{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "ced116e7e17d31fc151eb05653942b5f0b206031",
          "author": "Sébastien Stormacq",
          "description": "Discover how this high-performance remote protocol securely streams graphics-intensive apps from cloud to device, with QUIC, client enhancements, and extended OS support.",
          "link": "https://aws.amazon.com/blogs/aws/nice-desktop-cloud-visualization-dcv-is-now-amazon-dcv/",
          "publishedOn": "2024-10-01T19:05:59.000Z",
          "wordCount": 2004,
          "title": "NICE DCV is now Amazon DCV with 2024.0 release",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/09/24/NiceIMG2.png"
        },
        {
          "id": "d2c501e1f24b7e9eca5982d22f0f3c5ae24c59b0",
          "author": "Elizabeth Fuentes",
          "description": "Every week, there’s a new Amazon Web Services (AWS) community event where you can network, learn something new, and immerse yourself in the community. When you’re in a community, everyone grows together, and no one is left behind. Last week was no exception. I can highlight the Dach AWS Community Day where Viktoria Semaan closed […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-jamba-1-5-family-llama-3-2-amazon-ec2-c8g-and-m8g-instances-and-more-sep-30-2024/",
          "publishedOn": "2024-09-30T16:53:23.000Z",
          "wordCount": 2201,
          "title": "AWS Weekly Roundup: Jamba 1.5 family, Llama 3.2, Amazon EC2 C8g and M8g instances and more (Sep 30, 2024)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/08/13/AWS-WIR-default.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": [
        {
          "id": "2c4ac69958eb7ffd74f8ddce0a45e334dbc042ba",
          "author": "Luca Mezzalira",
          "description": "Software as a Service (SaaS) applications offer a transformative solution for businesses worldwide, delivering on-demand software solutions to a global audience. However, building a successful SaaS platform demands on meticulous architectural planning, especially given the inherent challenges of multi-tenancy. It’s also essential to ensure that each tenant’s data remains isolated and protected from unauthorized access […]",
          "link": "https://aws.amazon.com/blogs/architecture/lets-architect-building-multi-tenant-saas-systems/",
          "publishedOn": "2024-09-26T18:24:46.000Z",
          "wordCount": 1717,
          "title": "Let’s Architect! Building multi-tenant SaaS systems",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fc074d501302eb2b93e2554793fcaf50b3bf7291/2022/04/20/Site-Merch_Lets-Architect_REVIEW.jpg"
        }
      ]
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps & Developer Productivity Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": [
        {
          "id": "997dd18c527aa0428e12fdb6d20bc3309fd39e11",
          "author": "David Ernst",
          "description": "As organizations increasingly adopt Amazon Q Developer, understanding how developers use it is essential. Diving into specific telemetry events and user-level data clarifies how users interact with Amazon Q Developer, offering insights into feature usage and developer behaviors. This granular view, accessible through logs, is vital for identifying trends, optimizing performance, and enhancing the overall […]",
          "link": "https://aws.amazon.com/blogs/devops/exploring-telemetry-events-in-amazon-q-developer/",
          "publishedOn": "2024-09-30T19:58:09.000Z",
          "wordCount": 4185,
          "title": "Exploring Telemetry Events in Amazon Q Developer",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/09/30/Exploring_TelemetryEventsinAmazonQ_Developer_ppt-1121x630.png"
        },
        {
          "id": "3551fd691e991805cf5b17a5d031b3ad3b6bbc0d",
          "author": "Vikas Purohit",
          "description": "By Priya Mallya, Managing Director – Accenture, Sandeep Singh Bhatia, Sr Manager – Accenture      Vikas Purohit – Sr. Solutions Architect – AWS Being able to internally setup and manage flexible, efficient infrastructure can be painful. Manually authoring your Infrastructure as Code (IaC) templates is error prone and time consuming. However, adoption of generative […]",
          "link": "https://aws.amazon.com/blogs/devops/accenture-expedites-infrastructure-deployment-with-amazon-q-developer/",
          "publishedOn": "2024-09-30T14:26:11.000Z",
          "wordCount": 1636,
          "title": "Accenture Expedites Infrastructure Deployment with Amazon Q Developer",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/09/30/Featured-Image-1-1130x630.png"
        },
        {
          "id": "84a25e2a3fa6cf4b4c03c40b15b88d2a5c5edaa8",
          "author": "Piyush Mattoo",
          "description": "Amazon CodeCatalyst is a unified service that streamlines the entire software development lifecycle, empowering teams to build, deliver, and scale applications on AWS. DevSecOps is the practice of integrating security into all stages of software development. Rather than prioritizing features, it injects security into an earlier phase of the development process – baking it into […]",
          "link": "https://aws.amazon.com/blogs/devops/securing-your-software-supply-chain-with-amazon-codecatalyst-and-amazon-inspector/",
          "publishedOn": "2024-09-28T13:33:33.000Z",
          "wordCount": 2621,
          "title": "Securing Your Software Supply Chain with Amazon CodeCatalyst and Amazon Inspector",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/09/25/sbom.png"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "cd545d279ab991a3ed8f657b7adc59e9b1f42900",
          "author": "Piyush Shukla",
          "description": "After careful consideration, we have made the decision to discontinue AWS App Mesh, effective September 30th, 2026. Until this date, existing AWS App Mesh customers will be able to use the service as normal, including creating new resources and onboarding new accounts via the AWS CLI and AWS CloudFormation. Additionally, AWS will continue to provide […]",
          "link": "https://aws.amazon.com/blogs/containers/migrating-from-aws-app-mesh-to-amazon-vpc-lattice/",
          "publishedOn": "2024-10-01T17:48:04.000Z",
          "wordCount": 2666,
          "title": "Migrating from AWS App Mesh to Amazon VPC Lattice",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/09/30/Featured-images-for-Containers-Blog-6-1260x630.jpg"
        },
        {
          "id": "533837ea15587ac1d6c7f1df3cb349aa1fad90ac",
          "author": "Jason Janiak",
          "description": "Introduction In August 2022, Amazon Elastic Kubernetes Service (Amazon EKS) announced the availability of an Amazon EKS-optimized bundle of Kubecost for cluster cost visibility. The bundle is available to Amazon EKS users free of charge and enables users to gain deeper cost insights into Kubernetes resources, such as namespace, cluster, pod, and organizational concepts (for […]",
          "link": "https://aws.amazon.com/blogs/containers/aws-and-kubecost-collaborate-to-deliver-kubecost-2-0-for-amazon-eks-users/",
          "publishedOn": "2024-09-30T19:16:39.000Z",
          "wordCount": 1972,
          "title": "AWS and Kubecost Collaborate to Deliver Kubecost 2.0 for Amazon EKS Users",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/09/27/Featured-images-for-Containers-Blog-2-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=334911",
          "author": "Brad Wolf",
          "description": "Philip Berrigan was a World War II soldier, a Catholic priest, a civil rights and anti-war activist who spent 11 years behind bars for nonviolent resistance to war. From the 1950s until 2002— when he was released from prison just a few months before his passing— Phil was relentless in both articulating resistance to war and embodying that resistance by sacrificing his life and liberty for those victims in the breach. More\nThe post A Ministry of Risk in A Time of War appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/02/a-ministry-of-risk-in-a-time-of-war/",
          "publishedOn": "2024-10-02T06:00:59.000Z",
          "wordCount": null,
          "title": "A Ministry of Risk in A Time of War",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334909",
          "author": "John Feffer",
          "description": "Autocrats and right-wing ideologues hate diversity. They believe in political uniformity, preferably one-man rule. They also favor ethnic and/or religious homogeneity. They hold to anti-immigrant views even though they spell economic suicide for their countries. Their birthrates falling, European countries need immigrants to survive. The same holds true for the United States and most of Asia. But that hasn’t stopped these political forces from building walls, erecting bureaucratic obstacles, and even expelling people. More\nThe post The Weaponization of Immigrants appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/02/the-weaponization-of-immigrants/",
          "publishedOn": "2024-10-02T06:00:27.000Z",
          "wordCount": null,
          "title": "The Weaponization of Immigrants",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335330",
          "author": "Brian Tierney",
          "description": "What began as a war of collective punishment following October 7, 2023 quickly exploded into a full-scale genocide against the people of Gaza. Israel deployed the familiar trope about Hamas using civilians as “human shields” to justify the merciless targeting of population centers, dropping U.S. bombs on homes, hospitals, schools, and overcrowded refugee camps across the narrow strip of land that is home to some two million Palestinians.\nUsing starvation as a weapon, Israel has blocked most humanitarian aid from entering Gaza and brought the territory’s health care system to the brink of collapse. Lives spared by Israeli airstrikes face hell on earth, displaced many times over by the attacks while enduring famine, disease, and unimaginable psychological trauma. Among the more than 40,000 deaths accounted for in the official death toll, at least 11,000 children have been murdered by U.S. bombs, and another estimated 10,000 casualties remain buried under the mountains of rubble that is now Gaza’s landscape. More\nThe post Biden’s Gaza Genocide is Now Biden’s Greater Middle East War appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/02/bidens-gaza-genocide-is-now-bidens-greater-middle-east-war/",
          "publishedOn": "2024-10-02T05:59:03.000Z",
          "wordCount": null,
          "title": "Biden’s Gaza Genocide is Now Biden’s Greater Middle East War",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335210",
          "author": "Karen J. Greenberg",
          "description": "September marked the 23rd anniversary of al-Qaeda’s 2001 attacks on the United States, which left nearly 3,000 people dead. For the two decades since then, I’ve been writing, often for TomDispatch, about the ways the American response to 9/11, which quickly came to be known as the Global War on Terror, or GWOT, changed this country. As  More\nThe post Will the Forever Wars Ever End? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/02/will-the-forever-wars-ever-end/",
          "publishedOn": "2024-10-02T05:55:12.000Z",
          "wordCount": null,
          "title": "Will the Forever Wars Ever End?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335280",
          "author": "Phil Wilson",
          "description": "The Democratic Party – for those of us paying attention – has become a shadow of the Republican Party, a miniature MAGA image impaled on the adjacent ground if you will. The Democrats now aspire to package and market an incrementally less offensive, but equally lethal brand of MAGA cruelty. The empty mimicry of Republican  More\nThe post Kamala Harris Surrenders to Trump on Border Security and Endorses the War On Drugs appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/02/kamala-harris-surrenders-to-trump-on-border-security-and-endorses-the-war-on-drugs/",
          "publishedOn": "2024-10-02T05:55:12.000Z",
          "wordCount": null,
          "title": "Kamala Harris Surrenders to Trump on Border Security and Endorses the War On Drugs",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335287",
          "author": "W. T. Whitney",
          "description": "Beginning on September 17, marchers proceeded north for 118 miles from Caracollo in Oruro department to La Paz, Bolivia’s capital city, arriving there on September 24. Numbering from 5000 to 15,000 – estimates vary – they were supporting former President Evo Morales. They called their march a “National March to Save Bolivia; for Life, Democracy,  More\nThe post In Bolivia Gigantic March Reveals Socialist Divide, Elections are Ahead appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/02/in-bolivia-gigantic-march-reveals-socialist-divide-elections-are-ahead/",
          "publishedOn": "2024-10-02T05:55:11.000Z",
          "wordCount": null,
          "title": "In Bolivia Gigantic March Reveals Socialist Divide, Elections are Ahead",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335289",
          "author": "Ed Grystar",
          "description": "Here in Pittsburgh and nationwide, a false debate has erupted over the sale of US Steel (USX) to Japan’s Nippon Steel. Biden, Harris, Trump and labor are all opposed to the acquisition under the guise of national security and saving the US steel industry. Apparently we’re all supposed to be worried about the sale to a Japanese capitalist and  More\nThe post False Debate Over Sale of USX Ignores Decades of Industry Abandonment and the Need for Nationalization in the Public Interest appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/02/false-debate-over-sale-of-usx-ignores-decades-of-industry-abandonment-and-the-need-for-nationalization-in-the-public-interest/",
          "publishedOn": "2024-10-02T05:55:03.000Z",
          "wordCount": null,
          "title": "False Debate Over Sale of USX Ignores Decades of Industry Abandonment and the Need for Nationalization in the Public Interest",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335293",
          "author": "Grant Inskeep",
          "description": "While the world has understandably been focused on the Israeli-Hamas War in Gaza and its spillover effects across the Middle East, many people have lost interest in the Russo-Ukrainian War that continues in a grueling battle of attrition nearly two and a half years since Moscows full scale invasion. Without going into the multitudes of  More\nThe post On the Ukraine War and Where It’s Going appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/02/on-the-ukraine-war-and-where-its-going/",
          "publishedOn": "2024-10-02T05:53:34.000Z",
          "wordCount": null,
          "title": "On the Ukraine War and Where It’s Going",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334959",
          "author": "Chuanyi Ji – Scott C. Ganz",
          "description": "Hurricane Helene cut power to more than 4 million homes and businesses as it moved across the Southeast after hitting Florida’s Big Bend region as a powerful Category 4 storm on Sept. 26, 2024. As Helene’s rains moved into the mountains, causing devastating flooding, officials warned that fixing downed utility lines and restoring power would  More\nThe post After Power Outages, the Poor Wait Longer to Get Their Electricity Restored appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/02/after-power-outages-the-poor-wait-longer-to-get-their-electricity-restored/",
          "publishedOn": "2024-10-02T05:52:37.000Z",
          "wordCount": null,
          "title": "After Power Outages, the Poor Wait Longer to Get Their Electricity Restored",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334923",
          "author": "Peter Bach",
          "description": "A teenage boy last week was stabbed to death close to where we live here in south-east London. He was reported as saying, ‘I’m 15, don’t let me die,’ to the struggling brave 43-year-old woman attempting to make a tourniquet out of a bed sheet. The young stranger in the pool of blood had been  More\nThe post Letter from London: The Zombie Knives Are Out appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/02/letter-from-london-the-zombie-knives-are-out/",
          "publishedOn": "2024-10-02T05:48:38.000Z",
          "wordCount": null,
          "title": "Letter from London: The Zombie Knives Are Out",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335052",
          "author": "Omar Ocampo",
          "description": "In its most recent year-end letter, the private equity firm Blackstone gave its stockholders a seemingly counterintuitive assurance: the lack of new housing stock was reason for optimism. Why does a stagnant growth in new living spaces benefit Blackstone? Because it is the nation’s largest corporate landlord. For the firm and its investors, chronic housing  More\nThe post A New Permanent Affordable Housing Proposal appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/02/a-new-permanent-affordable-housing-proposal/",
          "publishedOn": "2024-10-02T05:42:42.000Z",
          "wordCount": null,
          "title": "A New Permanent Affordable Housing Proposal",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335273",
          "author": "Nizar Ghanem",
          "description": "Israel’s massive military escalation against Lebanon threatens to supercharge our steady descent into dissolution – one that the Lebanese state may not survive. In dropping thousands of bombs on city high-rises and rural townhouses alike since mid-September, the Israel air force has driven more than a million Lebanese from their homes and caused hundreds of  More\nThe post Amid Israeli Onslaught, Lebanese Policymakers Must Unite Against Worst-Case Outcomes   appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/02/amid-israeli-onslaught-lebanese-policymakers-must-unite-against-worst-case-outcomes/",
          "publishedOn": "2024-10-02T05:40:19.000Z",
          "wordCount": null,
          "title": "Amid Israeli Onslaught, Lebanese Policymakers Must Unite Against Worst-Case Outcomes",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335284",
          "author": "Harvey Wasserman",
          "description": "When the Olympics return to Los Angeles in 2028, we can make history— and vastly lower our electric rates, clean our air and employ our people— by making sure the Games are 100% powered with local-generated solar energy. That clean green electricity should not be wired in via an obsolete, over-stressed grid, coming from places  More\nThe post The 2028 LA Olympics Should Be 100% Solar-Powered appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/02/the-2028-la-olympics-should-be-100-solar-powered/",
          "publishedOn": "2024-10-02T05:06:46.000Z",
          "wordCount": null,
          "title": "The 2028 LA Olympics Should Be 100% Solar-Powered",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335204",
          "author": "Norman Solomon",
          "description": "As each day brings escalation toward a global nuclear inferno, standard-issue legislators on both sides of the aisle keep boosting the Pentagon budget. Huge new appropriations for nuclear weapons are voted under the euphemism of “modernization.” And here’s a sad irony: The few members of Congress willing to urgently warn about the danger of nuclear war often stoke that danger with calls for “victory” in the Ukraine war. Instead, what’s urgently needed is a sober push for actual diplomacy to end it. More\nThe post “Escalation Dominance” . . . and the Prospect of More Than 1,000 Holocausts appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/01/escalation-dominance-and-the-prospect-of-more-than-1000-holocausts/",
          "publishedOn": "2024-10-01T06:01:01.000Z",
          "wordCount": null,
          "title": "“Escalation Dominance” . . . and the Prospect of More Than 1,000 Holocausts",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334879",
          "author": "Sam Pizzigati",
          "description": "Have our world’s super rich become absolutely paranoid about the future? Or do they, deep down, understand that our exceedingly unequal global distribution of income and wealth has placed them — and everyone else — in ever-present danger? The Robb Report, a news service that offers our most awesomely affluent the ultimate in consumption advice, has no interest in psychoanalyzing what the wealthiest among us believe. But Robb Report analysts certainly do enjoy chronicling how these rich behave. More\nThe post The Only Real Shortcut to Long-Term Security: Greater Equality appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/01/the-only-real-shortcut-to-long-term-security-greater-equality/",
          "publishedOn": "2024-10-01T05:59:16.000Z",
          "wordCount": null,
          "title": "The Only Real Shortcut to Long-Term Security: Greater Equality",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334926",
          "author": "Ramzy Baroud",
          "description": "Two historical events regarding the Israeli occupation of Palestine have taken place on July 19 and September 18. The first was a most comprehensive ‘advisory opinion’ by the International Court of Justice (ICJ), which reiterated that the Israeli occupation of Palestine is illegal and must come to an immediate end. The second, by the United Nations General Assembly, two months later, set, for the first time in history, an exact time frame of when the Israeli occupation of Palestine must end. More\nThe post War of Legitimacy – How the ICJ, UNGA Challenged Decades of Israeli, US Arrogance  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/01/war-of-legitimacy-how-the-icj-unga-challenged-decades-of-israeli-us-arrogance/",
          "publishedOn": "2024-10-01T05:59:01.000Z",
          "wordCount": null,
          "title": "War of Legitimacy – How the ICJ, UNGA Challenged Decades of Israeli, US Arrogance",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335149",
          "author": "Dan Falcone",
          "description": "The great activist, academic, and Purdue University historian (and a co-founder of the Marxist publication, Spectre) Tithi Bhattacharya, recently wrote about Bangladesh for Time Magazine. She stated that, “it is Time, so I didn’t get to say ‘working class revolution, now’ as Cleveland [her deceased cat, RIP] undoubtedly would have said. But I do try to connect some of those past strains  More\nThe post Bangladesh and the Left appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/01/bangladesh-and-the-left/",
          "publishedOn": "2024-10-01T05:57:11.000Z",
          "wordCount": null,
          "title": "Bangladesh and the Left",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334924",
          "author": "William Hartung",
          "description": "The divestment campaigns launched last spring by students protesting Israel’s mass slaughter in Gaza brought the issue of the militarization of American higher education back into the spotlight. Of course, financial ties between the Pentagon and American universities are nothing new. As Stuart Leslie has pointed out in his seminal book on the topic, The Cold War and  More\nThe post The Pentagon Goes to School appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/01/the-pentagon-goes-to-school/",
          "publishedOn": "2024-10-01T05:56:15.000Z",
          "wordCount": null,
          "title": "The Pentagon Goes to School",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335119",
          "author": "Binoy Kampmark",
          "description": "The ongoing Israeli operation against Hezbollah, the Iranian-backed militia group so dominant in Lebanon, is following a standard pattern.  Ignore base causes.  Ignore context.  Target leaders, and target personnel.  See matters in conventional terms of civilisational warrior against barbarian despot.  Israel, the valiant and bold, fighting the forces of darkness. The entire blood woven tapestry of the Middle East offers  More\nThe post The Illusion of a Solution: Killing Hassan Nasrallah appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/01/the-illusion-of-a-solution-killing-hassan-nasrallah/",
          "publishedOn": "2024-10-01T05:55:55.000Z",
          "wordCount": null,
          "title": "The Illusion of a Solution: Killing Hassan Nasrallah",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334910",
          "author": "Cesar Chelala",
          "description": "Growing up in Argentina in the 1940s, I remember my late Lebanese father reminiscing about Lebanon in almost reverential terms. The fruits were bigger, the foods tastier, the sights more beautiful than in other places. More importantly, the people were very peaceful, as shown by the harmonious coexistence of people of different religious denominations. It  More\nThe post Let Lebanon Live appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/01/let-lebanon-live/",
          "publishedOn": "2024-10-01T05:55:49.000Z",
          "wordCount": null,
          "title": "Let Lebanon Live",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335151",
          "author": "Sonali Kolhatkar",
          "description": "My oldest born is a high school junior, taking his first steps into the hypercompetitive and bewildering world of undergraduate college applications and future careers. So, I was drawn to a recent headline in Fortune proclaiming, “Bosses Are Firing Gen Z Grads Just Months After Hiring Them—Here’s What They Say Needs to Change.” The story covers a  More\nThe post What We Can Learn from Gen Z Workers appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/01/what-we-can-learn-from-gen-z-workers/",
          "publishedOn": "2024-10-01T05:55:47.000Z",
          "wordCount": null,
          "title": "What We Can Learn from Gen Z Workers",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335114",
          "author": "Marilena Umuhoza Delli",
          "description": "In honor of Deaf Awareness Month and International Week of Deaf People both taking place in September, I spoke with, Raymond Antrobus, one of the international leaders in the deaf community about his experiences globally. Raymond is a 37-year-old, Jamaican British, Ted Hughes Award winning poet and educator who has devoted much of the past  More\nThe post Jamaican British Poet Raymond Antrobus Shares His Experienceswith Deaf Communities Around the Globe appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/01/jamaican-british-poet-raymond-antrobus-shares-his-experienceswith-deaf-communities-around-the-globe/",
          "publishedOn": "2024-10-01T05:55:05.000Z",
          "wordCount": null,
          "title": "Jamaican British Poet Raymond Antrobus Shares His Experienceswith Deaf Communities Around the Globe",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334966",
          "author": "Ron Jacobs",
          "description": "On September 8, 1974, Gerald Ford pardoned Richard Nixon for any crimes he may have committed while president of the United States.  I remember when I first heard the news.  A friend and I had just taken our seats in a lecture hall at the University of Maryland’s main campus in College Park, MD.  The  More\nThe post Believe Me, It’s Been Going Downhill for Awhile appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/01/believe-me-its-been-going-downhill-for-awhile/",
          "publishedOn": "2024-10-01T05:50:45.000Z",
          "wordCount": null,
          "title": "Believe Me, It’s Been Going Downhill for Awhile",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334905",
          "author": "Wenfei Xu, David Levinson, Michael J Smart, and Nebiyou Yonas Tilahun",
          "description": "A screenshot from body cam footage of officers pulling Miami Dolphins player Tyreek Hill from his car after stopping him for speeding on Sept. 9, 2024. Miami-Dade Police Department Traffic stops by Chicago police have more than doubled over the past nine years in what the American Civil Liberties Union, a civil rights group, is  More\nThe post Police Stop More Black Drivers, While Speed Cameras Issue Unbiased Tickets appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/01/police-stop-more-black-drivers-while-speed-cameras-issue-unbiased-tickets/",
          "publishedOn": "2024-10-01T05:50:38.000Z",
          "wordCount": null,
          "title": "Police Stop More Black Drivers, While Speed Cameras Issue Unbiased Tickets",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334906",
          "author": "John Cavanagh",
          "description": "Nayib Bukele has proudly called himself “the world’s coolest dictator.” On October 8, his government will begin an unjust trial of five water defenders from El Salvador. These men are heroes of El Salvador — and they never should have been arrested. In these two weeks leading up to the trial, human rights supporters across  More\nThe post El Salvador’s Self-Proclaimed Dictator Is On Trial appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/01/el-salvadors-self-proclaimed-dictator-is-on-trial/",
          "publishedOn": "2024-10-01T05:44:48.000Z",
          "wordCount": null,
          "title": "El Salvador’s Self-Proclaimed Dictator Is On Trial",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334880",
          "author": "Dean Baker",
          "description": "The revisions to GDP data generally are not of much interest to anyone except a small group of economics nerds who follow the data closely. However, this year’s revisions are a big deal which should interest many people. Basically, they tell us a story of an economy that has performed substantially better since the pandemic  More\nThe post The Economy After GDP Revisions appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/01/the-economy-after-gdp-revisions/",
          "publishedOn": "2024-10-01T05:32:29.000Z",
          "wordCount": null,
          "title": "The Economy After GDP Revisions",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334872",
          "author": "Melvin Goodman",
          "description": "There has been a deplorable consistency in the remarks and efforts of Robert M. Gates over the past four decades.  In the 1980s, Gates was a major player in the falsification of intelligence regarding the Soviet Union, designed to justify unneeded increases in the defense budget.  In 1986, Gates had to withdraw his name from congressional confirmation for the post of director of the Central Intelligence Agency because the majority of the Senate intelligence committee believed he was lying about his role in the infamous Iran-Contra operation. More\nThe post Same Old Robert Gates: The Poster Child for US Militarization appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/30/same-old-robert-gates-the-poster-child-for-us-militarization/",
          "publishedOn": "2024-09-30T06:07:28.000Z",
          "wordCount": null,
          "title": "Same Old Robert Gates: The Poster Child for US Militarization",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334858",
          "author": "Christopher Ketcham",
          "description": "A crowd of 3,000 anti-tourism protesters descended on posh downtown Barcelona last July, their demeanor one of delighted malice.  They cordoned off hotels and eateries with hazard tape, as if demarcating a crime scene. They sprayed with water guns the blithe holidaymakers seated in restaurants.  Video footage showed unhappy couples and glowering young men chased from their seats by the mob, stunned at the indignity.\nThe protesters shouted “tourists go home.” They held signs that said “Barcelona is not for sale.” They spoke of “mass touristification” and inveighed against the greed of restaurateurs and hoteliers and Airbnb landlords profiting from the madding crowd while the average Catalan struggled to meet the skyrocketing costs of daily life. One of the protesters told an interviewer, “The city has turned completely for tourists. What we want is a city for citizens.” More\nThe post Eat, Pray, Pollute: On The Needed Death of Tourism appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/30/eat-pray-pollute-on-the-needed-death-of-tourism/",
          "publishedOn": "2024-09-30T05:59:29.000Z",
          "wordCount": null,
          "title": "Eat, Pray, Pollute: On The Needed Death of Tourism",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334850",
          "author": "Ralph Nader",
          "description": "Israel’s Biden-backed war machine is once again bearing down on defenseless Lebanese people. Hostilities on the Israeli/Lebanon border have been occurring since the establishment of Israel and the dispossession of Palestinians and their land in 1948. But last week’s war-crime-laden escalation by Netanyahu stunned the world. It started with bombings followed by the simultaneous booby-trapped  More\nThe post Netanyahu – “Nothing Can Stop Us” – Not Even the Majority of Israelis appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/30/netanyahu-nothing-can-stop-us-not-even-the-majority-of-israelis/",
          "publishedOn": "2024-09-30T05:57:49.000Z",
          "wordCount": null,
          "title": "Netanyahu – “Nothing Can Stop Us” – Not Even the Majority of Israelis",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334873",
          "author": "Henry Giroux",
          "description": "Education is the most powerful weapon which you can use to change the world –Nelson Mandela Paulo Freire, the radical Brazilian educator, would have turned 103 on September 19, 2025. Freire was not merely an academic; he was a revolutionary, a fierce champion of the oppressed whose lifelong fight for economic, educational, and social justice  More\nThe post Paulo Freire’s Legacy and the Necessity of Critical Pedagogy in Dark Times appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/30/paulo-freires-legacy-and-the-necessity-of-critical-pedagogy-in-dark-times/",
          "publishedOn": "2024-09-30T05:57:28.000Z",
          "wordCount": null,
          "title": "Paulo Freire’s Legacy and the Necessity of Critical Pedagogy in Dark Times",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": [
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=31733",
          "author": "Andres Aradillas Fernandez, Martin Hiti, and Asani Sarkar",
          "description": "Recent events have heightened awareness of systemic risk stemming from nonbank financial sectors. For example, during the COVID-19 pandemic, liquidity demand from nonbank financial entities caused a “dash for cash” in financial markets that required government support. In this post, we provide a quantitative assessment of systemic risk in the nonbank sectors. Even though these sectors have heterogeneous business models, ranging from insurance to trading and asset management, we find that their systemic risk has common variation, and this commonality has increased over time. Moreover, nonbank sectors tend to become more systemic when banking sector systemic risk increases.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/10/are-nonbank-financial-institutions-systemic/",
          "publishedOn": "2024-10-01T11:44:51.000Z",
          "wordCount": 4579,
          "title": "Are Nonbank Financial Institutions Systemic?",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/10/LSE_2024_systemic-nonbank_sarkar_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=31665",
          "author": "Gonzalo Cisternas and Aaron Kolb",
          "description": "Expectations can play a significant role in driving economic outcomes, with central banks factoring market sentiment into policy decisions and market participants forming their own assumptions about monetary policy. But how well do central banks understand the expectations of market participants—and vice versa? Our model, developed in a recent paper, features a dynamic game between (i) a monetary authority that cannot commit to an inflation target and (ii) a set of market participants that understand the incentives created by that credibility problem. In this post, we describe the game, a type of Keynesian beauty contest: its main novelty is that each side attempts, with varying degrees of accuracy, to forecast the other’s beliefs, resulting in new findings regarding the levels and trajectories of inflation.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/09/the-central-banking-beauty-contest/",
          "publishedOn": "2024-09-30T11:00:00.000Z",
          "wordCount": 4325,
          "title": "The Central Banking Beauty Contest",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/09/LSE_2024_forecasting_cisternas_460.jpg"
        }
      ]
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45610",
          "author": "peterradford",
          "description": "from Peter Radford What?  Surely not!  How dare he suggest such a thing. What, you are correct in asking, am I talking about? The recent speech by a Department of Justice official who dared suggest that it is getting quite difficult to find a truly neutral technocratic expert to give testimony in court.  Imagine the […]",
          "link": "https://rwer.wordpress.com/2024/09/26/break-up-economics-continued/",
          "publishedOn": "2024-09-26T12:12:24.000Z",
          "wordCount": 4701,
          "title": "Break Up Economics — continued",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=279657",
          "author": "Yves Smith",
          "description": "Our studious daily links: Iran strikes Israel, Israel invades Lebanon, China housing glut, wildfires beget more wildfires, Ukraine pulls out of Vuhledar, Helene aftermath, Biden feels neglected, Mars tire wear, AI promotes self to sys admin, moar Covid, C.J. Hopkings conviction, port strike",
          "link": "https://www.nakedcapitalism.com/2024/10/links-10-2-2024.html",
          "publishedOn": "2024-10-02T10:59:12.000Z",
          "wordCount": 4618,
          "title": "Links 10/2/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/10/00-butterfly1.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279643",
          "author": "Conor Gallagher",
          "description": "Move would allow US to study Russian defensive capabilities. It would also severely damage ties between Ankara and Moscow, but are there reasons Erdogan would go for it?",
          "link": "https://www.nakedcapitalism.com/2024/10/the-us-is-tries-to-pressure-turkiye-into-putting-its-russian-missile-defense-systems-under-american-supervision.html",
          "publishedOn": "2024-10-02T08:00:57.000Z",
          "wordCount": 5804,
          "title": "The US Tries to Pressure Türkiye into Putting Its Russian Missile Systems Under American Supervision",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/10/Screenshot-2024-05-15-at-11.21.33 AM-1024x646.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279714",
          "author": "Yves Smith",
          "description": "Boeing management continues its intransigent, now punitive, posture towards its union, after years of squeezing pay, risking the company",
          "link": "https://www.nakedcapitalism.com/2024/10/why-we-need-medicare-for-all-boeing-revokes-health-benefits-for-striking-workers.html",
          "publishedOn": "2024-10-02T08:00:30.000Z",
          "wordCount": 3378,
          "title": "‘Why We Need Medicare for All’: Boeing Revokes Health Benefits for Striking Workers",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/10/00-boeing-1024x672.webp"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279683",
          "author": "Lambert Strether",
          "description": "Vance-Walz slugfest...",
          "link": "https://www.nakedcapitalism.com/2024/10/i-want-to-be-a-part-of-it-vance-v-walz-new-york-vice-presidential-debate-live-blog.html",
          "publishedOn": "2024-10-02T00:30:18.000Z",
          "wordCount": 12364,
          "title": "“I Want to Be a Part of It”: Vance v. Walz New York Vice-Presidential Debate Live Blog",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279659",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics;  Vance-Walz debate; Kamala's October Surprise? Effects of Helene on North Carolina election; Boeing and Longshoremen strikes ~",
          "link": "https://www.nakedcapitalism.com/2024/10/200pm-water-cooler-10-1-2024.html",
          "publishedOn": "2024-10-01T18:00:18.000Z",
          "wordCount": 22802,
          "title": "2:00PM Water Cooler 10/1/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/rcp_2024-09-27.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279649",
          "author": "Yves Smith",
          "description": "Not everyone, particularly some top Israel experts like John Mearsheimer, is convinced that Israel is on its way to a decisive win in Lebanon.",
          "link": "https://www.nakedcapitalism.com/2024/10/john-mearsheimer-is-not-very-impressed-with-israels-shock-and-awe-campaign-against.html",
          "publishedOn": "2024-10-01T14:42:31.000Z",
          "wordCount": 8696,
          "title": "John Mearsheimer Is Not Very Impressed With Israel’s Shock and Awe Campaign Against Hezbollah",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279562",
          "author": "Yves Smith",
          "description": "Our pacific daily links: Everest rising, Covid moon cooling, climate change induced ag price rises, China lithography, Greens disastrous policies, UK minimum wage crushing? Israel invades Lebanon, Russia Nord Stream suit? GA court strikes down abortion laa, Port strike, WaPo v Trump crime & immigration cliams, AI",
          "link": "https://www.nakedcapitalism.com/2024/10/links-10-1-2024.html",
          "publishedOn": "2024-10-01T10:55:32.000Z",
          "wordCount": 19022,
          "title": "Links 10/1/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/10/00-alaska-birds.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279579",
          "author": "Nick Corbishley",
          "description": "\"China is a very interesting trading partner,\" said Javier Milei, who just a year ago described the Chinese government as as \"assassin.\" They \"do not make demands, the only thing they ask is that they not be bothered.\"",
          "link": "https://www.nakedcapitalism.com/2024/10/washington-enters-panic-mode-as-even-mileis-argentina-seeks-closer-economic-ties-with-beijing.html",
          "publishedOn": "2024-10-01T10:45:42.000Z",
          "wordCount": 7390,
          "title": "Washington Enters Panic Mode As Even Javier Milei’s Argentina Seeks Closer Economic Ties With Beijing",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279641",
          "author": "Yves Smith",
          "description": "The Fed has little to do with the fall in inflation.  Limited labor bargaining power and easing supply chain problems were more important.",
          "link": "https://www.nakedcapitalism.com/2024/10/the-fed-and-the-soft-landing-policy-or-luck.html",
          "publishedOn": "2024-10-01T10:31:34.000Z",
          "wordCount": 3900,
          "title": "The Fed and the “Soft Landing” – Policy or Luck?",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279639",
          "author": "Yves Smith",
          "description": "Rather than blame young workers for bad attitudes, we need to understand why Gen Z prioritizes its well-being over company health.",
          "link": "https://www.nakedcapitalism.com/2024/10/what-we-can-learn-from-gen-z-workers.html",
          "publishedOn": "2024-10-01T10:16:30.000Z",
          "wordCount": 4958,
          "title": "What We Can Learn from Gen Z Workers",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "2dMuW3phhA9ClF8ROOAYPH",
          "author": "David Belson",
          "description": "On Monday, September 30, customers on Verizon’s mobile network in multiple cities across the United States reported experiencing a loss of connectivity. HTTP request traffic data from Verizon’s mobile ASN (AS6167) showed nominal declines across impacted cities.",
          "link": "https://blog.cloudflare.com/impact-of-verizons-september-30-outage-on-internet-traffic",
          "publishedOn": "2024-10-01T00:32:00.000Z",
          "wordCount": 1159,
          "title": "Impact of Verizon’s September 30 outage on Internet traffic",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4riEx6QIoNCWbIgsLUfY6r/0ae5b09c779aad3c2167e29d41f6251a/BLOG-2587_OG.png"
        },
        {
          "id": "65JnLP0MYKVzwTyOsItRJk",
          "author": "Kelly May Johnston",
          "description": "Recapping all the big announcements made during 2024’s Birthday Week.",
          "link": "https://blog.cloudflare.com/birthday-week-2024-wrap-up",
          "publishedOn": "2024-09-30T13:00:00.000Z",
          "wordCount": 1835,
          "title": "Wrapping up another Birthday Week celebration",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6tcR5pudfdKf1cC0yRyKuy/f2a2d771179b7b058e158e09acbaf5bd/Wrapping_up_another_Birthday_Week_celebration-OG.png"
        },
        {
          "id": "5KJejYd85inMDIZUZ6z17D",
          "author": "Brendan Irvine-Broque",
          "description": "We’ve been working on something new — a platform for running containers across Cloudflare’s network. We already use it in production, for AI inference and more. Today we want to share an early look at how it’s built, why we built it, and how we use it ourselves.",
          "link": "https://blog.cloudflare.com/container-platform-preview",
          "publishedOn": "2024-09-27T13:00:00.000Z",
          "wordCount": 4573,
          "title": "Our container platform is in production. It has GPUs. Here’s an early look",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1RolWb3TF9PRzx075YgVxq/d61dbaebc5e3a45ac7c1b8d68c8110d6/BLOG-2573_OG.png"
        },
        {
          "id": "6PcliMGa9hJMvd9HafSMwe",
          "author": "Sri Pulla",
          "description": "Cloudflare strengthens its commitment to cybersecurity by joining CISA's \"Secure by Design\" pledge. In line with this commitment, we're enhancing our vulnerability disclosure policy by launching a VIP bug bounty program, giving top researchers early access to our products. Keep an eye out for future updates regarding Cloudflare's CISA pledge as we work together to shape a safer digital future.",
          "link": "https://blog.cloudflare.com/cisa-pledge-commitment-bug-bounty-vip",
          "publishedOn": "2024-09-27T13:00:00.000Z",
          "wordCount": 1549,
          "title": "Advancing cybersecurity: Cloudflare implements a new bug bounty VIP program as part of CISA Pledge commitment",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/38UiDqMKYIrSjbAF5hcW4a/79cc7fc622a7208b3e21407315683c42/Advancing_cybersecurity-_Cloudflare_implements_a_new_bug_bounty_VIP_program_as_part_of_CISA_Pledge_commitment-OG.png"
        },
        {
          "id": "2Q277uIpNI04K4kTcUXLkf",
          "author": "Melissa Kargiannakis",
          "description": "Empowering developers with the Dev Starter Pack and Workers Cohort #4: get free or discounted access to essential developer tools and meet the latest set of incredible startups building on Cloudflare.",
          "link": "https://blog.cloudflare.com/launchpad-cohort4-dev-starter-pack",
          "publishedOn": "2024-09-27T13:00:00.000Z",
          "wordCount": 1652,
          "title": "Empowering builders: introducing the Dev Alliance and Workers Launchpad Cohort #4",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1ELK9sYzobsd7QllPCvzya/cb60a2b3d66640320b09278266bf20c2/Empowering_builders-_introducing_the_Dev_Alliance_and_Workers_Launchpad_Cohort_-4-OG.png"
        },
        {
          "id": "5LrF3eCtonOcP2Sf5BSVpe",
          "author": "Veronica Marin",
          "description": "At Cloudflare, we believe in the power of open source. With Project Alexandria, our expanded open source program, we’re helping open source projects have a sustainable and scalable future, providing them with the tools and protection needed to thrive.",
          "link": "https://blog.cloudflare.com/expanding-our-support-for-oss-projects-with-project-alexandria",
          "publishedOn": "2024-09-27T13:00:00.000Z",
          "wordCount": 1884,
          "title": "Expanding Cloudflare's support for open source projects with Project Alexandria",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5mVMH3mYUna1qsN8V8qdbD/9de4b746cf74a40839c1828eee6e7f97/Expanding_Cloudflare_s_support_for_open_source_projects_with_Project_Alexandria_-OG.png"
        },
        {
          "id": "4R2kUv9mZSgnAXmKOKTbLz",
          "author": "David Belson",
          "description": "The Cloudflare Radar Data Explorer provides a simple Web-based interface to build more complex API queries, including comparisons and filters, and visualize the results. The accompanying AI Assistant translates a user’s natural language statements or questions into the appropriate Radar API calls.",
          "link": "https://blog.cloudflare.com/radar-data-explorer-ai-assistant",
          "publishedOn": "2024-09-27T13:00:00.000Z",
          "wordCount": 2946,
          "title": "Network trends and natural language: Cloudflare Radar’s new Data Explorer & AI Assistant",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3xfhE19w0eSc8urF6mbIgm/999d594a56aa042a4df590d2fad9f03c/Network_trends_and_natural_language-_Cloudflare_Radar_s_new_Data_Explorer___AI_Assistant-OG.png"
        },
        {
          "id": "6HqKUMoXg0wFIQg9howLMX",
          "author": "Adam Martinetti",
          "description": "This year for Cloudflare’s birthday, we’ve extended our AI Assistant capabilities to help you build new WAF rules, added new AI bot & crawler traffic insights to Radar, and given customers new AI bot blocking capabilities",
          "link": "https://blog.cloudflare.com/bringing-ai-to-cloudflare",
          "publishedOn": "2024-09-27T13:00:00.000Z",
          "wordCount": 2278,
          "title": "AI Everywhere with the WAF Rule Builder Assistant, Cloudflare Radar AI Insights, and updated AI bot protection",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4wipGwjeGhBdS8jXcC3KTh/12e65389331e31250ad0c8a32dc10a6d/AI_Everywhere_with_the_WAF_Rule_Builder_Assistant__Cloudflare_Radar_AI_Insights__and_updated_AI_bot_protection-OG.png"
        },
        {
          "id": "P8TeQwTekaAHzlEGB8bLG",
          "author": "Nitin Rao",
          "description": "Today Cloudflare reaffirms its commitment to offering a robust Free service tier that continues to improve. We share why Free is a cornerstone of our business strategy, and how it contributes to building a better Internet.",
          "link": "https://blog.cloudflare.com/cloudflares-commitment-to-free",
          "publishedOn": "2024-09-27T13:00:00.000Z",
          "wordCount": 2067,
          "title": "Reaffirming our commitment to free",
          "imageUrl": ""
        },
        {
          "id": "6ct91ZmJYzPu9n9pt8sNBm",
          "author": "Tanushree Sharma",
          "description": "To celebrate Builder Day 2024, we’re shipping 18 updates inspired by direct feedback from developers building on Cloudflare. This includes new capabilities, like running evals with AI Gateway, beta products like Queues and Vectorize graduating to GA, massive speed improvements to KV and Workers AI, pricing simplifications, and bringing key features from Pages into Workers.",
          "link": "https://blog.cloudflare.com/builder-day-2024-announcements",
          "publishedOn": "2024-09-26T21:00:00.000Z",
          "wordCount": 3698,
          "title": "Builder Day 2024: 18 big updates to the Workers platform",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3iSS8tIBJ0kxNe8Spg7Qbc/638d618da92edfd4dc366558d2d8bffd/BLOG-2517_OG.png"
        },
        {
          "id": "2lS9TcgZHa1fubO371mYiv",
          "author": "Michelle Chen",
          "description": "Whether you want the fastest inference at the edge, optimized AI workflows, or vector database-powered RAG, we’re excited to help you harness the full potential of AI and get started on building with Cloudflare.",
          "link": "https://blog.cloudflare.com/workers-ai-bigger-better-faster",
          "publishedOn": "2024-09-26T13:00:00.000Z",
          "wordCount": 3189,
          "title": "Cloudflare’s bigger, better, faster AI platform",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5ulk9RqlQAEwprMduAUPy9/d099c3f8bac3523b90eeeedb2ebee218/Cloudflare_s_bigger__better__faster_AI_platform-OG.png"
        },
        {
          "id": "4ZEcwzAEh1rg9IxDqC3UyM",
          "author": "Christopher Rotas",
          "description": "Cloudflare’s Startup Program now offers up to $250,000 in credits for companies building on our Developer Platform. The program relaunch uses clear and predictable credits so that you can easily see how usage impacts future pricing.",
          "link": "https://blog.cloudflare.com/startup-program-250k-credits",
          "publishedOn": "2024-09-26T13:00:00.000Z",
          "wordCount": 1261,
          "title": "Startup Program revamped: build and grow on Cloudflare with up to $250,000 in credits",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6JY9nWh0ZbV5uhxCyu0xLY/2cacf8875adfc2f6dd43e76c1afb86b7/Startup_Program_revamped-_build_and_grow_on_Cloudflare_with_up_to__250_000_in_credits-OG.png"
        },
        {
          "id": "29PAMer5L0do12OtNa557I",
          "author": "Isaac Rehg",
          "description": "With a new generation of data center accelerator hardware and using optimization techniques such as KV cache compression and speculative decoding, we’ve made large language model (LLM) inference lightning-fast on the Cloudflare Workers AI platform.",
          "link": "https://blog.cloudflare.com/making-workers-ai-faster",
          "publishedOn": "2024-09-26T13:00:00.000Z",
          "wordCount": 2410,
          "title": "Making Workers AI faster and more efficient: Performance optimization with KV cache compression and speculative decoding",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5k8fRyeI3NnIxjvP1AMDn/da6a19b59f120a8d6112781375fdb21a/Making_Workers_AI_faster_and_more_efficient-_Performance_optimization_with_KV_cache_compression_and_speculative_decoding-OG.png"
        },
        {
          "id": "44R2ywetTc9l1c6D7oWTsz",
          "author": "Kenton Varda",
          "description": "Traditional cloud storage is inherently slow because it is accessed over a network and must synchronize many clients. But what if we could instead put your application code deep into the storage layer, such that your code runs where the data is stored? Durable Objects with SQLite do just that.",
          "link": "https://blog.cloudflare.com/sqlite-in-durable-objects",
          "publishedOn": "2024-09-26T13:00:00.000Z",
          "wordCount": 5122,
          "title": "Zero-latency SQLite storage in every Durable Object",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1EuNamTw8x3H3XRzBaobmS/a485560240894c922e322539be6be659/Zero-latency_SQLite_storage_in_every_Durable_Object-OG.png"
        },
        {
          "id": "76i5gcdv0wbMNnwa7E17MR",
          "author": "Thomas Gauvin",
          "description": "Speed is a critical factor that dictates Internet behavior. Every additional millisecond a user spends waiting for your web page to load results in them abandoning your website.",
          "link": "https://blog.cloudflare.com/faster-workers-kv",
          "publishedOn": "2024-09-26T13:00:00.000Z",
          "wordCount": 2151,
          "title": "We made Workers KV up to 3x faster — here’s the data",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2UHkSFT2lmnCkowZyD3wdn/0fcd27ca704da73dbfb6aa9021b34f88/We_made_Workers_KV_up_to_3x_faster___here_s_the_data-OG.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": [
        {
          "id": "https://kubernetes.io/blog/2024/09/30/cncf-deaf-and-hard-of-hearing-working-group-spotlight/",
          "author": null,
          "description": "In recognition of Deaf Awareness Month and the importance of inclusivity in the tech community, we are spotlighting Catherine Paganini, facilitator and one of the founding members of CNCF Deaf and Hard-of-Hearing Working Group (DHHWG). In this interview, Sandeep Kanabar, a deaf member of the DHHWG and part of the Kubernetes SIG ContribEx Communications team, sits down with Catherine to explore the impact of the DHHWG on cloud native projects like Kubernetes.\nSandeep’s journey is a testament to the power of inclusion. Through his involvement in the DHHWG, he connected with members of the Kubernetes community who encouraged him to join SIG ContribEx - the group responsible for sustaining the Kubernetes contributor experience. In an ecosystem where open-source projects are actively seeking co…",
          "link": "https://kubernetes.io/blog/2024/09/30/cncf-deaf-and-hard-of-hearing-working-group-spotlight/",
          "publishedOn": "2024-09-30T00:00:00.000Z",
          "wordCount": 5761,
          "title": "Spotlight on CNCF Deaf and Hard-of-hearing Working Group (DHHWG)",
          "imageUrl": "/blog/2024/09/30/cncf-deaf-and-hard-of-hearing-working-group-spotlight/cncf-dhhwg-chicago.jpg"
        }
      ]
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": []
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=41712460",
          "author": "Havoc",
          "description": "For context - he has a ~9m sub youtube channel on phones that must be banking it. This is a side project that appears to be grown out of frustration of disabled wife & seeing the shitshow that wheelchair market is. Seems 10/10 wholesome to have this disrupted by someone that cares",
          "link": "https://news.ycombinator.com/item?id=41712460",
          "publishedOn": "2024-10-01T18:40:59.000Z",
          "wordCount": 723,
          "title": "New comment by Havoc in \"A $1k Wheelchair\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41712267",
          "author": "fotta",
          "description": "Custom fit lightweight wheelchairs are expensive. My Ti-Lite (one of the most popular lightweight chair brands) Aero Z starts at $3k and goes up quickly with wheels and backrest and casters and various other options that I need for sitting 16 hours a day without creating more problems. Insurance covers this for me every 5 years, but of course that's not a luxury every one has. Most plans don't cover DME 100%.\nWhat Zack and Cambry are doing is great.\n(edit) I’d like to add that I think part of being able to drive costs down is that they’re not offering these via insurance so they sidestep the need for FDA approval to market it as a medical device (hence the company name), CMS approval and HCPCS coding and all the regulatory costs that come with that.\nNow don't get me started on power wheelchair cost...",
          "link": "https://news.ycombinator.com/item?id=41712267",
          "publishedOn": "2024-10-01T18:29:39.000Z",
          "wordCount": 3648,
          "title": "New comment by fotta in \"A $1k Wheelchair\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41710183",
          "author": "open-paren",
          "description": "I manage a medium-sized browser extension at work. We also offer(ed) it on Firefox. But I have spent the past year struggling to get back into Mozilla store after a manual review. As far as I can tell, there are maybe two reviewers that are based in Europe (Romania?). The turn around time is long when I am in the US, and it has been rife with this same kind of \"simple mistake\" that takes 2 weeks to resolve. \n\"You need a privacy policy\"–we already have one. \"You are using machine generated and minified code\"–no you are looking at the built code, not the included source. \"We cannot reproduce your source\"-that's because you didn't follow instructions and are in the wrong directory.\nVery frustrating.",
          "link": "https://news.ycombinator.com/item?id=41710183",
          "publishedOn": "2024-10-01T16:01:32.000Z",
          "wordCount": 3609,
          "title": "New comment by open-paren in \"Gorhill pulls uBlock Origin Lite from Firefox store\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41709058",
          "author": "yojo",
          "description": "I think it’s reasonable to expect that one of Firefox’s most popular extension publishers gets a higher tier of review service. Gorhill (and other top extension devs) are providing real value to Firefox, and have demonstrated good behavior for years.\nThis doesn’t mean they should get to publish whatever they want, but if a reviewer is about to reject a high profile plugin, they should get a second set of eyes on it. Which would have obviously caught the mistake here.\nFeels like another “Firefox is underinvested in developer relations” story, which is surprising given how much they rely on them.\nEdit: honestly the idea that gorhill doesn’t have a dedicated rep at Mozilla is baffling to me. According to their stats the extension has 8.4 million users. They should call him on the phone to let him know there’s a problem with his extension.",
          "link": "https://news.ycombinator.com/item?id=41709058",
          "publishedOn": "2024-10-01T14:39:52.000Z",
          "wordCount": null,
          "title": "New comment by yojo in \"Gorhill pulls uBlock Origin Lite from Firefox store\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41709019",
          "author": "bentt",
          "description": "The fact that ESPN itself has a sports betting app tells you all you need to know about the perversion of sports now that gambling is blessed by the government.\nI think I can live with the legalization of sports betting if there are strong restrictions against marketing and advertising. If you want to ruin your life that's your decision, and you can always just take the same amount of money and bet it on the stock market. But the way that advertising has its tentacles in our culture now... it's bad.",
          "link": "https://news.ycombinator.com/item?id=41709019",
          "publishedOn": "2024-10-01T14:36:41.000Z",
          "wordCount": null,
          "title": "New comment by bentt in \"Pro bettors disguising themselves as gambling addicts\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41701673",
          "author": "minimaxir",
          "description": "Context: PearAI evidently forked an OSS code editor, then later got funding from Y Combinator for it. (relevant discussion here: https://news.ycombinator.com/item?id=41697032)\nAs an aside, I'm starting to get annoyed with the \"we moved fast and broke things, we're smol indie hackers\" defense that has been popping up more lately in various contexts. The whole incident started because they got venture capital for their fork and were in a startup accelerator for several months: that's not moving fast or being indie.",
          "link": "https://news.ycombinator.com/item?id=41701673",
          "publishedOn": "2024-09-30T20:23:04.000Z",
          "wordCount": 3663,
          "title": "New comment by minimaxir in \"Pear AI founder: We made two big mistakes\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41701073",
          "author": "vineyardmike",
          "description": "> I would add a generic “culture fit” component to each candidate score which you could use as a hedge to admit legacies without calling them as such.\nThis is not new. This is a battle as old as time.\nWant to keep out poor people? Require them to live on campus instead of locally at home. Want to keep out the wrong kind of person? Start requiring college essays to get a \"culture fit\". Or add \"geographic diversity\" to get less NYC Jews, or require \"well rounded\" candidates that do more than pass tests to keep out Asian Americans. Or conduct interviews so you can see their race in-person without asking for it on a form.\nhttps://en.wikipedia.org/wiki/Antisemitism_and_higher_educat...\nhttps://en.wikipedia.org/wiki/Students_for_Fair_Admissions_v...",
          "link": "https://news.ycombinator.com/item?id=41701073",
          "publishedOn": "2024-09-30T19:28:33.000Z",
          "wordCount": 4665,
          "title": "New comment by vineyardmike in \"California bans legacy admissions at private universities\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41700629",
          "author": "tacticalturtle",
          "description": "> which will punish institutions that flout the law by publishing their names on a California Department of Justice website\nImportant to note that this is the only enforcement mechanism. You get put on a naughty list.\nWill be interesting to see how important that is to the selective universities in the state. I don’t see how being named and shamed on an official government website is much different than the status quo of being named and shamed in a media report on legacy admissions.",
          "link": "https://news.ycombinator.com/item?id=41700629",
          "publishedOn": "2024-09-30T18:53:11.000Z",
          "wordCount": 15327,
          "title": "New comment by tacticalturtle in \"California bans legacy admissions at private universities\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41700284",
          "author": "pragma_x",
          "description": "I love everything about this.\nThere is this undercurrent to our technology landscape. A kind of subculture somewhere in the locus of the hackersphere where a kind of punk-rock ethos rules the roost.  I can only describe it as a live exploration of concepts _through_ technology, where functional fixedness is a foreign concept, including in the shared experience of social construct; everything becomes parts to be remixed in a way.  In this place people just do things that, by way of having fun, just becomes art.  It's emergent gameplay just by following a solitary \"rule of cool.\"\nI saw this page and was immediately transported back to the late 1990's and early 'aughts.  The kind of \"I glued these things together and just look\" attitude that graced the pages of hackaday.com and slashdot.org.  LED \"throwies\" come to mind.\nIn this case we have a de-facto art installation.  I imagine that this was probably put together with odds and ends, maybe installed illegally, and probably doesn't have longevity in mind for its construction. It lightheartedly challenges some conventions, challenges ideas about privacy, brushes up against copyright, and is entertaining to boot. Most importantly, how it was made is less interesting than what it _does_, and where it carries the conversation of the observer.  Or maybe: that's the point.",
          "link": "https://news.ycombinator.com/item?id=41700284",
          "publishedOn": "2024-09-30T18:19:14.000Z",
          "wordCount": null,
          "title": "New comment by pragma_x in \"Bop Spotter\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41698425",
          "author": "dgreensp",
          "description": "Full disclosure, I'm a YC alum whose last start-up was acquired by Google, who applied to this batch and didn't get an interview.\nYC is not the stamp of quality it once was, to be sure, though it still works as social proof, because investors (especially VCs) want to invest in companies other investors like (or failing that, companies they imagine other investors would like).  YC would say that they aren't trying to be a stamp of quality or social proof, they are just trying to help start-ups.\nIf I had to take a stab at articulating how YC has changed, it's that it's become a VC, picking ideas to generate returns.\nThis rejection email from 2022 that someone posted online cements the idea for me (excerpted):\n\"Unfortunately, we've decided not to fund {Company} this batch. We enjoyed our conv…",
          "link": "https://news.ycombinator.com/item?id=41698425",
          "publishedOn": "2024-09-30T15:38:18.000Z",
          "wordCount": 4656,
          "title": "New comment by dgreensp in \"Y Combinator Traded Prestige for Growth\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41697730",
          "author": "bicx",
          "description": "This kind of project has made me realize that somewhere along the way, I quit thinking of tech as a way to build anything fun. I need to rekindle that goofball spirit.",
          "link": "https://news.ycombinator.com/item?id=41697730",
          "publishedOn": "2024-09-30T14:45:04.000Z",
          "wordCount": 477,
          "title": "New comment by bicx in \"Bop Spotter\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41697577",
          "author": "indymike",
          "description": "I think this is just literal rickrolling.",
          "link": "https://news.ycombinator.com/item?id=41697577",
          "publishedOn": "2024-09-30T14:33:56.000Z",
          "wordCount": null,
          "title": "New comment by indymike in \"Bop Spotter\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41697187",
          "author": "IncreasePosts",
          "description": "Alright, who wants to go wardriving around the mission with me, blasting Never Gonna Give You Up?",
          "link": "https://news.ycombinator.com/item?id=41697187",
          "publishedOn": "2024-09-30T14:01:10.000Z",
          "wordCount": 899,
          "title": "New comment by IncreasePosts in \"Bop Spotter\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41693639",
          "author": "timoth3y",
          "description": "NotebookLM's is incredibly good at generating the affect and structure of a quality podcast.\nThis is in-line with all art, music, and video created by LMM at the moment. They are imitating a structure and affect, the quality of the content is largely irrelevant.\nI think the interesting thing is that most people don't really care, and AI is not to blame for that.\nMost books published today have the affect of a book, but the author doesn't really have anything to say. Publishing a book is not about communicating ideas, but a means to something else. It's not meant to stand on its own.\nThe reason so much writing, podcasting, and  music is vulnerable to AI disruption is that quality has already become secondary.",
          "link": "https://news.ycombinator.com/item?id=41693639",
          "publishedOn": "2024-09-30T04:47:33.000Z",
          "wordCount": 13672,
          "title": "New comment by timoth3y in \"NotebookLM's automatically generated podcasts are surprisingly effective\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41691199",
          "author": "worstspotgain",
          "description": "Excellent move by Newsom. We have a very active legislature, but it's been extremely bandwagon-y in recent years. I support much of Wiener's agenda, particularly his housing policy, but this bill was way off the mark.\nIt was basically a torpedo against open models. Market leaders like OpenAI and Anthropic weren't really worried about it, or about open models in general. Its supporters were the also-rans like Musk [1] trying to empty out the bottom of the pack, as well as those who are against any AI they cannot control, such as antagonists of the West and wary copyright holders.\n[1] https://techcrunch.com/2024/08/26/elon-musk-unexpectedly-off...",
          "link": "https://news.ycombinator.com/item?id=41691199",
          "publishedOn": "2024-09-29T22:12:29.000Z",
          "wordCount": null,
          "title": "New comment by worstspotgain in \"Gavin Newsom vetoes SB 1047\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41690011",
          "author": "kragen",
          "description": "> I am certain they never intended to inspire a 12 year-old kid to find a better life.\ni can't speak for everyone, but as one of the people writing tutorials and faqs and helping people learn to do things with free software during the period miller is talking about, that is absolutely what i intended to do.  and, from the number of people i knew who were excited to work on olpc, conectar igualdad, and huayra linux, i think it was actually a pretty common motivation\nas a kid on bbses, fidonet, and the internet, i benefited to an unimaginable degree from other people's generosity in sharing their learning and their inventions (which is what software is).  how could i not want to do the same?\nunderwritten by the nsf, the internet was a gift economy, like burning man: people giving away things of value to all comers because if you don't do that maybe it's because you can't.  the good parts of it still are",
          "link": "https://news.ycombinator.com/item?id=41690011",
          "publishedOn": "2024-09-29T20:05:36.000Z",
          "wordCount": 5351,
          "title": "New comment by kragen in \"Being Raised by the Internet\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41688983",
          "author": "newpavlov",
          "description": "So Varlink requires a proper specification of message types, but then uses god damn JSON to serialize messages? Why would you do that?\nApparently, we don't have enough wasted cycles in modern software, just add a bunch more in a fundamental IPC infrastructure.",
          "link": "https://news.ycombinator.com/item?id=41688983",
          "publishedOn": "2024-09-29T17:45:17.000Z",
          "wordCount": null,
          "title": "New comment by newpavlov in \"Varlink – IPC to replace D-Bus gradually in systemd\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41685053",
          "author": "refibrillator",
          "description": "I recognize the author Jascha as an incredibly brilliant ML researcher, formerly at Google  Brain and now at Anthropic.\nAmong his notable accomplishments, he and coauthors mathematically characterized the propagation of signals through deep neural networks via techniques from physics and statistics (mean field and free probability theory). Leading to arguably some of the most profound yet under-appreciated theoretical and experimental results in ML in the past decade. For example see “dynamical isometry” [1] and the evolution of those ideas which were instrumental in achieving convergence in very deep transformer models [2].\nAfter reading this post and the examples given, in my eyes there is no question that this guy has an extraordinary intuition for optimization, spanning beyond the boundaries of ML and across the fabric of modern society.\nWe ought to recognize his technical background and raise this discussion above quibbles about semantics and definitions.\nLet’s address the heart of his message, the very human and empathetic call to action that stands in the shadow of rapid technological progress:\n> If you are a scientist looking for research ideas which are pro-social, and have the potential to create a whole new field, you should consider building formal (mathematical) bridges between results on overfitting in machine learning, and problems in economics, political science, management science, operations research, and elsewhere.\n[1] Dynamical Isometry and a Mean Field Theory of CNNs: How to Train 10,000-Layer Vanilla Convolutional Neural Networks\nhttp://proceedings.mlr.press/v80/xiao18a/xiao18a.pdf\n[2] ReZero is All You Need: Fast Convergence at Large Depth\nhttps://arxiv.org/pdf/2003.04887",
          "link": "https://news.ycombinator.com/item?id=41685053",
          "publishedOn": "2024-09-29T05:04:56.000Z",
          "wordCount": null,
          "title": "New comment by refibrillator in \"Too much efficiency makes everything worse (2022)\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41684333",
          "author": "mannyv",
          "description": "Well hmm. NASA decided Starliner wasn't safe enough to use for the return journey, so the astronauts stayed on the ISS until the next ride became available.\nOriginally the astronauts were supposed to go back on Starliner. Now they're taking another ride back. Is that considered a rescue? Well, it depends.\nIf you get left behind on an island because your ride wasn't safe and another boat picks you up, is that a rescue? Now what if you're 420 kilometers up and another boat has to come get you. Is that a rescue?\nIf there wasn't another ride from the ISS available, would the astronauts be stranded? Yes.\nIn that case, if a ride suddenly became available would it be considered a rescue? Probably, yes.",
          "link": "https://news.ycombinator.com/item?id=41684333",
          "publishedOn": "2024-09-29T02:12:33.000Z",
          "wordCount": null,
          "title": "New comment by mannyv in \"SpaceX launches mission for 2 NASA astronauts who are stuck on the ISS\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41674928",
          "author": "diggan",
          "description": "> The training code, dataset and weights for this model are open sourced so that developers can reproduce the model and help train other SLMs and LLMs.\nWow, an actual open source language model (first of its kind [from a larger company] maybe even?), includes all you need to be able to recreate it from scratch. Thanks AMD!\nAvailable under this funky GitHub organization it seems: https://github.com/AMD-AIG-AIMA/AMD-LLM",
          "link": "https://news.ycombinator.com/item?id=41674928",
          "publishedOn": "2024-09-27T19:57:29.000Z",
          "wordCount": 5978,
          "title": "New comment by diggan in \"AMD Unveils Its First Small Language Model AMD-135M\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41673954",
          "author": "testfoobar",
          "description": "Similar - when I was younger, I would never have suspected that a scientist was committing fraud.\nAs I've gotten older, I understand that Charlie Munger's observation \"“Show me the incentive and I will show you the outcome.” is applicable everywhere - including science.\nAcademic scientists' careers are driven by publishing, citations and impact.  Arguably some have figured how to game the system to advance their careers.  Science be damned.",
          "link": "https://news.ycombinator.com/item?id=41673954",
          "publishedOn": "2024-09-27T18:22:25.000Z",
          "wordCount": null,
          "title": "New comment by testfoobar in \"Fraud, so much fraud\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41673769",
          "author": "vighneshiyer",
          "description": "This work from Google (original Nature paper: https://www.nature.com/articles/s41586-021-03544-w) has been credibly criticized by several researchers in the EDA CAD discipline. These papers are of interest:\n- A rebuttal by a researcher within Google who wrote this at the same time as the \"AlphaChip\" work was going on (\"Stronger Baselines for Evaluating Deep Reinforcement Learning in Chip Placement\"): http://47.190.89.225/pub/education/MLcontra.pdf\n- The 2023 ISPD paper from a group at UCSD (\"Assessment of Reinforcement Learning for Macro Placement\"): https://vlsicad.ucsd.edu/Publications/Conferences/396/c396.p...\n- A paper from Igor Markov which critically evaluates the \"AlphaChip\" algorithm (\"The False Dawn: Reevaluating Google's Reinforcement Learning for Chip Macro Placement\"): https://arxiv.org/pdf/2306.09633\nIn short, the Google authors did not fairly evaluate their RL macro placement algorithm against other SOTA algorithms: rather they claim to perform better than a human at macro placement, which is far short of what mixed-placement algorithms are capable of today. The RL technique also requires significantly more compute than other algorithms and ultimately is learning a surrogate function for placement iteration rather than learning any novel representation of the placement problem itself.\nIn full disclosure, I am quite skeptical of their work and wrote a detailed post on my website: https://vighneshiyer.com/misc/ml-for-placement/",
          "link": "https://news.ycombinator.com/item?id=41673769",
          "publishedOn": "2024-09-27T18:05:08.000Z",
          "wordCount": null,
          "title": "New comment by vighneshiyer in \"How AlphaChip transformed computer chip design\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41673680",
          "author": "dekhn",
          "description": "These sorts of articles raise so many thoughts and emotions in me.  I was trained as a computational biologist with a little lab work and ran gels from time to time.  Personally, I hated gels- they're finicky, messy, ugly, and don't really tell you very much.  But molecular biology as a field runs on gels- it's the priimary source of results for almost everything in molbio.  I have seen more talks and papers that rested entirely a single image of a gel which is really just some dark bands.\nAt the same time, I was a failed scientist: my gels weren't as interesting, or convincing compared to the ones done by the folks who went on to be more successful.  At the time (20+ years ago) it didn't occur to me that anybody would intentionally modify images of gels to promote the results they claimed, although I did assume that folks didn't do a good job of organizing their data, and occasionally published papers that were wrong simply because they confused two images.\nWould I have been more successful if fewer people (and I now believe this is a common occurrence) published fraudulent images of gels?  Maybe, maybe not.  But the more important thing is that everybody just went along with this.  I participated in many journal clubs where folks would just flip to Figure 3, assume the gel was what the authors claimed, and proceed to agree with (or disagree with) the results and conclusions uncritically.  Whereas I would spend a lot of time trying to understand what experiment was actually run, and what th e data showed.",
          "link": "https://news.ycombinator.com/item?id=41673680",
          "publishedOn": "2024-09-27T17:58:01.000Z",
          "wordCount": 24620,
          "title": "New comment by dekhn in \"Fraud, so much fraud\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41673469",
          "author": "dang",
          "description": "Here's the article: https://www.science.org/content/article/research-misconduct-...",
          "link": "https://news.ycombinator.com/item?id=41673469",
          "publishedOn": "2024-09-27T17:41:54.000Z",
          "wordCount": null,
          "title": "New comment by dang in \"Fraud, so much fraud\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41673203",
          "author": "neom",
          "description": "I'm the furthest thing from a scientist unless you count 3,000 hours of PBS spacetime, but I love science and so science/academia fraud to me, feels kinda like the worst kinda fraud you can commit. Financial fraud can cause suicides and ruin in lives, sure, but I feel like academic fraud just sets the whole of humanity back? I also feel that through my life I've (maybe wrongly) placed a great deal of respect and trust in scientists, mostly that they understand that their work is of the upmost importance and so the downstream consequences of mucking around are just too grave. Stuff like this seems to bother me more than it rationally should. Are people who commit this type of science fraud just really evil humans? Am I over thinking this? Do scientists go to jail for academic fraud?",
          "link": "https://news.ycombinator.com/item?id=41673203",
          "publishedOn": "2024-09-27T17:21:04.000Z",
          "wordCount": null,
          "title": "New comment by neom in \"Fraud, so much fraud\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41673056",
          "author": "steveklabnik",
          "description": "I am always glad to see people pursuing creating their own programming language. More people should give it a try, IMHO.\nA tricky thing that comes up with Rust comparisons is that often, Rust has a feature that's weird or hard to use, but it's because that's the only solution that makes sense within the constraints Rust has placed upon itself. Clicking some links gets me to https://git.yzena.com/Yzena/Yc/src/branch/master/docs/yao/de...\n> Yao's biggest goals are: Correctness, Convenience, Performance, in that order.\nHaving clear goals is a great thing when making a language, because they give you guidance on what is appropriate to include and what is not.\nRust has certainly demonstrated having similar goals, but in a slightly different order: Correctness, Performance, and then Convenience. So it wouldn't shock me if Yao could do some things better than Rust, in accordance with its goals. But that also means that sometimes, Rust would be useful where Yao cannot be. Everything is tradeoffs.\nIncidentally, I actually think that figuring out what your values are, and what your needs are, is a great way to pick a programming language. Decide what matters to you as an engineer, and then find a language that shares similar values. I gave a conference talk a few years back on this idea, and how I viewed Rust's values at the time https://www.infoq.com/presentations/rust-tradeoffs/\nThis was based off of bcantrill's Platform as a Reflection of Values, which was very influential on me. https://www.youtube.com/watch?v=Xhx970_JKX4\nIf you've ever heard about Oxide's focus on values, this is some of the older background on that.",
          "link": "https://news.ycombinator.com/item?id=41673056",
          "publishedOn": "2024-09-27T17:09:49.000Z",
          "wordCount": 822,
          "title": "New comment by steveklabnik in \"Rewriting Rust: A Response\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41672834",
          "author": "dmoy",
          "description": "I like the idea of reclaiming the word \"buy\" to only be the traditional type of ownership transfer (first sale doctrine or whatever if it's a copyrighted thing).  Mandate the use of the word \"license\" or \"rent\" if it's something else",
          "link": "https://news.ycombinator.com/item?id=41672834",
          "publishedOn": "2024-09-27T16:53:04.000Z",
          "wordCount": null,
          "title": "New comment by dmoy in \"CA law means stores can't say you're buying a game if you're merely licensing it\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41672140",
          "author": "aantix",
          "description": "We took our kids to Disney World once.\nWhen asked what their favorite part of the trip was, they responded..\nThe hot tub.\nAt the hotel.\nMy kids light up the most when I am fully engaged with them, fully present, entertaining their ideas, and asking questions.\nTheir favorite family trip so far?  When we traveled to Arkansas to mine for crystals.  AKA, dig in the dirt all day.  They saw it on a YouTube video. They asked to go.  So we obliged. I had never been to Arkansas.  It's beautiful.\nWe stayed at a resort, Diamonds Old West Cabins, with a huge playground outside the cabins, archery, and a bubble party every evening at 6 pm.\nThey still talk about that trip.",
          "link": "https://news.ycombinator.com/item?id=41672140",
          "publishedOn": "2024-09-27T15:58:20.000Z",
          "wordCount": null,
          "title": "New comment by aantix in \"The best $4 ever spent\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41670530",
          "author": "TheOtherHobbes",
          "description": "Google didn't change it, it embodied it. The problem isn't AI, it's the pervasive culture of PR and advertising which appeared in the 50s and eventually consumed its host.\nWestern industrial culture was based on substance - getting real shit done. There  was always a lot of scammery around it, but the bedrock goal was to make physical things happen - build things, invent things, deliver things, innovate.\nPR and ad culture was there to support that. The goal was to change values and behaviours to get people to Buy More Stuff. OK.\nThen around the time the Internet arrived, industry was off-shored, and the culture started to become one of appearance and performance, not of substance and action.\nSEO, adtech, social media, web framework soup, management fads - they're all about impression manag…",
          "link": "https://news.ycombinator.com/item?id=41670530",
          "publishedOn": "2024-09-27T13:55:42.000Z",
          "wordCount": 3525,
          "title": "New comment by TheOtherHobbes in \"I Am Tired of AI\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41670122",
          "author": "snapcaster",
          "description": "The older I get the more I hate gambling. When i was younger I tended to think \"hey it's their choice\" but i've realized how unfair our society is in terms of things like this.\nFood, gambling, etc. are all backed by hordes of brilliant well paid people trying to get you to ruin your life so they make money. On the other side is just regular people like us stressed out trying to survive.\nThis isn't some \"freedom\" issue, it's an incredibly huge power asymmetry and I think \"we the people\" need protection from these forces",
          "link": "https://news.ycombinator.com/item?id=41670122",
          "publishedOn": "2024-09-27T13:20:58.000Z",
          "wordCount": 15364,
          "title": "New comment by snapcaster in \"Legalizing sports gambling was a mistake\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=53250",
          "author": "Eric Schliesser",
          "description": "Back in 1991 my co-blogger here at Crooked Timber, Elizabeth S. Anderson, reminded every one of the significance of John Stuart Mill and Experiments in Living (Ethics, 102(1): 4-26). She situated Mill’s views on the matter in the context of a debate with Bentham (and Parfit) over the nature of the good in which Mill wanted […]",
          "link": "https://crookedtimber.org/2024/10/02/on-robert-owen-and-the-history-of-experiments-in-living/",
          "publishedOn": "2024-10-02T08:48:01.000Z",
          "wordCount": 4170,
          "title": "On Robert Owen and the History of Experiments in Living",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53225",
          "author": "Miriam Ronzoni",
          "description": "I work at a very large University. I am the parent of a child who has just started secondary school, and of one in the middle of their primary school journey. I am currently taking what in the UK is called a Level 2 Adult Education course. In all four of those domains – and […]",
          "link": "https://crookedtimber.org/2024/10/01/shambles-but-make-it-digital/",
          "publishedOn": "2024-10-01T08:50:27.000Z",
          "wordCount": 6349,
          "title": "Shambles, But Make It Digital",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53241",
          "author": "Chris Bertram",
          "description": "Visit the post for more.",
          "link": "https://crookedtimber.org/2024/09/29/sunday-photoblogging-salisbury-cathedral-2/",
          "publishedOn": "2024-09-29T06:00:08.000Z",
          "wordCount": 1777,
          "title": "Sunday photoblogging: Salisbury Cathedral",
          "imageUrl": "https://live.staticflickr.com/65535/53559402338_2b9ef821b0.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52701",
          "author": "Liz Anderson",
          "description": "Citizens’ assemblies are a hot topic these days in democratic theory. Hélène Landemore gave her Tanner Lecture at University of Michigan last semester, describing her experience on the governance committee of the French Citizens’ Convention on the End of Life. Her account of how ordinary citizens could not only deliberate seriously about a contentious issue, […]",
          "link": "https://crookedtimber.org/2024/09/29/citizens-assemblies-in-michigan-and-beyond/",
          "publishedOn": "2024-09-29T01:43:25.000Z",
          "wordCount": 3710,
          "title": "Citizens’ Assemblies in Michigan and Beyond",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53233",
          "author": "John Q",
          "description": "My latest in The Guardian Announcements from major employers, including Amazon and Tabcorp, that workers will be required to return to the office five days a week have a familiar ring. There has been a steady flow of such directives. The Commonwealth Bank CEO, Matt Comyn, attracted a lot of attention with an announcement that […]",
          "link": "https://crookedtimber.org/2024/09/27/in-their-plaintive-call-for-a-return-to-the-office-ceos-reveal-how-little-they-are-needed/",
          "publishedOn": "2024-09-27T02:11:37.000Z",
          "wordCount": 6752,
          "title": "In their plaintive call for a return to the office, CEOs reveal how little they are needed",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/PRC-75-today",
          "author": "Michael Roberts",
          "description": "Today is the 75th anniversary of the founding of the People's Republic of China (PRC). The survival of the PRC is now longer than the Soviet Union, which lasted 74 years. China has nearly one-fifth of the world's population and on some measures is the largest economy in the world, although per person national income is only 30% of that of the US. \nEnglish\n\n/ \nChina, \nCapitalism",
          "link": "https://www.cadtm.org/PRC-75-today",
          "publishedOn": "2024-10-01T20:00:00.000Z",
          "wordCount": 1137,
          "title": "PRC 75 today",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L800xH420/752c2bbacfd8e3c4da4fd91c660936-b8ac4.jpg"
        },
        {
          "id": "https://www.cadtm.org/The-Blessing-for-genocide",
          "author": "Patrick Bond",
          "description": "The Biden-Harris genocide-facilitation team is celebrating about wanting a conflict-free world and post-Western geopolitical arrangements, including a two-state solution for Israel and Palestine. So this public recognition by Netanyahu of their usefulness should be humiliating enough. (At the United Nations, among BRICS+ members only Ethiopia typically joins Axis-of-Genocide powers by abstaining on resolutions criticising Israel, including a September 18 enforcement of the International (...)\nEnglish\n\n/ \nSouth Africa, \nWTO, \nIsrael, \nBRICS",
          "link": "https://www.cadtm.org/The-Blessing-for-genocide",
          "publishedOn": "2024-10-01T12:14:05.000Z",
          "wordCount": 3143,
          "title": "‘The Blessing' for genocide",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L624xH328/6b7cab7714a257c63a22239dafc619-49c5c.jpg"
        },
        {
          "id": "https://www.cadtm.org/Comrade-President-Change-and-Continuity-in-Sri-Lanka",
          "author": "Balasingham Skanthakumar",
          "description": "Anura Kumara Dissanayake's (AKD) victory on 21 September as the candidate of the centre-left National People's Power (NPP) coalition is highly significant for symbolic and substantive reasons. His predecessors have been from the social and political elite that has mis-ruled Sri Lanka since independence from Britain in 1948. Some were born into that elite, while a couple (Ranasinghe Premadasa, Maithripala Sirisena) made their way into it through the business of politics before they occupied (...)\nEnglish\n\n/ \nAusterity/Structural Adjustment, \nSri Lanka, \nIMF, \nDebt crisis",
          "link": "https://www.cadtm.org/Comrade-President-Change-and-Continuity-in-Sri-Lanka",
          "publishedOn": "2024-09-29T15:32:14.000Z",
          "wordCount": 4389,
          "title": "Comrade President? Change and Continuity in Sri Lanka",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L800xH420/6f3911ca7eb950e1d813e700f8947d-67baf.jpg"
        },
        {
          "id": "https://www.cadtm.org/The-CADTM-welcomes-the-sovereign-attitude-of-the-new-Government-of-Mexico-of",
          "author": "CADTM International",
          "description": "At the ceremony of the transfer of power from the President of Mexico, Andrés Manuel López Obrador, to the new President, Dr. Claudia Sheimbaum Pardo, next Tuesday, October 1, there will be a notable absence, that of King Felipe VI de Borbón of the Kingdom of Spain. \nEnglish\n\n/ \nMexico, \nNeocolonialism, \nColonialism, \nHuman Rights",
          "link": "https://www.cadtm.org/The-CADTM-welcomes-the-sovereign-attitude-of-the-new-Government-of-Mexico-of",
          "publishedOn": "2024-09-29T13:46:43.000Z",
          "wordCount": 1759,
          "title": "The CADTM welcomes the sovereign stance of the new Government of Mexico of not inviting King Felipe VI of Spain to attend the inauguration ceremony",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/6606cdc7cfc228361f114701bb65a9-24f0f.jpg"
        },
        {
          "id": "https://www.cadtm.org/Austria-stuck-in-the-middle",
          "author": "Michael Roberts",
          "description": "On Sunday, Austria has a general election for its parliament. The 183 members of the National Council are elected by open list proportional representation at three levels; a single national constituency, nine constituencies based on the federal states, and 39 regional constituencies. Seats are apportioned to the regional constituencies based on the results of the most recent census. For parties to receive any representation in the National Council, they must either win at least one seat in (...)\nEnglish\n\n/ \nAntifascism, \nRecession, \nAustria",
          "link": "https://www.cadtm.org/Austria-stuck-in-the-middle",
          "publishedOn": "2024-09-28T18:54:47.000Z",
          "wordCount": 2043,
          "title": "Austria: stuck in the middle",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1024xH538/9b117f7e1ac7d437e9332de9a50bf0-66f8e.jpg"
        },
        {
          "id": "https://www.cadtm.org/Strategic-Reflections-on-the-Escalation-of-Israeli-Intimidation-in-Lebanon-22909",
          "author": "Gilbert Achcar",
          "description": "On intimidation, terrorism, asymmetric war, deterrence, counter-deterrence, and the Dahiya doctrine in the ongoing Israeli onslaught on Lebanon \nEnglish\n\n/ \nLebanon, \nPalestine, \nIsrael",
          "link": "https://www.cadtm.org/Strategic-Reflections-on-the-Escalation-of-Israeli-Intimidation-in-Lebanon-22909",
          "publishedOn": "2024-09-27T15:02:17.000Z",
          "wordCount": 2400,
          "title": "Strategic Reflections on the Escalation of Israeli Intimidation in Lebanon",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/7e7e02df2f97ae0e8373ddd4478e3e-45a1d.jpg"
        },
        {
          "id": "https://www.cadtm.org/When-Israel-s-accomplices-accustom-us-to-a-monstrous-heartless-and-inhuman",
          "author": "Gideon Levy, Yorgos Mitralias",
          "description": "Worse than Israel's crimes is the fact that the entire so-called “civilized” world follows and comments on them as if they were just a video game. When, of course, it's not celebrating them by arming the criminal. Or approving them by letting them go unpunished. And it has been doing so for decades. And live on our TV screens. Day after day, hour after hour. As if these daily massacres were a never-ending TV series, interspersed with commercials, that we can follow lying on our sofas, while we (...)\nEnglish\n\n/ \nPalestine, \nIsrael, \nColonialism",
          "link": "https://www.cadtm.org/When-Israel-s-accomplices-accustom-us-to-a-monstrous-heartless-and-inhuman",
          "publishedOn": "2024-09-26T10:19:04.000Z",
          "wordCount": 2352,
          "title": "When Israel's accomplices accustom us to a monstrous, heartless and inhuman world!",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/a4fd68eb455209c2e91d1081f6161f-79c86.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=8607",
          "author": "disassociated.com",
          "description": "Juice is the latest novel by Australian author Tim Winton, which was published yesterday. From this synopsis, Juice sounds like it blends elements of the Max Mad saga, with Winton’s own environmental and climate change concerns: Two fugitives, a man and a child, drive all night across a stony desert. As dawn breaks, they roll […]",
          "link": "https://disassociated.com/juice-new-cli-fi-novel-australian-author-tim-winton/",
          "publishedOn": "2024-10-01T21:00:34.000Z",
          "wordCount": 348,
          "title": "Juice: the new cli-fi novel by Australian author Tim Winton",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8602",
          "author": "disassociated.com",
          "description": "I’m not very sporty as regular readers will have gathered. Of the approximate sixteen-hundred posts here at present, less than half a dozen are sport related. Of these, the majority relate to the Matildas, the Australian women’s football/soccer team, which I wrote during last year’s World Cup tournament. To think it’s been over a year […]",
          "link": "https://disassociated.com/mullets-great-australian-football-league-teams/",
          "publishedOn": "2024-09-30T21:00:10.000Z",
          "wordCount": 296,
          "title": "Do mullets make for great Australian Football League teams?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8589",
          "author": "disassociated.com",
          "description": "I’m pretty sure the 1984 film, A Room with a View, made by James Ivory and Ismail Merchant, was my introduction to the work of British stage and screen actor Maggie Smith, who died last week, aged 89. I’d been trying to read the 1908 novel of the same name, by E.M. Forster, but was […]",
          "link": "https://disassociated.com/vale-british-actor-maggie-smith/",
          "publishedOn": "2024-09-29T21:00:00.000Z",
          "wordCount": 334,
          "title": "Vale British actor Maggie Smith, Harry Potter, A Room with a View, star",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8577",
          "author": "disassociated.com",
          "description": "Google search does away with its cache, an archived copy of an earlier version of a webpage, but now links to the Internet Archive’s (IA) Wayback Machine copy instead. Try it on your own website, assuming it’s indexed by Google that is. On the search result, click the “more about this page” button, which will […]",
          "link": "https://disassociated.com/internet-archive-wayback-machine-link-replaces-google-search-cache/",
          "publishedOn": "2024-09-26T21:00:58.000Z",
          "wordCount": 284,
          "title": "Internet Archive Wayback Machine link replaces Google search cache",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8573",
          "author": "disassociated.com",
          "description": "Australian teachers in NSW, now have access to NSWEduChat, a generative artificial intelligence (AI) tool, intended to help educators get a grip on AI tools: The tool aims to provide additional support to staff in developing and delivering teaching experiences, easing workload demands, and empowering users to advance their AI skills in a safe environment. […]",
          "link": "https://disassociated.com/nsweduchat-generative-ai-tool-australian-teachers-nsw/",
          "publishedOn": "2024-09-26T20:30:29.000Z",
          "wordCount": 255,
          "title": "NSWEduChat, an AI tool for Australian teachers in NSW",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8582",
          "author": "disassociated.com",
          "description": "A few days ago, a group called the Social Web Foundation was launched. A coming together of “leaders of the open social networking movement“, the foundation aims to make “connections between social platforms with the open standard protocol ActivityPub.” Rather than me reinventing the wheel, here’s the Wikipedia definition of ActivityPub: ActivityPub is a protocol […]",
          "link": "https://disassociated.com/when-social-web-not-social-web/",
          "publishedOn": "2024-09-26T20:00:07.000Z",
          "wordCount": 1068,
          "title": "When is the social web not the social web? When it is THE social web",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": []
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/asperity-and-delight",
          "author": null,
          "description": "Richard Serra (1938-2024).",
          "link": "https://newleftreview.org/sidecar/posts/asperity-and-delight",
          "publishedOn": "2024-10-01T15:53:46.000Z",
          "wordCount": 1675,
          "title": "Hal Foster: &ldquo;Asperity and Delight&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/10/kd10lipn7kj41.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/consequences-of-nasrallah",
          "author": null,
          "description": "Israel and the Resistance.",
          "link": "https://newleftreview.org/sidecar/posts/consequences-of-nasrallah",
          "publishedOn": "2024-09-29T11:22:59.000Z",
          "wordCount": 1261,
          "title": "Tariq Ali: &ldquo;Consequences of Nasrallah&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/09/4c6f6b6d3681682iic3_800C450.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/like-a-prayer",
          "author": null,
          "description": "On Sally Rooney.",
          "link": "https://newleftreview.org/sidecar/posts/like-a-prayer",
          "publishedOn": "2024-09-27T15:06:27.000Z",
          "wordCount": 3979,
          "title": "Ryan Ruby: &ldquo;Like a Prayer&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/09/helen-frankenthaler_riverhead_1963_aware_women-artists_artistes-femmes.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/false-hopes",
          "author": null,
          "description": "Gaza and the DNC.",
          "link": "https://newleftreview.org/sidecar/posts/false-hopes",
          "publishedOn": "2024-09-27T12:42:45.000Z",
          "wordCount": 3867,
          "title": "Tim Barker: &ldquo;False Hopes&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/09/imageresize.jpeg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/singularity",
          "author": null,
          "description": "Fredric Jameson (1934-2024).",
          "link": "https://newleftreview.org/sidecar/posts/singularity",
          "publishedOn": "2024-09-26T14:44:21.000Z",
          "wordCount": 1803,
          "title": "Benjamin Kunkel: &ldquo;Singularity&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/09/jameson-nachruf-1.webp"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://ninecoffees.blog/the-calm-before-the-storm/",
          "author": null,
          "description": "At the time of writing this post, Typhoon Krathon will hit the populated west side of Taiwan in four hours.\nI was feeling rather cooped up earlier so I went out for a walk. Smack in the pouring rain. Thankfully, my sneakers were worn and in need of replacing so getting them soaked wasn't the biggest deal; still, one is forced to ask oneself if they're capable of making good life decisions when the wind starts howling against your umbrella. By the time I got to the halfway point of my walk, lightning was flashing furiously. Like I said, not a good life decision.\nAlmost every store was closed today. The only things left running were big corporate: convenience stores and chain cafes. I stopped by a Louisa (Taiwan's Starbucks equivalent) and saw that there was only the barista inside.\nI asked …",
          "link": "https://ninecoffees.blog/the-calm-before-the-storm/",
          "publishedOn": "2024-10-02T04:22:00.000Z",
          "wordCount": 849,
          "title": "The Calm Before the Storm",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://alexandrawolfe.ca/inktober-01-peas-in-a-pod/",
          "author": null,
          "description": "I know there is a prompt sheet available for the challenge, but I'm going rogue as I kind of tend to scribble stuff that pops into my head at any given time. And, so ... here's my first offering.",
          "link": "https://alexandrawolfe.ca/inktober-01-peas-in-a-pod/",
          "publishedOn": "2024-10-01T18:24:09.452Z",
          "wordCount": 1060,
          "title": "Inktober #01 : Peas in a Pod",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/notebook/peas.webp"
        },
        {
          "id": "https://azhdarchid.com/goodbye-cohost/",
          "author": null,
          "description": "Alright, I'm a little sick, and I have something of a headache, and I'm emotional for more reasons than just Cohost, but here goes.\nI've been writing on the internet for most of the time that I've been alive. I've done it on blogs, I've done it on social media. I've done it for money and I've done it for free. I've done it on Tumblr and on more than one defunct media vertical and in interactive fiction.\nCohost was the first place where it felt like, consistently, someone was always reading. Something about the site's design and user culture created a magical space where people approached things with openness and curiosity and willingness to give their time and attention.\nThis felt like a place where you could write about anything and people would care. I've talked about the Put your Helmet…",
          "link": "https://azhdarchid.com/goodbye-cohost/",
          "publishedOn": "2024-10-01T00:17:00.000Z",
          "wordCount": 888,
          "title": "Goodbye, Cohost",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/azhdarchid/1024px-arambourgiania_philadelphiae.jpg"
        },
        {
          "id": "https://blog.radicaldream.land/been-thinking-about-tangible-reality/",
          "author": null,
          "description": "this post was originally written for the final couple days of cohost, a long-form social media site that as of october 1st will be sunsetting.\nit really is precious, sometimes. to look at something and be able to experience it with your senses. it's novel, most days. you just do it without thinking.\nbut then there's times when you experience an intangible unreality so strong that it becomes a force in your life that can't be measured. we don't have scales for that, or weights that add up the unreal intangible space that exists between little lights in a grid & your brain.\nthere is a space, somewhere within the imagination, that fills in bit by bit over time. like reading a book, making the world come to life, hearing voices, making up the parts that the author never tells you. internet spa…",
          "link": "https://blog.radicaldream.land/been-thinking-about-tangible-reality/",
          "publishedOn": "2024-09-30T17:16:00.547Z",
          "wordCount": 1139,
          "title": "been thinking about tangible reality",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/radicaldreamland/logo_halo_socials_bigger.png"
        },
        {
          "id": "https://alexandrawolfe.ca/timeline/",
          "author": null,
          "description": "My Timeline\nAtomic Age\nAlexandra was born at a very young age, in Germany, to English speaking parents, which confused the hell out of her.\nThree Years Later\nAt aged 3, Alexandra took a very long boat journey with her parents half way around the world, from England to Hong Kong, via South Africa, and never once got sea sick.\nThree Years Later\nHaving survived an earthquake, a 1000 year historic tsunami that lifted a ship out of the harbour, and a mega typhoon that sucked all the windows out of their third story apartment, Alexandra and her family flew back to England for tea and marmalade sandwiches.\nThree Years Later\nAfter the heat and humidity of SE Asia, Alexandra and her family spent 3 years shivering in the cold frozen north of Scotland eating a lot of fish and chips. She did, however, get to sit in an English Electric Lightning fighter jet, and has the photographic evidence to prove it.\nThree Years Later\nWhat seemed like months but was, in fact, only days, Alexandra and her family arrived, by plane, in Singapore. Having hopped, skipped, and seemingly, jumped, through various countries. Singapore was very similar to Hong Kong minus the earthquake. It did, however, have a lot of tropical fish which Alexandra enjoyed collecting.\nThree Years Later\nArriving back in England, on a fancy jet, Alexandra and her family settled back into a boring English life where, secretly, they all longed to be back in SE Asia, anywhere, but the north of England. Whereupon, Alexandra quietly waited for adulthood to arrive.\nSix Years Later\nHaving waited patiently for adulthood to arrive, Alexandra packed a marmite sandwich, her toothbrush, favourite teddy bear, and a lucky button wrapped in a ten shilling note and, like Nelly the elephant, ran away to join the circus. Also known as, at this time, the Women's Royal Air Force. Where she became an air traffic controller, as it is also known, air is notoriously difficult to control at any given time of the day or night.",
          "link": "https://alexandrawolfe.ca/timeline/",
          "publishedOn": "2024-09-30T16:07:00.000Z",
          "wordCount": 1309,
          "title": "Timeline",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://birming.com/timeline-bear-blog/",
          "author": null,
          "description": "Timeline for Bear Blog\n\nDo you want to present your blogging timeline in a stylish way? Or perhaps have a unique style for your micro thoughts? Or keep a changelog for documenting your blog’s development?\nSay hello to the latest cub in the Bearming theme family: Timeline.\nHere’s an example with the time-focused timeless song In the Year 2525 (further down the page, you’ll find instructions on how to implement it on your blog):\nYear 3535\nIn the year 3535, ain't gonna need to tell the truth, tell no lie, everything you think, do and say, is in the pill you took today.\nYear 5555\nIn the year 5555, your arms hangin' limp at your sides, your legs got nothin' to do, some machine's doin' that for you.\nYear 9595\nIn the year 9595, I'm kinda wonderin' if man is gonna be alive, he's taken everything t…",
          "link": "https://birming.com/timeline-bear-blog/",
          "publishedOn": "2024-09-30T11:32:00.000Z",
          "wordCount": 2012,
          "title": "Timeline for Bear Blog",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert/img_5746.webp"
        },
        {
          "id": "https://so.axodys.com/inspired-by-micro-thoughts/",
          "author": null,
          "description": "Jedda1 had a timely post this week titled Micro Thoughts - Explained that was extremely relevant to my recent blog consolidation efforts:\nI post random thoughts and shorter things in various places. You can mostly find me on Mastodon these days, sporadically on micro.blog (that sometimes gets pushed to Mastodon), and these days on status.log (which also sometimes gets copied over to Mastodon). Anyways, I'm all over the place.\nThere are some fleeting thoughts I want to keep just because. I have my Mastodon profile set to delete after insert amount of time here so I want to keep a copy of it on my site.\nEnter Microthoughts: a summary (copy?) of most of my posts from random places. It could be for people who don't have those platforms to see what I've been posting, but it's also mostly just f…",
          "link": "https://so.axodys.com/inspired-by-micro-thoughts/",
          "publishedOn": "2024-09-30T00:44:00.000Z",
          "wordCount": 918,
          "title": "⚙️ Inspired by Micro Thoughts",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://platinumtulip.bearblog.dev/a-ranking-of-imac-g3-colors/",
          "author": null,
          "description": "bondi blue\n\na classic. delicious Y2K Teal. iconic. gotta love her. 4.5/5.\nblueberry\n\nbarely distinguishable from the original Bondi Blue, but from what i can tell in photos online and in real life, it's a slightly lighter color compared to bondi blue. but because of that, i think it's missing some contrast. i don't like it as much. 3/5\ngrape\n\nunderappreciated one! this color combination makes me think of the Teenz Zone at my library circa 2000. 4/5\ntangerine\n\ntruthfully, my fondness for this one is 99% because of The Cheat's computer. but it's a fun, retrofuturistic color choice, especially with the form factor. on its own i give it a 4.5/5, but it gets elevated to 5/5 because it makes me think of Homestar.\nlime\n\nit's very Nickelodeon Slime Green. i wasn't fond of this one when i first wro…",
          "link": "https://platinumtulip.bearblog.dev/a-ranking-of-imac-g3-colors/",
          "publishedOn": "2024-09-29T22:09:11.448Z",
          "wordCount": 1177,
          "title": "a ranking of iMac G3 colors",
          "imageUrl": "https://files.platinumtulip.net/tulip-icon.png"
        },
        {
          "id": "https://jeddacp.me/an-august-morning/",
          "author": null,
          "description": "Since relaunching JEDDACP.ME a year and a half ago, I’ve been meaning to update the blog's title (formerly known as With Love, Jedda).\nToday, I’m stoked to unveil its new name, inspired by an earlier pseudonym: august morning.\nTo kick it off, here's a photo taken on an august morning.\n\n🎂 Related (Birthday Weekend Series):\nSan Francisco in a Frame\nIncoming Fog Down the PCH",
          "link": "https://jeddacp.me/an-august-morning/",
          "publishedOn": "2024-09-29T19:18:53.771Z",
          "wordCount": 910,
          "title": "An August Morning",
          "imageUrl": "https://live.staticflickr.com/65535/54030321326_c8fdf89f04_b.jpg"
        },
        {
          "id": "https://andout.bearblog.dev/nihil-embracing-digital-minimalism/",
          "author": null,
          "description": "In a world of endless notifications, feature-bloated apps, and constant digital noise, I found myself yearning for simplicity. That's why I created Nihil - a suite of minimalist tools designed to help you focus on what truly matters.\nThe Vision Behind Nihil\nNihil was born out of a personal need. As a developer and a user, I was frustrated with the complexity of many digital tools. I wanted something that would strip away the unnecessary and leave only the essential. Something that would help me think clearer and live more intentionally.\nThat's the core of Nihil's philosophy: less is more. Each tool in the Nihil suite serves a single, specific purpose. No bloat, no distractions - just pure functionality.\n\nWhat Makes Nihil Different?\nPurposeful Design\nEvery feature in Nihil is there because …",
          "link": "https://andout.bearblog.dev/nihil-embracing-digital-minimalism/",
          "publishedOn": "2024-09-29T13:55:00.000Z",
          "wordCount": 1038,
          "title": "Nihil: Embracing Digital Minimalism",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://ninecoffees.blog/lets-do-laundry-together-goodbye-cohost/",
          "author": null,
          "description": "My first time watching Everything, Everywhere, All At Once (EEAAO) was at a friend's house with about ten other Asian immigrants. There's a scene where the male lead, Waymond Wang (Ke Huy Quan), was putting googly eyes all over the lanterns and doing a sneaky shush at the camera before running away.\n\"Oh, that's [deadname],\" said someone. Laughter echoed in the living room.\nEh? That's me?\nI'll admit, when my brain was mostly still concentrated on the movie, pre-transition, still stuck in my \"I have to be a man\" phase, I wondered if that was a snide comment. It's very easy to read it that way because Waymond's character is the opposite of the stereotypical male lead. He is presented as effeminate, weak, and his voice is high-pitched and lacks a full range. As a knee-jerk gut reaction, we foc…",
          "link": "https://ninecoffees.blog/lets-do-laundry-together-goodbye-cohost/",
          "publishedOn": "2024-09-28T14:09:00.000Z",
          "wordCount": 1682,
          "title": "Let's Do Laundry Together (Goodbye Cohost)",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://birming.com/youre-not-me/",
          "author": null,
          "description": "\"If I were you, I would...\"\nDo you sometimes hear that? I think it's such an incredibly stupid thing to say. If you were me, which you clearly aren't, then you would do something that I, as myself, wouldn’t do.\nIt's just a way of expressing oneself, someone might think. I beg to differ.\nMy feeling is that the person who expresses themselves in that way has a lot of their own issues that should be addressed. Instead of doing that, they get a momentary, false sense of \"I got my shit together\" by explaining what others should do.\nDo you want to share your own experiences? Please do, I love listening to that. Do you have specific advice to give? Bring it on, and I'll take what applies to who I am here and now.\nDo you want to explain what's best for me right now? Keep it to yourself, please, and sort out your own shit first. Good luck!\nmail Email\n print Print\n share Share",
          "link": "https://birming.com/youre-not-me/",
          "publishedOn": "2024-09-28T12:24:28.011Z",
          "wordCount": 1832,
          "title": "You're Not Me",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert/img_5725.webp"
        },
        {
          "id": "https://taylordrew.me/hello-new-blog/",
          "author": null,
          "description": "Hello everyone and welcome to my blog!\nThis is a project I've started many times before without a lot of success on several different WordPress sites—all of which no longer exist. The first was a free blog I set up when I first came to Japan in 2015 as a student. I'd seen so many blogs by other exchange students and thought it'd be pretty exciting. The only problem was that I didn't think that anything I was doing was very exciting, so I quickly stopped doing it. I've tried since to make several paid sites that focus on my reading and writing book reviews. There were a lot of problems with that, most of which came down to the fact that I was extremely worried about making the \"perfect\" site even though it was just something that I wanted to do for fun. WordPress has always just also been r…",
          "link": "https://taylordrew.me/hello-new-blog/",
          "publishedOn": "2024-09-28T09:19:00.000Z",
          "wordCount": 857,
          "title": "hello new blog",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://damien.zone/my-online-life-and-cohost/",
          "author": null,
          "description": "This post is mirrored on cohost as well and was written with it in mind. But also not? It's fine, don't worry about it.\nLike many people in my age group, I think it's fair to say that I grew up online.\nthe pre-social media years\nMy \"life online\" really started in the mid-2000s when I joined the forums of Crystal XP. This name probably won't mean anything to you, but if you used Windows XP at the time, you might have seen their \"BricoPacks\". These were 1-click installers that reskinned your entire Windows installation. Their most successful one was the Vista Inspirat one. Pretty wild stuff. Oh, and also CrystalXP was \"responsible\" for that one Tux and its myriad of variations you might see on every other Linux fanboy's profile.\nBut like I said, they had forums. I joined those forums after r…",
          "link": "https://damien.zone/my-online-life-and-cohost/",
          "publishedOn": "2024-09-28T07:00:00.000Z",
          "wordCount": 2965,
          "title": "my online life, and cohost",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/damien/favicon.png"
        },
        {
          "id": "https://tala.bearblog.dev/sometimes-i-wish-depression-was-a-physical-illness-new/",
          "author": null,
          "description": "It's from my experience that people are a lot more sympathetic when they can actually see you hurting. For the millionth time in my life, I wished depression manifested like the flu or some other recognizable disease, just to make it simple for me and for the people around me.\nHow much easier would it be if mental illness were physical - visible and tangible? A runny nose and a sore throat - people would understand. They would offer me tissues, a warm cup of tea, and a sympathetic get well soon. But a shitty compilation of mental symptoms and an even shittier chemical make up? How do I explain an intangible pain?\nWhat can I say, anyway? Sometimes I feel like I am carrying around a heavy suitcase full of sadness everywhere that I go. The smallest task feels impossible. Everything is dull yet heavy, all at once.  Everything matters too much yet nothing matters. Anything would be easier to explain than what's really going on.\nI think this topic further resonates with me as someone with high-functioning depression. I recall an attempt to open up about my state with a close friend, who reacted with amusement and disbelief, as if I was exchanging lighthearted banter. But you are so put together, Tala. You are successful, ace tests, and excel at work - it must be a misdiagnosis.\nI was overwhelmed with shame that later transformed into rage. I found it impossible to articulate the depth of pain - that yes, I am waking up everyday, leaving bed, fulfilling my obligations. But I am still struggling, still fighting a relentless battle with the energy I have left.\nAnd there are millions of us suffering a silent, invisible battle against our mental illnesses, while we present a facade of normalcy to world. Because sometimes silence is the easier option.",
          "link": "https://tala.bearblog.dev/sometimes-i-wish-depression-was-a-physical-illness-new/",
          "publishedOn": "2024-09-27T19:25:00.000Z",
          "wordCount": 762,
          "title": "sometimes i wish depression was a physical illness",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://notes.jeddacp.com/micro-thoughts-explained/",
          "author": null,
          "description": "Earlier this month, I decided to try something different on my blog. Some people caught on since some new older posts appeared on their RSS reader from me. I haven’t gotten a chance to explain it and since it’s nearing the end of the month, and a similar post will be popping up shortly, I figured I’d explain what I’m trying to do.\nIt’s a reverse POSSE of sorts that I’m calling #microthoughts\nBut first to understand what a reverse of something is, we must understand what it is.\nPOSSE is an abbreviation for Publish (on your) Own Site, Syndicate Elsewhere, the practice of posting content on your own site first, then publishing copies or sharing links to third parties (like social media silos) with original post links to provide viewers a path to directly interacting with your content. (source…",
          "link": "https://notes.jeddacp.com/micro-thoughts-explained/",
          "publishedOn": "2024-09-26T23:59:00.000Z",
          "wordCount": 1383,
          "title": "Micro Thoughts - Explained",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda/reverse-posse.png"
        },
        {
          "id": "https://otavio.cc/why-did-we-leave-san-francisco-the-us-actually/",
          "author": null,
          "description": "This story starts a long time ago. My wife had just returned from Canada, had finished her PhD, and I was a Software Designer working for one of the founding companies of Silicon Valley, though I was based in Brazil.\nIn one of those unfortunate coincidences in life, I had the opportunity to relocate to the United States, while scientist was offered a postdoctoral research position in Canada—both at the same time.\nAfter putting all the cards (offers, spreadsheets, etc.) on the table, my wife rejected the offer from the Canadian university, and I accepted the one in the U.S.\nIn Canada, scientist would have had a salary and health insurance, but I wouldn’t. Additionally, I wouldn’t be able to work as her dependent. In the U.S., however, we would both have everything—health insurance, the abil…",
          "link": "https://otavio.cc/why-did-we-leave-san-francisco-the-us-actually/",
          "publishedOn": "2024-09-26T22:24:00.000Z",
          "wordCount": 3660,
          "title": "Why Did We Leave San Francisco (the U.S., Actually)?",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/otaviocc/why-did-we-leave-san-francisco-the-us-actually.jpg"
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/anonymous-haters-cafe-ripples-and-waves?v=1727485961",
          "author": null,
          "description": "Author: Some Communist Study Group\nTitle: Ripples and Waves\nSubtitle: Notes on Ukraine in the Long Crisis\nDate: May 11th, 2022\nSource: Retrieved on 9/27/24 from haters.noblogs.org/post/2022/05/11/ripples-and-waves-notes-on-ukraine-in-the-long-crisis\n\nThis long-form essay was sent to us for publication by “some communist study group“. It discusses the historical role of Ukraine in the contemporary political economy, the response from radicals in the West towards the Russian invasion, and the material effects on the global political economy emanating from the disruption of a major bread basket, specifically with an eye towards revolt. The questions raised here are important not just for the current moment, but also for any social movement that desires to truly engage with “present state of t…",
          "link": "https://theanarchistlibrary.org/library/anonymous-haters-cafe-ripples-and-waves?v=1727485961",
          "publishedOn": "2024-09-28T01:12:41.000Z",
          "wordCount": 18552,
          "title": "Some Communist Study Group - Ripples and Waves",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "69752",
            "url": "https://theanarchistlibrary.org/library/anonymous-haters-cafe-ripples-and-waves.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/alexander-dunlap-book-review-we-are-forests-inhabiting-territories-in-struggle?v=1727332502",
          "author": null,
          "description": "Author: Alexander Dunlap\nTitle: Book Review: “We Are Forests: Inhabiting Territories in Struggle”\nDate: 2024/09/25\nSource: https://undisciplinedenvironments.org/2024/09/25/book-review-we-are-forests-inhabiting-territories-in-struggle-cambridgepolity-2023/\n\n Jean-Baptiste Vidalou, “We Are Forests: Inhabiting Territories in Struggle” (Cambridge: Polity, 2023) \n It’s shameful. The original French publication of We are Forests: Inhabiting Territories in Struggle by Jean-Baptiste Vidalou was in my hands since April 2018. Frequently described as “the French Seeing Like a State,” the book explores the art of state making in France. Having been in stimulating dialogues with Jean-Baptiste Vidalou (JBV) since 2018, and being linguistically challenged, I knew the general ideas and points in the book—…",
          "link": "https://theanarchistlibrary.org/library/alexander-dunlap-book-review-we-are-forests-inhabiting-territories-in-struggle?v=1727332502",
          "publishedOn": "2024-09-26T06:35:02.000Z",
          "wordCount": 2018,
          "title": "Alexander Dunlap - Book Review: “We Are Forests: Inhabiting Territories in Struggle”",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "10686",
            "url": "https://theanarchistlibrary.org/library/alexander-dunlap-book-review-we-are-forests-inhabiting-territories-in-struggle.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}