{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "b3f588f5745d41e324b4aff7dfd2cbe3ae71a674",
          "author": "Channy Yun",
          "description": "The Llama 3.1 models are a collection of 8B, 70B, and 405B parameter size multilingual models that demonstrate state-of-the-art performance on a wide range of industry benchmarks, offering new capabilities for your generative AI applications.",
          "link": "https://aws.amazon.com/blogs/aws/announcing-llama-3-1-405b-70b-and-8b-models-from-meta-in-amazon-bedrock/",
          "publishedOn": "2024-07-23T16:20:18.000Z",
          "wordCount": 2412,
          "title": "Announcing Llama 3.1 405B, 70B, and 8B models from Meta in Amazon Bedrock",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/07/22/Bedrock-models-feat-img.png"
        },
        {
          "id": "3b081c60311072864e5cf1c6d6441da57ae491ca",
          "author": "Donnie Prakoso",
          "description": "Last week, AWS Heroes from around the world gathered to celebrate the 10th anniversary of the AWS Heroes program at Global AWS Heroes Summit. This program recognizes a select group of AWS experts worldwide who go above and beyond in sharing their knowledge and making an impact within developer communities. Matt Garman, CEO of AWS […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-global-aws-heroes-summit-aws-lambda-amazon-redshift-and-more-july-22-2024/",
          "publishedOn": "2024-07-22T17:03:59.000Z",
          "wordCount": 1606,
          "title": "AWS Weekly Roundup: Global AWS Heroes Summit, AWS Lambda, Amazon Redshift, and more (July 22, 2024)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/08/13/AWS-WIR-default.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": [
        {
          "id": "c6ac364a9cbf15333381e44f406fe89ede26cc9d",
          "author": "Vijay Shekhar Rao",
          "description": "This post was co-written with Shyam Narayan, a leader in the Accenture AWS Business Group, and Hui Yee Leong, a DevOps and platform engineer, both based in Australia. Hui and Shyam specialize in designing and implementing complex AWS transformation programs across a wide range of industries. Enterprises that operate out of multiple locations such as […]",
          "link": "https://aws.amazon.com/blogs/architecture/simplify-and-automate-bill-processing-with-amazon-bedrock/",
          "publishedOn": "2024-07-19T15:42:48.000Z",
          "wordCount": 1806,
          "title": "Simplify and automate bill processing with Amazon Bedrock",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fc074d501302eb2b93e2554793fcaf50b3bf7291/2024/07/10/fig1-automate-billing-bedrock-1260x601.png"
        }
      ]
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": []
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/ee13a06f9c78",
          "author": "Netflix Technology Blog",
          "description": "By Jun He, Natallia Dzenisenka, Praneeth Yenugutala, Yingyi Zhang, and Anjali Norwood",
          "link": "https://netflixtechblog.com/maestro-netflixs-workflow-orchestrator-ee13a06f9c78?source=rss----2615bd06b42e---4",
          "publishedOn": "2024-07-22T17:38:23.000Z",
          "wordCount": 9076,
          "title": "Maestro: Netflix’s Workflow Orchestrator",
          "imageUrl": "https://miro.medium.com/v2/da:true/resize:fit:1200/0*d7XTqfPjAkuCBv6C"
        }
      ]
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": []
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=328910",
          "author": "Joan Roelofs",
          "description": "Why has NATO been so generally accepted in Europe by almost all the major political parties and especially puzzling, the social democratic ones? Its economic costs, illegal aggressive wars, environmental damage, and the risks of nuclear annihilation would seem to make it a prime platform item. Well-informed political activists are unlikely to believe that an invasion of Switzerland or Denmark is imminent. There are significant anti-NATO movements, such as No to War No to NATO, but so far they haven’t been able to turn the tide. More\nThe post NATO’s Civilian Bases  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/24/natos-civilian-bases/",
          "publishedOn": "2024-07-24T06:00:52.000Z",
          "wordCount": null,
          "title": "NATO’s Civilian Bases",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329071",
          "author": "Binoy Kampmark",
          "description": "The International Court of Justice has again deliberated over the thorn-bloodied subject of Israeli-Palestinian relations. Its latest advisory opinion, sought by the UN General Assembly early last year, was unremarkably conventional though nonetheless affirming: a finding that Israeli settlements in the West Bank and East Jerusalem, along with “the regime associated with them, have been established and are being  More\nThe post Conventional Wisdom: The ICJ Ruling on Israeli Settlements appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/24/conventional-wisdom-the-icj-ruling-on-israeli-settlements/",
          "publishedOn": "2024-07-24T05:55:43.000Z",
          "wordCount": null,
          "title": "Conventional Wisdom: The ICJ Ruling on Israeli Settlements",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329073",
          "author": "Emma Rae Lierley",
          "description": "Palm oil is one of the most used vegetable oils in the world and is found in a large variety of packaged products, from shampoos and lipstick to cookies and frozen pizza. Unfortunately, the production of palm oil has been linked to severe environmental and social costs, including significant rainforest destruction and human rights abuses, particularly in  More\nThe post Is the Food Industry Concealing Possible Destruction of the Tropics From the Public? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/24/is-the-food-industry-concealing-possible-destruction-of-the-tropics-from-the-public/",
          "publishedOn": "2024-07-24T05:55:37.000Z",
          "wordCount": null,
          "title": "Is the Food Industry Concealing Possible Destruction of the Tropics From the Public?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329066",
          "author": "David Rosen",
          "description": "The Foundation for Individual Rights and Expression (FIRE) filed a petition calling on Pres. Joe Biden to posthumously pardon D.M. Bennett, one of the Comstock Act’s most prominent victims.  Hopefully, we will do this before leaving office. Never heard of Bennett?  Born DeRobigne Mortimer Bennet (1818-1882), in 1873 he founder of The Truth Seeker, a publication he edited until his death.  During its  More\nThe post Mr. President, Pardon the Truth Seeker appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/24/mr-president-pardon-the-truth-seeker/",
          "publishedOn": "2024-07-24T05:55:27.000Z",
          "wordCount": null,
          "title": "Mr. President, Pardon the Truth Seeker",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329065",
          "author": "Lawrence Reichard",
          "description": "We had a service for my mother, Karen Saum, yesterday. She died May 9. She was 89. And she was a fighter. From her birth in 1935 until her senior year of high school my mother lived in the city of Colón, a global melting pot on the Caribbean coast of Panama. Her father was  More\nThe post My Mother Lived and Fought History’s Trenches appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/24/my-mother-lived-and-fought-historys-trenches/",
          "publishedOn": "2024-07-24T05:55:25.000Z",
          "wordCount": null,
          "title": "My Mother Lived and Fought History’s Trenches",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329001",
          "author": "Tom Engelhardt",
          "description": "Well, it’s one, two, three, look at that amputee, At least it’s below the knee, Could have been worse, you see. Well, it’s true your kids look at you differently, But you came in an ambulance instead of a hearse, That’s the phrase of the trade, It could have been worse. — First verse of a  More\nThe post Remembrance of Wars Past appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/24/remembrance-of-wars-past/",
          "publishedOn": "2024-07-24T05:55:06.000Z",
          "wordCount": null,
          "title": "Remembrance of Wars Past",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329069",
          "author": "Eugene Doyle",
          "description": "Hit pause right there. Very few people have tuned into the fact that what is happening isn’t “NATO” moving into our region – it’s actually far bigger than that.  The US is creating a super-bloc, a super-alliance of client states that includes both the EU and NATO, the AP4 (its key Asia Pacific partners Australia,  More\nThe post It’s bigger than NATO and It’s Coming to the Pacific appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/24/its-bigger-than-nato-and-its-coming-to-the-pacific/",
          "publishedOn": "2024-07-24T05:54:04.000Z",
          "wordCount": null,
          "title": "It’s bigger than NATO and It’s Coming to the Pacific",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328830",
          "author": "Sudip Bhattacharya",
          "description": "Toiling as a clinical psychiatrist in the heart of French-controlled Algeria, Frantz Fanon would conclude after several years of work and struggle, “Today the all-out national war of liberation waged by the Algerian people for seven years has become a breeding ground for mental disorders.”[i] At the time, the Algerian people, taking inspiration from their  More\nThe post Frantz Fanon Our Contemporary appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/24/frantz-fanon-our-contemporary/",
          "publishedOn": "2024-07-24T05:50:25.000Z",
          "wordCount": null,
          "title": "Frantz Fanon Our Contemporary",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328824",
          "author": "John Feffer",
          "description": "The conventional Artificial Intelligence doomsday scenario runs like this. A robot acquires sentience and decides for some reason that it wants to rule the world. It hacks into computer systems to shut down everything from banking and hospitals to nuclear power. Or it takes over a factory to produce a million copies of itself to  More\nThe post AI May Kill Us All, But Not the Way You Think appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/24/ai-may-kill-us-all-but-not-the-way-you-think/",
          "publishedOn": "2024-07-24T05:50:02.000Z",
          "wordCount": null,
          "title": "AI May Kill Us All, But Not the Way You Think",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328898",
          "author": "Richard Rhames",
          "description": "I came of age in a simpler time. The Maine mill town of my youth produced textiles, shoes, and lumber. There were dozens of dairy farms, vegetable/ fruit growers, and a poultry operation or two. The union movement, in the aftermath of World War Two had finally penetrated the steely resistance of the local mill  More\nThe post We Live in a Time of Monsters appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/24/we-live-in-a-time-of-monsters/",
          "publishedOn": "2024-07-24T05:45:13.000Z",
          "wordCount": null,
          "title": "We Live in a Time of Monsters",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328993",
          "author": "Sarah Hyden",
          "description": "The National Environmental Policy Act, or NEPA, is the environmental bill of rights for the public, who are the legal owners of our national forests. It’s the framework in which we consider the risks and benefits of forest management projects, and attempt to avoid damaging outcomes or even environmental disasters. In the past, NEPA required  More\nThe post The Infrastructure Act and the Taos Canyon Logging Project:  Time For a Forest Revolution.  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/24/the-infrastructure-act-and-the-taos-canyon-logging-project-time-for-a-forest-revolution/",
          "publishedOn": "2024-07-24T05:36:29.000Z",
          "wordCount": null,
          "title": "The Infrastructure Act and the Taos Canyon Logging Project:  Time For a Forest Revolution.",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329013",
          "author": "Robert Koehler",
          "description": "Every bullet fired into a crowd penetrates the national soul — or so it seems to me, as I continue to grapple emotionally with the Trump-rally shooting in Butler, Pa. on July 13, which left one attendee murdered, several others wounded and the shooter himself dead. As with all such shootings, this goes beyond “motive”  More\nThe post ‘Got Any Tennis Balls?’ appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/24/got-any-tennis-balls/",
          "publishedOn": "2024-07-24T05:35:47.000Z",
          "wordCount": null,
          "title": "‘Got Any Tennis Balls?’",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329017",
          "author": "Cesar Chelala",
          "description": "When last Sunday Lionel Messi left the playing field because of a serious injury in the final match of the Copa América against Colombia (that Argentina won) and soon afterwards began to cry inconsolably, the entire world cried with him. Such is the charisma of a player who is considered by many as the best  More\nThe post Messi Can Also Cry appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/24/messi-can-also-cry/",
          "publishedOn": "2024-07-24T04:49:34.000Z",
          "wordCount": null,
          "title": "Messi Can Also Cry",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329020",
          "author": "CounterPunch News Service",
          "description": "For Immediate Release Contact: Harvey Smith July 23, 2024                                                                                               More\nThe post Farewell, Carol Christ appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/24/farewell-carol-christ/",
          "publishedOn": "2024-07-24T04:24:56.000Z",
          "wordCount": null,
          "title": "Farewell, Carol Christ",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328940",
          "author": "Paul Street",
          "description": "I get it: in order to induce the declining, cognitively crippled Joe Biden to admit that he’s a catastrophic loser bringing down his party and greatly increasing the likelihood of full Republi-fascist takeover in 2025, Democrats have had to kiss the president’s ass. The only way to get Bernie Sanders’ “good friend” “Genocide Joe” Biden to give up his delegates and allow them to go to someone with (perhaps) a better shot at beating Adolph Trump (the man Trump’s 2024 vice presidential running mate JD Vance called “America’s Hitler” in 2016) was to praise the incumbent as “a man of great integrity with a long and noble record of service to America and humanity including his heroic defeat of Trump in the 2020 election.” More\nThe post Three Things Missing from the Big Biden Butt Kiss appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/23/three-things-missing-from-the-big-biden-butt-kiss/",
          "publishedOn": "2024-07-23T06:22:12.000Z",
          "wordCount": null,
          "title": "Three Things Missing from the Big Biden Butt Kiss",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328807",
          "author": "Melvin Goodman",
          "description": "In the mid-1990s, I was a professor of international relations at the National War College and a member of the Brookings Institution’s Russian Study Group that held regular off-the-record discussions of key issues.  This was an important time when the leading subject for the study group was the question of expanding the North Atlantic Treaty Organization (NATO).  The group had rather high level membership from the National Security Council, the Departments of State and Defense, and the intelligence community, particularly CIA and INR, the intelligence arm of State.  These individuals were for the most part supporters of the absurd idea that we had won the Cold War and there was a mood of triumphalism and exceptionalism that was obvious in their support for NATO expansion. More\nThe post NATO Expansion: the Road to Cold War and War Itself appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/23/nato-expansion-the-road-to-cold-war-and-war-itself/",
          "publishedOn": "2024-07-23T06:00:57.000Z",
          "wordCount": null,
          "title": "NATO Expansion: the Road to Cold War and War Itself",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328825",
          "author": "Sonali Kolhatkar",
          "description": "Billionaires have tried very hard to buy influence and political power. For example, former New York City Mayor Mike Bloomberg donated $20 milliontoward efforts to reelect Biden this year alone. Four years ago, Bloomberg spent a whopping $1 billion in just four months in an attempt to be the 2020 Democratic presidential nominee. In a testament to the fact that we have a modicum of democratic accountability left within the system as it stands, he failed spectacularly, as others have often done. Voters seem to have a distaste for electing the ultra-rich but have yet to disavow the de facto proxies that their money helps elect. More\nThe post Who’s a Bigger Threat to Democracy—Immigrants, or Billionaires? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/23/whos-a-bigger-threat-to-democracy-immigrants-or-billionaires/",
          "publishedOn": "2024-07-23T05:59:35.000Z",
          "wordCount": null,
          "title": "Who’s a Bigger Threat to Democracy—Immigrants, or Billionaires?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328809",
          "author": "L. Michael Hager",
          "description": "Israeli Prime Minister Benjamin Netanyahu is due to address a joint session of Congress on July 24. Speaker of the House Mike Johnson took the lead in extending the invitation last March.  With the participation of Senate Majority Leader Chuck Schumer and House Minority Leader Hakeem Jeffries, it soon became a bipartisan invitation. This won't be the first time an Israeli leader has used an address to Congress to strengthen Israel's already powerful relations with America.  In 2015 Netanyahu bypassed the White House to deliver an address that attacked U.S participation in the Iran nuclear deal negotiations.  Although the Prime Minister's visit deeply embarrassed then President Obama, a year later he overlooked the slight to commit $38 billion in arms aid to Israel over ten-years.    More\nThe post Honoring Netanyahu; Dishonoring America appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/23/honoring-netanyahu-dishonoring-america/",
          "publishedOn": "2024-07-23T05:59:10.000Z",
          "wordCount": null,
          "title": "Honoring Netanyahu; Dishonoring America",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328845",
          "author": "Dave Lindorff",
          "description": "Just before sunrise 79 years ago at 5:29 Mountain War Time on July 16, 1945 the Journado del Muerto desert in New Mexico instantly and in total silence flashed as bright as day. As a group of several hundred scientists peered from six miles away at a 100-foot steel tower holding the world’s first atomic bomb, the sky turned brighter than day and the tower and bomb vanished in a brilliant flash of light that erased the stars of the night sky, They were replaced by a fiery turbulent cloud of smoke and dust. A powerful shock wave and the roar of the explosion followed he flash as a mushroom cloud rose 38,000 feet into the stratosphere. More\nThe post 79 Years Ago, the US tested the First Atomic Bomb appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/23/79-years-ago-the-us-tested-the-first-atomic-bomb/",
          "publishedOn": "2024-07-23T05:58:56.000Z",
          "wordCount": null,
          "title": "79 Years Ago, the US tested the First Atomic Bomb",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328897",
          "author": "Richard Falk",
          "description": "There is every reason to be glad that Joe Biden finally acted responsibly by withdrawing his candidacy for a second term. But to call this overdue act ‘brave’ and ‘courageous’ is to rob those precious words of their proper meaning. It is certainly true that Trump repeatedly lies about his achievements and the failings of  More\nThe post An Open Letter to Kamala Harris and the Democratic Party appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/23/an-open-letter-to-kamala-harris-and-the-democratic-party/",
          "publishedOn": "2024-07-23T05:58:39.000Z",
          "wordCount": null,
          "title": "An Open Letter to Kamala Harris and the Democratic Party",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328934",
          "author": "Thomas Knapp",
          "description": "On July 19, users of about 8.5 million Windows users worldwide faced the dreaded “Blue Screen of Death.” As I write this column, many remain down. Microsoft has issued a manual fix for machines that aren’t able to automatically recover, but it’s a black eye for Microsoft and for Crowdstrike, the cybersecurity firm whose fault  More\nThe post Windows/CrowdStrike Outage: The Most Important Lesson appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/23/windows-crowdstrike-outage-the-most-important-lesson/",
          "publishedOn": "2024-07-23T05:55:50.000Z",
          "wordCount": null,
          "title": "Windows/CrowdStrike Outage: The Most Important Lesson",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328929",
          "author": "Jon Hochschartner",
          "description": "I’ve been unsure how animal activists should orient themselves in the coming American presidential election. Obviously, in the United States’ two-party system we should vote for the Democratic nominee. But should we do more than simply cast a ballot for the candidate, whoever that ends up being? I typically argue we should prioritize nonhuman interests  More\nThe post Trump’s Threat to Animals appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/23/trumps-threat-to-animals/",
          "publishedOn": "2024-07-23T05:55:35.000Z",
          "wordCount": null,
          "title": "Trump’s Threat to Animals",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328932",
          "author": "Lawrence Wittner",
          "description": "Over the past decade and more, nuclear war has grown increasingly likely.  Most nuclear arms control and disarmament agreements of the past have been discarded by the nuclear powers or will expire soon.  Moreover, there are no nuclear arms control negotiations underway.  Instead, all nine nuclear nations (Russia, the United States, China, Britain, France, India, Pakistan, Israel, and North Korea)  More\nThe post Trump’s Reckless Infatuation with Nuclear Weapons appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/23/trumps-reckless-infatuation-with-nuclear-weapons/",
          "publishedOn": "2024-07-23T05:55:28.000Z",
          "wordCount": null,
          "title": "Trump’s Reckless Infatuation with Nuclear Weapons",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328968",
          "author": "Evaggelos Vallianatos",
          "description": "President Joe Biden wisely decided not to seek a second term. He blessed his Vice President, Kamala Harris, and he urged the Democratic Party to nominate her for the November election. There may be better Democratic politicians to run for president –like Senator Sheldon Whitehouse of Rhode Island. But the Democratic Party has little time  More\nThe post After Biden appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/23/after-biden/",
          "publishedOn": "2024-07-23T05:53:51.000Z",
          "wordCount": null,
          "title": "After Biden",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328865",
          "author": "Peter Bach",
          "description": "It was fun listening to Spirit again. I am of course talking about the old Randy California-Ed Cassidy band Spirit. In this special instance, their venerable album Spirit of ’76 — in particular, the opening electro-jam medley America, The Beautiful/The Times They Are A-Changing. Listening to it again flashed me back to the magical Inner  More\nThe post Letter from London: Was it that, JD? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/23/letter-from-london-was-it-that-jd/",
          "publishedOn": "2024-07-23T05:50:15.000Z",
          "wordCount": null,
          "title": "Letter from London: Was it that, JD?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328890",
          "author": "Letter of Indigenous Peoples, Peasants, Traditional Communities and Afro-Descendants In Latin America",
          "description": "Alto Turiaçu, July 2024 In the Indigenous territory of Alto Turiaçu, in the Aldeia Ararorenda of the Ka’apor people, in the state of Maranhão, Brazil, from the 9th to the 11th of July, we held our first meeting as indigenous peoples, peasants, traditional communities, quilombolas (descendants of escaped slaves), organizations defending Indigenous rights from different  More\nThe post Our Life Project Against Their Death Project appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/23/our-life-project-against-their-death-project/",
          "publishedOn": "2024-07-23T05:32:35.000Z",
          "wordCount": null,
          "title": "Our Life Project Against Their Death Project",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329016",
          "author": "CounterPunch News Service",
          "description": "For Immediate Release Contact: Harvey Smith July 23, 2024 peoplesparkhxdist@gmail.com, 510-684-0414 Many fluff pieces have been celebrating the tenure of Carol Christ as chancellor of UC Berkeley, particularly extolling her fundraising prowess. However, there is a dark side to her seven years at the helm, chief among them her obsession with People’s Park, which according  More\nThe post Farewell, Carol Christ: Long Live Peoples’ Park appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/23/farewell-carol-christ-long-live-peoples-park/",
          "publishedOn": "2024-07-23T04:03:45.000Z",
          "wordCount": null,
          "title": "Farewell, Carol Christ: Long Live Peoples’ Park",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328674",
          "author": "Vijay Prashad",
          "description": "NATO’s Washington Declaration contains a section that is puzzling. It says that China “has become a decisive enabler of Russia’s war against Ukraine.” The term “decisive enabler” has attracted significant attention within China, where the government immediately condemned NATO’s characterization of the war in Ukraine. China’s Foreign Ministry spokesperson Lin Jian said that NATO’s statement “is ill-motivated and makes no sense.” Shortly after Russian troops entered Ukraine, China’s Wang Wenbin of the Foreign Ministry said that “all countries’ sovereignty and territorial integrity should be respected and upheld.” This is precisely the opposite of cheerleading for the war. More\nThe post NATO Accelerates Its Conflict With China appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/22/nato-accelerates-its-conflict-with-china/",
          "publishedOn": "2024-07-22T06:01:55.000Z",
          "wordCount": null,
          "title": "NATO Accelerates Its Conflict With China",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328751",
          "author": "Binoy Kampmark",
          "description": "Bring out the bon bons, the bubbles, and the praise-filled memoranda for that old alliance.  At the three-quarter century mark of its existence, the North Atlantic Treaty Organisation is showing itself to be a greater nuisance than ever, gossiping, meddling, and dreaming of greater acts of mischief under the umbrella of manufactured insecurity.  It is also being coquettish to certain countries (Ukraine, figures prominently in the wooing stakes) making promises it can never make good. More\nThe post NATO: 75 and Still Threatening appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/22/nato-75-and-still-threatening/",
          "publishedOn": "2024-07-22T06:00:18.000Z",
          "wordCount": null,
          "title": "NATO: 75 and Still Threatening",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328768",
          "author": "Henry Giroux",
          "description": "An ideology of hardness and cruelty runs through American culture like an electric current, sapping the strength of social relations and individual character, moral compassion and collective action. Crimes against humanity now become fodder for video games and the Hollywood disimagination machine.  All of which creates an ecology of cruelty and sadism that promotes a “symbiosis of suffering and spectacle.” More\nThe post Welcome to the Mass Psychology of Violence American Style appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/22/welcome-to-the-mass-psychology-of-violence-american-style/",
          "publishedOn": "2024-07-22T05:59:32.000Z",
          "wordCount": null,
          "title": "Welcome to the Mass Psychology of Violence American Style",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": []
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45490",
          "author": "Lars Syll",
          "description": "from Lars Syll The fallacy of composition basically consists of the false belief that the whole is nothing but the sum of its parts.  In society and in the economy this is arguably not the case. An adequate analysis of society and economy a fortiori can’t proceed by just adding up the acts and decisions of individuals. The whole […]",
          "link": "https://rwer.wordpress.com/2024/07/22/the-teaching-of-economics-captured-by-a-small-and-dangerous-sect/",
          "publishedOn": "2024-07-22T19:44:47.000Z",
          "wordCount": 4658,
          "title": "The teaching of economics — captured by a small and dangerous sect",
          "imageUrl": "https://larspsyll.wordpress.com/wp-content/uploads/2014/02/dept_of_econ_fac_pic.jpg?w=539&h=404"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45483",
          "author": "Editor",
          "description": "from Asad Zaman and WEA Pedagogy Blog In this sequence of posts, I will present the contents of the video podcast entitled “Michael Hudson: Why the US has a unique place in the history of imperialism? ” For me, Hudson’s book Super Imperialism: The Economic Strategy of the American Empire was an amazing eye-opener, essential reading […]",
          "link": "https://rwer.wordpress.com/2024/07/18/hudson-on-super-imperialism-1/",
          "publishedOn": "2024-07-18T17:22:07.000Z",
          "wordCount": 5051,
          "title": "Hudson on Super Imperialism 1",
          "imageUrl": "http://img.youtube.com/vi/K9nbj4X556A/0.jpg"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=275546",
          "author": "Lambert Strether",
          "description": "Our brain-tingling daily links",
          "link": "https://www.nakedcapitalism.com/2024/07/links-7-24-2024.html",
          "publishedOn": "2024-07-24T10:58:35.000Z",
          "wordCount": 7153,
          "title": "Links 7/24/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/cockatoo.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275553",
          "author": "Conor Gallagher",
          "description": "Will Euro defense bonds be the answer?",
          "link": "https://www.nakedcapitalism.com/2024/07/more-guns-less-butter-how-will-the-eu-wed-austerity-to-militarization.html",
          "publishedOn": "2024-07-24T10:00:52.000Z",
          "wordCount": 6124,
          "title": "More Guns, Less Butter: How Will the EU Wed Austerity to Militarization?",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/Screenshot-2024-07-24-at-11.04.37 AM-1024x918.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275545",
          "author": "Yves Smith",
          "description": "A recent report from Pitchbook commits data crimes in attempting to depict private equity management of healthcare companies as benign.",
          "link": "https://www.nakedcapitalism.com/2024/07/pitchbook-report-attempting-to-defend-private-equity-role-in-healthcare-suffers-from-fundamental-fatal-analytical-flaw.html",
          "publishedOn": "2024-07-24T09:59:15.000Z",
          "wordCount": 3630,
          "title": "Pitchbook Report Attempting to Defend Private Equity Role in Healthcare Suffers from Fundamental, Fatal Analytical Flaw",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275564",
          "author": "Yves Smith",
          "description": "The FTC targets surveillance pricing, which is privacy-risking data harvesting used to charge higher prices.",
          "link": "https://www.nakedcapitalism.com/2024/07/woah-ftc-applauded-for-launching-inquiry-into-surveillance-pricing.html",
          "publishedOn": "2024-07-24T09:29:22.000Z",
          "wordCount": 3906,
          "title": "‘Woah!’: FTC Applauded for Launching Inquiry Into Surveillance Pricing",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275520",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics; Pelosi and the Twenty Fifth Amendment; Kamala's rollout; establishment voices at the Atlantic; Boeing cluster continues ~",
          "link": "https://www.nakedcapitalism.com/2024/07/200pm-water-cooler-7-23-2024.html",
          "publishedOn": "2024-07-23T18:00:24.000Z",
          "wordCount": 14563,
          "title": "2:00PM Water Cooler 7/23/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/rcp_2024-07-19.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275515",
          "author": "Yves Smith",
          "description": "Communities ravaged by neoliberal capitalism want real change. Candidates like Biden make Trump look more able to deliver it.",
          "link": "https://www.nakedcapitalism.com/2024/07/us-voters-want-change-bidens-exit-hasnt-fixed-that.html",
          "publishedOn": "2024-07-23T14:22:03.000Z",
          "wordCount": 16833,
          "title": "US Voters Want Change, Biden’s Exit Hasn’t Fixed That",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275387",
          "author": "Yves Smith",
          "description": "Our trumpeting daily links: sharks! perma flu vaccine? Covid as cancer accelerant, white paint climate change remediation, China bad bank support, NKorea trash balloons, Bangladesh riots, polio in Gaza, US-Russia plane skirmishes, Turkiye Cyprus saber rattling, Biden parial exit, Kamala doubts, Crowdstrike, billionaire CA city withdrawn",
          "link": "https://www.nakedcapitalism.com/2024/07/links-7-23-2024.html",
          "publishedOn": "2024-07-23T10:55:07.000Z",
          "wordCount": 21232,
          "title": "Links 7/23/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/00-poms.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275490",
          "author": "Yves Smith",
          "description": "As you were transfixed by the Biden, Harris and Trump show, the Middle East conflict is escalating, with Hezbollah launching new attacks.",
          "link": "https://www.nakedcapitalism.com/2024/07/middle-east-heating-up-increased-hezbollah-houthi-attacks-on-israel-after-israel-strike-on-yemen-port.html",
          "publishedOn": "2024-07-23T10:54:05.000Z",
          "wordCount": 5989,
          "title": "Middle East Heating Up: Increased Hezbollah, Houthi Attacks on Israel after Israel Strike on Yemen Port,",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/Screen-Shot-2024-07-23-at-7.11.06-PM.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275427",
          "author": "Nick Corbishley",
          "description": "The mainstream media has, until now, played a crucial role in advancing the Global War on Cash -- a war that began with no official declaration but in which propaganda, as with all wars, is a vital weapon.",
          "link": "https://www.nakedcapitalism.com/2024/07/in-historic-u-turn-corporate-media-begins-warning-of-perils-of-cashless-society-after-global-it-outage.html",
          "publishedOn": "2024-07-23T10:45:40.000Z",
          "wordCount": 7054,
          "title": "In Major Shift, British Newspapers Begin Warning of Perils of Cashless Society After Global IT Outage",
          "imageUrl": "https://pbs.twimg.com/media/GS7VIz2W0AAAyOd?format=png&name=small"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275484",
          "author": "Yves Smith",
          "description": "More evidence that US drug price curbs are unlikely to be harming pharmaceutical innovation",
          "link": "https://www.nakedcapitalism.com/2024/07/crying-wolf-why-negotiating-lower-drug-prices-will-not-harm-pharmaceutical-innovation.html",
          "publishedOn": "2024-07-23T09:24:58.000Z",
          "wordCount": 4031,
          "title": "Crying Wolf: Why Negotiating Lower Drug Prices Will Not Harm Pharmaceutical Innovation",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "669fb2b358eb3b000a368f3a",
          "author": "Michelle Chen",
          "description": "Cloudflare is excited to be a launch partner with Meta to introduce Workers AI support for Llama 3.1",
          "link": "https://blog.cloudflare.com/meta-llama-3-1-available-on-workers-ai",
          "publishedOn": "2024-07-23T15:15:55.000Z",
          "wordCount": 1084,
          "title": "Meta Llama 3.1 now available on Workers AI",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/Meta-Llama-3.1-now-available-on-Workers-AI-OG-1.png"
        },
        {
          "id": "669e3bbb58eb3b000a368bbf",
          "author": "João Tomé",
          "description": "As the Paris 2024 Olympics approach, our analysis reveals France, the host nation, leads in DNS traffic to official Olympic sites, followed by the UK, the US, and Australia",
          "link": "https://blog.cloudflare.com/countdown-to-paris-2024-france-leads-in-olympic-web-interest",
          "publishedOn": "2024-07-22T14:41:52.000Z",
          "wordCount": 1653,
          "title": "Countdown to Paris 2024 Olympics: France leads in web interest",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/Countdown-to-Paris-2024--France-leads-in-Olympic-web-interest--OG-3.png"
        },
        {
          "id": "669a608f58eb3b000a368a2e",
          "author": "João Tomé",
          "description": "This week, the Republican National Convention was hosted in Milwaukee, Wisconsin from July 15 to 18, 2024. We examined traffic shifts and cyberattacks since June 2024 to see how these events have impacted the Internet",
          "link": "https://blog.cloudflare.com/exploring-internet-traffic-during-the-2024-us-republican-national-convention",
          "publishedOn": "2024-07-19T15:07:04.000Z",
          "wordCount": 1401,
          "title": "Exploring Internet traffic during the 2024 U.S. Republican National Convention",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/Exploring-Internet-traffic-during-the-2024-U.S.-Republican-National-Convention-OG-1.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": [
        {
          "id": "https://kubernetes.io/blog/2024/07/19/kubernetes-1-31-upcoming-changes/",
          "author": null,
          "description": "As Kubernetes develops and matures, features may be deprecated, removed, or replaced with better ones for the project's overall health.\nThis article outlines some planned changes for the Kubernetes v1.31 release that the release team feels you should be aware of for the continued maintenance of your Kubernetes environment.\nThe information listed below is based on the current status of the v1.31 release.\nIt may change before the actual release date.\nThe Kubernetes API removal and deprecation process\nThe Kubernetes project has a well-documented deprecation policy for features.\nThis policy states that stable APIs may only be deprecated when a newer, stable version of that API is available and that APIs have a minimum lifetime for each stability level.\nA deprecated API has been marked for remo…",
          "link": "https://kubernetes.io/blog/2024/07/19/kubernetes-1-31-upcoming-changes/",
          "publishedOn": "2024-07-19T00:00:00.000Z",
          "wordCount": 4873,
          "title": "Kubernetes Removals and Major Changes In v1.31",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=21495",
          "author": null,
          "description": "What happens when a team of mechanical engineers get tired of looking at flat images of 3D models over Zoom? Meet the team behind Caddy, a new CAD app for mixed reality. They join Pascal Hartig (@passy) on the Meta Tech Podcast to talk about teaching themselves to code, disrupting the CAD software space, how [...]\nRead More...\nThe post Meet Caddy – Meta’s next-gen mixed reality CAD software appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/07/18/virtual-reality/caddy-cad-mixed-reality-mr-meta/",
          "publishedOn": "2024-07-18T13:00:26.000Z",
          "wordCount": 1590,
          "title": "Meet Caddy – Meta’s next-gen mixed reality CAD software",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/07/Meta-Tech-Podcast-Caddy.webp"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=41052152",
          "author": "oceanplexian",
          "description": "I opted out at Boston International Airport. It involved arguing with the TSA for about 5 minutes while holding up a 150 person line. Then the supervisor came over, told me that I \"was required to have to have my photo taken\" and opting out consisted of checking a box in the software to not save my photo. My alternative was to not get on the flight.\nThe whole idea of opting out is a scam. They are 100% planning to force mandatory facial recognition on the general public.",
          "link": "https://news.ycombinator.com/item?id=41052152",
          "publishedOn": "2024-07-23T23:34:11.000Z",
          "wordCount": null,
          "title": "New comment by oceanplexian in \"You can opt out of airport face scans\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41047467",
          "author": "cs702",
          "description": "> We’re releasing Llama 3.1 405B, the first frontier-level open source AI model, as well as new and improved Llama 3.1 70B and 8B models.\nBravo! While I don't agree with Zuck's views and actions on many fronts, on this occasion I think he and the AI folks at Meta deserve our praise and gratitude. With this release, they have brought the cost of pretraining a frontier 400B+ parameter model to ZERO for pretty much everyone -- well, everyone except Meta's key competitors.[a] THANK YOU ZUCK.\nMeanwhile, the business-minded people at Meta surely won't mind if the release of these frontier models to the public happens to completely mess up the AI plans of competitors like OpenAI/Microsoft, Google, Anthropic, etc. Come to think of it, the negative impact on such competitors was likely a key motivation for releasing the new models.\n---\n[a] The license is not open to the handful of companies worldwide which have more than 700M users.",
          "link": "https://news.ycombinator.com/item?id=41047467",
          "publishedOn": "2024-07-23T15:59:29.000Z",
          "wordCount": 5984,
          "title": "New comment by cs702 in \"Open source AI is the path forward\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41047141",
          "author": "the8thbit",
          "description": "\"Eventually though, open source Linux gained popularity – initially because it allowed developers to modify its code however they wanted ...\"\nI find the language around \"open source AI\" to be confusing. With \"open source\" there's usually \"source\" to open, right? As in, there is human legible code that can be read and modified by the user? If so, then how can current ML models be open source? They're very large matrices that are, for the most part, inscrutable to the user. They seem akin to binaries, which, yes, can be modified by the user, but are extremely obscured to the user, and require enormous effort to understand and effectively modify.\n\"Open source\" code is not just code that isn't executed remotely over an API, and it seems like maybe its being conflated with that here?",
          "link": "https://news.ycombinator.com/item?id=41047141",
          "publishedOn": "2024-07-23T15:37:01.000Z",
          "wordCount": 16566,
          "title": "New comment by the8thbit in \"Open source AI is the path forward\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41047116",
          "author": "JumpCrisscross",
          "description": "“The Heavy Press Program was a Cold War-era program of the United States Air Force to build the largest forging presses and extrusion presses in the world.” This ”program began in 1944 and concluded in 1957 after construction of four forging presses and six extruders, at an overall cost of $279 million. Six of them are still in operation today, manufacturing structural parts for military and commercial aircraft” [1].\n$279mm in 1957 dollars is about $3.2bn today [2]. A public cluster of GPUs provided for free to American universities, companies and non-profits might not be a bad idea.\n[1] https://en.m.wikipedia.org/wiki/Heavy_Press_Program\n[2] https://data.bls.gov/cgi-bin/cpicalc.pl?cost1=279&year1=1957...",
          "link": "https://news.ycombinator.com/item?id=41047116",
          "publishedOn": "2024-07-23T15:35:23.000Z",
          "wordCount": 7496,
          "title": "New comment by JumpCrisscross in \"Open source AI is the path forward\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41046892",
          "author": "Rinzler89",
          "description": "> instead of learning how to start and run a business\nBecause the stress and risks of running a small business as a solo inexperienced first time business owner are insane compared to a regular 9-5.\nEspecially if you start hiring other people, your liability then  increases 10 fold as now anything can happen with them (sick leave, absenteism, low performance, sabotage, etc) but you're still bound to the same deadlines you agreed with your customers or you'll get sued for damages by them.\nAs an employee you have some basic rights and protections from the state on the limits your employer can squeeze from you, more or less, depending on where you live. As a contractor or company however, you don't, and can be fully liable in court for your failures to deliver regardless of your personal circumstances. Unless you know what you're getting into and have the know-how, experience, or mentorship, it's not worth it in most cases.",
          "link": "https://news.ycombinator.com/item?id=41046892",
          "publishedOn": "2024-07-23T15:19:26.000Z",
          "wordCount": null,
          "title": "New comment by Rinzler89 in \"Ask HN: Is it possible to make FAANG salaries without working there?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41039276",
          "author": "karaterobot",
          "description": "> As a designer, I feel the need to be original. If you’re a designer, or even if you’re just interested in design, you probably feel the need to be original, too.\nI've been a professional designer since 2006, and I got over that thinking pretty quickly. A designer trying to be strikingly original is rarely acting in service of the design. If you want to be strikingly original, you probably want to be an artist instead of a designer. What a designer fundamentally does is communicate the best solution to a problem, given the requirements, goals, and constraints of that problem. Originality is subordinate to that at best.",
          "link": "https://news.ycombinator.com/item?id=41039276",
          "publishedOn": "2024-07-22T20:11:39.000Z",
          "wordCount": null,
          "title": "New comment by karaterobot in \"Copying is the way design works\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41037900",
          "author": "bko",
          "description": "Why is the goal to get people to quit their jobs and get a nice apartment?\nIsn't it supposed to be a minimum base level of support? Why do we keep moving the goal posts?\nAnd if everyone quits their job and lives in a nice apartment, where is this money going to come from? The problem with welfare today is that its a disincentive to work. Start working, you lose your transfer payments. A lot of people are stuck in this trap and don't want to start working, forsaking valuable on the job training and socialization that will hurt them in the long run. That's where universal part comes in",
          "link": "https://news.ycombinator.com/item?id=41037900",
          "publishedOn": "2024-07-22T18:28:40.000Z",
          "wordCount": 12954,
          "title": "New comment by bko in \"Unconditional Cash Study: first findings available\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41033091",
          "author": "barnabee",
          "description": "Spending it on other projects is a bad idea:\n- it'd be distracting, they're open source devs/maintainers not fund managers\n- it could be divisive and they'd risk taking flak if they get it \"wrong\"\n- it creates a class of \"approved\" clients and related projects\nI think the Jellyfin team's approach is pretty reasonable.\nThat said, if I was them I'd probably do what the Helix devs do [0] and rather than telling people to stop donating, remind them that donations are a \"tip\" to the project and shouldn't be assumed to be buying you anything or paying to ramp up development (or marketing or anything else). I really appreciate that stance and their attitude that it's great to have the money and they'll spend it if and when they need it, while also encouraging people to consider donating elsewhere if they want to have a bigger impact.\n[0] https://github.com/helix-editor/helix/issues/2220",
          "link": "https://news.ycombinator.com/item?id=41033091",
          "publishedOn": "2024-07-22T11:14:22.000Z",
          "wordCount": null,
          "title": "New comment by barnabee in \"Jellyfin: We're Good, Seriously\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41021105",
          "author": "noduerme",
          "description": "> various European nations [...] some immigrant groups\nAmerican Jew here, who spent years living in France and Spain. I've heard the same polite euphemisms refering to Arabs and Gypsies from the mouths of members of the Front National. You know, before 1945 it was said in Europe that Jews weren't able to integrate fully with the host society.\nOne might ask: Was that the Jews' fault? Or the host society's fault?\nIt's a relevant question. You are blaming it on the particular group of migrants involved in the case of Europe right now. But historically Europe has ghettoized other groups.\nWhen the US ghettoized Chinese economic migrants, American politicians claimed they could never integrate. And yet the Chinese-American population is well integrated and hugely successful since the host society allowed it. Same with Jews in America, and increasingly with Hispanics.\nWhy is it that economic migrants do, after a few generations, become successfully integrated in America, while they tend not to in Europe?\nI don't think the evidence definitively supports the conclusion that it's down to which group. Europe has a problem with integration that has its roots in the ethnic character of its states (something America does not have), in deep-seated xenophobia that causes social exclusion of immigrant or out-groups, and in the fact that its states' reasons for existence are based on tribal boundaries and wars for territory rather than on achieving broader democratic and economic flourishing by harnessing the capability of the whole population. And thus Europe presents neither a dream of integration nor a path toward integration (as in, \"to become American\"; there is neither an equivalent aspiration nor option \"to become French\"). And then, once again, Europe blames the groups it refuses to accept.",
          "link": "https://news.ycombinator.com/item?id=41021105",
          "publishedOn": "2024-07-20T23:38:54.000Z",
          "wordCount": 18413,
          "title": "New comment by noduerme in \"10% of Cubans left Cuba between 2022 and 2023\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41020287",
          "author": "gottorf",
          "description": "> I'm not concerned about the crime\nYou may not be concerned about the crime, but many voters are. The author of the article you linked to also exhorts the Somali immigrant community to not engage in crime.\n> because that seems like a somewhat higher tendency until the 2nd and 3rd generation is able to make it into established society.\nHistory and data from various European nations suggest that some immigrant groups aren't able to integrate with the host society after multiple generations, and remain ghettoized with low employment and high crime rates (vastly higher than the native population, for certain categories of crime).\nIt's clear that the national interest is in accepting skilled immigrants who migrate legally and are able to integrate fully into the host society, a la Teddy Roosevelt's dropping of the hyphen. It is not desirable to have separate ethnic groups who \"share the same language, culture and faith\" distinct from the mainstream.",
          "link": "https://news.ycombinator.com/item?id=41020287",
          "publishedOn": "2024-07-20T21:49:55.000Z",
          "wordCount": null,
          "title": "New comment by gottorf in \"10% of Cubans left Cuba between 2022 and 2023\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41016892",
          "author": "ent101",
          "description": "When we released our open-source project[1], this hacker (Eva) pentested our project pretty extensively and was very professional in their disclosures. They didn't even ask for a bounty since we didn't have a program back then!\nEva is an incredibly gifted hacker and a responsible one, a16z should treat them better.\n[1]: https://github.com/heyPuter/puter/",
          "link": "https://news.ycombinator.com/item?id=41016892",
          "publishedOn": "2024-07-20T14:53:21.000Z",
          "wordCount": null,
          "title": "New comment by ent101 in \"Researcher finds flaw in a16z website that exposed some company data\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41012615",
          "author": "thinkcontext",
          "description": "Better satellites and other aerial survey data has determined that oil and gas  related methane emissions are far, far higher than industry reports.  Everywhere independent researchers look along the production, transmission, distribution and end use pipeline they find more leakage than has been assumed because industry has provided the numbers the assumptions are based on for years.\nAlong some particularly leaky production paths methane emissions are so great that the impact is greater than coal over 100 year timescale.  For example, some parts of NM Permian have a 9% (!) leakage rate.  When combusted methane releases about half the amount of CO2 that coal does.  The eGHG potential of methane is 20x CO2 over 100 year timescale, so you have to add 180% to the total GHG potential, making it 40% worse than coal w/o even considering other leakage along the pipeline.\nhttps://sustainability.stanford.edu/news/methane-leaks-are-f...",
          "link": "https://news.ycombinator.com/item?id=41012615",
          "publishedOn": "2024-07-19T23:39:08.000Z",
          "wordCount": null,
          "title": "New comment by thinkcontext in \"Multisatellite data depicts a record-breaking methane leak from a well blowout\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41008579",
          "author": "1024core",
          "description": "Read on Mastodon: https://infosec.exchange/@littlealex/112813425122476301\nThe CEO of Crowdstrike, George Kurtz, was the CTO of McAfee back in 2010 when it sent out a bad update and caused similar issues worldwide.\nIf at first you don't succeed, .... ;-)  j/k",
          "link": "https://news.ycombinator.com/item?id=41008579",
          "publishedOn": "2024-07-19T17:04:56.000Z",
          "wordCount": null,
          "title": "New comment by 1024core in \"CrowdStrike Update: Windows Bluescreen and Boot Loops\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41008128",
          "author": "hackerlytest",
          "description": "Some context: Students are protesting to reform the quota system. Which was abolished in 2018 after protest but recently brought back again. The Quota system basically reserves 56% of public sector jobs, i.e. 30% to relatives of war veteran.\nThe war happened in 1971. To get public job and avail the quota, it must be their 3rd or 4th generation now. Which is plain unfair.\nBut it’s not about that, the gov loyalists and their goons fake these veteran certificates to land these jobs. Bangladesh is one of the most corrupted countries in the world after all. So real veteran relatives are seldom the beneficiary.\nThese students just wanted to reform this system. But our fascist gov and their goons used force and killed 50+ unarmed students until yesterday (3 from my alma mater alone.) This was completely unprovoked and unnecessary. Basically any forms of dissent have been dealt with this way since 2009. No one can criticize or protest the big brother.\nWe have a dictatorship since 2009. People are angry - due to corruption, inflation, joblessness and tyranny. This is just some outburst of it.\nWhen you see the videos how the police are killing teenagers and university students in the road - our future generation - no one can tolerate this.\nNow the fascist gov has closed all internet and phone connection to outside world. I can't contact my family anymore. I don't know their well being.\nThere is of course more to it. But this is the summary.",
          "link": "https://news.ycombinator.com/item?id=41008128",
          "publishedOn": "2024-07-19T16:26:22.000Z",
          "wordCount": null,
          "title": "New comment by hackerlytest in \"Bangladesh imposes curfew after dozens killed in anti-government protests\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41008009",
          "author": "nimbius",
          "description": "I work for a diesel truck repair facility and just locked up the doors after a 40 minute day :( .\n- lifts wont operate.\n- cant disarm the building alarms. (have been blaring \nnonstop...)\n- cranes are all locked in standby/return/err.\n- laser aligners are all offline.\n- lathe hardware runs but controllers are all down.\n- cant email suppliers.\n- phones are all down.\n- HVAC is also down for some reason (its getting hot in \nhere.)\nthe police drove by and told us to close up for the day since we dont have 911 either.\nalarms for the building are all offline/error so we chained things as best we could (might drive by a few times today.)\nwe dont know how many orders we have, we dont even know whos on schedule or if we will get paid.",
          "link": "https://news.ycombinator.com/item?id=41008009",
          "publishedOn": "2024-07-19T16:16:35.000Z",
          "wordCount": null,
          "title": "New comment by nimbius in \"CrowdStrike Update: Windows Bluescreen and Boot Loops\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41007974",
          "author": "tbatchelli",
          "description": "This event is predicted in Sydney Dekker’s book “Drift into Failure”, which basically postulates that in order to prevent local failure we setup failure prevention systems that increase the complexity beyond our ability to handle, and introduce systemic failures that are global. It’s a sobering book to read if you ever thought we could make systems fault tolerant.",
          "link": "https://news.ycombinator.com/item?id=41007974",
          "publishedOn": "2024-07-19T16:13:29.000Z",
          "wordCount": 3120,
          "title": "New comment by tbatchelli in \"CrowdStrike Update: Windows Bluescreen and Boot Loops\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41007836",
          "author": "bonestamp2",
          "description": "> without even the most basic level of qualification\nThat was my first thought too. Our company does firmware updates to hundreds of thousands of devices every month and those updates always go through 3 rounds of internal testing, then to a couple dozen real world users who we have a close relationship with (and we supply them with spare hardware that is not on the early update path in case there is a problem with an early rollout). Then the update goes to a small subset of users who opt in to those updates, then they get rolled out in batches to the regular users in case we still somehow missed something along the way. Nothing has ever gotten past our two dozen real world users.",
          "link": "https://news.ycombinator.com/item?id=41007836",
          "publishedOn": "2024-07-19T16:02:37.000Z",
          "wordCount": null,
          "title": "New comment by bonestamp2 in \"CrowdStrike Update: Windows Bluescreen and Boot Loops\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41007570",
          "author": "steelframe",
          "description": "Wow, this hits close to home. Doing a page fault where you can't in the kernel is exactly what I did with my very first patch I submitted after I joined the Microsoft BitLocker team in 2009. I added a check on the driver initialization path and didn't annotate the code as non-paged because frankly I didn't know at the time that the Windows kernel was paged. All my kernel development experience up to that point was with Linux, which isn't paged.\nBitLocker is a storage driver, so that code turned into a circular dependency. The attempt to page in the code resulted a call to that not-yet-paged-in code.\nThe reason I didn't catch it with local testing was because I never tried rebooting with BitLocker enabled on my dev box when I was working on that code. For everyone on the team that did have BitLocker enabled they got the BSOD when they rebooted. Even then the \"blast radius\" was only the BitLocker team with about 8 devs, since local changes were qualified at the team level before they were merged up the chain.\nThe controls in place not only protected Windows more generally, but they even protected the majority of the Windows development group. It blows my mind that a kernel driver with the level of proliferation in industry could make it out the door apparently without even the most basic level of qualification.",
          "link": "https://news.ycombinator.com/item?id=41007570",
          "publishedOn": "2024-07-19T15:39:17.000Z",
          "wordCount": null,
          "title": "New comment by steelframe in \"CrowdStrike Update: Windows Bluescreen and Boot Loops\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41007558",
          "author": "casey2",
          "description": "Isn't Crowdstrike the same company the heavily lobbied to get make all their features a requirement for government computers?\nhttps://www.opensecrets.org/federal-lobbying/clients/summary...\nThey have plenty of money for congress, but it seem little for any kind of reasonable software development practices. This isn't the first time crowdstrike has pushed system breaking changes.",
          "link": "https://news.ycombinator.com/item?id=41007558",
          "publishedOn": "2024-07-19T15:38:25.000Z",
          "wordCount": null,
          "title": "New comment by casey2 in \"CrowdStrike Update: Windows Bluescreen and Boot Loops\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41006660",
          "author": "dvektor",
          "description": "I remember when I first went to jail in 2013, every month paying for a $20 phone card and getting to make a 25 minute \"long-distance\" call. I couldn't believe that this was legal, and even if it was, I was in disbelief that morally, this was allowed to go on.\nThere are so many other similarities in corrections that my family and I would unfortunately go on to discover over the years, things that until you experience them firsthand, either by yourself or a loved one being incarcerated, that you likely wouldn't believe.",
          "link": "https://news.ycombinator.com/item?id=41006660",
          "publishedOn": "2024-07-19T13:57:39.000Z",
          "wordCount": null,
          "title": "New comment by dvektor in \"FCC votes to limit prison telecom charges\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41006412",
          "author": "frob",
          "description": "Florida is a special version of horrible when it comes to treatment of incarcerated and formerly incarcerated people. The citizens of Florida overwhelmingly voted to restore voting rights to people who had completed their sentence. Ron DeSantis and the Republicans modified the law to prevent people from voting if they hadn't paid all of their fees, which there is no central tracking or source of. They then went on to arrest Black citizens who tried to register to vote after their PO had told them they owed no money and were clear to vote.",
          "link": "https://news.ycombinator.com/item?id=41006412",
          "publishedOn": "2024-07-19T13:34:56.000Z",
          "wordCount": null,
          "title": "New comment by frob in \"FCC votes to limit prison telecom charges\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41006307",
          "author": "notaustinpowers",
          "description": "It's absolutely grotesque to me.\nFlorida charges their inmates $50/day as a \"bed fee\" that they must pay when they are released. If you were found guilty and sentenced to 5 years in prison, but were released after 1 month because your charge was overturned, you still have to pay the fee for the full 5 years you would have been there.\nIt makes me ashamed to be an American.",
          "link": "https://news.ycombinator.com/item?id=41006307",
          "publishedOn": "2024-07-19T13:24:38.000Z",
          "wordCount": null,
          "title": "New comment by notaustinpowers in \"FCC votes to limit prison telecom charges\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41005936",
          "author": "JackC",
          "description": "Crowdstrike did this to our production linux fleet back on April 19th, and I've been dying to rant about it.\nThe short version was: we're a civic tech lab, so we have a bunch of different production websites made at different times on different infrastructure. We run Crowdstrike provided by our enterprise. Crowdstrike pushed an update on a Friday evening that was incompatible with up-to-date Debian stable. So we patched Debian as usual, everything was fine for a week, and then all of our servers across multiple websites and cloud hosts simultaneously hard crashed and refused to boot.\nWhen we connected one of the disks to a new machine and checked the logs, Crowdstrike looked like a culprit, so we manually deleted it, the machine booted, tried reinstalling it and the machine immediately crashes again. OK, let's file a support ticket and get an engineer on the line.\nCrowdstrike took a day to respond, and then asked for a bunch more proof (beyond the above) that it was their fault. They acknowledged the bug a day later, and weeks later had a root cause analysis that they didn't cover our scenario (Debian stable running version n-1, I think, which is a supported configuration) in their test matrix. In our own post mortem there was no real ability to prevent the same thing from happening again -- \"we push software to your machines any time we want, whether or not it's urgent, without testing it\" seems to be core to the model, particularly if you're a small IT part of a large enterprise. What they're selling to the enterprise is exactly that they'll do that.",
          "link": "https://news.ycombinator.com/item?id=41005936",
          "publishedOn": "2024-07-19T12:46:00.000Z",
          "wordCount": 3343,
          "title": "New comment by JackC in \"CrowdStrike Update: Windows Bluescreen and Boot Loops\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41005738",
          "author": "miki123211",
          "description": "1. The government decides that prisoners can make phone calls, but they can only use a single prison-approved phone operator, and that operator is a private company.\n2. The private company realizes it has no competition, raises prices as much as it wants.\n3. The government is surprised with the outcome.\nI would say the government is at fault here for prohibiting competition, not the companies.\nIt's the 21st century, you could establish a system where any company, with an appropriate license and government approval, could offer tablets / cell phones for prisoner use, with appropriate limitations and restrictions placed on them of course. Prisoners could then choose which company they want to go with. That would instantly eliminate the problem.",
          "link": "https://news.ycombinator.com/item?id=41005738",
          "publishedOn": "2024-07-19T12:29:20.000Z",
          "wordCount": null,
          "title": "New comment by miki123211 in \"FCC votes to limit prison telecom charges\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41005386",
          "author": "jmmcd",
          "description": "They love saying things like \"generative AI doesn't know physics\". But the constraint that both eyes should have consistent reflection patterns is just another statistical regularity that appears in real photographs. Better training, larger models, and larger datasets, will lead to models that capture this statistical regularity. So this \"one weird trick\" will disappear without any special measures.",
          "link": "https://news.ycombinator.com/item?id=41005386",
          "publishedOn": "2024-07-19T11:55:59.000Z",
          "wordCount": null,
          "title": "New comment by jmmcd in \"Want to spot a deepfake? Look for the stars in their eyes\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41005151",
          "author": "eitland",
          "description": "Some Canonical guy I think many years ago mentioned this as their sales strategy a few year ago after a particularly nasty Windows outage:\nWe don't ask customers to switch all systems from Windows to Ubuntu, but to consider moving maybe a third to Ubuntu so they won't sit completely helpless next time Windows fail spectacularly.\nWhile I see more and more Ubuntu systems, and recently have even spotted Landscape in the wild I don't think they were as successful as they hoped with that strategy.\nThat said, maybe there is a silver lining on todays clouds both WRT Ubuntu and Linux in general, and also WRT IT departments stopping to reconsider some security best practices.",
          "link": "https://news.ycombinator.com/item?id=41005151",
          "publishedOn": "2024-07-19T11:29:52.000Z",
          "wordCount": null,
          "title": "New comment by eitland in \"CrowdStrike Update: Windows Bluescreen and Boot Loops\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41004691",
          "author": "sidmkp96",
          "description": "The thing that amazes me is how they've rolled out such a buggy change at such a scale. I would assume that for such critical systems, there would be a gradual rollout policy, so that not everything goes down at once.",
          "link": "https://news.ycombinator.com/item?id=41004691",
          "publishedOn": "2024-07-19T10:41:37.000Z",
          "wordCount": null,
          "title": "New comment by sidmkp96 in \"CrowdStrike Update: Windows Bluescreen and Boot Loops\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41004184",
          "author": "zmmmmm",
          "description": "So CrowdStrike is deployed as third party software into the critical path of mission critical systems and then left to update itself. It's easy to blame CrowdStrike but that seems too easy on both the orgs that do this but also the upstream forces that compel them to do it.\nMy org which does mission critical healthcare just deployed ZScaler on every computer which is now in the critical path of every computer starting up and then in the critical path of every network connection the computer makes. The risk of ZScaler being a central point of failure is not considered. But - the risk of failing the compliance checkbox it satisfies is paramount.\nAll over the place I'm seeing checkbox compliance being prioritised above actual real risks from how the compliance is implemented. Orgs are doing this because they are more scared of failing an audit than they are of the consequences failure of the underlying systems the audits are supposed to be protecting. So we need to hold regulatory bodies accountable as well - when they frame regulation such that organisations are cornered into this they get to be part of the culpability here too.",
          "link": "https://news.ycombinator.com/item?id=41004184",
          "publishedOn": "2024-07-19T09:38:32.000Z",
          "wordCount": 16617,
          "title": "New comment by zmmmmm in \"CrowdStrike Update: Windows Bluescreen and Boot Loops\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41003390",
          "author": "teeheelol",
          "description": "Throwaway account...\nCrowdStrike in this context is a NT kernel loadable module (a .sys file) which does syscall level interception and logs then to a separate process on the machine. It can also STOP syscalls from working if they are trying to connect out to other nodes and accessing files they shouldn't be (using some drunk ass heuristics).\nWhat happened here was they pushed a new kernel driver out to every client without authorization to fix an issue with slowness and latency that was in the previous Falcon sensor product. They have a staging system which is supposed to give clients control over this but they pissed over everyone's staging and rules and just pushed this to production.\nThis has taken us out and we have 30 people currently doing recovery and DR. Most of our nodes are boot looping with blue screens which in the cloud is not something you can just hit F8 and remove the driver. We have to literally take each node down, attach the disk to a working node, delete the .sys file and bring it up. Either that or bring up a new node entirely from a snapshot.\nThis is fine but EC2 is rammed with people doing this now so it's taking forever. Storage latency is through the roof.\nI fought for months to keep this shit out of production because of this reason. I am now busy but vindicated.\nEdit: to all the people moaning about windows, we've had no problems with Windows. This is not a windows issue. This is a third party security vendor shitting in the kernel.",
          "link": "https://news.ycombinator.com/item?id=41003390",
          "publishedOn": "2024-07-19T08:19:27.000Z",
          "wordCount": null,
          "title": "New comment by teeheelol in \"CrowdStrike Update: Windows Bluescreen and Boot Loops\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41002977",
          "author": "jmcgough",
          "description": "Took down our entire emergency department as we were treating a heart attack. 911 down for our state too. Nowhere for people to be diverted to because the other nearby hospitals are down. Hard to imagine how many millions of not billions of dollars this one bad update caused.",
          "link": "https://news.ycombinator.com/item?id=41002977",
          "publishedOn": "2024-07-19T07:41:32.000Z",
          "wordCount": null,
          "title": "New comment by jmcgough in \"CrowdStrike Update: Windows Bluescreen and Boot Loops\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=52873",
          "author": "John Q",
          "description": "Joe Biden’s withdrawal from the US presidential election has prompted me to write down a few thoughts about getting old and being old. First up, I’m going to rant a bit (in classic old-person mode) about how much I loathe the various prissy euphemisms for “old” that appear just about everywhere: “older”, “aging”, “senior” and, […]",
          "link": "https://crookedtimber.org/2024/07/23/getting-old-and-being-old/",
          "publishedOn": "2024-07-23T06:52:40.000Z",
          "wordCount": 3955,
          "title": "Getting old and being old",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52870",
          "author": "Chris Bertram",
          "description": "Visit the post for more.",
          "link": "https://crookedtimber.org/2024/07/21/sunday-photoblogging-pigeon/",
          "publishedOn": "2024-07-21T12:31:51.000Z",
          "wordCount": 1712,
          "title": "Sunday photoblogging: pigeon",
          "imageUrl": "https://live.staticflickr.com/65535/53870840121_6c92159c62.jpg"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/Solidarity-with-Kenyal-people",
          "author": "CADTM International",
          "description": "The CADTM and Kenyan Allies Declaration We, the CADTM and Kenyan allies: Alarmed by the capture of the Kenyan government by the International Monetary Fund (IMF) that has worsened the Kenyan debt crisis Affirm our solidarity with the Kenyan people in their struggle against the neoliberal and neocolonial policies of the International Monetary Fund (IMF) imposed on the government of Kenya that have resulted in a Kenyan Peasant Revolution against the IMF led by the young people, popularly (...)\nEnglish\n\n/ \nSocial movements, \nIMF, \nKenya, \nStructural Adjustment Programs",
          "link": "https://www.cadtm.org/Solidarity-with-Kenyal-people",
          "publishedOn": "2024-07-24T08:24:21.000Z",
          "wordCount": 3271,
          "title": "Solidarity with Kenyan people!",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L960xH504/f0ea7d36e67b46b73dab851e46f759-9b970.jpg"
        },
        {
          "id": "https://www.cadtm.org/Corporate-Corruption-of-South-African-Politics-and-Economics",
          "author": "Patrick Bond",
          "description": "‘Accumulation by Dispossession' as a Structural Process, beyond ‘State Capture' \nEnglish\n\n/ \nCorruption / financial criminality, \nSouthern Africa, \nCorporate",
          "link": "https://www.cadtm.org/Corporate-Corruption-of-South-African-Politics-and-Economics",
          "publishedOn": "2024-07-22T08:25:32.000Z",
          "wordCount": 14267,
          "title": "Corporate Corruption of South African Politics and Economics",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/33232c44a4b2586ed559437bfa7b5b-869b4.jpg"
        },
        {
          "id": "https://www.cadtm.org/Crowd-strikes-out",
          "author": "Michael Roberts",
          "description": "The massive tech failure that caused chaos around the world raises important questions about the ownership and control of our digital world. The relatively unknown, cyber-security firm CrowdStrike admitted that the problem was caused by an update to its antivirus software, which was designed to protect Microsoft Windows devices from malicious attacks. \nEnglish\n\n/ \nCapitalism, \nMultinational corporation",
          "link": "https://www.cadtm.org/Crowd-strikes-out",
          "publishedOn": "2024-07-22T06:09:23.000Z",
          "wordCount": 2301,
          "title": "Crowd strikes out",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/02d3b0f28c5fc3eeb7c289698f2612-83efd.png"
        },
        {
          "id": "https://www.cadtm.org/CADTM-STATEMENT-ON-REPRESSION-IN-BANGLADESH",
          "author": "CADTM International",
          "description": "The CADTM denounces the brutality and violent crackdown against student demonstrators protesting against the government job quotas imposed by the government of Bangladesh. More than 150 deaths have been reported, while thousands of demonstrators have been injured. In a country where nearly 40% of young people lack employment and have limited access to education, the student movement is out in force on the streets, demonstrating against the decision that permits admission quotas into civil (...)\nPress releases\n\n/ \nSocial movements, \nBangladesh",
          "link": "https://www.cadtm.org/CADTM-STATEMENT-ON-REPRESSION-IN-BANGLADESH",
          "publishedOn": "2024-07-21T14:05:25.000Z",
          "wordCount": 1635,
          "title": "CADTM statement on repression in Bangladesh",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L429xH226/463e7ee7d036ac0d2bb484260d8a2b-ac442.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=8053",
          "author": "disassociated.com",
          "description": "The shortlists for the 2024 Tiny Awards have been published. Now in their second year, the Tiny Awards honour “interesting, small, craft-y internet projects and spaces which basically make the web a more fun place to be.” Think the work of small, and independent creatives. To be eligible, websites need to be non-commercial, and launched […]",
          "link": "https://disassociated.com/tiny-awards-2024-shortlist-announced-public-voting-open/",
          "publishedOn": "2024-07-23T21:00:45.000Z",
          "wordCount": 193,
          "title": "Tiny Awards 2024 shortlist announced, public voting open",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8050",
          "author": "disassociated.com",
          "description": "This news, via Kurzgesagt, may not be what some people want to hear. Exercising is useful, necessary in fact, but not so much when it comes to trying to lose weight it seems. Active people who work out regularly do burn more than inactive people. But only very little, often as low as 100 calories, […]",
          "link": "https://disassociated.com/fixed-calorie-budget-stops-weight-loss-exercise/",
          "publishedOn": "2024-07-22T21:00:25.000Z",
          "wordCount": 192,
          "title": "Your fixed calorie budget stops weight loss through exercise",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8047",
          "author": "disassociated.com",
          "description": "If you enjoyed the novels of late British author Douglas Adams, you may enjoy this in-depth article about his later life, by Jimmy Maher. Adams, it seems, did not restrict his particular brand of humour to the written word. A regular customer at a coffee shop I used to go to, told me about an […]",
          "link": "https://disassociated.com/douglas-adams-unofficially-signed-copies-books-sydney-australia/",
          "publishedOn": "2024-07-21T21:00:03.000Z",
          "wordCount": 344,
          "title": "That time Douglas Adams unofficially signed copies of his books in Sydney, Australia",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8044",
          "author": "disassociated.com",
          "description": "Back in 2008, I had a brief tweet exchange with another Twitter member, about the merits of LinkedIn*. At that point, I was a member, but really didn’t like the platform. I thought having a personal website, showcasing your abilities, was a better idea. #IndieWeb me was thinking — all of sixteen years ago — […]",
          "link": "https://disassociated.com/linkedin-professional-network-blogging-platform/",
          "publishedOn": "2024-07-18T21:00:01.000Z",
          "wordCount": 439,
          "title": "LinkedIn, a professional network, or a blogging platform?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20240723",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20240723",
          "publishedOn": "2024-07-23T23:00:00.000Z",
          "wordCount": 753,
          "title": "Week Ending July 21, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/remainders",
          "author": null,
          "description": "Thomas Heise (1955-2024).",
          "link": "https://newleftreview.org/sidecar/posts/remainders",
          "publishedOn": "2024-07-19T15:58:55.000Z",
          "wordCount": 2064,
          "title": "Julia Hertäg: &ldquo;Remainders&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/Heise.jpeg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/mutiny-in-bolivia",
          "author": null,
          "description": "The crisis of the MAS.",
          "link": "https://newleftreview.org/sidecar/posts/mutiny-in-bolivia",
          "publishedOn": "2024-07-18T17:23:06.000Z",
          "wordCount": 2882,
          "title": "Sinclair Thomson: &ldquo;Mutiny in Bolivia&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/maria-luisa-pacheco-montanas-1979-trivium-art-history.jpg"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://notes.jeddacp.com/when-every-day-feels-the-same/",
          "author": null,
          "description": "I woke up this morning with a sense of déjà vu.\nMy alarm hadn't gone off yet, but I was already awake, rolling over in bed with a familiar sense of dread. The routine was the same: get ready for work, make coffee, and head to my home office to start the work day.\nAs I attended meetings, smiled for the camera, and updated my product roadmap for what felt like the millionth time, that same feeling stayed— I’ve done this before.\nThis feeling has been with me since yesterday, last week, months before, and maybe even longer. It’s like living in my own version of Groundhog Day1, where every day is identical to the day before.\nI wake up too early (for me, at least)2, work all day, and by the end of my work day, I'm so drained (emotionally and mentally) that all I want to do is curl up in a ball and sleep. The only break to this repetition is the weekends, and even then, I try not to think about work.\nI can’t help but ask myself, is this really all there is to life?\nUgh, I think I just need a vacation.\n16/100\nReply by email\nA movie from 1993 where “A narcissistic, self-centered weatherman finds himself in a time loop on Groundhog Day.” I’m not narcissistic but I do feel like I’m stuck in some loop I want to break free from.↩\n\n\nI’m not a morning person↩",
          "link": "https://notes.jeddacp.com/when-every-day-feels-the-same/",
          "publishedOn": "2024-07-23T21:49:00.000Z",
          "wordCount": 967,
          "title": "When Every Day Feels the Same",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1721771238.png"
        },
        {
          "id": "https://bones-ai.bearblog.dev/anti-resume/",
          "author": null,
          "description": "I saw this really cool post on Twitter and thought I'd make my own version of it\nHere's my anti-resume,\nI don't specialise in any particular programming language. To me, languages are just syntax on top of ideologies and principles. I've come to appreciate the essence of programming itself.\nI don't follow clean code, I don't follow any programming patterns. When I write code I only strive for simplicity.\nI overvalue simplicity, to the point that I believe that its the most critical thing when it comes to software development. I don't like it when I see python one-liner in a codebase\nI write code because its fun. I don't care a lot about how many people use the things I build. I build things simply because I love building things.\nI love Lua, it's beautiful. Again, I like simplicity in things, when I code in any other language, I usually use a subset of its features. I don't like using iterators over loops, I don't do operator overloading, I don't like it when languages offer multiple ways of accomplishing the same thing. This is also the reason I'm starting to like C.\nI rely a lot on intuition.\nI’m not a fan of TDD.\nI value data structures over algorithms.\nI don't like Jira. I often end up not using it during projects. I don't like Docker either, I try to avoid it whenever possible.\nI prefer monoliths over microservices. While microservices can be useful, I think they are often misused.\nI'm not very good at math. I need a pen and a paper whenever I encounter problems involving matrices, trigonometry, or anything beyond basic math\nThat's it for now :)",
          "link": "https://bones-ai.bearblog.dev/anti-resume/",
          "publishedOn": "2024-07-23T15:46:00.000Z",
          "wordCount": 700,
          "title": "Anti-Resume",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://iamyourboon.com/my-run-in-with-the-russian-mafia/",
          "author": null,
          "description": "On my history with sports betting.\nDisclaimer: I am not a fan of gambling. I do not condone it. I do not recommend it. In fact, I believe online gambling and sports betting will irrevocably damage entire generations. I was terribly addicted and it really gave me bad thoughts all the time. Do not, do not gamble.\nWith that being said, I used to gamble, a lot. I started really young: when I was 11. It began innocuously with Team Fortress 2, betting in-game currencies like refined metals in raffle groups for larger prizes. I was on the edge of my seat for pennies. I never told my parents (hint: my family was poor). While this wasn't particularly profitable, it was my introduction to the habit. Trading virtual items in Team Fortress 2 was more lucrative and in fact how I made most of my early s…",
          "link": "https://iamyourboon.com/my-run-in-with-the-russian-mafia/",
          "publishedOn": "2024-07-23T15:01:00.000Z",
          "wordCount": 1086,
          "title": "My run in with the Russian Mafia",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://lebacafables.bearblog.dev/avant-de-passer-a-la-suite/",
          "author": null,
          "description": "En écrivant ces lignes, j’écoute ça : Open in new tab\nDans mon article précédent, j’ai constaté un malaise :\nde nombreuses campagnes de jeu de rôle m’ont déçu.\nJe suis parti en envolées lyriques.\nMaintenant, j’ai envie d’agir.\nJ’ai déjà commencé, en réalité,\ndepuis plusieurs semaines.\nJ’expérimente des trucs.\nJ’en ré-applique d’autres que j’avais laissés de côté.\nDans mes prochains articles,\nje vais probablement me concentrer à nouveau\nsur du plus \"jeu de rôle\".\nMais j'ai l'intuition que parler de créativité en général,\nça apporte aussi quelque chose.\nMe contenter de parler \"techniques de jeu de rôle\",\nc'est comme brûler une étape.\nDonc... Je vais encore parler de moi.\n(Et peut-être de toi)\nOn nous a tendu un piège\nOn va parler du circuit de la récompense,\nde créativité, et de neurobullshi…",
          "link": "https://lebacafables.bearblog.dev/avant-de-passer-a-la-suite/",
          "publishedOn": "2024-07-23T14:32:00.000Z",
          "wordCount": 3320,
          "title": "Avant de passer à la suite...",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://goofpunk.com/theres-so-many-of-you/",
          "author": null,
          "description": "Looks like since I started regularly updating this blog in June, there’s been 500 unique visitors and nearly a thousand reads. That’s kind of insane to me, I was pretty sure no one was going to read this thing, and I’m still not 100% sure why people do. I’m just some person!! I didn’t think I had enough interesting things to say to warrant being read a thousand times, but it looks like you all disagree. So thank you to everyone who’s reading, I appreciate you being here!\nAlso, shout out to the person reading this blog from Fraidycat. I know someone is cool when they use Fraidycat.",
          "link": "https://goofpunk.com/theres-so-many-of-you/",
          "publishedOn": "2024-07-23T12:05:00.000Z",
          "wordCount": 972,
          "title": "there’s so many of you",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://happy.bearblog.dev/hello-world/",
          "author": null,
          "description": "hello world\ni'm hoping to use this blog as a means of self expression. it will be a notebook of sorts - there will be unorganized thoughts, documents of my adventures, windows into my academic & career pursuits.\nmost of all, i'd like to share with you some of the reasons i've found to love life through my 20s, and in doing so, inspire you to find happiness on your own journey.\ntalk soon",
          "link": "https://happy.bearblog.dev/hello-world/",
          "publishedOn": "2024-07-23T01:31:00.000Z",
          "wordCount": 534,
          "title": "hello world",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://notes.jeddacp.com/a-separation-of-spaces/",
          "author": null,
          "description": "A kind of response to Do people IRL know you have a blog? by bacardi55 ⤵️\nI have two main blogs: Notes by JCProbably (this one) and JEDDACP.ME (still yet to be named). If you haven’t guessed already, this one is mainly about my notes on things, thoughts about life, and is primarily text based. On the other hand, JEDDACP.ME is primarily where I post photos, with some random context about the photos, or the location where the photo was snapped.\nI wish I could combine both spaces into one so that I am able to consolidate and just focus on one blog. However, the separation of both spaces is intentional.\nJEDDACP.ME is the website that I freely give to others. It exists for me to showcase photos I’ve taken, and serves as an informal, photographic guide to places I’ve been. If I have friends visi…",
          "link": "https://notes.jeddacp.com/a-separation-of-spaces/",
          "publishedOn": "2024-07-22T18:23:00.000Z",
          "wordCount": 1169,
          "title": "A Separation of Spaces",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1721672406.png"
        },
        {
          "id": "https://veronique.ink/a-summer-postcard-project-a-survey/",
          "author": null,
          "description": "I'm drinking a very strong cup of coffee.\nI'm back in my own apartment after being in the country again for the last few days. It's nice to be around my own things and have some time to write some personal email letters, read blogs, journal, and be alone for a bit.\nideas/thoughts/reading:\n-Working on a zine: Summer Diaries. This will be a short edition of maybe 20 copies. Tiny snippets about my country jaunts (written on my typewriter) with Polaroid pictures of said jaunts. Each copy will receive a different Polaroid from the zine. This project is born from wanting a more physical existence, a continuation of my quest for solid/analog experiences. A tangible proof of ordinary days.\n-TBR: Conversations with Friends, and Normal People, by Sally Rooney.\n-Goofpunk's post about detaching from t…",
          "link": "https://veronique.ink/a-summer-postcard-project-a-survey/",
          "publishedOn": "2024-07-22T17:36:00.000Z",
          "wordCount": 963,
          "title": "a summer postcard project + a survey 🛼",
          "imageUrl": "![13BDA3F7-C535-4B26-9C55-A1C97937EE6B](https://bear-images.sfo2.cdn.digitaloceanspaces.com/veronique-1721606707.jpeg)"
        },
        {
          "id": "https://alexandrawolfe.ca/the-retirement-i-never-asked-for/",
          "author": null,
          "description": "Back in early 2016 I had a medical emergency I never saw coming and had something happen to me that resulted in my having to take early retirement. Though I am thankful it wasn't permanent retirement to the grave.\nThe event? My brain blew a gasket.\nThe event so powerful, I lost three days of my life and woke up in hospital wondering what the hell had happened. I can't say I was scared at the time because I had no real idea of what happened or any memories of those lost days. I just woke up. A fact I am forever grateful for.\nThat medical emergency took me out for a whole year. I was laid up not really able to do much for a good few months. And then, slowly, bit by bit, I got back on my feet and tried to think about nothing else than what I was doing that day, and what I could look forward t…",
          "link": "https://alexandrawolfe.ca/the-retirement-i-never-asked-for/",
          "publishedOn": "2024-07-22T16:08:53.945Z",
          "wordCount": 1005,
          "title": "The Retirement I Never Asked For",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/awolfe-1720898838.png"
        },
        {
          "id": "https://iamyourboon.com/almost-getting-suspended-from-cmu/",
          "author": null,
          "description": "A story of the time I got a disciplinary hearing after hacking into CMU's dining system.\nI graduated from Carnegie Mellon University last semester. It’s a modest school in the rust belt city of Pittsburgh, Pennsylvania. The CS department is renowned, and its PhDs are coveted.\nPittsburgh is a city past its prime, with abandoned steel mills as quaint witnesses to an older time. It's citizens are resilient, enduring the constant rain and wind, trying their best to navigate life between Steelers' losses. Carnegie Mellon was founded by Andrew Carnegie. Carnegie was a philanthropist, but also a terrible employer. And his employees were the type to be driven more by sheer necessity than ambition (to be fair, they were factory workers).\nSimilarly, CMU students are driven not by dreams of passion o…",
          "link": "https://iamyourboon.com/almost-getting-suspended-from-cmu/",
          "publishedOn": "2024-07-22T12:28:00.000Z",
          "wordCount": 1505,
          "title": "Almost Getting Suspended from CMU",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://iamyourboon.com/anti-resume/",
          "author": null,
          "description": "For everything I did not get to experience.\nI'm boon. I wanted to be an astronaut. Instead, New York City's skyscrapers are the closest I will ever be to the stars. Unfortunately, the designers of NYC's skyline forgot to include them.\nBefore College\nI offered to produce a website for our local cinema; someone else won and produced this instead. Yes, it's still like that today.\n\nI self-studied 8 AP courses in a year; I didn't actually study. I still sat through them. A single teacher supervised all of them; I told her I'm sorry I wasted her time.\nI took the SAT once. Apparently you're allowed to retake it. I bombed the PSAT the year prior. You get free scholarship money from that. I missed applying to scholarships too: sorry mom and dad.\nI built a website and Point of Sale software for my p…",
          "link": "https://iamyourboon.com/anti-resume/",
          "publishedOn": "2024-07-21T18:08:00.000Z",
          "wordCount": 1105,
          "title": "Anti-Resume*",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://forkingmad.bearblog.dev/adding-comments-to-bear/",
          "author": null,
          "description": "I love reading blog posts, and I also enjoy responding to them.  I enjoy writing blog posts, and getting replies.  It makes it more interesting.\nHowever, comments are not for everyone, or every post.  Also, comments have traditionally opened up your blog to spammers.  It's a balancing act.\nIntroducing Komments.cloud\nFull disclosure -- I developed Komments to serve my own purposes but a few people then asked if they could use it, so I have opened it up to everyone.\n\n\n\nKomments.cloud is an entirely separate website, but let's call it a side-app 😏  It sounds nicer.\nHow does it work?  Simple:\nWrite your blog post as normal in Bear\nCreate an page in Komments.cloud for user comments\nAdd a link on your blog post to the unique address in Komments\nDone\nIf anyone leaves a comment you must approve it before it is live.  Approving takes a few seconds.\nThere's more detail here, and you can see it in action by clicking the comments link at the end of this blog post.\nWorks everywhere\nYou can use Komments anywhere, on any blogging/website that allows links (which is all of them basically).  Depending on what access you have to the blogging page code, you can even add buttons, or insert the Komments directing on the page.\nBear uses a simple link.  You can see how to do it at the bottom of the About page.\nFancy trying it?  Have any thoughts?  Want to test it?\nOh, and it's completely FREE.  No adverts, no tracking.  Just plain and simple good clean honest coding to help us all enjoy the web.\nComments welcome",
          "link": "https://forkingmad.bearblog.dev/adding-comments-to-bear/",
          "publishedOn": "2024-07-20T21:43:00.000Z",
          "wordCount": 759,
          "title": "Adding Comments to Bear",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://lebacafables.bearblog.dev/les-campagnes-qui-mont-decu/",
          "author": null,
          "description": "Pour bien commencer ce blog, je vais faire un article égocentrique.\nJ'espère que parmi celles et ceux qui le liront,\nil y aura quand même 2-3 \"pélo\" qui arriveront à s'identifier à mon ressenti.\nCes dernières années, j'ai mené de nombreuses campagnes de jeu de rôle.\nMais j'ai souvent été déçu.\nElles n'avaient pourtant pas de problèmes intrinsèques.\nJ'entends par là qu'a priori, je crois que les joueurs s'amusaient.\nJe pense d'ailleurs que je m'amusais aussi durant la partie.\nBien sûr, tout n'était pas mémorable, tout ne se valait pas,\nil y a eu des bonnes et des mauvaises rencontres,\nmais j'estime que ces parties n'étaient pas \"mauvaises\".\nLa déception dont je parle est plus personnelle.\nEt elle va plus loin que la partie en tant que telle.\nPour comprendre cela, il faut se pencher sur la r…",
          "link": "https://lebacafables.bearblog.dev/les-campagnes-qui-mont-decu/",
          "publishedOn": "2024-07-20T17:17:00.000Z",
          "wordCount": 2546,
          "title": "Les campagnes qui m'ont déçu",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://kylevallans.bearblog.dev/consistency-over-perfection/",
          "author": null,
          "description": "Enter your email to get 1 free month to our overnight momentum trading chat. Please check your promotions and spam for the confirmation email.\nYou NEED a Framework and there is no way around it!\nWithout one, you will remain stagnant at best!\nYou see, I finally figured out my health and fitness after many years. Over the years, I have jumped from one fad to the next, trying keto, intermittent fasting, low fat, high fat, you name it!\nAdditionally, I have found myself committing to a workout program for a few weeks only to switch it up on myself and try something else that seemed more exciting in the moment. Because of this constant change, very little progress was being made. In fact, I was simply maintaining at best!\nFinally, I made a change to my way of thinking!\nI now buy into the idea of…",
          "link": "https://kylevallans.bearblog.dev/consistency-over-perfection/",
          "publishedOn": "2024-07-19T16:30:00.000Z",
          "wordCount": 1317,
          "title": "Consistency Over Perfection: Why A Framework Matters",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://herman.bearblog.dev/discovery-feed-changes/",
          "author": null,
          "description": "The Bear community is awesome. The discovery feed is vibrant with slices of life, letter circles, the sharing of tips on how to trick out your blog, and so much more. It's a special corner of the internet that needs to be nourished and protected.\nBut as with any growing community, this hasn't been without its own set of challenges. These challenges can be broadly categorised into 2 groups:\n1. Spam blogs\nFighting spam is an ongoing battle, but mostly a solved problem. A combination of The Frustration Loop and the review process has taken care of it. However, due to a sharp increase in the number of signups recently (both legitimate and spam blogs), I've co-opted the help of Pam and Shraddha from Bonsai Digital to get through the never-ending stack of new blogs.\n2. Unsuitable content\nThe dis…",
          "link": "https://herman.bearblog.dev/discovery-feed-changes/",
          "publishedOn": "2024-07-19T06:00:00.000Z",
          "wordCount": 1100,
          "title": "Upcoming changes to the discovery feed",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://anotherjournal.bearblog.dev/a-leap-of-faith/",
          "author": null,
          "description": "u know that feeling when it's nearly impossible to achieve something..\neither because you're too late\nor you didn't prepare enough and it has high competition\nyour mind and logic says: there is no way\nbut your brain (or soul?) says: f*ck it we do it anyway.\nand somehow (most of the time) it works out!\nand even if it doesn't -- u don't feel thaaat bad..\nu say gg and move on.\nthat leap of faith is real!\ni hope such happy ending occurs again in my upcoming move inshallah.\nif u reading this: wish me luck homie -- will need it fr.",
          "link": "https://anotherjournal.bearblog.dev/a-leap-of-faith/",
          "publishedOn": "2024-07-18T21:17:00.000Z",
          "wordCount": 566,
          "title": "a leap of faith",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://pj.bearblog.dev/on-being-unemployed-at-26/",
          "author": null,
          "description": "this is the first time i'm revealing my age on bear, something i kept hidden for privacy's sake. \n\ni'm quitting my part-time job next week. \n\nis it okay to be unemployed at 26? \n\ni think it's mainly because i don't like where i am right now. \n\nwhen i was a kid i picked up on things very quickly. \n\ni know (i hope) i won't be stuck here forever. \n\ni'm still struggling, and even if i tell myself and others that there is no such thing as being behind, i can't help but feel dissatisfied with my current situation. \n\ni'm trying to have faith in myself but i'm not so good on my own, so please put your faith in me as well. \nand hope with me that this too shall pass.",
          "link": "https://pj.bearblog.dev/on-being-unemployed-at-26/",
          "publishedOn": "2024-07-18T18:06:17.766Z",
          "wordCount": 1019,
          "title": "on being unemployed at 26",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://veronique.ink/loose-thoughts/",
          "author": null,
          "description": "-Women are not allowed to be women. We're expected to look like teenagers for the rest of our lives, and it's exhausting.\n-One of my favorite hobbies used to be reading books. Now, it feels impossible to read one page without having to backtrack and read that page again (and sometimes...again) because I have no idea what I just read. My mind is unable to keep focus. I buy a lot of books, but I don't read them. I'm a collector of nightstand-books.\n-I started eating Kimchi for the first time ever this week and...I'm in love.\n-A part of me wants to remove my blog archives page from the navigation, create a new page, and showcase only the posts I want to keep sharing. idk.\n-Dating someone new is hard. Constantly making sure you're shaved, smelling wonderful, hair at its best, face presentable, worried about farting in front of them or taking a shit in your own bathroom, making sure you're wearing sexy underwear, not eating too much in front of them...honestly, it's like I'm afraid of being human. I just want to be a slob on my couch sometimes.\n-Do you use Are.na? I want to, but it looks awful. I downloaded Cosmos, and I do like it so far. I wonder if there are any other apps similar to Are.na (not Pinterest).\n-I sent out my weekly letter yesterday. Did you read it? I love writing these tiny missives through email. Are people reading it though? I don't know. But I shall keep writing and sharing, and hopefully, it will help someone out there feel a little less alone.",
          "link": "https://veronique.ink/loose-thoughts/",
          "publishedOn": "2024-07-18T15:15:00.000Z",
          "wordCount": 793,
          "title": "loose thoughts",
          "imageUrl": "![13BDA3F7-C535-4B26-9C55-A1C97937EE6B](https://bear-images.sfo2.cdn.digitaloceanspaces.com/veronique-1721606707.jpeg)"
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/ameed-faleh-i-dont-want-a-state-and-i-never-did?v=1721606156",
          "author": null,
          "description": "Author: Ameed Faleh\nTitle: I Don’t Want a State, and I Never Did\nDate: July 16, 2024\nSource: Retrieved on July 21, 2024 from https://hello.goodshepherdcollective.org/sendy/w/v763892xRCuLgGPl4ovANruMOA/wcJf7Kvgs9eSy6JDl2qKuQ/9Be3XcAljVwc892eDWMhTjUQ\n\n It was the early spring of 2017, and I stood in line for the daily school routine. We did the usual routine of standing up for the Palestinian anthem and the obligatory start-of-the-week fingernail check. The inspector will hit your hands with a wooden stick if you do not cut your fingernails every week. After the morning routine, we saw our sports teacher make an announcement: \n “On behalf of the school administration, we would like to present our condolences to Kareem and his entire family for the martyrdom of Kareem’s cousin, Ahmad, by the …",
          "link": "https://theanarchistlibrary.org/library/ameed-faleh-i-dont-want-a-state-and-i-never-did?v=1721606156",
          "publishedOn": "2024-07-21T23:55:56.000Z",
          "wordCount": 1320,
          "title": "Ameed Faleh - I Don’t Want a State, and I Never Did",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7053",
            "url": "https://theanarchistlibrary.org/library/ameed-faleh-i-dont-want-a-state-and-i-never-did.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}