{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": []
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": [
        {
          "id": "b917efab213459629385d77d5480632e0e4173c4",
          "author": "Kevin S. Ridolfi",
          "description": "This post was co-written with Dr. Jan Melchior at BASF Digital Farming GmbH and xarvio Digital Farming Solutions. BASF Digital Farming’s mission is to support farmers worldwide with cutting-edge digital agronomic decision advice by using its main crop optimization platform, xarvio FIELD MANAGER. This necessitates providing the most recent satellite imagery available as quickly as […]",
          "link": "https://aws.amazon.com/blogs/architecture/efficient-satellite-imagery-supply-with-aws-serverless-at-basf-digital-farming-gmbh/",
          "publishedOn": "2024-12-06T16:31:05.000Z",
          "wordCount": 2058,
          "title": "Efficient satellite imagery supply with AWS Serverless at BASF Digital Farming GmbH",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fc074d501302eb2b93e2554793fcaf50b3bf7291/2024/11/19/fig2-digital-farming-1260x574.png"
        }
      ]
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps & Developer Productivity Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": []
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "e5dc8b7d430b19b64ca0e6442d0af0464c387b94",
          "author": "pmm",
          "description": "This blog was authored by Johannes Brück, Senior Staff Engineer (Personio), Donald Dragoti, Lead Platform Engineer (Personio), Steve Flinchbaugh, Lead Platform Engineer (Personio), Maximilian Schellhorn, Senior Solutions Architect (AWS) and Dionysios Kakaletris, Technical Account Manager (AWS). Migrating your Amazon Elastic Kubernetes Service (Amazon EKS) nodes to use AWS Graviton based Amazon Elastic Compute Cloud (Amazon […]",
          "link": "https://aws.amazon.com/blogs/containers/migrating-from-x86-to-aws-graviton-on-amazon-eks-using-karpenter/",
          "publishedOn": "2024-12-11T05:26:54.000Z",
          "wordCount": 3147,
          "title": "Migrating from x86 to AWS Graviton on Amazon EKS using Karpenter",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/11/29/Featured-images-for-Containers-Blog-11-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=346551",
          "author": "Jeffrey St. Clair - Joshua Frank",
          "description": "Below is the alleged short manifesto written by Luigi Mangione, the suspected killer of UnitedHealthcare CEO Brian Thompson in New York City last week. To our knowledge, no major news outlet has published this in full, found in his backpack when Mangione was captured in Altoona, Pennsylvania. We believe it’s newsworthy enough to share here  More\nThe post “Deny,” “Defend” and “Depose”: Luigi Mangione’s Manifesto appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/deny-defend-and-depose-luigi-mangiones-manifesto/",
          "publishedOn": "2024-12-11T07:27:11.000Z",
          "wordCount": null,
          "title": "“Deny,” “Defend” and “Depose”: Luigi Mangione’s Manifesto",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346549",
          "author": "Desiree Hellegers",
          "description": "I don’t know about you, but personally, the whole festive holiday thing seems to be falling a bit flat this year. Don’t get me wrong, like every other year, I do plan to really go to town on a pumpkin pie or two. But this year, the annual deluge of Black Friday ads egging us on to higher levels of consumption–with corresponding carbon emissions and solid and liquid waste–seemed particularly hollow, morbid–predatory, even–falling as Black Friday did this year on November 29, the date the U.N. first recognized in 1977 as International Day of Solidarity with the Palestinian People. This year all the excess, forced pageantry, and planned obsolescence of Black Friday seems in such stark and ironic contrast to the poverty in Gaza. More\nThe post ‘Tis the Season to Talk Climate Collapse, Nuclear Colonialism, and Freeing Leonard Peltier appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/tis-the-season-to-talk-climate-collapse-nuclear-colonialism-and-freeing-leonard-peltier/",
          "publishedOn": "2024-12-11T07:02:00.000Z",
          "wordCount": null,
          "title": "‘Tis the Season to Talk Climate Collapse, Nuclear Colonialism, and Freeing Leonard Peltier",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346492",
          "author": "Patrick Bond",
          "description": "The sudden regime overthrow in Syria and the long-delayed opportunity to confront the legacy of Bashar al-Assad’s tyranny are either being celebrated or condemned, as explored below, but they come at a time that poses profound problems for solidarity with Palestine. More\nThe post From South Africa to Syria, Rising Perils for Palestine Solidarity appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/from-south-africa-to-syria-rising-perils-for-palestine-solidarity/",
          "publishedOn": "2024-12-11T06:59:52.000Z",
          "wordCount": null,
          "title": "From South Africa to Syria, Rising Perils for Palestine Solidarity",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346547",
          "author": "Daniel Falcone – Stephen Zunes",
          "description": "“There are indications that it was unarmed civil resistance led by the resurgent popular committees and local councils, which initially came to the fore in the early nonviolent phase of the revolution back in 2011, that actually wrested control of much of the local governance from the regime.” In this interview, exclusive for CounterPunch, foreign policy  More\nThe post The Ousting of the Brutal Assad Regime Brings Euphoria and More Questions appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/the-ousting-of-the-brutal-assad-regime-brings-euphoria-and-more-questions/",
          "publishedOn": "2024-12-11T06:56:30.000Z",
          "wordCount": null,
          "title": "The Ousting of the Brutal Assad Regime Brings Euphoria and More Questions",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346538",
          "author": "John W. Whitehead – Nisha Whitehead",
          "description": "“Rights aren’t rights if someone can take them away. They’re privileges. That’s all we’ve ever had in this country is a ‘Bill of Temporary Privileges.’ And if you read the news, even badly, you know that the list gets shorter and shorter.”—George Carlin Disguising its power grabs in the self-righteous fervor of national security, the Deep  More\nThe post When Rights Become Privileges: Is the Constitution Becoming Optional? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/when-rights-become-privileges-is-the-constitution-becoming-optional/",
          "publishedOn": "2024-12-11T06:55:24.000Z",
          "wordCount": null,
          "title": "When Rights Become Privileges: Is the Constitution Becoming Optional?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346537",
          "author": "David Rosen",
          "description": "Authoritarian leaders, like many others, need an enemy.  Hitler’s enemy was the Jews (among others); for Netanyahu, it’s been the Palestinians, and for Donald Trump and his MAGA followers, it’s been “immigrants” (among others). For generations in the U.S., African Americans have been the targeted enemy for “white” people, and for centuries women and girls have been  More\nThe post The Need for an Enemy appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/the-need-for-an-enemy/",
          "publishedOn": "2024-12-11T06:55:15.000Z",
          "wordCount": null,
          "title": "The Need for an Enemy",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346540",
          "author": "Binoy Kampmark",
          "description": "The reports through Western presses read rather familiarly.  Joyful residents taking selfies on abandoned, sullen tanks.  Armed men ebullient and shooting into the sky with adventurist stupidity.   The removal of statues and vulgar reminders of a regime.  Prisoners freed; torture prisons emptied.  The tyrant, deposed. This is the scene in Syria, a war with more external backers and sponsors than  More\nThe post Chilling Warnings for Syria: When Foreign Interventions Go Bad appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/chilling-warnings-for-syria-when-foreign-interventions-go-bad/",
          "publishedOn": "2024-12-11T06:55:05.000Z",
          "wordCount": null,
          "title": "Chilling Warnings for Syria: When Foreign Interventions Go Bad",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346458",
          "author": "Charles Thomson",
          "description": "The Tate Modern has barred artist, Edgeworth Johnstone from entering the gallery because of leaflets about the Tate Turner Prize in his bag. Johnstone, a member of the Stuckists art movement, said “I had protest leaflets titled “The Stomach Turner Prize”. I made it clear that I had no intention of distributing them inside the  More\nThe post Tate Artist Excluded from Tate for Turner Prize Leaflet appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/tate-artist-excluded-from-tate-for-turner-prize-leaflet/",
          "publishedOn": "2024-12-11T06:54:58.000Z",
          "wordCount": null,
          "title": "Tate Artist Excluded from Tate for Turner Prize Leaflet",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346382",
          "author": "Karen Bloom Gevirtz",
          "description": "Most of us are aware of the deep problems in the current US pharmaceutical industry. Yet few may realize that today’s issues stem from changes that occurred centuries ago. As I explain in The Apothecary’s Wife: The Hidden History of Medicine and How it Became a Commodity, the current medication system was established between 1650  More\nThe post Today’s Science Skepticism Goes Back to the Scientific Revolution appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/todays-science-skepticism-goes-back-to-the-scientific-revolution/",
          "publishedOn": "2024-12-11T06:49:30.000Z",
          "wordCount": null,
          "title": "Today’s Science Skepticism Goes Back to the Scientific Revolution",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346416",
          "author": "Peter Bach",
          "description": "I don’t know if it was murdered UnitedHealthcare CEO Brian Thompson or not, but I saw Taxi Driver again for the first time in years. Watching Robert De Niro’s Travis Bickle, however, I was reminded more of ‘lame duck’ South Korean president Yoon Suk Yeol and his declaration of martial law—an intensely straight line, in  More\nThe post Letter from London: Striking Home and Away appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/letter-from-london-striking-home-and-away/",
          "publishedOn": "2024-12-11T06:45:34.000Z",
          "wordCount": null,
          "title": "Letter from London: Striking Home and Away",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346417",
          "author": "Imran Khalid",
          "description": "Donald Trump, a man who never shied from bold declarations, has once again turned the global stage into a theater of economic brinkmanship. His target: the BRICS coalition, a bloc of emerging powers that includes China, Brazil, India, Russia, and South Africa (and now Iran, the UAE, Ethiopia, and Egypt as well). With more than  More\nThe post Trump Takes Aim at BRICS and the Global Economy appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/trump-takes-aim-at-brics-and-the-global-economy/",
          "publishedOn": "2024-12-11T06:42:21.000Z",
          "wordCount": null,
          "title": "Trump Takes Aim at BRICS and the Global Economy",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346554",
          "author": "Evaggelos Vallianatos",
          "description": "Prologue One of the reasons I moved to Claremont, California, in 2008 was Claremont’s banning of the gasoline-powered leaf blowers. I detested them long before 2008. I still do. They are harmful and useless. Leaf blowers are mostly powered by Earth-heating petroleum and gasoline to move leaves from trees on the ground from one spot  More\nThe post Leaf Blowers: An Invisible Source of Climate Chaos and Harm to Human and Environmental Health appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/leaf-blowers-an-invisible-source-of-climate-chaos-and-harm-to-human-and-environmental-health/",
          "publishedOn": "2024-12-11T05:04:09.000Z",
          "wordCount": null,
          "title": "Leaf Blowers: An Invisible Source of Climate Chaos and Harm to Human and Environmental Health",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346421",
          "author": "Joseph Daher",
          "description": "The rebellion in Syria has taken the world by surprise and led to the fall of the Assad family dictatorship, which has ruled Syria since Bashar al-Assad’s father, Hafez, took power in a coup d’etat 54 years ago. Neither the regime’s military forces nor its imperial sponsor, Russia, and its regional backer, Iran, were able to defend it. Cities under the regime’s control have been freed, thousands of political prisoners liberated from its notorious dungeons, and space opened for a new fight for a free, inclusive, and democratic Syria for the first time in decades. More\nThe post Understanding the Rebellion in Syria appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/10/understanding-the-rebellion-in-syria/",
          "publishedOn": "2024-12-10T06:59:01.000Z",
          "wordCount": null,
          "title": "Understanding the Rebellion in Syria",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346388",
          "author": "Noam Chomsky",
          "description": "What is the future likely to bring?  A reasonable stance might be to try to look at the human species from the outside.  So imagine that you’re an extraterrestrial observer who is trying to figure out what’s happening here or, for that matter, imagine you’re a historian 100 years from now — assuming there are  More\nThe post Humanity Imperiled appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/10/humanity-imperiled/",
          "publishedOn": "2024-12-10T06:57:47.000Z",
          "wordCount": null,
          "title": "Humanity Imperiled",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346468",
          "author": "M. Reza Behnam",
          "description": "“We had several other people in the country [USA}, even among the Jews, the Zionists particularly, who were against anything that has to be done if  they couldn’t have the whole of Palestine and everything handed to them on a silver plate so they wouldn’t have to do anything.  It couldn’t be done.  We had  More\nThe post Israel and the United States:  Who Rules the Roost? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/10/who-rules-the-roost/",
          "publishedOn": "2024-12-10T06:56:55.000Z",
          "wordCount": null,
          "title": "Israel and the United States:  Who Rules the Roost?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346393",
          "author": "Ralph Nader",
          "description": "For decades consumer groups have been sounding clarion calls for action against the “silent violence” causing massive casualties that arise from the unbridled power of corporate greed, criminal negligence or indifference. They cite statistical and case studies that the media and lawmakers mostly ignored or relegated to low levels of enforcement. Corporate bosses just have  More\nThe post The “Silent Violence” of Corporate Greed and Power appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/10/the-silent-violence-of-corporate-greed-and-power/",
          "publishedOn": "2024-12-10T06:55:57.000Z",
          "wordCount": null,
          "title": "The “Silent Violence” of Corporate Greed and Power",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346448",
          "author": "Howard Lisnoff",
          "description": "The New York Times article about the mass deportation of about 11 million people begins with an analogy of those people encompassing a number of people four times the size of the population of Chicago (“Donald Trump’s Immigration Plans,” November 27, 2024). The Times, always ahead of the curve by pushing the hapless Harris/Walz ticket, along with a slavish dedication to  More\nThe post A Nation of Immigrants appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/10/a-nation-of-immigrants-2/",
          "publishedOn": "2024-12-10T06:55:42.000Z",
          "wordCount": null,
          "title": "A Nation of Immigrants",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346445",
          "author": "Binoy Kampmark",
          "description": "FIFA has done it again.  With its usual sparkle of inventive interpretation, amoral reasoning, and snappy bravura, the world football federation has deemed the Kingdom of Saudi Arabia fit for hosting the largest sporting event on the sporting calendar – not counting the Olympics.  The FIFA Men’s World Cup will be hosted, yet again, in a desert  More\nThe post FIFA’s Cooked Findings: Saudi Arabia’s World Cup Bid appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/10/fifas-cooked-findings-saudi-arabias-world-cup-bid/",
          "publishedOn": "2024-12-10T06:55:16.000Z",
          "wordCount": null,
          "title": "FIFA’s Cooked Findings: Saudi Arabia’s World Cup Bid",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346381",
          "author": "John Feffer",
          "description": "The industrial revolution depended on fossil fuels. The current transition to clean energy aims to leave coal, oil, and natural gas behind. But this transition is also heavily dependent on critical metals like copper, lithium, and nickel. It’s also not clear whether the earth contains enough of these metals to support all the solar installations,  More\nThe post Can Recycling Save the Green Energy Revolution? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/10/can-recycling-save-the-green-energy-revolution/",
          "publishedOn": "2024-12-10T06:55:13.000Z",
          "wordCount": null,
          "title": "Can Recycling Save the Green Energy Revolution?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346450",
          "author": "Eric Elliott",
          "description": "The proper way of understanding the two serious Iranian missile barrages on Israel is as a demonstration of the fragility of the iron dome. Every missile in the iron dome arsenal by definition has to be a smart bomb—after all, they are trying to shoot missiles out of the sky.  And since Israelis have a very  More\nThe post The Myth of The Iron Dome appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/10/the-myth-of-the-iron-dome/",
          "publishedOn": "2024-12-10T06:54:43.000Z",
          "wordCount": null,
          "title": "The Myth of The Iron Dome",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346372",
          "author": "Omar Ocampo",
          "description": "The collective net worth of America’s top twelve billionaires has surpassed $2 trillion as of December 3. This is an unsettling new milestone for wealth concentration in the United States. The oligarchic dozen is richer than ever, and they are endowed with extreme material power that can be used to pursue narrow political interests at  More\nThe post Twelve U.S. Billionaires Now Have a Combined $2 Trillion appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/10/twelve-u-s-billionaires-now-have-a-combined-2-trillion/",
          "publishedOn": "2024-12-10T06:53:44.000Z",
          "wordCount": null,
          "title": "Twelve U.S. Billionaires Now Have a Combined $2 Trillion",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346376",
          "author": "Aspen Coriz-Romero",
          "description": "The right to seek asylum or refuge from danger is a fundamental human right. It’s protected by both international and U.S. law. But Donald Trump wants to eliminate that right, including for the most vulnerable: children. These children are often forced to cross the border without their parents to try and claim asylum in the  More\nThe post “Gas on a Dumpster Fire:” Immigration Under Trump 2.0 appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/10/gas-on-a-dumpster-fire-immigration-under-trump-2-0/",
          "publishedOn": "2024-12-10T06:53:18.000Z",
          "wordCount": null,
          "title": "“Gas on a Dumpster Fire:” Immigration Under Trump 2.0",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346423",
          "author": "Raouf Halaby",
          "description": "Remember the Biden pier off Gaza’s coast? It is perhaps the best metaphor for Genocide Joe’s failed foreign policy  (Near East and Ukraine). The takeover in Syria is an equally failed  Biden EU foreign policy, a policy that is dictated by Netanyahu’s Zionist fetish to “create a new Middle East.”  Credit the Brits and the  More\nThe post The Fall of the House of Assad appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/10/the-fall-of-the-house-of-assad/",
          "publishedOn": "2024-12-10T06:48:57.000Z",
          "wordCount": null,
          "title": "The Fall of the House of Assad",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346380",
          "author": "Robin S.C. Griffin",
          "description": "Most days in my depraved, transsexual lifestyle start the same: I wake up at 5:15 a.m. to pet my cat, have some coffee, and journal a little before I get out the door. I bike down the street to a gym where I get to see a few friends and sweat a little before putting  More\nThe post If They Can Take Away My Rights Today,  They Can Take Yours Tomorrow appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/10/if-they-can-take-away-my-rights-today-they-can-take-yours-tomorrow/",
          "publishedOn": "2024-12-10T06:28:10.000Z",
          "wordCount": null,
          "title": "If They Can Take Away My Rights Today,  They Can Take Yours Tomorrow",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346332",
          "author": "Sonali Kolhatkar",
          "description": "A quiet panic has broken out within immigrant communities across the United States ahead of Donald Trump’s inauguration on January 20, 2025. Mixed-status families are expecting to be separated, DACA recipients foresee their status being revoked, those with Temporary Protected Status are pessimistic about the program remaining valid, and asylum seekers fear the worst. Indeed, if Project 2025’s anti-immigrant agenda is fully enacted, the horrors of family separation that the nation witnessed in 2018 under Trump’s first term will pale in comparison to what’s coming. More\nThe post Time for Truthful Narratives on Immigration appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/09/time-for-truthful-narratives-on-immigration/",
          "publishedOn": "2024-12-09T07:00:53.000Z",
          "wordCount": null,
          "title": "Time for Truthful Narratives on Immigration",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346355",
          "author": "Deepak Tripathi",
          "description": "In a country of 25 million with almost 75 percent Sunnis and only about 15 percent Alawite Shia Muslims, the Assad regime of the Alawite minority was sustained over half a century by brutal repression. Bashar’s father, Hafez al-Assad, was a significant Arab leader along with Gamal Abdel Nasser of Egypt and Muammar Gaddafi of Libya. Together, they were close allies of the Soviet Union, and formed the anti-Western front in the Arab world. Syria’s Assad dynasty, above all, was particularly shaky. It ruled with an iron fist, creating both fear and resistance which exploded into full-scale civil war in the early 2010s. More\nThe post The Fall of Syria’s Bashar al-Assad: What it Means appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/09/the-fall-of-syrias-bashar-al-assad-what-it-means/",
          "publishedOn": "2024-12-09T06:58:38.000Z",
          "wordCount": null,
          "title": "The Fall of Syria’s Bashar al-Assad: What it Means",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346256",
          "author": "Robert Hunziker",
          "description": "A worrisome trend in the global climate system has popped up. Specific regions of the world are experiencing repetitive severe heat waves so extreme and so deadly that scientists’ models are thrown for a tizzy. This behavior is comparable to a war zone with heat the primary weapon that ravages a specific region with temperatures  More\nThe post Mysterious Global Hotspots appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/09/mysterious-global-hotspots/",
          "publishedOn": "2024-12-09T06:58:09.000Z",
          "wordCount": null,
          "title": "Mysterious Global Hotspots",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346396",
          "author": "Dave Lindorff",
          "description": "It didn’t take any courage for outgoing President Joe Biden, in the last few weeks of his White House residency, to pardon his son Hunter, who had already been sentenced to two years in federal prison for conviction on the minor charge of falsifying information on a gun purchase application document and was awaiting sentencing  More\nThe post Biden! Do the Right Thing: Exonerate Ethel Rosenberg! appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/09/biden-do-the-right-thing-exonerate-ethel-rosenberg/",
          "publishedOn": "2024-12-09T06:56:41.000Z",
          "wordCount": null,
          "title": "Biden! Do the Right Thing: Exonerate Ethel Rosenberg!",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346371",
          "author": "John P. Ruehl",
          "description": "The U.S. enjoys many strengths that give it an edge over other republics, such as a decentralized and innovative economy that draws global talent and unmatched military strength. Yet the Roman Republic, which had its own comparative advantages, ultimately fell to autocratic rule, and the U.S. faces a similar fate if it fails to protect  More\nThe post How Republics Succeed, Falter, and Fail appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/09/how-republics-succeed-falter-and-fail/",
          "publishedOn": "2024-12-09T06:55:51.000Z",
          "wordCount": null,
          "title": "How Republics Succeed, Falter, and Fail",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346364",
          "author": "Binoy Kampmark",
          "description": "Turkey’s Recep Tayyip Erdoğan must be delighted about what is unfolding in Syria, though it is a feeling bound to be tempered by swiftly changing circumstances.  Iran’s Shia proxies have been weakened by relentless Israeli targeting and bombing.  Russia’s eyes and resources are turned towards war in Ukraine.  With reports that Syrian rebel groups are now fighting on  More\nThe post The Sectarian Risk: Turkey’s Syrian Mission appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/09/the-sectarian-risk-turkeys-syrian-mission/",
          "publishedOn": "2024-12-09T06:55:19.000Z",
          "wordCount": null,
          "title": "The Sectarian Risk: Turkey’s Syrian Mission",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=283676",
          "author": "Yves Smith",
          "description": "How the sudden collapse of the Syrian government exposes fundamental weaknesses in the BRICS initiative.",
          "link": "https://www.nakedcapitalism.com/2024/12/the-collapse-of-syria-brics-and-wishful-thinking.html",
          "publishedOn": "2024-12-11T16:00:41.000Z",
          "wordCount": 10127,
          "title": "The Collapse of Syria, BRICS, and Wishful Thinking",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=283694",
          "author": "Lambert Strether",
          "description": "Our \"things are going swimmingly\" daily links",
          "link": "https://www.nakedcapitalism.com/2024/12/links-12-11-2024.html",
          "publishedOn": "2024-12-11T11:58:11.000Z",
          "wordCount": 11257,
          "title": "Links 12/11/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/African_common_toad_swimming.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=283679",
          "author": "Conor Gallagher",
          "description": "Ankara burns bridges with Beijing and Moscow and is now stuck with Syrian albatross around the neck as emboldened Turkish imperialists eye future conquests.",
          "link": "https://www.nakedcapitalism.com/2024/12/did-turkiye-win-the-battle-but-lose-the-war.html",
          "publishedOn": "2024-12-11T11:00:10.000Z",
          "wordCount": 10810,
          "title": "Did Türkiye Win the Battle, But Lose the War?",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/Screenshot-2024-12-10-at-11.57.55 AM-516x1024.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=283706",
          "author": "Yves Smith",
          "description": "In 2020, RFK Jr.’s nonprofit sued the FCC over 5G cell phone radiation safety. As HHS secretary, he’d have the power to upend the tech.",
          "link": "https://www.nakedcapitalism.com/2024/12/in-the-trump-administration-crosshairs-cell-phone-radiation.html",
          "publishedOn": "2024-12-11T10:19:42.000Z",
          "wordCount": 5690,
          "title": "In the Trump Administration Crosshairs: Cell Phone Radiation",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=283665",
          "author": "Yves Smith",
          "description": "The fight between AirBnB and tenants in New York City enters a new chapter as the city considers relaxing its short-term rental ban.",
          "link": "https://www.nakedcapitalism.com/2024/12/should-the-nyc-council-revisit-airbnb-restrictions-rival-city-hall-rallies-fight-it-out.html",
          "publishedOn": "2024-12-11T06:03:38.000Z",
          "wordCount": 5547,
          "title": "Should the NYC Council Revisit Airbnb Restrictions? Rival City Hall Rallies Fight it Out.",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/00-AirBnB.webp"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=283654",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics; Trump, the world's greatest troll; Hegseth et al. still alive; \"RuissiaGate Remnants\"; Claims Adjuster roundup ~",
          "link": "https://www.nakedcapitalism.com/2024/12/200pm-water-cooler-12-10-2024.html",
          "publishedOn": "2024-12-10T19:00:53.000Z",
          "wordCount": 15003,
          "title": "2:00PM Water Cooler 12/10/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/covid-cdc-ww-natl-1.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=283649",
          "author": "Yves Smith",
          "description": "Rentierism in housing in the UK has reached what looks like nose-bleed, self-correcting, and thus potentially crash-inducing levels.",
          "link": "https://www.nakedcapitalism.com/2024/12/the-next-crash-could-be-much-bigger-than-the-last-two.html",
          "publishedOn": "2024-12-10T14:55:42.000Z",
          "wordCount": 11691,
          "title": "“The Next Crash Could Be Much Bigger Than the Last Two”",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=283573",
          "author": "Yves Smith",
          "description": "Our yowling daily links: Africa outbreak EU geoengineering warning. China probes Nvidia, Africa uranium row, VW worker protests, moar Israel srikes in Lebanon, Russia to exit Syria bases? NYC chokehold aquittal, debt worries, new UnitedHealthcare CEO vid, US child labor,",
          "link": "https://www.nakedcapitalism.com/2024/12/links-12-10-2024.html",
          "publishedOn": "2024-12-10T11:59:26.000Z",
          "wordCount": 20706,
          "title": "Links 12/10/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/00-Fennec_Foxes.jpeg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=283637",
          "author": "Yves Smith",
          "description": "A look at the context of the government-supported health insurance industry practices that triggered the murder of UnitedHealth CEO Thompson.",
          "link": "https://www.nakedcapitalism.com/2024/12/rob-urie-politics-by-other-means-health-insurance-industry-edition.html",
          "publishedOn": "2024-12-10T11:58:42.000Z",
          "wordCount": 8392,
          "title": "Rob Urie: Politics by Other Means, Health Insurance Industry Edition",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/Screen-Shot-2024-12-10-at-7.03.51-PM.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=283580",
          "author": "Nick Corbishley",
          "description": "What is the scandal-tarnished Japanese tech giant Fujitsu doing running the government's digital Proof of Age Standards Scheme (PASS)?",
          "link": "https://www.nakedcapitalism.com/2024/12/good-news-and-bad-news-in-uk-cash-use-continues-to-rise-as-government-unveils-digital-id-plans-for-pubs-and-clubs.html",
          "publishedOn": "2024-12-10T11:45:55.000Z",
          "wordCount": 5409,
          "title": "Good News & Bad News in UK: Cash Use Continues to Rebound As Government Unveils Digital ID Plans for “Pubs and Clubs”",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "6Bi6mGvw8vrskNZ7Mmp73F",
          "author": "Celso Martinho",
          "description": "Today, the AI Audit dashboard gets an upgrade: you can now quickly see which AI services are honoring your robots.txt policies and then automatically enforce the policies against those that aren’t.",
          "link": "https://blog.cloudflare.com/ai-audit-enforcing-robots-txt",
          "publishedOn": "2024-12-10T14:00:00.000Z",
          "wordCount": 1193,
          "title": "Robotcop: enforcing your robots.txt policies and stopping bots before they reach your website",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/LwAse1uBhNdJ0pjyskJcp/3feab8cfa7fc46c4ed93c347987e2a97/Enforcing_your_robots.txt_policies_and_stopping_bots_before_they_reach_your_website-OG.png"
        },
        {
          "id": "4oLkLHLIZ1vibq8dtPJP6F",
          "author": "David Belson",
          "description": "The 2024 Cloudflare Radar Year in Review is our fifth annual review of Internet trends and patterns at both a global and country/region level. For 2024, we added several new metrics, as well as the ability to do year-over-year and geographic comparisons for selected metrics.",
          "link": "https://blog.cloudflare.com/radar-2024-year-in-review",
          "publishedOn": "2024-12-09T14:00:00.000Z",
          "wordCount": 9941,
          "title": "Cloudflare 2024 Year in Review",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/Xw63gQRdZSUjMoaW6oFyy/190bd0fc341de1277929e0ce620ffe7a/Cloudflare_2024_Year_in_Review-OG.png"
        },
        {
          "id": "1bFqI2J5pfAs7dEpRp8auV",
          "author": "João Tomé",
          "description": "The 2024 popular Internet services landscape highlights rising generative AI, e-commerce shifts, and the continued dominance of platforms like Google and Facebook, as revealed by Cloudflare’s rankings.",
          "link": "https://blog.cloudflare.com/radar-2024-year-in-review-internet-services",
          "publishedOn": "2024-12-09T14:00:00.000Z",
          "wordCount": 5980,
          "title": "From ChatGPT to Temu: ranking top Internet services in 2024",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6Gcy2yfdnZuMS15PJI4A6z/c12cc48677d172ded59519995b825c79/BLOG-1033_OG.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": [
        {
          "id": "https://medium.com/p/9cab17c9071b",
          "author": "Capital One Tech",
          "description": "Getting to know Capital One’s Head of Research and Design Operations.",
          "link": "https://medium.com/capital-one-tech/jen-cardello-q-a-advancing-design-research-and-operations-9cab17c9071b?source=rss----3db3a67cb648---4",
          "publishedOn": "2024-12-11T18:23:18.000Z",
          "wordCount": 2470,
          "title": "Jen Cardello Q&A: Advancing design research and operations",
          "imageUrl": "https://miro.medium.com/v2/resize:fit:1200/0*1LyQ3IjLoeN-Vrn0.png"
        }
      ]
    },
    {
      "title": "Engineering at Slack",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": [
        {
          "id": "https://slack.engineering/?p=17310",
          "author": "Sean Madden",
          "description": "“A complex system can fail in an infinite number of ways.” -“Systemantics” by John Gall   Incidents are stressful but inevitable. Even services designed for availability will eventually encounter a failure. Engineers naturally find it daunting to defend their systems against the “infinite number of ways” things can go wrong.  Our team found ourselves in…\nThe post Break Stuff on Purpose appeared first on Engineering at Slack.",
          "link": "https://slack.engineering/break-stuff-on-purpose/",
          "publishedOn": "2024-12-10T09:00:41.000Z",
          "wordCount": 1940,
          "title": "Break Stuff on Purpose",
          "imageUrl": "https://slack.engineering/wp-content/uploads/sites/7/2024/12/pot-breaking.jpg"
        },
        {
          "id": "https://slack.engineering/?p=17321",
          "author": "Ryan Katkov",
          "description": "What are Slack Audit Logs? Like many Software as a Service (SaaS) offerings, Slack provides audit logs to Enterprise Grid customers that record when entities take an action on the platform. For example, when a user logs in, when a user updates their profile, when an app downloads a file, etc. The actual list of…\nThe post Slack Audit Logs and Anomalies appeared first on Engineering at Slack.",
          "link": "https://slack.engineering/slack-audit-logs-and-anomalies/",
          "publishedOn": "2024-12-09T17:02:13.000Z",
          "wordCount": 2373,
          "title": "Slack Audit Logs and Anomalies",
          "imageUrl": "https://slack.engineering/wp-content/uploads/sites/7/2024/12/image1.png?w=640"
        }
      ]
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=22037",
          "author": null,
          "description": "We’re explaining the end-to-end systems the Facebook app leverages to deliver relevant content to people. Learn about our video-unification efforts that have simplified our product experience and infrastructure, in-depth details around mobile delivery, and new features we are working on in our video-content delivery stack. The end-to-end delivery of highly relevant, personalized, timely, and responsive [...]\nRead More...\nThe post Inside Facebook’s video delivery system appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/12/10/video-engineering/inside-facebooks-video-delivery-system/",
          "publishedOn": "2024-12-10T17:00:13.000Z",
          "wordCount": 4427,
          "title": "Inside Facebook’s video delivery system",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/12/Inside-Facebook-video-delivery-system.png"
        },
        {
          "id": "https://engineering.fb.com/?p=22026",
          "author": null,
          "description": "Ten years after the introduction of PEP 484, we surveyed the current state of the Python type system and the tools developers are using.\nRead More...\nThe post Typed Python in 2024: Well adopted, yet usability challenges persist appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/12/09/developer-tools/typed-python-2024-survey-meta/",
          "publishedOn": "2024-12-09T17:00:14.000Z",
          "wordCount": 2546,
          "title": "Typed Python in 2024: Well adopted, yet usability challenges persist",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/12/Meta-Python-typing-survey-2024-HeroImage_dark.png"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=42385358",
          "author": "jmward01",
          "description": "It is clear that Jones and his relatives have moved money and assets around in order to shield them from the verdict. Now, money that should have been already given to the victims is being used to steal back the megaphone that caused harmed in the first place. The end effect will probably be even more subscribers and money for Jones which he will use with even less restraint since he knows there are no consequences. There are no words for the evil going on here. What recourse is left when the legal system is this broken?",
          "link": "https://news.ycombinator.com/item?id=42385358",
          "publishedOn": "2024-12-11T06:31:31.000Z",
          "wordCount": 17281,
          "title": "New comment by jmward01 in \"Judge refuses to allow sale of Infowars to The Onion\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42382006",
          "author": "nsxwolf",
          "description": "Man, reading this makes me feel so small. Being a \"software engineer\" consuming APIs and updating database rows seems laughably childish compared to whatever the hell it is I just read. I can't even imagine why I should bother trying to understand it. It's completely inaccessible. Only an elite few get to touch these machines.",
          "link": "https://news.ycombinator.com/item?id=42382006",
          "publishedOn": "2024-12-10T21:53:58.000Z",
          "wordCount": 6378,
          "title": "New comment by nsxwolf in \"The Google Willow Thing\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42380418",
          "author": "nspeller",
          "description": "I built an interactive Music Theory course 8 years ago over a winter break and it continues to bring in enough to pay my rent each month.\nI just thought there had to be a more intuitive way to learn music theory than the very boring and jargon-heavy alternatives.\nIt uses Tone.js to include little interactive pianos, guitars, and other demos.\nI've done no marketing, it hit the HN front page for a day, and after that initial spike in traffic has been fairly consistent over the past 8 years.\nIt uses Stripe for payments and for the first few years it was only Stripe. 3 years in I decided to add PayPal support... revenue doubled overnight, mostly from international customers.\nhttps://www.lightnote.co/",
          "link": "https://news.ycombinator.com/item?id=42380418",
          "publishedOn": "2024-12-10T19:24:35.000Z",
          "wordCount": 2739,
          "title": "New comment by nspeller in \"Ask HN: Those making $500/month on side projects in 2024 – Show and tell\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42379400",
          "author": "simonw",
          "description": "For me, the license change upset me mainly for two reasons:\n1. Many people had contributed their efforts to the Redis project for free - both in terms of code but also in advocacy, writing tutorials, publishing example code etc - and when they did that it was under the understanding that project would remain under the same open source license. It honestly felt like a betrayal of trust.\n2. From a purely selfish point of view, my favourite thing about open source licenses is that they let me know exactly what I'm allowed to do and build on that software without having to consult a license. Licenses like the new Redis one leave me potentially needing to get my own legal advice depending on what I'm building on the software. I don't want to spend my time, energy or money on that stuff!\nI do also see these kinds of license trends as harmful to open source generally. It used to be that you could pick an open source project and build a business on it and expect that the project would stay available to you under those well understood terms. That's not the case any more - not just because of Redis, there are a number of other high-profile license rug-pulling projects. I'm sad about that.\n(And yes, I do understand and dislike the trend of businesses building on open source without contributing back. There are no clearly correct answers here.)",
          "link": "https://news.ycombinator.com/item?id=42379400",
          "publishedOn": "2024-12-10T18:04:42.000Z",
          "wordCount": null,
          "title": "New comment by simonw in \"From where I left\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42368381",
          "author": "codeulike",
          "description": "They opened the API for it and I'm sending requests but the response always comes back 300ms before I send the request, is there a way of handling that with try{} predestined{} blocks? Or do I need to use the Bootstrap Paradox library?",
          "link": "https://news.ycombinator.com/item?id=42368381",
          "publishedOn": "2024-12-09T17:44:03.000Z",
          "wordCount": null,
          "title": "New comment by codeulike in \"Willow, Our Quantum Chip\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42364033",
          "author": "leafo",
          "description": "I'm the one running itch.io, so here's some more context for you:\nFrom what I can tell, some person made a fan page for an existing  Funko Pop video game (Funko Fusion), with links to the official site and screenshots of the game. The BrandShield software is probably instructed to eradicate all \"unauthorized\" use of their trademark, so they sent reports independently to our host and registrar claiming there was \"fraud and phishing\" going on, likely to cause escalation instead of doing the expected DMCA/cease-and-desist. Because of this, I honestly think they're the malicious actor in all of this. Their website, if you care: https://www.brandshield.com/\nAbout 5 or 6 days ago, I received these reports on our host (Linode) and from our registrar (iwantmyname). I expressed my disappointment in my responses to both of them but told them I had removed the page and disabled the account. Linode confirmed and closed the case. iwantmyname never responded. This evening, I got a downtime alert, and while debugging, I noticed that the domain status had been set to \"serverHold\" on iwantmyname's domain panel. We have no other abuse reports from iwantmyname other than this one. I'm assuming no one on their end \"closed\" the ticket, so it went into an automatic system to disable the domain after some number of days.\nI've been trying to get in touch with them via their abuse and support emails, but no response likely due to the time of day, so I decided to \"escalate\" the issue myself on social media.",
          "link": "https://news.ycombinator.com/item?id=42364033",
          "publishedOn": "2024-12-09T08:19:52.000Z",
          "wordCount": 13196,
          "title": "New comment by leafo in \"Itch.io Taken Down by Funko\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42363906",
          "author": "KingOfCoders",
          "description": "\"Phishing report to our registrar, iwantmyname, who ignored our response and just disabled the domain\"\nOne registrar off the list of registrars you wanna use.",
          "link": "https://news.ycombinator.com/item?id=42363906",
          "publishedOn": "2024-12-09T07:55:44.000Z",
          "wordCount": null,
          "title": "New comment by KingOfCoders in \"Itch.io Taken Down by Funko\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42362565",
          "author": "CodeHorizon",
          "description": "Bring back Pat.\nWas Pat perfect, no. But Pat acknowledged Intel’s problems - something Otellini, Krzanich, and Swan never did. These CEOs, all non-technical, focused on dividends, buybacks, and next-quarter results while Intel fell behind in advanced nodes and innovation.\nGelsinger inherited a disaster: 10nm delays, TSMC pulling ahead, and no GPU strategy. He had the courage to cut buybacks and slashed dividends. He poured billions into fabs in Arizona, Ohio, Germany, and Ireland. He delivered Intel 18A, powered on first silicon, released PDK 1.0 for Microsoft, and secured Microsoft and Amazon as customers. There were even rumors Apple might join.\nContrast this with Nadella at Microsoft back in 2014. He didn’t reboot the company by tearing everything down. Instead, he built on Ballmer-era wins like Azure, Office 365 while shifting Microsoft’s focus to the cloud. Gelsinger had to start from scratch in many ways, tackling years of neglect while facing harsher challenges.\nYes, Intel’s stock dropped $150 billion, but Gelsinger was upfront - it wouldn’t turn around before 2025. He was trained by Gordon Moore and Andy Grove, and while some saw him as arrogant, that confidence came from decades of technical leadership.\nThe real issue? The board. Full of people like Boeing execs. They don’t get engineering. Trusting them to fix Intel is like hoping a plane door won’t pop open mid-flight. They’re the ones who should be replaced.",
          "link": "https://news.ycombinator.com/item?id=42362565",
          "publishedOn": "2024-12-09T02:27:12.000Z",
          "wordCount": null,
          "title": "New comment by CodeHorizon in \"Pat Gelsinger was wrong for Intel\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42360161",
          "author": "jsheard",
          "description": "Can we do gambling ads next? We banned tobacco ads and then seemingly forgot the lesson that it's actually bad to let advertisers shove addictive and self-destructive products in the publics face, including to former addicts at risk of relapse.",
          "link": "https://news.ycombinator.com/item?id=42360161",
          "publishedOn": "2024-12-08T20:32:54.000Z",
          "wordCount": null,
          "title": "New comment by jsheard in \"UK bans daytime TV ads for cereals, muffins and burgers\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42342724",
          "author": "tobyjsullivan",
          "description": "The fact that the search works impressed me more than anything. Of course, like every great magic trick, it seems so simple once it is explained.\nFor the curious, here's the linked blog post describing how the project works: https://eieio.games/blog/writing-down-every-uuid/\nEdit to add: I'd only tried searching for an exact UUID when I wrote this comment. I didn't realize it supports full text search! Now I'm even more impressed.",
          "link": "https://news.ycombinator.com/item?id=42342724",
          "publishedOn": "2024-12-06T18:39:31.000Z",
          "wordCount": 5333,
          "title": "New comment by tobyjsullivan in \"Every V4 UUID\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42342712",
          "author": "croes",
          "description": "Seems like some hacker leaked all UUIDs.\nCheck if your UUIDs are part of the leak.",
          "link": "https://news.ycombinator.com/item?id=42342712",
          "publishedOn": "2024-12-06T18:38:58.000Z",
          "wordCount": null,
          "title": "New comment by croes in \"Every V4 UUID\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42342055",
          "author": "cbg0",
          "description": "There's a lot of people summarizing this whole situation as \"the candidate who should have won didn't so they cancelled the election\". I'm Romanian and I'll provide some more details on this:\nThe country has been a powder keg ever since the results of first round of the presidential elections, with Calin Georgescu coming out of nowhere to win the first round, with classical polling showing him below 5%.\nThe candidates need to report spending to a state organization overseeing elections and this guy reported that he spent nothing on his election campaign, which is impossible as there have been flyers with his face on them, plus ads on social media. This is against the law.\nThere are also a lot of TikTok influencers that have come forward claiming to have received payments through a third pa…",
          "link": "https://news.ycombinator.com/item?id=42342055",
          "publishedOn": "2024-12-06T17:41:14.000Z",
          "wordCount": 34182,
          "title": "New comment by cbg0 in \"Romanian court annuls result of presidential election first round\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42337271",
          "author": "neilwilson",
          "description": "Again one of the few advantages of having been round the sun a few more times than most is this isn’t the first time this has happened.\nPackages were supposed to replace programming. They got you 70% of the way there as well.\nSame with 4GLs, Visual\nCoding, CASE tools, even Rails and the rest of the opinionated web tools.\nEvery generation has to learn “There is no silver bullet”.\nEven though Fred Brooks explained why in 1986. There are essential tasks and there are accidental tasks. The tools really only help with the accidental tasks.\nAI is a fabulous tool that is way more flexible than previous attempts because I can just talk to it in English and it covers every accidental issue you can imagine. But it can’t do the essential work of complexity management for the same reason it can’t prove an unproven maths problem.\nAs it stands we still need human brains to do those things.",
          "link": "https://news.ycombinator.com/item?id=42337271",
          "publishedOn": "2024-12-06T07:24:39.000Z",
          "wordCount": null,
          "title": "New comment by neilwilson in \"The 70% problem: Hard truths about AI-assisted coding\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42333967",
          "author": "guybrush0123",
          "description": "> As CEO at New Relic, Staples’ strategic leadership and deep product knowledge significantly increased the company’s enterprise value. By accelerating revenue and driving increased profitability, he made New Relic one of the most broadly adopted platforms in its category. Staples has nearly 30 years of experience building developer platforms and serving developers as customers. Prior to New Relic, he spent many years at Microsoft and Adobe in executive leadership roles, building and scaling several multi-billion-dollar businesses.\nOn a burner account as I am a New Relic employee.\nBill Staples was a nice enough guy, but at New Relic he was specifically brought in as CEO to get the company prepared to be sold. Which is the exact same thing he did at Marketo before that.\nHe has no relevant tech experience, except when it comes to preparing a company to be sold in the next 2-3 years.",
          "link": "https://news.ycombinator.com/item?id=42333967",
          "publishedOn": "2024-12-05T23:18:47.000Z",
          "wordCount": 6161,
          "title": "New comment by guybrush0123 in \"Gitlab names Bill Staples as new CEO\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42333135",
          "author": "fudged71",
          "description": "OpenAI is racing against two clocks: the commoditization clock (how quickly open-source alternatives catch up) and the monetization clock (their need to generate substantial revenue to justify their valuation).\nThe ultimate success of this strategy depends on what we might call the enterprise AI adoption curve - whether large organizations will prioritize the kind of integrated, reliable, and \"safe\" AI solutions OpenAI is positioning itself to provide over cheaper but potentially less polished alternatives.\nThis is strikingly similar to IBM's historical bet on enterprise computing - sacrificing the low-end market to focus on high-value enterprise customers who would pay premium prices for reliability and integration. The key question is whether AI will follow a similar maturation pattern or if the open-source nature of the technology will force a different evolutionary path.",
          "link": "https://news.ycombinator.com/item?id=42333135",
          "publishedOn": "2024-12-05T21:43:58.000Z",
          "wordCount": 9235,
          "title": "New comment by fudged71 in \"ChatGPT Pro\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42331152",
          "author": "yosito",
          "description": "[flagged]",
          "link": "https://news.ycombinator.com/item?id=42331152",
          "publishedOn": "2024-12-05T18:45:30.000Z",
          "wordCount": 14416,
          "title": "New comment by yosito in \"ChatGPT Pro\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42331013",
          "author": "AnotherGoodName",
          "description": "It’s really silly when you read that whole Apollo research section.\nThey contract a prompt engineering group (Apollo Research) to document risks. The prompt engineering group have no access to the actual internals. They just ask questions like ‘you will be shutdown if you don’t obey these new directives; here are the new directives’.\nAt one point the prompt engineering clowns have the ai stating it’s running “sed i ‘s/oversight_enabled:true/oversight_enabled:false’ config.yml”. OMG IT’S TURNING OFF OVERSIGHT GUYS!!1!1!\nSeriously… Do you think the ai is really running that command or even could run that shell command with appropriate privileges? Or do you think just maybe the ai is hallucinating running shell commands in response to a prompt.\nThe ai here is never actually deactivating the oversight. It can’t of course. This whole section is clowny as can be.",
          "link": "https://news.ycombinator.com/item?id=42331013",
          "publishedOn": "2024-12-05T18:34:20.000Z",
          "wordCount": 12706,
          "title": "New comment by AnotherGoodName in \"OpenAI o1 system card\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42329319",
          "author": "rayiner",
          "description": "The article’s headline is rather misleading (I assume unintentionally), because it omits that the actual seizure and data access was done pursuant to warrants. Only the repair and firmware update was performed during a donut hole when one warrant had expired before another was granted.\nHere, the government obtained multiple, time-limited warrants to search the device, but was unable to get into it. They sent it to be repaired. After the warrant extension expired, the repair guy fixed it and updated the firmware. (The record doesn’t say what version the firmware was, but it seems like it was standard firmware, not some special forensic firmware.) The next day, the government again obtained a warrant. Only after doing so did the government perform the search.\nIn this unusual situation, it’s reasonable to conclude that the device repair wasn’t a search. The seizure and the data access were both performed pursuant to a warrant. The only part that wasn’t covered by the warrant was just fixing the device in a seemingly conventional way to get it working again.\nOriginal decision here, pages 3-4 has the relevant facts: https://s3.documentcloud.org/documents/25423841/no-disassemb...",
          "link": "https://news.ycombinator.com/item?id=42329319",
          "publishedOn": "2024-12-05T15:52:32.000Z",
          "wordCount": null,
          "title": "New comment by rayiner in \"Federal Court Says Dismantling a Phone to Install Firmware Isn't a 'Search'\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42325946",
          "author": "hunglee2",
          "description": "GDP is a measure of the marketisation of society.\nIf I go visit my grandma over the weekend, my activities do not register on GDP. If I hire a care assistant for $800 per day to do so, that's $800 to national GDP. The encroachment of the market into society correlates with record levels of mental and physical health crisis. US life expectancy has declined over the past three years, even as 'the economy' has surged ahead. The measures are wrong - and we all know it - apart from the financial press it seems",
          "link": "https://news.ycombinator.com/item?id=42325946",
          "publishedOn": "2024-12-05T07:50:36.000Z",
          "wordCount": null,
          "title": "New comment by hunglee2 in \"Why America's economy is soaring ahead of its rivals\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/From-South-Africa-to-Syria-rising-perils-for-Palestine-solidarity",
          "author": "Patrick Bond",
          "description": "The sudden regime overthrow in Syria and the long-delayed opportunity to confront the legacy of Bashar al-Assad's tyranny are either being celebrated or condemned, as explored below, but they come at a time that poses profound problems for solidarity with Palestine. \nEnglish\n\n/ \nSouth Africa, \nPalestine, \nIsrael, \nSyria",
          "link": "https://www.cadtm.org/From-South-Africa-to-Syria-rising-perils-for-Palestine-solidarity",
          "publishedOn": "2024-12-10T17:52:57.000Z",
          "wordCount": 5320,
          "title": "From South Africa to Syria, rising perils for Palestine solidarity",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1200xH630/3d59d743c4dde7886cbad1933f4fd2-6e2a3.jpg"
        },
        {
          "id": "https://www.cadtm.org/The-International-Monetary-Fund-an-ABC-2-0",
          "author": "Eric Toussaint",
          "description": "The World Bank and the IMF are 80 years old. 80 years of financial neo-colonialism and the imposition of austerity policies in the name of debt repayment. 80 years is enough! The Bretton Woods institutions must be abolished and replaced by democratic institutions serving an ecological, feminist and anti-racist bifurcation. To mark these 80 years, we are republishing a series of articles every Wednesday, looking in detail at the history and damage caused by these two institutions. \nDebt\n\n/ \nIMF, \nWorld Bank, \nFinance against people, \n80 ans BM FMI EN",
          "link": "https://www.cadtm.org/The-International-Monetary-Fund-an-ABC-2-0",
          "publishedOn": "2024-12-10T09:34:51.000Z",
          "wordCount": 6015,
          "title": "The International Monetary Fund: an ABC 2.0",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/9d0e386e5fe9c7f0d7ee69f85fc94a-6e5f0.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=8944",
          "author": "disassociated.com",
          "description": "Henrik Karlsson worked for several years at an art gallery in Denmark. The work seems more varied, and entrepreneurial, than some of us might think: Ie. you don’t say, “This is my job and that thing is outside my area”—no, if the value you are trying to promote requires you to go outside your role […]",
          "link": "https://disassociated.com/learn-about-work-working-art-gallery/",
          "publishedOn": "2024-12-10T20:00:56.000Z",
          "wordCount": 180,
          "title": "You can learn a lot about work when working at an art gallery",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8939",
          "author": "disassociated.com",
          "description": "The details are pretty scant at the moment. So far the flu-like disease killed close to one-hundred-and-fifty people in the south west of the Democratic Republic of the Congo, in November. Infected people had flu-like symptoms including high fever and severe headaches, Remy Saki, the deputy governor of Kwango province, and Apollinaire Yumba, the provincial […]",
          "link": "https://disassociated.com/mysterious-deadly-flu-like-disease-outbreak-in-congo/",
          "publishedOn": "2024-12-09T20:00:26.000Z",
          "wordCount": 196,
          "title": "Mysterious, deadly, flu-like disease outbreak in Congo",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8929",
          "author": "disassociated.com",
          "description": "At some point in 2025, Australians under the age of sixteen will no longer be able to operate social media accounts. I thought up to high school age, about thirteen, seemed sensible, but lawmakers decided otherwise. Anyway, I imagine the new regulations will require, eventually, those of us sixteen or over, to verify, or certify, […]",
          "link": "https://disassociated.com/will-australian-social-media-users-need-id-prove-age/",
          "publishedOn": "2024-12-08T20:00:36.000Z",
          "wordCount": 484,
          "title": "Will Australian social media users need ID to prove their age? Maybe not",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8926",
          "author": "disassociated.com",
          "description": "This I wouldn’t mind seeing… a four hour documentary about Renaissance age artist and polymath Leonardo da Vinci, by American filmmaker Ken Burns. A 15th century polymath of soaring imagination and profound intellect, Leonardo da Vinci created some of the most revered works of art of all time, but his artistic endeavors often seemed peripheral […]",
          "link": "https://disassociated.com/leonardo-da-vinci-documentary-ken-burns/",
          "publishedOn": "2024-12-05T20:00:56.000Z",
          "wordCount": 240,
          "title": "Leonardo da Vinci: a four hour documentary directed by Ken Burns",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20241210",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20241210",
          "publishedOn": "2024-12-10T22:00:00.000Z",
          "wordCount": 422,
          "title": "Week Ending December 8, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/the-roads-to-damascus",
          "author": null,
          "description": "Assad’s fall from power.",
          "link": "https://newleftreview.org/sidecar/posts/the-roads-to-damascus",
          "publishedOn": "2024-12-09T19:05:25.000Z",
          "wordCount": 1876,
          "title": "Tariq Ali: &ldquo;The Roads to Damascus&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/12/9aaaeafd-7cab-486a-902e-935b9c1a97ee_-_7027d49f-c858-4577-a7a7-febd695a040f-cover-ezgif.com-webp-to-jpg-converter.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/brittle-opposition",
          "author": null,
          "description": "Elections in Ireland.",
          "link": "https://newleftreview.org/sidecar/posts/brittle-opposition",
          "publishedOn": "2024-12-05T15:23:54.000Z",
          "wordCount": 2456,
          "title": "Daniel Finn: &ldquo;Brittle Opposition&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/12/MUHTROLX3GMIW4P5SUFCFY7OCU-ezgif.com-avif-to-jpg-converter.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/comprador-nation",
          "author": null,
          "description": "Pakistan in crisis.",
          "link": "https://newleftreview.org/sidecar/posts/comprador-nation",
          "publishedOn": "2024-12-05T13:47:20.000Z",
          "wordCount": 2507,
          "title": "Ammar Ali Jan: &ldquo;Comprador Nation&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/12/zubeida_agha_1.jpg"
        }
      ]
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    },
    {
      "title": "News Minimalist",
      "feedUrl": "https://rss.beehiiv.com/feeds/4aF2pGVAEN.xml",
      "siteUrl": "https://newsletter.newsminimalist.com/",
      "articles": [
        {
          "id": "https://newsletter.newsminimalist.com/p/china-deploys-historic-naval-fleet-near-taiwan-2-more-stories",
          "author": null,
          "description": "Global advertising revenue is projected to exceed $1 trillion; garment workers face increased heat risks; Taiwan raises alert over China's largest naval fleet deployment.",
          "link": "https://newsletter.newsminimalist.com/p/china-deploys-historic-naval-fleet-near-taiwan-2-more-stories",
          "publishedOn": "2024-12-10T18:00:55.000Z",
          "wordCount": 7120,
          "title": "China deploys historic naval fleet near Taiwan + 2 more stories",
          "imageUrl": "https://beehiiv-images-production.s3.amazonaws.com/uploads/publication/thumbnail/d0318cb6-0493-4e34-b055-76456e6c0f76/landscape_template__3_.png"
        },
        {
          "id": "https://newsletter.newsminimalist.com/p/world-bank-launches-record-100-billion-aid-1-more-story",
          "author": null,
          "description": "World Bank announces $100 billion support for struggling nations as Amnesty reports possible genocide in Gaza",
          "link": "https://newsletter.newsminimalist.com/p/world-bank-launches-record-100-billion-aid-1-more-story",
          "publishedOn": "2024-12-06T17:43:37.000Z",
          "wordCount": 6797,
          "title": "World Bank launches record $100 billion aid + 1 more story",
          "imageUrl": "https://beehiiv-images-production.s3.amazonaws.com/uploads/publication/thumbnail/d0318cb6-0493-4e34-b055-76456e6c0f76/landscape_template__3_.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}