{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "c7447db6c34719e72bdc50b8f0ffb80c00a60878",
          "author": "Donnie Prakoso",
          "description": "The new AWS Asia Pacific (Malaysia) Region bolsters cloud innovation, empowering local businesses and government initiatives while aligning with Malaysia's sustainability goals through Amazon's renewable energy commitment.",
          "link": "https://aws.amazon.com/blogs/aws/now-open-aws-asia-pacific-malaysia-region/",
          "publishedOn": "2024-08-22T01:03:25.000Z",
          "wordCount": 2018,
          "title": "Now open — AWS Asia Pacific (Malaysia) Region",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/07/25/2024-07-awsnews-malaysia-788x630.jpg"
        },
        {
          "id": "7c92c240b5751fb505e0a2c423b6891c4fe90c69",
          "author": "Sébastien Stormacq",
          "description": "AWS CodeBuild now supports macOS, simplifying CI/CD pipelines for Apple apps, using managed M2 machines with pre-installed tools like Xcode. Auto scale capacity seamlessly while CodeBuild manages the fleet.",
          "link": "https://aws.amazon.com/blogs/aws/add-macos-to-your-continuous-integration-pipelines-with-aws-codebuild/",
          "publishedOn": "2024-08-19T21:14:31.000Z",
          "wordCount": 2455,
          "title": "Add macOS to your continuous integration pipelines with AWS CodeBuild",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/08/05/codebuild-feat-img.png"
        },
        {
          "id": "204a9127d101972ff3aeb38af0a2c2198f16f9ba",
          "author": "Prasad Rao",
          "description": "You know what I find more exciting than the Amazon Prime Day sale? Finding out how Amazon Web Services (AWS) makes it all happen. Every year, I wait eagerly for Jeff Barr’s annual post to read the chart-topping metrics. The scale never ceases to amaze me. This year, Channy Yun and Jeff Barr bring us […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-g6e-instances-karpenter-amazon-prime-day-metrics-aws-certifications-update-and-more-august-19-2024/",
          "publishedOn": "2024-08-19T20:18:23.000Z",
          "wordCount": 1944,
          "title": "AWS Weekly Roundup: G6e instances, Karpenter, Amazon Prime Day metrics, AWS Certifications update and more (August 19, 2024)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/08/13/AWS-WIR-default.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": []
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps & Developer Productivity Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": []
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "0f5f0175f3302ce8a81549c5099bc61006d4ac3f",
          "author": "Alex Koenig",
          "description": "WebAssembly (Wasm) is a revolutionary technology that promises to bring near-native performance to web applications. However, its potential extends far beyond the browser, enabling developers to run Wasm workloads in various environments, such as cloud-native platforms like Amazon Elastic Kubernetes Service (Amazon EKS). In this post, you can explore how AWS empowers users to harness […]",
          "link": "https://aws.amazon.com/blogs/containers/16532-2/",
          "publishedOn": "2024-08-20T14:54:00.000Z",
          "wordCount": 2379,
          "title": "How to Run WebAssembly on Amazon EKS",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/08/20/Featured-images-for-Containers-Blog-5-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=331473",
          "author": "Joshua Frank",
          "description": "Last week, the Department of Energy, which oversees the aging nuclear site in Hanford, Washington, reported that a tank containing high-level radioactive waste was leaking.  This is currently the third tank we know of that’s releasing deadly nuclear waste into the soil above the groundwater that feeds the nearby Columbia River. This is not a new problem for Hanford, which has 177 of these huge underground tanks that contain 55 million gallons of radioactive leftovers from the US’s nuclear weapons operation. These waste tanks were only supposed to hold up twenty-thirty years, and we’re now going on six decades. Below is an excerpt from my book Atomic Days, which details the site’s sordid history and its extremely problematic future. Sadly, leaks at Hanford are nothing new, nor are the lies surrounding them. It’s a looming nuclear danger that’s bubbling in our own backyard, and I’m scared. You should be too.  More\nThe post Of Leaks and Lies: A Looming Nuclear Catastrophe Threatens the Pacific Northwest appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/22/of-leaks-and-lies/",
          "publishedOn": "2024-08-22T06:12:09.000Z",
          "wordCount": null,
          "title": "Of Leaks and Lies: A Looming Nuclear Catastrophe Threatens the Pacific Northwest",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331282",
          "author": "Rob Larson",
          "description": "Defenders of ruling elites have seldom been satisfied with the argument that the rich deserve their wealth because of their grudging willingness to provide jobs for everyone else. Very commonly, the tendency is to celebrate the rich and powerful as being different kinds of people from the rest of us—suggesting that they built their gigantic companies up from scratch by their own almost miraculously superior knowledge, relentless drive, and willingness to make tough calls. More\nThe post The Best Families:  Enduring Ruling-class Alibis appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/22/the-best-families-enduring-ruling-class-alibis/",
          "publishedOn": "2024-08-22T06:00:12.000Z",
          "wordCount": null,
          "title": "The Best Families:  Enduring Ruling-class Alibis",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331264",
          "author": "M. Reza Behnam",
          "description": "Israel’s claim to self-defense is never questioned.  Although it has one of the strongest modern militaries (581 aircraft, including F-15, F-16 and advanced stealth F-35 fighter jets), possesses the latest air defense systems, stockpiles 400 nuclear weapons with delivery systems, and has the United States, the world’s largest military power, standing ready to protect it, we are to believe that Israel is in physical danger.  More\nThe post Does Any Other Country Besides Israel Have the Right to Defend Itself? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/22/does-any-other-country-besides-israel-have-the-right-to-defend-itself/",
          "publishedOn": "2024-08-22T05:58:04.000Z",
          "wordCount": null,
          "title": "Does Any Other Country Besides Israel Have the Right to Defend Itself?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331370",
          "author": "Benjamin Dangl",
          "description": "Armored trucks and rogue military officers filled La Paza’s central Plaza Murillo once again this past June in a failed coup attempt against Bolivian President Luis Arce. This right-wing effort at seizing power harkened back to 2019, when another coup successfully overthrew the government of President Evo Morales, leading to massacres and widespread repression. The 2019-2020 coup government of Jeanine Áñez was ultimately defeated by the country’s social movements and the Movement Toward Socialism (MAS). More\nThe post Defending Democracy from the Streets in Bolivia appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/22/defending-democracy-from-the-streets-in-bolivia/",
          "publishedOn": "2024-08-22T05:57:27.000Z",
          "wordCount": null,
          "title": "Defending Democracy from the Streets in Bolivia",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331352",
          "author": "David Bacon",
          "description": "On August 17, a group of committed migrant activists set forth on a three-day march from Silicon Valley to San Francisco, highlighting the choices for progressive candidates in the coming November election. Should their campaigns amplify the hysteria about an immigration “crisis,” or should they speak the truth to the American people about the border and the roots of migration? Even more important, these marchers are providing a practical way for activists and political leaders to advocate for rights as they work to defeat the threat of MAGA racism. More\nThe post Treating Migrants as the Enemy Provides No Vision for the Future appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/22/treating-migrants-as-the-enemy-provides-no-vision-for-the-future/",
          "publishedOn": "2024-08-22T05:55:06.000Z",
          "wordCount": null,
          "title": "Treating Migrants as the Enemy Provides No Vision for the Future",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331453",
          "author": "Dean Baker",
          "description": "I don’t have time to do an exhaustive analysis of the implication of the downward revisions to the jobs numbers today, but I will make a few quick points. First, the people complaining that this downward revision exposes cooked jobs data in prior months need to get their heads screwed on straight. Let’s just try  More\nThe post Mixed Story: What the Revision to the Jobs Data Means appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/22/mixed-story-what-the-revision-to-the-jobs-data-means/",
          "publishedOn": "2024-08-22T05:53:35.000Z",
          "wordCount": null,
          "title": "Mixed Story: What the Revision to the Jobs Data Means",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331447",
          "author": "Medea Benjamin - Nicolas J. S. Davies",
          "description": "An Orwellian disconnect haunts the 2024 Democratic National Convention. In the isolation of the convention hall, shielded from the outside world behind thousands of armed police, few of the delegates seem to realize that their country is on the brink of direct involvement in major wars with Russia and Iran, either of which could escalate  More\nThe post The DNC Fiddles While the World Burns appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/22/the-dnc-fiddles-while-the-world-burns/",
          "publishedOn": "2024-08-22T05:51:16.000Z",
          "wordCount": null,
          "title": "The DNC Fiddles While the World Burns",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331467",
          "author": "Chris Houston",
          "description": "A plane crash, an unusually named store, and a celebrated coin caught my attention this week. A common theme of these events was symbolism. This week, I reflect on symbols of peace, and symbols of war. I fear that too many people think war is normal. We encounter symbols of conflict frequently, and our everyday  More\nThe post The Power of Symbols: War & Peace appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/22/the-power-of-symbols-war-peace/",
          "publishedOn": "2024-08-22T05:50:28.000Z",
          "wordCount": null,
          "title": "The Power of Symbols: War & Peace",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331486",
          "author": "Stewart Lawrence",
          "description": "Some politicians give opportunism a bad name. A case in point is Robert F. Kennedy Jr., nephew of JFK and son of Robert Kennedy, two of the most beloved figures – and martyrs – in the annals of the Democratic party. When RFK Jr., then a lifelong Democrat. launched his quixotic bid for the White  More\nThe post RFK Jr. and the Politics of Opportunism appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/22/rfk-jr-and-the-politics-of-opportunism/",
          "publishedOn": "2024-08-22T05:47:33.000Z",
          "wordCount": null,
          "title": "RFK Jr. and the Politics of Opportunism",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331348",
          "author": "Nina Silber",
          "description": "Few Americans today know about the events that occurred 75 years ago in the small Hudson Valley community of Peekskill, New York. That’s where a riot broke out at a folk concert that marked a significant turning point in the political landscape of the post-World War II era. The riot sharpened the dividing lines and  More\nThe post 75 Years Ago, the KKK and Anti-Communists Teamed up to Violently Stop a Folk Concert in NY appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/22/75-years-ago-the-kkk-and-anti-communists-teamed-up-to-violently-stop-a-folk-concert-in-ny/",
          "publishedOn": "2024-08-22T05:37:11.000Z",
          "wordCount": null,
          "title": "75 Years Ago, the KKK and Anti-Communists Teamed up to Violently Stop a Folk Concert in NY",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331201",
          "author": "Julie Wark",
          "description": "More often than not, the dead do not return to rejoin the living but rather to lead them into some dreadful snare, entrapping them with disastrous consequences [… What] haunts are not the dead, but the gaps left within us by the secrets of others. – Nicolas Abraham I was about six when I learned  More\nThe post Secret Histories appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/21/secret-histories/",
          "publishedOn": "2024-08-21T06:00:39.000Z",
          "wordCount": null,
          "title": "Secret Histories",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331410",
          "author": "CounterPunch News Service",
          "description": "As former President Barack Obama prepared to speak at the Democratic National Convention in Chicago on the evening of August 20, pro-Palestine protestors outside the Consulate General of Israel were arrested. Over fifty-five arrests were reported, including press members—photos by Steel Brooks.  \nThe post Numerous Pro-Palestine Protestors Arrested Outside Consulate of Israel Chicago appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/21/numerous-pro-palestine-protestors-arrested-outside-consulate-of-israel-chicago/",
          "publishedOn": "2024-08-21T05:59:38.000Z",
          "wordCount": null,
          "title": "Numerous Pro-Palestine Protestors Arrested Outside Consulate of Israel Chicago",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331366",
          "author": "Yoav Litvin",
          "description": "In a recent article in the New York Times titled “Bari Weiss Knows Exactly What She’s Doing,” Matt Flegenheimer writes: As the founder, public face and heat-seeking curator of The Free Press, a new media company with ambitions to overtake the old media, Ms. Weiss, 40, has identified a mélange of reliable foils: the illiberal left; diversity, equity and  More\nThe post Bari Weiss, Zionist Crusaders, and The Era of The Toxic Troll appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/21/bari-weiss-zionist-crusaders-and-the-era-of-the-toxic-troll/",
          "publishedOn": "2024-08-21T05:57:34.000Z",
          "wordCount": null,
          "title": "Bari Weiss, Zionist Crusaders, and The Era of The Toxic Troll",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331359",
          "author": "Jamal Kanj",
          "description": "Israel escaped a certain military retaliation last week when Joe Biden hastily called to start a new round of ceasefire negotiations —a ploy likely succeeded in delaying a planned reprisals against Israel for its aggression in Tehran, Yemen, and Beirut. Previously, the Palestinians have agreed to multiple revised American ceasefire proposals. Each time, however, Benjamin  More\nThe post The Mirage of Ceasefire in Gaza appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/21/the-mirage-of-ceasefire-in-gaza/",
          "publishedOn": "2024-08-21T05:57:06.000Z",
          "wordCount": null,
          "title": "The Mirage of Ceasefire in Gaza",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331389",
          "author": "Binoy Kampmark",
          "description": "Be happy.  Think of your wellness.  Across organisations, private and public entities, government bodies and social clubs, the cult of contrived happiness abounds with ritualistic, clotting repetition.  In such cases, the forced grin, the pressured smile, the affected giggle, have become part of a project of puppeteering, manipulation and manufacture.  Critics of such approaches are ostracised, treated as leprous  More\nThe post Wellness as Tyranny: The Cult of Toxic Happiness appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/21/wellness-as-tyranny-the-cult-of-toxic-happiness/",
          "publishedOn": "2024-08-21T05:55:38.000Z",
          "wordCount": null,
          "title": "Wellness as Tyranny: The Cult of Toxic Happiness",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331361",
          "author": "Chris Houston",
          "description": "“The vast majority of my people are in refugee camps or in apartheid villages, struggling every day just to make a living… They deserve to have a biography, not someone like me, living in Canada with a decent job in the government,” said Raïss Tinmaung. Tinmaung is Rohingya and when we met last month in  More\nThe post Beyond Refuge: Empowering Rohingya to Lead Their Own Future appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/21/beyond-refuge-empowering-rohingya-to-lead-their-own-future/",
          "publishedOn": "2024-08-21T05:55:37.000Z",
          "wordCount": null,
          "title": "Beyond Refuge: Empowering Rohingya to Lead Their Own Future",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331260",
          "author": "Lawrence Davidson",
          "description": "On 6 August 1945, President Harry Truman announced to the world that one U.S. airplane, named the Enola Gay, had “dropped one bomb on Hiroshima.” The bomb had the equivalent “power of 200,000 tons of T.N.T.” That single bomb killed 140,000 people in a matter of minutes. Truman went on to say that “We are  More\nThe post Nagasaki, the Gaza Strip, and the Denial of Truth appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/21/nagasaki-the-gaza-strip-and-the-denial-of-truth/",
          "publishedOn": "2024-08-21T05:55:15.000Z",
          "wordCount": null,
          "title": "Nagasaki, the Gaza Strip, and the Denial of Truth",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331199",
          "author": "Peter Bach",
          "description": "Commentator: ‘The Premier League season, with all its daft cash and crazy splendour, with all its nifty footwork and gifted stars, has commenced. Let us not forget, ladies and gentlemen, the most goals EVER were scored last season. Football, soccer, is upon us once more…’ I have friends whose eyes glaze over if I enthuse  More\nThe post Letter from London: Hoof and Feint appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/21/letter-from-london-hoof-and-feint/",
          "publishedOn": "2024-08-21T05:53:27.000Z",
          "wordCount": null,
          "title": "Letter from London: Hoof and Feint",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331364",
          "author": "Andrea Mazzarino",
          "description": "One thing our government doesn’t like doing is challenging the greed of health insurance companies. I can speak with some authority about holes in the ever-fraying safety net of our healthcare system, including Tricare, the military health insurance plan used by most troops, veterans, and their families, other employer-sponsored health insurance, state-sponsored care like Medicare  More\nThe post Deep Corporate America appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/21/deep-corporate-america/",
          "publishedOn": "2024-08-21T05:42:20.000Z",
          "wordCount": null,
          "title": "Deep Corporate America",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331346",
          "author": "Dean Baker",
          "description": "No one expects serious economic analysis from the Washington Post’s conservative columnists and Mark Theissen doesn’t let us down. Theissen starts off by reminding of one of Larry Summers’ most embarrassing moments: “Nonetheless, as president of the Senate, Harris cast the deciding vote to pass the catastrophically misnamed ‘American Rescue Plan’ with only Democratic votes  More\nThe post The Washington Post’s Conservative Columnists Just Make it Up appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/21/the-washington-posts-conservative-columnists-just-make-it-up/",
          "publishedOn": "2024-08-21T05:40:50.000Z",
          "wordCount": null,
          "title": "The Washington Post’s Conservative Columnists Just Make it Up",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331263",
          "author": "Jon Hochschartner",
          "description": "I was excited to see Upside Foods and the Institute of Justice had filed a lawsuit in federal court seeking to overturn Florida’s ban on cultivated-meat sales. For those who don’t know, cultivated meat is grown from livestock cells, without slaughter. It offers a number of potential animal welfare, public health and environmental benefits. Finally,  More\nThe post The Right’s War on Cultivated-Meat appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/21/the-rights-war-on-cultivated-meat/",
          "publishedOn": "2024-08-21T05:32:15.000Z",
          "wordCount": null,
          "title": "The Right’s War on Cultivated-Meat",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331306",
          "author": "Eman Abdelhadi",
          "description": "Eman Abdelhadi’s speech from the “Bodies Outside of Unjust Laws” demonstration on Aug. 18 in Chicago. Chicago, we all know why we are here. We are drowning, and our hearts are broken. We are drowning in debt. In medical bills. In rising rents. In inflation. We are under attack in this country. The Right has declared war on people  More\nThe post “And Now They Want Our Votes” appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/20/and-now-they-want-our-votes/",
          "publishedOn": "2024-08-20T06:01:21.000Z",
          "wordCount": null,
          "title": "“And Now They Want Our Votes”",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331344",
          "author": "Norman Solomon",
          "description": "An observation from George Orwell -- “those who control the present, control the past and those who control the past control the future” -- is acutely relevant to how President Biden talked about Gaza during his speech at the Democratic convention Monday night. His words fit into a messaging template now in its eleventh month, depicting the U.S. government as tirelessly seeking peace, while supplying the weapons and bombs that have enabled Israel’s continual slaughter of civilians. More\nThe post Biden’s Convention Speech Made Absurd Claims About His Gaza Policy appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/20/bidens-convention-speech-made-absurd-claims-about-his-gaza-policy/",
          "publishedOn": "2024-08-20T05:58:48.000Z",
          "wordCount": null,
          "title": "Biden’s Convention Speech Made Absurd Claims About His Gaza Policy",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331179",
          "author": "Sam Pizzigati",
          "description": "Enormously rich people tend to get bored easily, especially those on the younger side. Stocks and bonds, such a yawn. Wealthy Baby Boomers certainly do still get a kick out of watching their financial portfolios fatten. But their Millennial and Generation Z counterparts have an added expectation. The fortunes they’re investing, they’re expecting, will be filling their lives up with fun. More\nThe post Today’s Young Mega-Millionaires Just Want to Have Fun appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/20/todays-young-mega-millionaires-just-want-to-have-fun/",
          "publishedOn": "2024-08-20T05:58:04.000Z",
          "wordCount": null,
          "title": "Today’s Young Mega-Millionaires Just Want to Have Fun",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331307",
          "author": "Binoy Kampmark",
          "description": "Ekecheiria, also known as the “Olympic Truce,” is a quaint notion dating to Ancient Greece, when three kings prone to warring against each other – Iphitos of Elis, Cleosthenes of Pisa and Lycurgus of Sparta – concluded a treaty permitting the safe passage of all athletes and spectators from the relevant city-states for the duration  More\nThe post The Distasteful Nonsense of Olympism appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/20/the-distasteful-nonsense-of-olympism/",
          "publishedOn": "2024-08-20T05:55:58.000Z",
          "wordCount": null,
          "title": "The Distasteful Nonsense of Olympism",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331313",
          "author": "Jonathan Woodrow Martin",
          "description": "I have a very intense relationship with water.  As a result of a long-term health condition, I am often feeling very thirsty and drained. I cannot go more than perhaps 15 minutes without having a sup of water until I start to feel uncomfortable. On average people in the UK use 149 litres of water per-day,  More\nThe post Water, Water, Everywhere, But Not for You, Palestinian appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/20/water-water-everywhere-but-not-for-you-palestinian/",
          "publishedOn": "2024-08-20T05:55:56.000Z",
          "wordCount": null,
          "title": "Water, Water, Everywhere, But Not for You, Palestinian",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331291",
          "author": "John P. Ruehl",
          "description": "Spanish officials reassuringly heralded a “new era” for the country after May 2024 elections. Catalonian pro-independence parties had lost the parliamentary majority that had enabled them to govern their region since 2015, and for the first time in decades, had failed to secure a majority of seats in regional parliament. Spain’s ruling Socialists meanwhile managed to emerge as Catalonia’s largest party. More\nThe post The Status of Europe’s Autonomous Movements appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/20/the-status-of-europes-autonomous-movements/",
          "publishedOn": "2024-08-20T05:55:21.000Z",
          "wordCount": null,
          "title": "The Status of Europe’s Autonomous Movements",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331315",
          "author": "Marcy Winograd",
          "description": "While University of California students chanted “Divest!” and erected “Free Palestine” encampments, a little-known pro-Israel faction of the California legislature introduced legislation to indoctrinate six million California public school children and stem the rising tide of college resistance to Israel’s genocide in Gaza. What’s in a name? They call themselves the California Legislative Jewish Caucus and they  More\nThe post Who Are They? The CA Legislative Jewish Caucus appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/20/who-are-they-the-ca-legislative-jewish-caucus/",
          "publishedOn": "2024-08-20T05:46:34.000Z",
          "wordCount": null,
          "title": "Who Are They? The CA Legislative Jewish Caucus",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331299",
          "author": "Tarique Niazi",
          "description": "Naheed Islam was not yet born in 1996, when prime minister Sheikh Hasina of Bangladesh began her first term in office. In 2009, when she was elected to her second term, Islam had just turned 11. On August 5, he brought an abrupt end to Hasina’s 15-year long autocracy. The 26-year-old Islam, a sociology major  More\nThe post The Economics Behind the Fall of Autocracy in Bangladesh appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/20/the-economics-behind-the-fall-of-autocracy-in-bangladesh/",
          "publishedOn": "2024-08-20T05:45:44.000Z",
          "wordCount": null,
          "title": "The Economics Behind the Fall of Autocracy in Bangladesh",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331182",
          "author": "Hatim Rahman",
          "description": "It was barely a decade ago that many of us became enamored by the “gig” economy. Booking a room, ride, or restaurant took seconds and could be done at virtually any time or place. A major factor enabling the gig economy to grow was organizations using algorithms to create these services. Organizations, such as Airbnb,  More\nThe post Speculative Algorithms are the New Invisible Cage for Workers appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/20/speculative-algorithms-are-the-new-invisible-cage-for-workers/",
          "publishedOn": "2024-08-20T05:40:52.000Z",
          "wordCount": null,
          "title": "Speculative Algorithms are the New Invisible Cage for Workers",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": [
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=31442",
          "author": "Nina Boyarchenko and Leonardo Elias",
          "description": "Long-run trends in increased access to credit are thought to improve real activity. However, “rapid” credit expansions do not always end well and have been shown in the academic literature to predict adverse real outcomes such as lower GDP growth and an increased likelihood of crises. Given these financial stability considerations associated with rapid credit expansions, being able to distinguish in real time “good booms” from “bad booms” is of crucial interest for policymakers. While the recent literature has focused on understanding how the composition of borrowers helps distinguish good and bad booms, in this post we investigate how the composition of lending during a credit expansion matters for subsequent real outcomes.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/08/the-disparate-outcomes-of-bank-and-nonbank-financed-private-credit-expansions/",
          "publishedOn": "2024-08-20T11:00:00.000Z",
          "wordCount": 4194,
          "title": "The Disparate Outcomes of Bank‑ and Nonbank‑Financed Private Credit Expansions",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/08/LSE_2024_disparate-credit-expansions_boyarchenko_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=31414",
          "author": "Gizem Kosar, Davide Melcangi, and Sasha Thomas",
          "description": "The Federal Reserve Bank of New York’s July 2024 SCE Labor Market Survey shows a year-over-year increase in the average reservation wage—the lowest wage respondents would be willing to accept for a new job—to $81,147, but a decline from a series’ high of $81,822 in March 2024. In this post, we investigate how the recent dynamics of reservation wages differed across individuals and how reservation wages are related to individuals’ expectations about their future labor market movements.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/08/an-update-on-the-reservation-wages-in-the-sce-labor-market-survey/",
          "publishedOn": "2024-08-19T15:00:00.000Z",
          "wordCount": 4091,
          "title": "An Update on the Reservation Wages in the SCE Labor Market Survey",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/08/LSE_2024_SCE-reservation-wage_kosar_460.jpg"
        }
      ]
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45560",
          "author": "Editor",
          "description": "from Asad Zaman and current issue of RWER Our current environmental predicament is fundamentally a crisis of knowledge, rooted in the Enlightenment’s narrow conceptualization of epistemology. This shift fostered an illusion of objectivity that has since permeated our understanding of the world, particularly in the context of societal dynamics. The Enlightenment’s emphasis on objective knowledge […]",
          "link": "https://rwer.wordpress.com/2024/08/20/the-crisis-of-knowledge-and-enlightenments-imitations/",
          "publishedOn": "2024-08-20T20:55:26.000Z",
          "wordCount": 4185,
          "title": "The crisis of knowledge and enlightenment’s imitations",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45554",
          "author": "Lars Syll",
          "description": "from Lars Syll To be fair to academia, it has realized that the pure DSGE model is incapable of explaining observable phenomena so they have introduced numerous amendments, known, oddly, as “imperfections” in the model. Long-term nominal contracts, other labour market frictions, imperfection in credit markets, all these and more are prayed in aid and, […]",
          "link": "https://rwer.wordpress.com/2024/08/19/new-keynesian-dsge-models-3/",
          "publishedOn": "2024-08-19T15:33:19.000Z",
          "wordCount": 4200,
          "title": "“New Keynesian” DSGE models",
          "imageUrl": "https://payhip.com/cdn-cgi/image/format=auto/https://pe56d.s3.amazonaws.com/o_1hmdpulj11999i721qvu1h3p1dqar.png"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45543",
          "author": "Edward Fullbrook",
          "description": "from Edward Fullbrook A few years ago, I wrote a novel that was published under a pen name and titled Two American Dreams; Which is yours?  Recently its publisher realized that, although set in the Sixties (mostly in Berkeley) this novel pertains to the coming US presidential election to a remarkable degree.  With that in […]",
          "link": "https://rwer.wordpress.com/2024/08/17/amazon-blocks-advertising-of-a-novel-whose-narrator-is-an-economist/",
          "publishedOn": "2024-08-17T17:45:18.000Z",
          "wordCount": 4088,
          "title": "Amazon blocks advertising of a novel whose narrator is an economist",
          "imageUrl": "https://m.media-amazon.com/images/I/4132jYJQ03L._SY342_.jpg"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=277120",
          "author": "Yves Smith",
          "description": "The party convention demonstrates how dangerously disconnected the DNC is about our disastrous strategies in Ukraine and the Middle East.",
          "link": "https://www.nakedcapitalism.com/2024/08/the-dnc-fiddles-while-the-world-burns.html",
          "publishedOn": "2024-08-22T06:00:31.000Z",
          "wordCount": 3586,
          "title": "The DNC Fiddles While the World Burns",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/Screen-Shot-2024-08-21-at-11.38.43-PM.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277112",
          "author": "Yves Smith",
          "description": "So how did language, and specifically syntax, develop?",
          "link": "https://www.nakedcapitalism.com/2024/08/who-invented-syntax.html",
          "publishedOn": "2024-08-22T04:37:23.000Z",
          "wordCount": 4610,
          "title": "Who Invented Syntax?",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/00-syntax-.webp"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277121",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, pandemics; Democrat National Convention vignettes ; Sabato moves North Carolina to toss-up from Republican;  new Boeing 777X and 787debacles; Covid, anosmia, and loss of executive function ~",
          "link": "https://www.nakedcapitalism.com/2024/08/200pm-water-cooler-8-21-2024.html",
          "publishedOn": "2024-08-21T18:00:25.000Z",
          "wordCount": 14632,
          "title": "2:00PM Water Cooler 8/21/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/rcp_2024-08-16.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277106",
          "author": "Yves Smith",
          "description": "Limited liability has come to cover for not just incompetent but also criminal conduct. But what to do?",
          "link": "https://www.nakedcapitalism.com/2024/08/no-one-has-a-right-to-limited-liability.html",
          "publishedOn": "2024-08-21T13:55:10.000Z",
          "wordCount": 6945,
          "title": "“No One Has a Right to Limited Liability”",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277051",
          "author": "Yves Smith",
          "description": "Our fanciful daily links: student nuclear reactor, WHO reassurance on mpox (?!?!), Middle East heat records, China housing support doubts, 25% of Brits plan not to heat this winter, Hezbollah excalating? Putin rejects negotiation, Kamala $500 million fund raise, RFK to jump to Trump? court nixes non-compete ban",
          "link": "https://www.nakedcapitalism.com/2024/08/links-8-21-2024.html",
          "publishedOn": "2024-08-21T10:55:31.000Z",
          "wordCount": 18177,
          "title": "Links 8/21/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/00-sandhilll-crane.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277092",
          "author": "Conor Gallagher",
          "description": "The favorite to succeed Jake Sullivan is a diehard Russophobe who is critical of Germany for not launching Taurus missiles at Russia.",
          "link": "https://www.nakedcapitalism.com/2024/08/kamalas-national-security-adviser-points-to-continuation-of-bidens-russia-policy.html",
          "publishedOn": "2024-08-21T10:00:37.000Z",
          "wordCount": 9570,
          "title": "Kamala’s National Security Adviser Points to Continuation of Biden’s Russia Policy",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277100",
          "author": "Yves Smith",
          "description": "Using bacteria to take a bite out of plastic pollution is not new. But can the same microbes be used as a food source?",
          "link": "https://www.nakedcapitalism.com/2024/08/can-plastic-waste-be-transformed-into-food-for-humans.html",
          "publishedOn": "2024-08-21T09:55:25.000Z",
          "wordCount": 4887,
          "title": "Can Plastic Waste Be Transformed Into Food for Humans?",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/00-plastic.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=276971",
          "author": "Yves Smith",
          "description": "Migrants in facilities overseen by the city Department of Homeless Services will start receiving notices they must leave after 60 days",
          "link": "https://www.nakedcapitalism.com/2024/08/state-greenlights-nyc-evicting-more-migrant-families-from-shelters.html",
          "publishedOn": "2024-08-21T09:42:43.000Z",
          "wordCount": 3724,
          "title": "State Greenlights NYC Evicting More Migrant Families From Shelters",
          "imageUrl": "https://i0.wp.com/www.thecity.nyc/wp-content/uploads/2023/08/port_authority_migrant_bus-scaled.jpg?resize=350%2C200&ssl=1"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277067",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, Syndemics; Democrat National Convention vignettes; Highest Covid wave in two years; Stupid money and blood money ~",
          "link": "https://www.nakedcapitalism.com/2024/08/200pm-water-cooler-8-20-2024.html",
          "publishedOn": "2024-08-20T18:00:33.000Z",
          "wordCount": 15835,
          "title": "2:00PM Water Cooler 8/20/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/rcp_2024-08-16.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277058",
          "author": "Yves Smith",
          "description": "Do you stand your ground or seek out a climate haven? Some resources to help you decide.",
          "link": "https://www.nakedcapitalism.com/2024/08/what-should-you-do-to-prepare-for-the-climate-change-storm.html",
          "publishedOn": "2024-08-20T13:55:04.000Z",
          "wordCount": 10984,
          "title": "What Should You Do to Prepare for the Climate Change Storm?",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/00-storm.webp"
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "66c3a5d84a25d6000ae1d9b0",
          "author": "Luke Valenta",
          "description": "NIST has published the first cryptographic standards for protecting against attacks from quantum computers. Learn what this means for you and your organization",
          "link": "https://blog.cloudflare.com/nists-first-post-quantum-standards",
          "publishedOn": "2024-08-20T13:00:39.000Z",
          "wordCount": 1905,
          "title": "NIST’s first post-quantum standards",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/08/2499-OG-1.png"
        },
        {
          "id": "66c2ca3c4a25d6000ae1d73e",
          "author": "Aaron Snell",
          "description": "This summer, Cloudflare welcomed approximately 60 interns from all around the globe, on a mission to #HelpBuildABetterInternet. Join us as we dive into what we were able to accomplish and our experiences!",
          "link": "https://blog.cloudflare.com/2024-interns",
          "publishedOn": "2024-08-19T13:00:21.000Z",
          "wordCount": 2623,
          "title": "Summer 2024 weather report: Cloudflare with a chance of Intern-ets",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/08/2494-OG-1.png"
        },
        {
          "id": "66be71ff4a25d6000ae1d4a6",
          "author": "Pete Pang",
          "description": "From the U.S. elections and geopolitical conflict to tens of millions in corporate dollars lost, phishing remains the root cause of cyber damages. Learn why a comprehensive solution is the best way to stay protected",
          "link": "https://blog.cloudflare.com/a-wild-week-in-phishing-and-what-it-means-for-you",
          "publishedOn": "2024-08-16T17:34:14.000Z",
          "wordCount": 1865,
          "title": "A wild week in phishing, and what it means for you",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/08/2504-OG-1.png"
        },
        {
          "id": "66be142d4a25d6000ae1d42b",
          "author": "Alex Huang",
          "description": "Cloudflare Stream is an end-to-end solution for video encoding, storage, delivery, and playback, focused on simplifying all aspects of video for developers. Newly uploaded or ingested portrait videos will now automatically be processed in full HD quality",
          "link": "https://blog.cloudflare.com/introducing-high-definition-portrait-video-support-for-cloudflare-stream",
          "publishedOn": "2024-08-16T13:00:53.000Z",
          "wordCount": 2152,
          "title": "Introducing high-definition portrait video support for Cloudflare Stream",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/08/Introducing-high-definition-portrait-video-support-for-Cloudflare-Stream-OG-1.png"
        },
        {
          "id": "66bcdb694a25d6000ae1d2f8",
          "author": "Nikita Cano",
          "description": "Meet Cloud Connector — a new free product to simplify your cloud routing and object storage configurations. Say goodbye to frustrating Host Header workarounds and hello to protecting your assets, accelerating applications, and routing your traffic between multiple cloud providers seamlessly",
          "link": "https://blog.cloudflare.com/cloud-connector",
          "publishedOn": "2024-08-16T13:00:18.000Z",
          "wordCount": 2017,
          "title": "Simplify cloud routing and object storage configurations with Cloud Connector",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/08/Simplify-cloud-routing-and-object-storage-configurations-with-Cloud-Connector-OG-1.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": [
        {
          "id": "https://kubernetes.io/blog/2024/08/22/kubernetes-1-31-custom-profiling-kubectl-debug/",
          "author": null,
          "description": "There are many ways of troubleshooting the pods and nodes in the cluster. However, kubectl debug is one of the easiest, highly used and most prominent ones. It\nprovides a set of static profiles and each profile serves for a different kind of role. For instance, from the network administrator's point of view,\ndebugging the node should be as easy as this:\n$ kubectl debug node/mynode -it --image=busybox --profile=netadmin\n\n\nOn the other hand, static profiles also bring about inherent rigidity, which has some implications for some pods contrary to their ease of use.\nBecause there are various kinds of pods (or nodes) that all have their specific\nnecessities, and unfortunately, some can't be debugged by only using the static profiles.\nTake an instance of a simple pod consisting of a container wh…",
          "link": "https://kubernetes.io/blog/2024/08/22/kubernetes-1-31-custom-profiling-kubectl-debug/",
          "publishedOn": "2024-08-22T00:00:00.000Z",
          "wordCount": 4406,
          "title": "Kubernetes 1.31: Custom Profiling in Kubectl Debug Graduates to Beta",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2024/08/22/fine-grained-supplementalgroups-control/",
          "author": null,
          "description": "This blog discusses a new feature in Kubernetes 1.31 to improve the handling of supplementary groups in containers within Pods.\nMotivation: Implicit group memberships defined in /etc/group in the container image\nAlthough this behavior may not be popular with many Kubernetes cluster users/admins, kubernetes, by default, merges group information from the Pod with information defined in /etc/group in the container image.\nLet's see an example, below Pod specifies runAsUser=1000, runAsGroup=3000 and supplementalGroups=4000 in the Pod's security context.\nimplicit-groups.yaml\n\n\napiVersion: v1\nkind: Pod\nmetadata:\n name: implicit-groups\nspec:\n securityContext:\n runAsUser: 1000\n runAsGroup: 3000\n supplementalGroups: [4000]\n containers:\n - name: ctr\n image: registry.k8s.io/e2e-test-images/agnhost:2.4…",
          "link": "https://kubernetes.io/blog/2024/08/22/fine-grained-supplementalgroups-control/",
          "publishedOn": "2024-08-22T00:00:00.000Z",
          "wordCount": 4798,
          "title": "Kubernetes 1.31: Fine-grained SupplementalGroups control",
          "imageUrl": "/images/copycode.svg"
        },
        {
          "id": "https://kubernetes.io/blog/2024/08/22/cpumanager-static-policy-distributed-cpu-across-cores/",
          "author": null,
          "description": "In Kubernetes v1.31, we are excited to introduce a significant enhancement to CPU management capabilities: the distribute-cpus-across-cores option for the CPUManager static policy. This feature is currently in alpha and hidden by default, marking a strategic shift aimed at optimizing CPU utilization and improving system performance across multi-core processors.\nUnderstanding the feature\nTraditionally, Kubernetes' CPUManager tends to allocate CPUs as compactly as possible, typically packing them onto the fewest number of physical cores. However, allocation strategy matters, CPUs on the same physical host still share some resources of the physical core, such as the cache and execution units, etc.\nWhile default approach minimizes inter-core communication and can be beneficial under certain sc…",
          "link": "https://kubernetes.io/blog/2024/08/22/cpumanager-static-policy-distributed-cpu-across-cores/",
          "publishedOn": "2024-08-22T00:00:00.000Z",
          "wordCount": 4533,
          "title": "Kubernetes v1.31: New Kubernetes CPUManager Static Policy: Distribute CPUs Across Cores",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2024/08/21/cri-cgroup-driver-lookup-now-beta/",
          "author": null,
          "description": "Historically, configuring the correct cgroup driver has been a pain point for users running new\nKubernetes clusters. On Linux systems, there are two different cgroup drivers:\ncgroupfs and systemd. In the past, both the kubelet\nand CRI implementation (like CRI-O or containerd) needed to be configured to use\nthe same cgroup driver, or else the kubelet would exit with an error. This was a\nsource of headaches for many cluster admins. However, there is light at the end of the tunnel!\nAutomated cgroup driver detection\nIn v1.28.0, the SIG Node community introduced the feature gate\nKubeletCgroupDriverFromCRI, which instructs the kubelet to ask the CRI\nimplementation which cgroup driver to use. A few minor releases of Kubernetes\nhappened whilst we waited for support to land in the major two CRI implementations\n(containerd and CRI-O), but as of v1.31.0, this feature is now beta!\nIn addition to setting the feature gate, a cluster admin needs to ensure their\nCRI implementation is new enough:\ncontainerd: Support was added in v2.0.0\nCRI-O: Support was added in v1.28.0\nThen, they should ensure their CRI implementation is configured to the\ncgroup_driver they would like to use.\nFuture work\nEventually, support for the kubelet's cgroupDriver configuration field will be\ndropped, and the kubelet will fail to start if the CRI implementation isn't new\nenough to have support for this feature.",
          "link": "https://kubernetes.io/blog/2024/08/21/cri-cgroup-driver-lookup-now-beta/",
          "publishedOn": "2024-08-21T00:00:00.000Z",
          "wordCount": 4175,
          "title": "Kubernetes 1.31: Autoconfiguration For Node Cgroup Driver (beta)",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2024/08/20/websockets-transition/",
          "author": null,
          "description": "In Kubernetes 1.31, by default kubectl now uses the WebSocket protocol\ninstead of SPDY for streaming.\nThis post describes what these changes mean for you and why these streaming APIs\nmatter.\nStreaming APIs in Kubernetes\nIn Kubernetes, specific endpoints that are exposed as an HTTP or RESTful\ninterface are upgraded to streaming connections, which require a streaming\nprotocol. Unlike HTTP, which is a request-response protocol, a streaming\nprotocol provides a persistent connection that's bi-directional, low-latency,\nand lets you interact in real-time. Streaming protocols support reading and\nwriting data between your client and the server, in both directions, over the\nsame connection. This type of connection is useful, for example, when you create\na shell in a running container from your local…",
          "link": "https://kubernetes.io/blog/2024/08/20/websockets-transition/",
          "publishedOn": "2024-08-20T00:00:00.000Z",
          "wordCount": 4527,
          "title": "Kubernetes 1.31: Streaming Transitions from SPDY to WebSockets",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2024/08/19/kubernetes-1-31-pod-failure-policy-for-jobs-goes-ga/",
          "author": null,
          "description": "This post describes Pod failure policy, which graduates to stable in Kubernetes\n1.31, and how to use it in your Jobs.\nAbout Pod failure policy\nWhen you run workloads on Kubernetes, Pods might fail for a variety of reasons.\nIdeally, workloads like Jobs should be able to ignore transient, retriable\nfailures and continue running to completion.\nTo allow for these transient failures, Kubernetes Jobs include the backoffLimit\nfield, which lets you specify a number of Pod failures that you're willing to tolerate\nduring Job execution. However, if you set a large value for the backoffLimit field\nand rely solely on this field, you might notice unnecessary increases in operating\ncosts as Pods restart excessively until the backoffLimit is met.\nThis becomes particularly problematic when running large-sc…",
          "link": "https://kubernetes.io/blog/2024/08/19/kubernetes-1-31-pod-failure-policy-for-jobs-goes-ga/",
          "publishedOn": "2024-08-19T00:00:00.000Z",
          "wordCount": 4975,
          "title": "Kubernetes 1.31: Pod Failure Policy for Jobs Goes GA",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2024/08/16/matchlabelkeys-podaffinity/",
          "author": null,
          "description": "Kubernetes 1.29 introduced new fields MatchLabelKeys and MismatchLabelKeys in PodAffinity and PodAntiAffinity.\nIn Kubernetes 1.31, this feature moves to beta and the corresponding feature gate (MatchLabelKeysInPodAffinity) gets enabled by default.\nMatchLabelKeys - Enhanced scheduling for versatile rolling updates\nDuring a workload's (e.g., Deployment) rolling update, a cluster may have Pods from multiple versions at the same time.\nHowever, the scheduler cannot distinguish between old and new versions based on the LabelSelector specified in PodAffinity or PodAntiAffinity. As a result, it will co-locate or disperse Pods regardless of their versions.\nThis can lead to sub-optimal scheduling outcome, for example:\nNew version Pods are co-located with old version Pods (PodAffinity), which will ev…",
          "link": "https://kubernetes.io/blog/2024/08/16/matchlabelkeys-podaffinity/",
          "publishedOn": "2024-08-16T00:00:00.000Z",
          "wordCount": 4547,
          "title": "Kubernetes 1.31: MatchLabelKeys in PodAffinity graduates to beta",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2024/08/16/kubernetes-1-31-prevent-persistentvolume-leaks-when-deleting-out-of-order/",
          "author": null,
          "description": "PersistentVolume (or PVs for short) are\nassociated with Reclaim Policy.\nThe reclaim policy is used to determine the actions that need to be taken by the storage\nbackend on deletion of the PVC Bound to a PV.\nWhen the reclaim policy is Delete, the expectation is that the storage backend\nreleases the storage resource allocated for the PV. In essence, the reclaim\npolicy needs to be honored on PV deletion.\nWith the recent Kubernetes v1.31 release, a beta feature lets you configure your\ncluster to behave that way and honor the configured reclaim policy.\nHow did reclaim work in previous Kubernetes releases?\nPersistentVolumeClaim (or PVC for short) is\na user's request for storage. A PV and PVC are considered Bound\nif a newly created PV or a matching PV is found. The PVs themselves are\nbacked by vo…",
          "link": "https://kubernetes.io/blog/2024/08/16/kubernetes-1-31-prevent-persistentvolume-leaks-when-deleting-out-of-order/",
          "publishedOn": "2024-08-16T00:00:00.000Z",
          "wordCount": 4760,
          "title": "Kubernetes 1.31: Prevent PersistentVolume Leaks When Deleting out of Order",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2024/08/16/kubernetes-1-31-image-volume-source/",
          "author": null,
          "description": "The Kubernetes community is moving towards fulfilling more Artificial\nIntelligence (AI) and Machine Learning (ML) use cases in the future. While the\nproject has been designed to fulfill microservice architectures in the past,\nit’s now time to listen to the end users and introduce features which have a\nstronger focus on AI/ML.\nOne of these requirements is to support Open Container Initiative (OCI)\ncompatible images and artifacts (referred as OCI objects) directly as a native\nvolume source. This allows users to focus on OCI standards as well as enables\nthem to store and distribute any content using OCI registries. A feature like\nthis gives the Kubernetes project a chance to grow into use cases which go\nbeyond running particular images.\nGiven that, the Kubernetes community is proud to present…",
          "link": "https://kubernetes.io/blog/2024/08/16/kubernetes-1-31-image-volume-source/",
          "publishedOn": "2024-08-16T00:00:00.000Z",
          "wordCount": 4982,
          "title": "Kubernetes 1.31: Read Only Volumes Based On OCI Artifacts (alpha)",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=21564",
          "author": null,
          "description": "Llama 3 is Meta’s most capable openly-available LLM to date and the recently-released Llama 3.1 will enable new workflows, such as synthetic data generation and model distillation with unmatched flexibility, control, and state-of-the-art capabilities that rival the best closed source models.  At AI Infra @ Scale 2024, Meta engineers discussed every step of how we [...]\nRead More...\nThe post Bringing Llama 3 to life appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/08/21/production-engineering/bringing-llama-3-to-life/",
          "publishedOn": "2024-08-21T16:00:49.000Z",
          "wordCount": 1668,
          "title": "Bringing Llama 3 to life",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/08/AI-@Scale-2024-YouTube-Thumbnail-JoeDeliaKaushikYe.webp"
        },
        {
          "id": "https://engineering.fb.com/?p=21559",
          "author": null,
          "description": "Delivering new AI technologies at scale also means rethinking every layer of our infrastructure – from silicon and software systems and even our data center designs. For the second year in a row, Meta’s engineering and infrastructure teams returned for the AI Infra @ Scale conference, where they discussed the challenges of scaling up an [...]\nRead More...\nThe post Aparna Ramani discusses the future of AI infrastructure appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/08/20/data-infrastructure/aparna-ramani-future-of-ai-infrastructure-meta/",
          "publishedOn": "2024-08-20T16:00:26.000Z",
          "wordCount": 1600,
          "title": "Aparna Ramani discusses the future of AI infrastructure",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/08/Ai_infra@Scale-YouTube-Thumbnail-Aparna_Ramani_r01.webp"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=41314388",
          "author": "JohnMakin",
          "description": "When I was a teenageer a school counselor incorrectly perceived me to be in a crisis and had me sent to 72 hour hold (which stays on certain records for quite a while and can be incredibly disruptive, but that's besides the point) - for some reason I was sent almost 40 miles away in another county in a city I'd never been. The hospital doctors took one look at me and realized I didn't belong there, but to do a discharge apparently is a pretty lengthy process once this process is initiated - almost 20 hours later (again, being held completely against my will for no reason) they released me. I asked them where I was supposed to go and if I could call my dad. They said no, but they gave me two (2) bus tokens, which wasn't enough to get back where my car was parked at the school, plus I had no idea how to use the bus system in that county, and didn't have my glasses, phone, or wallet.\nI really don't know how long it took or how I made it, but many many hours later I made it back to my car. I had to beg for money and walk the last several miles once I recognized finally where I was. It really sucked, and ever since then I've had a great deal of sympathy for people that are churned through this terrible system and spit right back out with no dignity whatsoever, let alone empathy. This incident disrupted my life irreversibly (ended up missing tests and having to do a medical withdrawal from school, lost scholarships, etc) and derailed a lot of things I had wanted to do for many, many years. The hospital/medical care industrial complex doesn't optimize for empathy. They're just trying to get the bodies through as quickly as possible.",
          "link": "https://news.ycombinator.com/item?id=41314388",
          "publishedOn": "2024-08-21T21:31:56.000Z",
          "wordCount": 1204,
          "title": "New comment by JohnMakin in \"US hospital told family their daughter had checked out when in fact she'd died\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41314291",
          "author": "jofer",
          "description": "You'd be amazed how bad hospitals can be at keeping track of fairly critical things.\nI had a cousin who voluntarily checked himself into the hospital related to severe withdrawal symptoms (and had bouts of psychosis related to said with withdrawal - meth addictions are nasty).  His mother stayed for awhile but had to leave for work. She was repeatedly guaranteed by multiple doctors and nurses that he could not check himself out and would be there for several days at least. They told her to come back the next morning.\nLate that night, he was discharged. Not even \"he checked himself out\". The hospital discharged him (and that's over an hour ride away from home, btw - no hospitals in rural areas these days).\nHe had no phone and no wallet.  According to staff, he tried to call his mother to pick him up, but couldn't remember her cell phone number (it had changed recently). He called his sister and left a message, but she was traveling and didn't get it until much later.  According to the hospital, he tried to call several different numbers trying to get a ride home and they made him stop and made him leave.  In a quite rough downtown area he was not familiar with. While clearly not in his right mind. At 2am. With no wallet, no phone, no nothing.\nThe hospital had his mother's contact info.  They did not give it to him even when he requested it. They did not attempt to contact her in any way.\nWe still don't know what happened afterwards. His body was found four days later in the river and it had been there for awhile.\nForcibly discharging someone under those circumstances and refusing to even contact their emergency contacts is beyond belief.  I'm furious about it.  Apparently it's common and not even something there's any recourse for.",
          "link": "https://news.ycombinator.com/item?id=41314291",
          "publishedOn": "2024-08-21T21:19:35.000Z",
          "wordCount": 7245,
          "title": "New comment by jofer in \"US hospital told family their daughter had checked out when in fact she'd died\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41310700",
          "author": "shash7",
          "description": "Can relate, I've been in a similar boat running a small B2B Saas over the last 2 years. It does get easier over time.\nI've learnt a few tricks for managing early stage pain points.\n- You need to develop a polite but curt tone of voice for customer support.\n- Once your core product is built, its worthwhile spending some time automating the heck out of everything. This will save a TON of time in the near future.\n- Invest in good docs, even if you're not running a api saas. Good docs + consistent ux + rock solid support will solve most of your support issues.\nI think a lot of literature around running a online biz has been boiled down to rather basic advice and its hard to find anything solid in this area. I've been running a small blog where I document these issues(operational.co) if anyone wants to check it out.",
          "link": "https://news.ycombinator.com/item?id=41310700",
          "publishedOn": "2024-08-21T14:32:57.000Z",
          "wordCount": null,
          "title": "New comment by shash7 in \"I've built my first successful side project, and I hate it\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41306288",
          "author": "Calavar",
          "description": "I feel like I'm living in a different universe sometimes. The consensus on HN seems to be that you can be pretty productive with LLMs as coding assistants, but every time I try I find it borderline impossible to get functional code even for pretty straightforward prompts.\nI decided to fire up GPT-4o again today to see if maybe things have gotten better over the past few months.\nI asked GPT to write code to render a triangle using Vulkan (a 3D graphics API). There are about 1000 tutorials on this that are almost certainly in GPT-4's training data. I gave GPT two small twists so it's not a simple case of copy/paste: I asked it 1) to apply a texture to the triangle and 2) to keep all the code in a single function. (Most tutorials break the code up into about a dozen functions, but each of these functions are called only once, so it should be trivial to inline them.)\nWithin the first ten lines, the code is already completely nonfunctional:\nGPT-4o declares a pointer (VkPhysicalDevice) that is uninitialized. It queries the number of graphics devices on the host machine. A human being would allocate a buffer with that number of elements and store the reference in the pointer. GPT-4o just ignores the result. Completely ignores it. So the function call was just for fun, I guess? It then tries to copy an entire array of VkPhysicalDevice_T objects into this uninitialized pointer. So that's a guaranteed memory access violation right off the bat.",
          "link": "https://news.ycombinator.com/item?id=41306288",
          "publishedOn": "2024-08-21T02:45:12.000Z",
          "wordCount": 9808,
          "title": "New comment by Calavar in \"Artificial intelligence is losing hype\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41306187",
          "author": "fuzzfactor",
          "description": "From a different article:\n>\"A sweeping prohibition of noncompete agreements by the FTC was an unlawful extension of power that would have put American workers, businesses, and our economy at a competitive disadvantage,\" U.S. Chamber of Commerce President and CEO Suzanne Clark said in a statement.\nIf you ever wondered what kind of moron would get this completely backwards and think that non-compete agreements give Americans a competitive advantage, now you know.",
          "link": "https://news.ycombinator.com/item?id=41306187",
          "publishedOn": "2024-08-21T02:20:32.000Z",
          "wordCount": 5380,
          "title": "New comment by fuzzfactor in \"US judge throws out FTC's ban on non-compete agreements\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41303747",
          "author": "MarkusQ",
          "description": "Aaron Swartz would have liked some of those principles.  This is a small, \"better late than never\" step for most of us, but for Aaron...it's more like \"too little, too late.\"",
          "link": "https://news.ycombinator.com/item?id=41303747",
          "publishedOn": "2024-08-20T20:29:54.000Z",
          "wordCount": null,
          "title": "New comment by MarkusQ in \"MIT leaders describe the experience of not renewing Elsevier contract\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41302961",
          "author": "simonw",
          "description": "The key thing to understand here is the exfiltration vector.\nSlack can render Markdown links, where the URL is hidden behind the text of that link.\nIn this case the attacker tricks Slack AI into showing a user a link that says something like \"click here to reauthenticate\" - the URL attached to that link goes to the attacker's server, with a query string that includes private information that was visible to Slack AI as part of the context it has access to.\nIf the user falls for the trick and clicks the link, the data will be exfiltrated to the attacker's server logs.\nHere's my attempt at explaining this attack: https://simonwillison.net/2024/Aug/20/data-exfiltration-from...",
          "link": "https://news.ycombinator.com/item?id=41302961",
          "publishedOn": "2024-08-20T19:07:00.000Z",
          "wordCount": 3011,
          "title": "New comment by simonw in \"Data Exfiltration from Slack AI via indirect prompt injection\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41300777",
          "author": "JohnMakin",
          "description": "Working as a SRE for a year in a large global company broke me out of this \"panic\" mode described in this post. To a business, every problem seems like a world-ending event. It's very easy to give in to panic in those situations. However, in reality, it's rarely that bad, and even if it is, you'll probably survive without harm. The key in these situations, and what I try to do (totally relate to breaking out in a sweat, that still happens to me, just happened yesterday) is to take 5-10 minutes before doing any action to try to fix it and sketch it out, think about it as clearly as you can. Fear interferes with your ability to reason rationally. Mashing buttons in a panic can make your problems spiral even worse (seen that happen). Disrupting that fear circuit any way you can is important. Splashing my face and hands with extremely cold water is my trick.\nThen after you go through a few of these, you'll realize it really isn't too bad and you've dealt with bad situations before and you'll gain the confidence to know you can deal with it, even when there's no one you can reach out to for help.",
          "link": "https://news.ycombinator.com/item?id=41300777",
          "publishedOn": "2024-08-20T15:09:19.000Z",
          "wordCount": null,
          "title": "New comment by JohnMakin in \"The anatomy of a 2AM mental breakdown\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41299495",
          "author": "lolinder",
          "description": "I'm not convinced. Most of the argument seems to be that redundant UX is bad UX:\n> But by archiving the email, the email disappears from the list, which already implies the action was successful.\n> In this example, the button already includes a confirmation so the toast is entirely unnecessary.\nI vehemently disagree with the idea that just because you're already communicating something one way it's bad UX to include another way of communicating the same thing at the same time. Redundancy in communication is a feature, not a bug, and it's present in all human languages. It ensures that even in less than ideal conditions the message still gets through.\nIn the case of toasts, having a single, standardized way of communicating the status of all actions (and if possible providing the undo) allows a user to quickly pick up on the pattern. Extra indicators closer to the action can be valuable too, but it's when they're paired with the toast that their meaning becomes entirely clear.  To remove the toast in favor of a bunch of specific indicators is to force your user to learn several different ways of saying \"it's done now\" entirely from context (many of which will be small and subtle as in the examples given). This might work fine for you and me but isn't great for, say, the elderly or the vision impaired or children.\nUnless they're actually getting in the way, toasts aren't bad UX, they're redundant UX, and a UX designer shouldn't be striving to optimize away redundancy.",
          "link": "https://news.ycombinator.com/item?id=41299495",
          "publishedOn": "2024-08-20T12:35:47.000Z",
          "wordCount": 9517,
          "title": "New comment by lolinder in \"Toasts are bad UX\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41292982",
          "author": "delroth",
          "description": "> In the Netherlands alone, these solar panels generate a power output equivalent to at least 25 medium sized nuclear power plants.\nSince this didn't pass the smell test: the author is looking at nameplate capacity, which is a completely useless metric for variable electricity production sources (a solar panel in my sunless basement has the same nameplate capacity as the same panel installed in the Sahara desert).\nLooking at actual yearly energy generation data, this is more like 1.5 times the generation of an average nuclear power plant (NL solar production in 2023: 21TWh, US nuclear production in 2021: 778TWh by 54 plants).\nWhich maybe puts more into perspective the actual risks involved here. I'm not saying there shouldn't be more regulations and significantly better security practices, but otoh you could likely drive a big truck into the right power poles and cause a similar sized outage.",
          "link": "https://news.ycombinator.com/item?id=41292982",
          "publishedOn": "2024-08-19T17:38:25.000Z",
          "wordCount": null,
          "title": "New comment by delroth in \"The gigantic and unregulated power plants in the cloud\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41291192",
          "author": "GNOMES",
          "description": "My kiddo has easily spent 500+ on Roblox across birthday/Xmas gift cards/chores.\nI can't stand that almost all of the games seem to have a pay to win aspect, or are heavily advertising every chance they get.\nAs a gamer dad, I try to show my kid better games to play, but because they aren't free, his friends can't play. Just drives him to keep playing and wanting more Robux. It's compounded when his favorite Youtubers play...\nSeriously don't understand how Roblox isn't being investigated for predatory practices. I imagine they can hide behind the fact users are making most of the mini games, and they are just providing a platform.",
          "link": "https://news.ycombinator.com/item?id=41291192",
          "publishedOn": "2024-08-19T14:09:39.000Z",
          "wordCount": null,
          "title": "New comment by GNOMES in \"Roblox is the biggest game in the world, but is unprofitable\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41287805",
          "author": "fishtoaster",
          "description": "I came to this same conclusion some years ago while working on a side project.\nBefore anything LLM existed, I built a site[0] to generate fake \"AWS Blog Posts.\"  I trained a markov chain generator on all AWS announcement posts up to that point, copied the html + css of aws's standard blog posts, then glued them all together with some python + JS.  It turned out, IMO, pretty funny!  People familiar with AWS's blog posts would often get several sentences in before they realized they were looking at word-soup.\nWhen GPT was new, I looked into using that to \"upgrade\" it.  I spent a weekend messing around with Minimaxir's gpt-2-simple generating blog posts based on AWS content.  What I found was, ultimately, it was way less fun.  The posts were far too realistic to be interesting.  They read like totally-real blog posts that just happened to not be true.\nI realized then that the humor of those early markov generations was the ridiculousness.  The point where, a few words or sentences in, you realized it was all nonsense.  LLM's these days are too good for that - the text they generate is sometimes wrong, but rarely nonsense in a humorous way.\nMarkov chain content was wrong in a \"kid's say the darndest things\" way, while modern LLMs are wrong in a \"My uncle doesn't know basic geography\" way.\n[0] https://totes-not-amazon.com/ - click any link to get a new one.",
          "link": "https://news.ycombinator.com/item?id=41287805",
          "publishedOn": "2024-08-19T04:24:03.000Z",
          "wordCount": 2146,
          "title": "New comment by fishtoaster in \"Markov chains are funnier than LLMs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41287768",
          "author": "andyferris",
          "description": "> Unlike other social platforms, Roblox’s revenue is nearly all via user spending rather than advertising. As such, Roblox pays 25% of its revenue to Apple and Google (30% of transactions on those platforms) whereas Facebook, Snap, et al pay effectively 0. Note that Facebook, which has structurally lower costs to service users than Roblox and is far more mature, has an operating margin of roughly 40% — if the company had to pay out 25-30% first, it would never have “tech company” profit margins, let alone profit dollars.\nWow. I've never though about this before, but this is an awful second-order consequence of the high app store fees set by Apple and Google. It essentially incentivizes App makers to treat users as products not customers!\n(Not too surprising for Google, but certainly goes against Apple's public stance).",
          "link": "https://news.ycombinator.com/item?id=41287768",
          "publishedOn": "2024-08-19T04:17:18.000Z",
          "wordCount": null,
          "title": "New comment by andyferris in \"Roblox is the biggest game in the world, but is unprofitable\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41287638",
          "author": "wavemode",
          "description": "> Though Roblox isn’t profitable, there are some significant caveats to the situation. Over the last twelve months, operating cash flow—a far more important measure than accounting-defined profits—were $650MM, about 20% of revenue. Roblox has been cash-positive for at least twenty-four quarters.\nThis feels like an example of the phenomenon highlighted in another recent post: https://news.ycombinator.com/item?id=41263855\nNamely, that as long as Roblox's cash flow is increasing year-over-year, they probably don't care about profit. (And if cash flow ever does stop increasing, they can always get back to sustainability by pumping the brakes on reinvestment spending.)",
          "link": "https://news.ycombinator.com/item?id=41287638",
          "publishedOn": "2024-08-19T03:47:50.000Z",
          "wordCount": null,
          "title": "New comment by wavemode in \"Roblox is the biggest game in the world, but is unprofitable\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41286672",
          "author": "burnte",
          "description": "That's amazing, it took them 3 months to kill a scam app, but they proactively shutdown smaller apps that break no rules constantly. I swear someone in Google's exec team is going out of their way to make Google products suck. They've all been getting worse for the past several years. Search gives bad results, search qualifiers only work in \"verbatim\" mode, GMail sucks at spam filtering now, Android is becoming a PITA, Chrome is shoving in new bad features while killing old good features, etc. There was even a big thing about Google Voice having some massive change where lots of features were going away, so I pulled GV out of my life expecting it to go away, and literally nothing changed.\nIt's almost like Google is suicidal and these are calls for help.",
          "link": "https://news.ycombinator.com/item?id=41286672",
          "publishedOn": "2024-08-19T00:19:56.000Z",
          "wordCount": null,
          "title": "New comment by burnte in \"Google took three months to remove scam app that stole over $5M\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41286072",
          "author": "__MatrixMan__",
          "description": "They took my camera and then when I tried to get it back they claimed that nothing like that was in evidence.  So I filed a police report because the police stole my camera, but I never heard back about it.\nGlad you eventually got your money.",
          "link": "https://news.ycombinator.com/item?id=41286072",
          "publishedOn": "2024-08-18T22:30:51.000Z",
          "wordCount": null,
          "title": "New comment by __MatrixMan__ in \"Police cannot seize property indefinitely after an arrest, federal court rules\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41284917",
          "author": "nimbius",
          "description": "I once had the cops seize $800 in cash I had on me to pay for motorcycle service (15% discount with cash) and hold it for 3 months.\nEventually I got a letter saying I had to show up and prove I wasnt going to do drugs with it.  So I showed up with my invoice.\nThen I was told I had to submit fingerprints and sign a letter promising I wasnt going to do drugs and I refused.\nFinally a month later they sent me a letter saying I had forfeited the money and I showed up again (took a day off work) and they said I had to go to court.  So I went to court, and the judge spent ten minutes telling the cops that didnt show up I had to get my money back.\nNext month after that I got a call saying I had property to pick up and that I'd be fined daily if I didnt.  So I got the money back.",
          "link": "https://news.ycombinator.com/item?id=41284917",
          "publishedOn": "2024-08-18T19:54:21.000Z",
          "wordCount": null,
          "title": "New comment by nimbius in \"Police cannot seize property indefinitely after an arrest, federal court rules\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41284801",
          "author": "alberth",
          "description": "I initially loved Zed.\nBut as their focus has shifted to building Collaboration & AI features, and still haven’t yet nailed just being a good/great base editor, its become less useful to me.\nI still have a lot of hope for Zed.\nBut for the time being, I’ve switched back to my old editor & IDE … and I’ll try Zed again at a much later date.",
          "link": "https://news.ycombinator.com/item?id=41284801",
          "publishedOn": "2024-08-18T19:35:31.000Z",
          "wordCount": null,
          "title": "New comment by alberth in \"Leaving Neovim for Zed\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41283829",
          "author": "OutOfHere",
          "description": "This is a well-intentioned but largely useless ruling because it fails to define the maximum duration for which property can be held. As such, it's up to the police as to what qualifies as indefinite. If the ruling had capped it to 14 or 30 days, that would be a useful ruling.\nA hard time cap is essential because one's life too has a cap. The amount of time for which one can go without earning a livelihood also has a cap. Imagine if prison sentences didn't have a time cap.\nThis illustrates a common problem with our laws. They're very often vaguely defined, needlessly so, in a way that keeps attorneys and judges very rich, and the police abusive, to the detriment of the individual. In a sensible world, the laws would all be rewritten for clarity and consistency, starting with the Constitution.",
          "link": "https://news.ycombinator.com/item?id=41283829",
          "publishedOn": "2024-08-18T17:38:10.000Z",
          "wordCount": null,
          "title": "New comment by OutOfHere in \"Police cannot seize property indefinitely after an arrest, federal court rules\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41278719",
          "author": "j1elo",
          "description": "Wow those answers are indeed funny. I agree that as an OSS dev/maintainer, it's easy to fall on the vice of over-generalization and crusade for the perfect solution, and it feels that's exactly what happened there.\n> this feature is algorithmically impossible\n> You're just looking at one specific video, not the general problem.\n> is not generally possible.\nAs a fellow multimedia dev, man, who cares? Sometimes we forget that software ought to be useful, not hypothetical ideals of truth. Just implement the feature for those codecs that support it and which probably are in the 98% percentile of what users actually use, regardless of the damned \"general case\".\nOr accept and announce shamelessly that you don't have either the knowledge or the development resources to tackle such a complex feature. But excuses about not being possible for absolutely every possible codec in a completely generic way is just denying that the world is just a chaotic and dirty place where things are not ideal nor perfect. Just give your users a real-world solution (or rejection).",
          "link": "https://news.ycombinator.com/item?id=41278719",
          "publishedOn": "2024-08-17T22:57:21.000Z",
          "wordCount": null,
          "title": "New comment by j1elo in \"Mpv – A free, open-source, and cross-platform media player\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41278203",
          "author": "lairv",
          "description": "I use it to inspect video frames by frames, particularly being able to go back one frame. VLC doesn't support it, this thread about the feature is hilarious https://forum.videolan.org/viewtopic.php?t=120627",
          "link": "https://news.ycombinator.com/item?id=41278203",
          "publishedOn": "2024-08-17T21:38:40.000Z",
          "wordCount": null,
          "title": "New comment by lairv in \"Mpv – A free, open-source, and cross-platform media player\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41277640",
          "author": "etra0",
          "description": "A fantastic mediaplayer, quite minimalistic and performant; it does what it's supposed to do!\nAlso has a fantastic commit where the author rants about locales: https://github.com/mpv-player/mpv/commit/1e70e82baa9193f6f02... worth a read for some chuckles.",
          "link": "https://news.ycombinator.com/item?id=41277640",
          "publishedOn": "2024-08-17T20:20:49.000Z",
          "wordCount": null,
          "title": "New comment by etra0 in \"Mpv – A free, open-source, and cross-platform media player\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41276507",
          "author": "SoftTalker",
          "description": "\"This is a small example of a big problem with usability and cybersecurity. This is what happens when apps are developed by engineers who don’t have a strong knowledge of customers\"\nThis really rings true. Just think of all the nonsense you have to deal with in the name of \"security.\" Mandatory password change intervals. Insane rules for constructing passwords. Completely undocumented password requirements that you just have to figure out by trial and error. Complicated error messages full of security jargon. \"Secret Questions\" that you can't remember the answers to. And on the other side of the coin, the security of these systems themselves is like a sieve. So many data breaches, information disclosures, they are in the news almost daily. I often wonder how they get away with it all.",
          "link": "https://news.ycombinator.com/item?id=41276507",
          "publishedOn": "2024-08-17T17:59:46.000Z",
          "wordCount": null,
          "title": "New comment by SoftTalker in \"Flaw has Microsoft Authenticator overwriting MFA accounts, locking users out\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41276038",
          "author": "virgulino",
          "description": "Brazilian here. If anyone wants a great introduction to the context and the bigger picture, there's this great article from the NYT in 2022, written by an excellent reporter who lives in Brazil. I highly recommend this article to anyone who hasn't lived in Brazil for the last 10 years:\n\"To Defend Democracy, Is Brazil’s Top Court Going Too Far?\"\nhttps://www.nytimes.com/2022/09/26/world/americas/bolsonaro-...\nhttps://archive.is/plQFT\nIt covers the judge at the center of the current issue: \"Mr. Moraes has jailed five people without a trial for posts on social media that he said attacked Brazil’s institutions. He has also ordered social networks to remove thousands of posts and videos with little room for appeal. And this year, 10 of the court’s 11 justices sentenced a congressman to nearly nine years in prison for making what they said were threats against them in a livestream.\"\nRumble has been blocked in Brazil for over a year, and WhatsApp and Telegram have been briefly blocked multiple times.",
          "link": "https://news.ycombinator.com/item?id=41276038",
          "publishedOn": "2024-08-17T17:13:24.000Z",
          "wordCount": null,
          "title": "New comment by virgulino in \"X says it is closing operations in Brazil due to judge's content orders\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41275901",
          "author": "oldprogrammer2",
          "description": "Stripe, Block, and PayPal each solved a massive pain point.\nPayPal provided a way to pay people and vendors without giving away your credit card number.\nSquare made it easy to accept payment in person on a phone, without an extensive upfront underwriting experience and without expensive fixed monthly fees.\nStripe did the same as Square, but for accepting online payments.\nFraud and Risk come in many forms, and these providers, even with their UX innovations, sit on top of those same rails to reduce fraud.  Without those rails, buyers can’t trust sellers and sellers can’t trust buyers.\nIn my opinion, you need to find a way to solve that problem before you can eliminate the fees being captured by these providers.",
          "link": "https://news.ycombinator.com/item?id=41275901",
          "publishedOn": "2024-08-17T16:57:17.000Z",
          "wordCount": null,
          "title": "New comment by oldprogrammer2 in \"Ask HN: Do we need to pay billions in fees to Stripe, Block, PayPal and Visa/MC?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41275258",
          "author": "lenerdenator",
          "description": "Well, if they want to learn from the US, they should ship their manufacturing capacity and intellectual property off to their geopolitical rival for short-term monetary gain.",
          "link": "https://news.ycombinator.com/item?id=41275258",
          "publishedOn": "2024-08-17T15:34:38.000Z",
          "wordCount": null,
          "title": "New comment by lenerdenator in \"China's manufacturers are going broke\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41273310",
          "author": "DarkNova6",
          "description": "> If you see a college student or fresh grad using MongoDB stop them. They need help. They have been led astray.\nI like this sentence way more than I should.",
          "link": "https://news.ycombinator.com/item?id=41273310",
          "publishedOn": "2024-08-17T10:20:50.000Z",
          "wordCount": null,
          "title": "New comment by DarkNova6 in \"Just use Postgres\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41273180",
          "author": "sleepless",
          "description": "And here's the Fediverse post about the incident if you don't want to click on a twitter link https://fosstodon.org/@organicmaps/112976308191001762",
          "link": "https://news.ycombinator.com/item?id=41273180",
          "publishedOn": "2024-08-17T09:57:53.000Z",
          "wordCount": null,
          "title": "New comment by sleepless in \"Google removed Organic Maps from the Play Store\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41272908",
          "author": "thor-rodrigues",
          "description": "I am glad to hear that workers rights are being enforced in Europe.\nAs an employee in Germany, it sounds deranged to receive an email saying I have one day to completely change my work contract, or be fired from my job.",
          "link": "https://news.ycombinator.com/item?id=41272908",
          "publishedOn": "2024-08-17T08:58:52.000Z",
          "wordCount": null,
          "title": "New comment by thor-rodrigues in \"X ordered to pay €550k to Irish employee fired after yes-or-resign ultimatum\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41272867",
          "author": "CharlieDigital",
          "description": "I ask these indirectly.\n    \"What types of people tend to succeed and do well with your team?  What types of people tend to struggle in your team?\"\n\n    \"What are your main objectives in the next 6 to 12 months?  What's your plan to meet those objectives?\"\n\n    \"How do you see the candidate in this role contributing to that objective?\"\n\n    \"Tell me about how the team collaborates and coordinates work\"\n\n(Am I going to be stuck in 1 hour all-hands daily \"stand-ups\" every day?)",
          "link": "https://news.ycombinator.com/item?id=41272867",
          "publishedOn": "2024-08-17T08:48:06.000Z",
          "wordCount": null,
          "title": "New comment by CharlieDigital in \"Interviewing the Interviewer: Questions to Uncover a Company's True Culture\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=53031",
          "author": "Harry",
          "description": "Gina’s post about David O’Brien’s chapter in The Art of Teaching Philosophy reminded me that I should tell you about the class our department (Philosophy) has for all beginning Teaching Assistants (beginning at Madison, whether or not they have already taught elsewhere). The focus is pretty relentlessly practical: providing them with strategies, techniques, and advice […]",
          "link": "https://crookedtimber.org/2024/08/21/6-or-more-things-you-might-want-to-know-how-to-do-as-a-new-ta/",
          "publishedOn": "2024-08-21T16:07:15.000Z",
          "wordCount": 6329,
          "title": "6 (or more) things you might want to know how to do as a new TA.",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53029",
          "author": "Henry Farrell",
          "description": "“To promote open inquiry and free, market-based technological progress, you need an open society, not one founded on the enemy principle. The understandable desire to escape criticism, misunderstanding, and the frustrations of ordinary politics does not entail the radical remaking of the global geoeconomic order to confound the New York Times and its allies. The cult of […]",
          "link": "https://crookedtimber.org/2024/08/20/what-went-wrong-with-the-silicon-valley-right/",
          "publishedOn": "2024-08-20T12:57:48.000Z",
          "wordCount": 4762,
          "title": "What went wrong with the Silicon Valley right",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52980",
          "author": "Miriam Ronzoni",
          "description": "This is a midsummer short and light hearted post, but I find that Summer is often the time when I am most reminded of my bodily existence, and of how naïve us philosophers are in forgetting (de facto, if not in principle) how much our thoughts and beliefs are embedded in our bodily experience. Indeed,often […]",
          "link": "https://crookedtimber.org/2024/08/20/against-the-sleepboring-analogy/",
          "publishedOn": "2024-08-20T08:22:02.000Z",
          "wordCount": 3609,
          "title": "Against the Sleep=Boring Analogy",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53018",
          "author": "Belle Waring",
          "description": "Henry James: girl, you are so cool and smart, and well-dressed, and beautiful. And I mean this in the least-sexual, but not sassy-gay-best-friend way, exactly, but more like just, your good friend who is also gay? And do you know, that guy is the worst. The worst. I feel like someone should leave you a […]",
          "link": "https://crookedtimber.org/2024/08/19/henry-james-opposes-wildly-unlikeable-guys/",
          "publishedOn": "2024-08-19T22:19:09.000Z",
          "wordCount": 2710,
          "title": "Henry James Opposes Wildly Unlikeable Guys",
          "imageUrl": "https://img.youtube.com/vi/pB4gIRunnhM/0.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53014",
          "author": "Serene Khader",
          "description": "The value of individualism often comes up in attempts to make sense of the elusiveness of women’s empowerment. “Investing in women” has not uniformly yielded either the quick reduction in women’s poverty or the decrease in women’s adherence to sexist norms or deference to men policymakers had hoped it would. Of course, this is partly […]",
          "link": "https://crookedtimber.org/2024/08/19/new-work-on-gender-and-development-soledad-artiz-prillamans-the-patriarchal-political-order/",
          "publishedOn": "2024-08-19T20:02:07.000Z",
          "wordCount": 2858,
          "title": "New Work on Gender and Development: Soledad Artiz Prillaman’s The Patriarchal Political Order",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53009",
          "author": "Chris Bertram",
          "description": "Visit the post for more.",
          "link": "https://crookedtimber.org/2024/08/18/sunday-photoblogging-gull/",
          "publishedOn": "2024-08-18T16:00:36.000Z",
          "wordCount": 2014,
          "title": "Sunday photoblogging: gull",
          "imageUrl": "https://live.staticflickr.com/65535/53897622235_5bd50828c2.jpg"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/The-Debt-System-The-CADTM-s-analyses-and-theoretical-foundations",
          "author": "Christoph Sorg",
          "description": "Extract from “Social Movements and the Politics of Debt: Transnational Resistance against Debt on Three Continents” \nEnglish\n\n/ \nDebt campaign, \nCapitalism, \nCADTM",
          "link": "https://www.cadtm.org/The-Debt-System-The-CADTM-s-analyses-and-theoretical-foundations",
          "publishedOn": "2024-08-21T07:56:57.000Z",
          "wordCount": 3457,
          "title": "The Debt System: The CADTM's analyses and theoretical foundations",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1200xH630/adba5190f7678838d3042e66b02596-d4e95.jpg"
        },
        {
          "id": "https://www.cadtm.org/Peasants-and-Politics-in-Neoliberal-India-The-2020-21-Peasant-Movement",
          "author": "Paramjit Singh",
          "description": "The persistence of peasantry in the Global South and imperialism's necessity to integrate it into its accumulation network has given birth to a new agrarian question. This question centers around policies and efforts employed by imperialist countries to pressurize countries of the Global South, through international institutions (WTO, World Bank, and IMF), to integrate their peasantry into globalized capital. A peculiar feature of recent developments in this process is the exceptional (...)\nEnglish\n\n/ \nSocial movements, \nIndia, \nAgriculture and Food Sovereignty",
          "link": "https://www.cadtm.org/Peasants-and-Politics-in-Neoliberal-India-The-2020-21-Peasant-Movement",
          "publishedOn": "2024-08-19T10:00:00.000Z",
          "wordCount": 3378,
          "title": "Peasants and Politics in Neoliberal India: The 2020-21 Peasant Movement",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1200xH630/1ada42a6e9b299b58229c78c8d17c7-59863.jpg"
        },
        {
          "id": "https://www.cadtm.org/The-worst-ever-global-debt-crisis",
          "author": "Collective, Development finance international",
          "description": "This policy briefing, based on the new Debt Service Watch database, shows that the citizens of the Global South now face the worst debt crisis since global records began. Debt service is absorbing an average 38% of budget revenue and 30% of spending across the South, rising to 54% of revenue and 40% of spending in Africa. Spread across all continents, 35 countries are paying more than half of revenue, and 54 over one third. (...)\nEnglish\n\n/ \nAusterity/Structural Adjustment, \nIllegitimate debt, \nSouth",
          "link": "https://www.cadtm.org/The-worst-ever-global-debt-crisis",
          "publishedOn": "2024-08-17T07:51:08.000Z",
          "wordCount": 865,
          "title": "The worst ever global debt crisis",
          "enclosure": {
            "url": "https://www.cadtm.org/IMG/pdf/debt_service_watch_briefing_final_word_en_0910.pdf",
            "length": "454754",
            "type": "application/pdf"
          },
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/25d245c34d7df490a34d9141fc46da-bb8d2.jpg"
        },
        {
          "id": "https://www.cadtm.org/From-the-Committee-for-the-Cancellation-of-Third-World-Debt-to-the-Committee",
          "author": "Christoph Sorg",
          "description": "Excerpts from Social Movements and the Politics of Debt: Transnational Resistance against Debt on Three Continents. \nEnglish\n\n/ \nSocial movements, \nDebt campaign, \nDebt crisis, \nCADTM",
          "link": "https://www.cadtm.org/From-the-Committee-for-the-Cancellation-of-Third-World-Debt-to-the-Committee",
          "publishedOn": "2024-08-16T16:45:29.000Z",
          "wordCount": 2951,
          "title": "From the “Committee for the Cancellation of Third World Debt” to the “Committee for the Abolition of Illegitimate Debt”",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1200xH630/dc1b79000bbb425941d2d5346ac8b3-477d3.jpg"
        },
        {
          "id": "https://www.cadtm.org/Ecuador-Resistance-against-the-policies-imposed-by-the-World-Bank-the-IMF-and",
          "author": "Eric Toussaint",
          "description": "The World Bank and the IMF are 80 years old. 80 years of financial neo-colonialism and the imposition of austerity policies in the name of debt repayment. 80 years is enough! The Bretton Woods institutions must be abolished and replaced by democratic institutions serving an ecological, feminist and anti-racist bifurcation. To mark these 80 years, we are republishing a series of articles every Wednesday until July, looking in detail at the history and damage caused by these two institutions. (...)\nEnglish\n\n/ \nEcuador, \nIMF, \nWorld Bank, \nFinance against people, \nBM-FMI-Equateur_EN",
          "link": "https://www.cadtm.org/Ecuador-Resistance-against-the-policies-imposed-by-the-World-Bank-the-IMF-and",
          "publishedOn": "2024-08-16T06:30:00.000Z",
          "wordCount": 8317,
          "title": "Ecuador: Resistance against the policies imposed by the World Bank, the IMF and other creditors between 2007 and 2011",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L710xH373/126f43b85ae140a278cc99c504a47a-c8730.jpg"
        },
        {
          "id": "https://www.cadtm.org/Social-Movements-and-the-Politics-of-Debt",
          "author": "Christoph Sorg",
          "description": "Social Movements and the Politics of Debt, Transnational Resistance against Debt on Three Continents, Christoph Sorg, Amsterdam University Press, 2022 \nEnglish\n\n/ \nDebt campaign, \nDebt crisis, \nDebt in History",
          "link": "https://www.cadtm.org/Social-Movements-and-the-Politics-of-Debt",
          "publishedOn": "2024-08-15T20:43:26.000Z",
          "wordCount": 10303,
          "title": "Social Movements and the Politics of Debt",
          "enclosure": {
            "url": "https://www.cadtm.org/IMG/pdf/social_movements_0aand_the_politics_of_debt.pdf",
            "length": "2952874",
            "type": "application/pdf"
          },
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1200xH630/e34b4947add76e7652572a6d2077db-35d33.jpg"
        },
        {
          "id": "https://www.cadtm.org/Bangladesh-the-Global-South-debt-crisis-intensifies",
          "author": "Michael Roberts",
          "description": "The overthrow of the Sheikh Hasina's dictatorial government in Bangladesh by students and the populace last week is a startling outcome of the economic nightmare. The country's average GDP growth over the past decade, according to government statistics, was around 6.6%. As late as April this year, the World Bank reckoned that Bangladesh would grow by 5.6% this year, led by its highly successful garment industry, which relies on cheap labour sweat shops to gain market share globally. It (...)\nEnglish\n\n/ \nBangladesh, \nDebt crisis, \nSouth",
          "link": "https://www.cadtm.org/Bangladesh-the-Global-South-debt-crisis-intensifies",
          "publishedOn": "2024-08-15T20:36:00.000Z",
          "wordCount": 2542,
          "title": "Bangladesh: the ‘Global South' debt crisis intensifies",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/4a1ddc8bdd91b99b0e1ebabd5f40cc-cb52c.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=8334",
          "author": "disassociated.com",
          "description": "About six years ago I decided I wasn’t reading enough novels. Books sat on the side table untouched, gathering dust, and inducing a pang of guilt whenever I took notice of them. I wondered what I could do to get more into reading. One thing I am good at is meeting deadlines, and doing things […]",
          "link": "https://disassociated.com/wanting-read-more-novels-versus-everything-else/",
          "publishedOn": "2024-08-20T21:00:18.000Z",
          "wordCount": 791,
          "title": "Wanting to read more novels, versus trying to do everything else",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8320",
          "author": "disassociated.com",
          "description": "Do Australian Prime Ministers have time to read books? They may not, but they do have a literary award for Australian publications, created in 2008, of which the 2024 shortlist was announced last week. Five titles, across the six award categories of fiction, non-fiction, Australian history, poetry, children’s, and young adult, were included. Among books […]",
          "link": "https://disassociated.com/australian-prime-ministers-literary-awards-2024-shortlist/",
          "publishedOn": "2024-08-19T21:00:29.000Z",
          "wordCount": 292,
          "title": "Australian Prime Minister’s Literary Awards 2024 shortlist",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8315",
          "author": "disassociated.com",
          "description": "The Zone of Interest, trailer, the 2023 film by British director Jonathan Glazer (Sexy Beast, Under the Skin), explores a slightly different aspect of the World War II Holocaust, which resulted in the deaths of six million European Jews at the hands of the Nazis. Rudolf Höss (Christian Friedel), the commandant of Auschwitz, a Nazi […]",
          "link": "https://disassociated.com/film-the-zone-of-interest-jonathan-glazer-christian-friedel-sandra-huller/",
          "publishedOn": "2024-08-18T21:00:38.000Z",
          "wordCount": 417,
          "title": "The Zone of Interest, a film by Jonathan Glazer, with Christian Friedel, Sandra Huller",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8327",
          "author": "disassociated.com",
          "description": "Coming soon to Threads on the website: the facility to save post drafts, and schedule posts. Post insights, similar I imagine, to those on Instagram, are also on the way, according to a recent thread by Meta CEO Mark Zuckerberg. Scheduling posts and saving drafts — at least if using Threads through the website — […]",
          "link": "https://disassociated.com/new-threads-micro-blogging-features-badge-number-easter-egg/",
          "publishedOn": "2024-08-18T20:30:36.000Z",
          "wordCount": 275,
          "title": "New Threads micro-blogging features, badge number Easter egg",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8297",
          "author": "disassociated.com",
          "description": "Marie Le Conte, writing for New Humanist, in a provocatively titled article: the introverts are winning, seems to suggest introverts and extraverts are embroiled in some sort of global conflict. A quick explainer. People generally fall into one of two personality traits: extraversion or introversion. It’s a scale. You can be close to either end, […]",
          "link": "https://disassociated.com/introverts-extraverts-war-introverts-winning-wtf/",
          "publishedOn": "2024-08-15T21:00:01.000Z",
          "wordCount": 1037,
          "title": "Introverts and extraverts are at war, and introverts are winning. WTF?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8302",
          "author": "disassociated.com",
          "description": "News sites seem to be the worst, but they’re not alone*. You want to read a news item, but are assailed by a plethora of interfering popups of some sort. But a new feature in the soon to be released iPhone operating system, iOS 18, for Apple’s Safari browser, is a step in the right […]",
          "link": "https://disassociated.com/ios-18-distraction-free-browsing-parts-web/",
          "publishedOn": "2024-08-15T20:30:19.000Z",
          "wordCount": 300,
          "title": "iOS 18 will bring distraction free browsing to parts of the web",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20240820",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20240820",
          "publishedOn": "2024-08-20T22:00:00.000Z",
          "wordCount": 547,
          "title": "Week Ending August 18, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/fraud-foretold",
          "author": null,
          "description": "Elections in Venezuela.",
          "link": "https://newleftreview.org/sidecar/posts/fraud-foretold",
          "publishedOn": "2024-08-21T10:20:03.000Z",
          "wordCount": 2724,
          "title": "Gabriel Hetland: &ldquo;Fraud Foretold?&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/08/download.jpeg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/prospects",
          "author": null,
          "description": "Forecasting Starmerism.",
          "link": "https://newleftreview.org/sidecar/posts/prospects",
          "publishedOn": "2024-08-16T10:22:07.000Z",
          "wordCount": 2391,
          "title": "Caitlín Doherty: &ldquo;Prospects&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/08/Starmer.jpeg"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://birming.com/ditching-desk-dreams/",
          "author": null,
          "description": "\"I don't want to work in IT anymore.\"\nI saw this comment pop up on my Mastodon feed today. It really resonated with me, as I was in the same boat a few years ago.\nI had a great job at a great company. The people were friendly, the boss was understanding, the pay was good, and it was a short walk from home. In short, it was perfect!\nBut over time, something started to feel off. I couldn't quite put my finger on what it was. Everything ought to be great, which my family and friends were quick to point out when I told them how I felt.\nThen one day, a window cleaner came to the office. I completely lost track of time watching him work. When I finally snapped out of it, I told him it looked like a peaceful job.\n– Yes, I can't imagine a better job, he replied cheerfully.\nIn that moment, a seed was planted. Six months later, I was on a plane to Bangkok for a sabbatical in Asia. It was such a rewarding experience!\nWhen I got back, I explained to my employer that it was time for something new. He admired my adventurous spirit and completely understood.\nFast forward ten years, and here I am now. I love my current job as a house inspector, even though I still make less than I did back then.\nAnd when it comes to IT, I'm more passionate about it now that it's a hobby instead of a career. It's fun again!\nAre you happy with your job? If not, do what you can to change the situation. Life is too short and precious to spend a large part of it unhappy.\nChok Dee, as they say in Thailand.",
          "link": "https://birming.com/ditching-desk-dreams/",
          "publishedOn": "2024-08-21T15:17:00.000Z",
          "wordCount": 1257,
          "title": "Ditching the Desk for Dreams",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1724252786.jpg"
        },
        {
          "id": "https://notes.jeddacp.com/sometimes-there-are-just-too-many-words/",
          "author": null,
          "description": "Sometimes I get tired of formulating words to help things make sense. At work, I am either talking things through with someone, writing things down for someone to consume, or typing an email or some sort of message to someone.\nI just want to be given time to process things without having to feel obligated to communicate it with anyone.\nI’ve been craving silence, and the opportunity to just be. There are times I force my inner monologue to be quiet just so I can have some sort of silence. My mind is constantly running at 100mph, and finding peace even during sleep can be hard to come by.\nI haven’t properly journaled in a few weeks because I haven’t had time to process things. I’ve been keeping very rushed day logs privately just to account happenings in my daily life, but that’s it. Keeping my DayOne streak alive.\nI’ve been finding myself thinking too hard, and feeling too much.\nMy life has become such a broken record. It seems like I’m just repeating the same words to describe a multitude of feelings. My physical health has been at a steady decline and I’ve honestly been struggling just to push forward in the mornings.\nWords, sentences, paragraphs. It’s just all too much.\nEven this post has just way too many.\n21/31 - Blaugust\n💬 Community Echoes\n\"I know you might be worried about regrets later, but sometimes it's okay to break the ritual, to interrupt the flow, to just pause and breathe it all in. No achievement is going to light up above your head when you write all the words, read all the books, collect all the things. Not one that'll be worth it in the long run anyway. Be joyful when you can, be reflective when you need to be, but most of all, focus on being. If that means writing, great. If that means quiet, that's great too.\" by Netigen\nReply by email",
          "link": "https://notes.jeddacp.com/sometimes-there-are-just-too-many-words/",
          "publishedOn": "2024-08-21T14:56:00.000Z",
          "wordCount": 1022,
          "title": "Sometimes there are just too many words",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1724252014.png"
        },
        {
          "id": "https://marblethoughts.bearblog.dev/i-had-a-dream-about-you/",
          "author": null,
          "description": "The message was simple: “I had a dream about you.” In my opinion, one of the sweetest things you can say to a person, followed up by something sentimental, absurd, or just plain disturbing.\nThis time, it was actually followed up by, “…Well I don’t remember much but we got hitched. Seemed like the right idea.”\nMy heart didn’t skip a beat, but I couldn’t help but smile. I have always thought that dreams have a way of drumming up the past, tying together old memories with bits of our subconscious. This was the kind of thing that could lead to a nice moment of reconnection, or an awkward ”thanks for letting me know.”\nSurely, it wasn’t overly dramatic or romantic. Just two people enjoying each other’s company in that familiar, comforting way.\nSometimes dreams remind us of what was good, even if it wasn’t meant to be. They’re postcards from a past life- a plea of a “wish you were here,” far from any sense of urgency - but just letting you know “it was once beautiful.”\nIn all honesty, there’s something heartwarming in knowing that I wandered in someone’s dream- that even in the complex landscape of someone’s subconscious thoughts- there’s a place for me.\nI just simply responded with, “It’s nice to know that I’m sweet enough to dream about. The food at the reception must have been good.”\n~ dreams by fleetwood mac,\n<3 K\n🍄\nhttps://marblethoughts.bearblog.dev/",
          "link": "https://marblethoughts.bearblog.dev/i-had-a-dream-about-you/",
          "publishedOn": "2024-08-20T21:05:00.000Z",
          "wordCount": 1034,
          "title": "172. I had a dream about you",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://alexandrawolfe.ca/my-96th-birthday/",
          "author": null,
          "description": "Today I realised this would be my 96th post here, on my Bear blog. And that's just from somewhere from the first week of April. I'm nearing that magic 100 posts. Though, of course, as is typical, I only started the 100DaysToOffload challenge half way through and am only on post 48 of the challenge itself. But hey, that's okay.\nI know I can be a prolific writer and love to talk about everything and anything. You can thank my family and a lack of TV in our house till much later than everyone else on the planet, for that. I can thank my parents for an inquisitive nature, an appetite for reading anything with print on it, and a love of science and nature, and the physical world around us. Funny how growing up without smart devices, TV, and only access to museums and libraries shaped who I am.\n…",
          "link": "https://alexandrawolfe.ca/my-96th-birthday/",
          "publishedOn": "2024-08-20T16:02:00.000Z",
          "wordCount": 936,
          "title": "My 96th Birthday ...",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/awolfe-1720898838.png"
        },
        {
          "id": "https://birming.com/no-secret/",
          "author": null,
          "description": "\"What's the secret?\"\nI asked this question to one of my clients today. He was 85 years old, looked 60, and was as fit and agile as a 50-year-old.\nHe replied: \"There's no secret. I enjoy walking. That’s all.\"\nNo secrets. No tricks. Completely natural.\nBut that's often how it is, isn’t it; we think there's a code to crack, a secret recipe to follow to achieve success. When in reality, the answer lies in the most natural thing in the world.\nIf we want to increase our chances of being in good shape, then we need to make sure we move around a bit. If we want to become a better writer, then we need to make sure we write a lot.\nThere's no secret.",
          "link": "https://birming.com/no-secret/",
          "publishedOn": "2024-08-20T15:08:00.000Z",
          "wordCount": 1073,
          "title": "There's No Secret",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1724166275.jpg"
        },
        {
          "id": "https://wawawa.bearblog.dev/smoking-breaks-for-non-smokers/",
          "author": null,
          "description": "I’m currently outside, having a smoking break.\nI don’t smoke.\nFor some reason, in office environments, it is mainly customary for smoking people to go outside during work hours for breaks.\nUnless they go out to eat, non-smokers tend to remain in the office for the whole day, which frankly sounds unhealthy. Going outside for a short walk, or just to sit with your coffee in the outside air and sun, helps me to unwind a bit, get a little energy to help me with my work later.\nIt’s not that my workplace (or any of my previous office workplaces for that matter) won’t allow people to go outside, but somehow it’s rare for non-smokers to do so. When I went outside with other people, it was mainly with smokers for their smoking breaks.\nI think breaks outside should be the norm for all people in jobs where it’s possible. If you can do it, I encourage you to try.\nLet’s talk about this: [e-mail] [Facebook]",
          "link": "https://wawawa.bearblog.dev/smoking-breaks-for-non-smokers/",
          "publishedOn": "2024-08-20T13:44:40.456Z",
          "wordCount": 904,
          "title": "Smoking Breaks for Non-Smokers",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://zarar.dev/anatomy-of-a-mental-breakdown/",
          "author": null,
          "description": "Note: this made it on HN somehow.\nAround 2AM this morning I had a realization that this was the most stressed I have ever been. On verge of a complete breakdown.\nWhy? Because I noticed around 10PM that jumpcomedy.com was entirely broken with all HTTP POST calls made by RTK Query failing. Nothing worked and though I had deployed recent changes, none of them would cause this. I was at a complete loss as to where to look, especially as this is working locally. Posting on the usual Discords (NextJS, Vercel) is leading to dead silence. I'm alone and have to fix this issue which I didn't cause.\nThis isn't the first production defect I've introduced in my 25 years of working, but this is the first one where I had absolutely nobody to turn to in a time of crisis while customer complaints are pilin…",
          "link": "https://zarar.dev/anatomy-of-a-mental-breakdown/",
          "publishedOn": "2024-08-20T13:15:00.000Z",
          "wordCount": 1612,
          "title": "The anatomy of a 2AM mental breakdown",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://dostoynikov.com/on-becoming/",
          "author": null,
          "description": "I no longer want to simply be a developer, an artist, or a sporty person. I’ve changed my mindset:\nfrom \"I want to be a developer\" to \"I want to become someone who enjoys tinkering with coding and tech every day,\"\nfrom \"I want to be an artist\" to \"I want to become someone who appreciates and creates art,\"\nfrom \"I want to be a runner\" to \"I want to become someone who loves running and taking walks.\"\nThis shift in mindset helps me focus more on the process and the enjoyment of what I do, rather than being fixated on the end result. I’ve realized that I was too focused on the final outcome, neglecting more important things like the process, the joy in what I do, and being present in the moment.\nI remind myself that becoming is a lifelong journey that never truly ends. We never completely become anything; we are always in the process of becoming. So, there’s no point in fixating on final results.\nJust enjoy the path, stay on the path, and keep becoming.",
          "link": "https://dostoynikov.com/on-becoming/",
          "publishedOn": "2024-08-20T10:50:54.087Z",
          "wordCount": 834,
          "title": "On becoming",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://kylevallans.bearblog.dev/zoom_video_is_cheap/",
          "author": null,
          "description": "Welcome!\nOkay, today I am going to be discussing Zoom Video ($ZM) and how it's incredibly \"cheap\", at least on paper!\nLet's start with the obvious.\nThere are a few things that are important to understand for each company. How much cash they have, how much debt they have, and what is the market cap. These 3 things provide you with the ability to calculate the enterprise value (total value).\nLet's take a look at this sheet.\n\nWe can see that $ZM has $7.9 billion dollars worth of cash or cash equivalents (instruments that can be easily converted).\nZoom also has less than a billion dollars in debt - basically zero debt.\nAnd finally, we can calculate the market cap (as of 8/19/24) which is just taking the share price and multiplying it by the outstanding shares. The market cap comes in around $1…",
          "link": "https://kylevallans.bearblog.dev/zoom_video_is_cheap/",
          "publishedOn": "2024-08-19T22:54:00.000Z",
          "wordCount": 1501,
          "title": "A Special Opp on $ZM - It's so cheap!",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/kylevallans-1724188295.png"
        },
        {
          "id": "https://bearlysignificant.com/when-did-you-stop-studying/",
          "author": null,
          "description": "You might answer that you haven't yet (but wish you had). However, if you're in your 30s, have a well-established job, and a busy life (away from academia), you might respond, \"I don't know, since college maybe?\"\nSure, you've learned. You might have explored a topic you're curious about or spent countless hours on Wikipedia. And if your job, like mine, requires you to constantly update your knowledge, your answer might quickly shift to: \"all the time!\"\nPlease, re-read the question.\nI didn't ask when was the last time you learned something new. I'm talking about the act of studying: having a syllabus, a set of disciplines or areas you want to study, and the time to sit down and actually take notes, read books, and do exercises.\nMaybe I'm alone in this feeling, but it's been a while since I took the time to actually study while trying to juggle everything going on.\nThat's why, from now on, I'm going to try to dedicate at least one hour to study every day.\nI'm currently working on my syllabus, which I'll gladly share with you once I've finished it. Feel free to do the same (maybe we can borrow some ideas from each other's schedules).\nTake a moment and think about the areas where you feel you lack knowledge. From ancient Greek culinary arts to quantum physics, pick the topics you really want to dedicate yourself to for the next 6 months.\nI can't wait to learn with you all.",
          "link": "https://bearlysignificant.com/when-did-you-stop-studying/",
          "publishedOn": "2024-08-19T22:28:16.675Z",
          "wordCount": 2044,
          "title": "When did you stop studying?",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/bearlysignificant-1721836514.jpg"
        },
        {
          "id": "https://birming.com/quit-stay/",
          "author": null,
          "description": "A close friend of mine recently landed a new job and is now considering quitting.\nIt's impossible to predict whether you'll enjoy a workplace, but it usually becomes apparent soon after starting. If you consistently feel like \"this is the wrong place for me,\" I strongly believe you should quit as soon as possible. I've personally quit jobs within the first week.\nGiven that work occupies a significant portion of our lives, it's crucial that it feels right. But the very fact that work constitutes a large part of our lives can also mislead us.\nBesides work, we have relationships, hobbies, financial responsibilities, and our health to maintain. And, as we all know, life isn't always a constant joyride. Relationships can strain, health can deteriorate, and unexpected financial problems can arise.\nLife is often challenging. We feel down and want to feel better.\nWe seek solutions and try to identify what needs to change. We yearn for a quick fix, and it's easy to blame work. Considering it occupies around a third of our daily lives, it's not surprising that we hold our jobs accountable.\n\"Yes, of course, it's my workplace. There we have it. I gotta quit!\"\nBut is that really the root of the problem?\nIt might be partially, or not at all. Regardless, it's never wise to make major decisions based on fleeting, fluctuating, and undefined emotions.\nThere's usually no rush. It's worth waiting a while. The most important thing is that it's the right decision, whenever and whatever we decide.\nYou can't eliminate ripples on water with a slap. Wait, and they will eventually subside. Against this still background, the correct answer will emerge.",
          "link": "https://birming.com/quit-stay/",
          "publishedOn": "2024-08-18T12:21:00.000Z",
          "wordCount": 1217,
          "title": "Quit or Stay?",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1723983499.jpg"
        },
        {
          "id": "https://marblethoughts.bearblog.dev/curate-your-love/",
          "author": null,
          "description": "There’s a really nice quote that goes along the lines of “we’re a combination of everything we’ve ever known.” We’re just composed of things that we come across in our lives, and I find that very beautiful.\nYou are a museum.\n~evie\\\nIn essence, love is much like the art of curating a museum. We consider, assess, and most importantly choose the \"artifacts\" of most significance based on what we (uniquely) enjoy. The things we (uniquely) enjoy are informed by factors as varied and disparate as our blood-sugar levels, among other things. We carefully display our \"exhibit of love\" in beautiful frames and tags. \"This is so me.\"\nOr, to put it differently - imagine an unimaginably vast wall that contains every interest, hobby, passion, and person to ever exist. The concepts of \"self\" and \"taste\" le…",
          "link": "https://marblethoughts.bearblog.dev/curate-your-love/",
          "publishedOn": "2024-08-18T12:00:00.000Z",
          "wordCount": 1500,
          "title": "169. Curate your love",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://notes.jeddacp.com/week-notes-018/",
          "author": null,
          "description": "🗓️ // August 10 - August 16, 2024\nI am enjoying writing these Week Notes on Saturday mornings as I drink my first cup of coffee. Today’s a late start since I’m still slightly under the weather but feeling a tiny bit better.\nTook our friend CS down the coast while she was here this past weekend. Every year she visits from the east coast, we take her to a different part of the Bay (Area). Her first year, we explored the city (San Francisco), the second year we went to Point Reyes, and this year we went a little past Half Moon Bay. Pictures slowly incoming in the photo blog.\nA co-worker turned friend recently started a blog. I’ve been talking about my blogging experience the past few months, and since she was looking to start something new, figured she’d try her hand in it. She’s currently t…",
          "link": "https://notes.jeddacp.com/week-notes-018/",
          "publishedOn": "2024-08-17T18:54:00.000Z",
          "wordCount": 1380,
          "title": "Week Notes 018",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1721425535.png"
        },
        {
          "id": "https://birming.com/bearming/",
          "author": null,
          "description": "Bearming is a theme for the Bear blogging platform. You're seeing it in action right now, and it’s easy to customize.\nIt offers a clean and crisp reading experience, using high contrast and clear fonts to enhance readability for readers with low vision.\nBeyond the basic styles, Bearming also includes optional add-ons that provide extra customization options. The current selection, with more to come, features:\nPrint styles.\nHighlighted tab.\nUpvote button.\nRounded corners for images.\nStyles for the Guestbook by Meadow.\nSimply delete the ones you don't want to use.\nIf you want to use the highlighted tab part, it works best if you only have Home, Blog, and any Page in your navigation. Example code:\n<span class=\"nav-home\">[Home](/)</span> <span class=\"nav-blog\">[Blog](/blog/)</span> <span class…",
          "link": "https://birming.com/bearming/",
          "publishedOn": "2024-08-17T16:04:00.000Z",
          "wordCount": 1888,
          "title": "New Bear Theme: Bearming",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1724230437.jpg"
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/uchiyama-gudo-thoughts-during-imprisonment?v=1724225818",
          "author": null,
          "description": "Author: Uchiyama Gudō\nTitle: Thoughts During Imprisonment\nDate: Oct 26, 1909\nSource: Nihon Rekishi Issue 131 (1951)\n\n It is government suppression. It is tyranny. \n Even until now, I am unable to give a viewpoint on whether the ending of a human life is a good or bad thing, regardless of someone giving me a good or bad name for it. Daring to be brief about whether or not to end a human life, I am neither for nor against either choice, because I am for the sake of everybody’s happiness, with an unshakeable faith to stand on the impossible conviction of working for the freedom of any or even all people. \n I wish that I will behave in accordance with the demands of reason and not based on the demands of immediate emotions or instincts based on material desire. If this course of action is in a…",
          "link": "https://theanarchistlibrary.org/library/uchiyama-gudo-thoughts-during-imprisonment?v=1724225818",
          "publishedOn": "2024-08-21T07:36:58.000Z",
          "wordCount": 1707,
          "title": "Uchiyama Gudō - Thoughts During Imprisonment",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7539",
            "url": "https://theanarchistlibrary.org/library/uchiyama-gudo-thoughts-during-imprisonment.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/boak-our-somrade-anarchist-internationalist-from-russia-vladislav-iurchenko-pirate-became-a-mar?v=1724165397",
          "author": null,
          "description": "Author: BOAK\nTitle: Our Сomrade, Anarchist-Internationalist from Russia, Vladislav Iurchenko (“Pirate”), Became a Martyr Defending the Peoples of Ukraine\nDate: August 19, 2024\nSource: Retrieved on 20th August 2024 from telegra.ph and t.me\n\n Another fighter became a martyr. On August 9, our comrade and anarchist-internationalist from Russia, Vladislav Iurchenko (nom de guerre “Pirate”), was killed in battle. He was 22 years old. Vladislav was part of the “Siberian Battalion” of the International Legion, and he was martyred in a fight during a landing operation on the Kinburn Spit. \n Before coming to Ukraine, Vladislav participated in actions of solidarity with anarchist and other anti-government prisoners. He fought against Russian fascism and imperialism. Knowing that anarchists in Ukraine…",
          "link": "https://theanarchistlibrary.org/library/boak-our-somrade-anarchist-internationalist-from-russia-vladislav-iurchenko-pirate-became-a-mar?v=1724165397",
          "publishedOn": "2024-08-20T14:49:57.000Z",
          "wordCount": 1326,
          "title": "BOAK - Our Сomrade, Anarchist-Internationalist from Russia, Vladislav Iurchenko (“Pirate”), Became a Martyr Defending the Peoples of Ukraine",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6978",
            "url": "https://theanarchistlibrary.org/library/boak-our-somrade-anarchist-internationalist-from-russia-vladislav-iurchenko-pirate-became-a-mar.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anarchists-the-hooligans-the-stingies-the-starved-people-and-the-bad-asses?v=1724088997",
          "author": null,
          "description": "Author: Anarchists\nTitle: The Hooligans, the Stingies, the Starved People and the Bad Asses\nDate: 1985\nNotes: This is a translation of a leaflet written in 1985 by anarchists frequenting the Chrysallida social space in Limassol, Cyprus.\nSource: https://movementsarchive.org/doku.php?id=en:leaflets:xrisalllida:kakakakathkia\n\n The football league is over; the mass rallies of July have also passed. The Cuéllar initiative froze, as usual, and everything indicated that Cypriot society would remain for about a month without mass spectacles to organize its boredom. \n And suddenly “chaos” erupts in Germasogeia. A new “fruit” for the “Cypriot reality”; and the hysteria of the occasion is analogous. The newspapers are shouting about hooligans, they are searching for the “brains” (in this place it see…",
          "link": "https://theanarchistlibrary.org/library/anarchists-the-hooligans-the-stingies-the-starved-people-and-the-bad-asses?v=1724088997",
          "publishedOn": "2024-08-19T17:36:37.000Z",
          "wordCount": 1479,
          "title": "Anarchists - The Hooligans, the Stingies, the Starved People and the Bad Asses",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7363",
            "url": "https://theanarchistlibrary.org/library/anarchists-the-hooligans-the-stingies-the-starved-people-and-the-bad-asses.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anonymous-a-friend-of-mine-or-a-friend-of-ours?v=1723997702",
          "author": null,
          "description": "Author: Anonymous\nTitle: A Friend of Mine or a Friend of Ours?\nSubtitle: An Essay On Vouching\nDate: 2024/08/15\nSource: https://unravel.noblogs.org/a-friend-of-mine-or-a-friend-of-ours-an-essay-on-vouching/\n\n Vouching means different things to different anarchists. For some, to vouch for a person means the vouchee is felt to be trustworthy and competent enough for an action. For others, vouching means that the voucher has concrete evidence of the trustworthiness and competence of the vouchee, and is willing to stake their reputation on that evidence. \n To agree on whether to vouch for someone or not, we need to be clear about what we mean by vouching. We propose three components of a vouch that might be helpful in discussing that meaning: trustworthiness, competence, and the voucher's reput…",
          "link": "https://theanarchistlibrary.org/library/anonymous-a-friend-of-mine-or-a-friend-of-ours?v=1723997702",
          "publishedOn": "2024-08-18T16:15:02.000Z",
          "wordCount": 2982,
          "title": "Anonymous - A Friend of Mine or a Friend of Ours?",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "12377",
            "url": "https://theanarchistlibrary.org/library/anonymous-a-friend-of-mine-or-a-friend-of-ours.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/margaret-killjoy-why-i-joined-the-industrial-workers-of-the-world?v=1723882411",
          "author": null,
          "description": "Author: Margaret Killjoy\nTitle: Why I Joined the Industrial Workers of the World\nDate: August 14, 2024\nSource: Retrieved on 17th August 2024 from margaretkilljoy.substack.com\n\n Back in probably 2004, maybe 2005, I was working in Portland, Oregon as a landscaper. It was a small crew, just three of us and our boss. Our boss was, for the most part, pretty cool. He didn’t work us to the bone. He was flexible about time off. He was down to call me Magpie. He paid us under the table. Sometimes he’d cancel work to go surfing. That kind of guy. \n In fact, after my first week of work, I told him: “hey I’m going to leave for about a month to go block roads in Southern Oregon to stop this old growth timber sale, maybe do some treesitting. When I come back, can I have my job back?” and he said yes, an…",
          "link": "https://theanarchistlibrary.org/library/margaret-killjoy-why-i-joined-the-industrial-workers-of-the-world?v=1723882411",
          "publishedOn": "2024-08-17T08:13:31.000Z",
          "wordCount": 2990,
          "title": "Margaret Killjoy - Why I Joined the Industrial Workers of the World",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "10542",
            "url": "https://theanarchistlibrary.org/library/margaret-killjoy-why-i-joined-the-industrial-workers-of-the-world.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/zhachev-anarchy-and-the-mythic-path?v=1723842478",
          "author": null,
          "description": "Author: Zhachev\nTitle: Anarchy and the Mythic Path\nDate: 08/09/2024\nSource: https://zhachev.substack.com/p/anarchy-and-the-mythic-path\n\n Fluctuations within a continuum can be generated from diverging narratives. Uncertain climes, alternative timelines. Chronoflipping, retroswitching, taleshifting. An alterverse created via timeforge. Terra incognita.\n Narratives serve the function of temporal modulators, unbound by the shackles of progress and linearity. Vectors of radivergence. Distorting, disrupting, and corrupting conventional chronologies, conduits to alternative realities proliferate with every shift in narrative azimuth. Each story is a potential rupture in the continuum of time, a machinic assemblage capable of bearing a plethora of parallel existences. Through an intricate tango b…",
          "link": "https://theanarchistlibrary.org/library/zhachev-anarchy-and-the-mythic-path?v=1723842478",
          "publishedOn": "2024-08-16T21:07:58.000Z",
          "wordCount": 1154,
          "title": "Zhachev - Anarchy and the Mythic Path",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6461",
            "url": "https://theanarchistlibrary.org/library/zhachev-anarchy-and-the-mythic-path.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/unsalted-red-flags-before-you-join-that-org?v=1723779932",
          "author": null,
          "description": "Author: Unsalted Counter Info\nTitle: Red Flags: Before You Join That Org…\nSubtitle: A Primer on Authoritarian & Vanguard Communist Groups & What You Can Do Instead\nDate: June 3, 2024\nSource: Retrieved on 10 August 2024 from unsalted.noblogs.org/files/2024/06/RedFlags_Web1.pdf\n\n\nIntro\n When we pay attention to the amount of injustice in the world, we find ourselves wanting to do something about it. And we don’t want to do just anything. We want to participate in what can most strategically stop those injustices. We need to organize together to confront what is killing us and the planet. \n If you go looking for others involved in this resistance work, you might stumble across some organizations that seem to have all the answers. They say they know exactly how to bring capitalism to its knees…",
          "link": "https://theanarchistlibrary.org/library/unsalted-red-flags-before-you-join-that-org?v=1723779932",
          "publishedOn": "2024-08-16T03:45:32.000Z",
          "wordCount": 5513,
          "title": "Unsalted Counter Info - Red Flags: Before You Join That Org…",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "163147",
            "url": "https://theanarchistlibrary.org/library/unsalted-red-flags-before-you-join-that-org.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/uploads/en/thumbnails/u-r-unsalted-red-flags-before-you-join-that-org-1.jpg.large.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/bill-templer-from-mutual-struggle-to-mutual-aid?v=1723779766",
          "author": null,
          "description": "Author: Bill Templer\nTitle: From Mutual Struggle to Mutual Aid\nSubtitle: Moving Beyond the Statist Impasse in Israel/Palestine\nDate: 2003\nSource: Borderlands volume 2 number 3, 2003. Retrieved from https://web.archive.org/web/20180123112424/http://www.borderlands.net.au/vol2no3_2003/templer_impasse.htm\n\nWhat about a no-state solution? Self determination for everyone, no borders, police, or soldiers. A right-of-return for both Jews and Palestinians. —Pirate Prentice (2002)\nThe regime that will succeed the nation-state will not be the fruit of preconception or social engineering, but of sociological and political imagination wielded through transformative actions. —Gustavo Esteva (2003)\nI Introduction: Reclaiming the Commons\n 1. Reinventing politics in Israel and Palestine means laying the g…",
          "link": "https://theanarchistlibrary.org/library/bill-templer-from-mutual-struggle-to-mutual-aid?v=1723779766",
          "publishedOn": "2024-08-16T03:42:46.000Z",
          "wordCount": 11897,
          "title": "Bill Templer - From Mutual Struggle to Mutual Aid",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "180281",
            "url": "https://theanarchistlibrary.org/library/bill-templer-from-mutual-struggle-to-mutual-aid.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/fury-of-a-rebel-poet?v=1723779574",
          "author": null,
          "description": "Author: David S. D’Amato\nTitle: Fury of a Rebel Poet\nSubtitle: The Anarchism of Joseph Déjacque\nDate: August 2, 2024\nSource: https://www.counterpunch.org/2024/08/02/fury-of-a-rebel-poet-the-anarchism-of-joseph-dejacque/\n\n The French firebrand Joseph Déjacque lived a short life defined by a wild and beautiful struggle against authority, a life of intense passion for freedom and genuine class war. Unlike many of the seminal figures of the anarchist movement, Déjacque was truly of the working class. Born in 1821, he was raised in Paris by a single mother, who had become a widow when he was very young, and he worked full time from the age of 12. His trade was house painting and wallpaper hanging, but as we shall see, he was an able polemicist and poet; his words were a shot of adrenaline to ra…",
          "link": "https://theanarchistlibrary.org/library/fury-of-a-rebel-poet?v=1723779574",
          "publishedOn": "2024-08-16T03:39:34.000Z",
          "wordCount": 2895,
          "title": "David S. D’Amato - Fury of a Rebel Poet",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "11448",
            "url": "https://theanarchistlibrary.org/library/fury-of-a-rebel-poet.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/antiauthoritarians-internationalists-minimal-contribution-for-communicating-to-the-turkish-cypr?v=1723779503",
          "author": null,
          "description": "Author: Antiauthoritarians-Internationalists\nTitle: Minimal Contribution for Communicating to the Turkish Cypriot Revolutionary Internationalists the Hypocrisy of The ‘Rapprochement’ Elite of the Greek Cypriot State Intellectuals and Social Patriots\nDate: 1989\nSource: https://movementsarchive.org/doku.php?id=en:leaflets:unclassified:antieksousiastes_epanaprosegisi\n\n Until today, we knew that the mechanisms of repression of the state and capital were the army, the police, the schools, the psychiatric hospitals. Now we know that along with them have been added the Greek Cypriot ‘rapprochement’ state intellectuals and social-patriots. How else could we explain the fact that these gentlemen invite representatives from all the supposedly re-reunificationist areas to such a meeting — for represe…",
          "link": "https://theanarchistlibrary.org/library/antiauthoritarians-internationalists-minimal-contribution-for-communicating-to-the-turkish-cypr?v=1723779503",
          "publishedOn": "2024-08-16T03:38:23.000Z",
          "wordCount": 1288,
          "title": "Antiauthoritarians-Internationalists - Minimal Contribution for Communicating to the Turkish Cypriot Revolutionary Internationalists the Hypocrisy of The ‘Rapprochement’ Elite of the Greek Cypriot State Intellectuals and Social Patriots",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6924",
            "url": "https://theanarchistlibrary.org/library/antiauthoritarians-internationalists-minimal-contribution-for-communicating-to-the-turkish-cypr.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/nvp-is-there-a-non-colonial-language-in-cyprus-and-if-yes-should-we-all-speak-eteo-cypriot?v=1723779471",
          "author": null,
          "description": "Author: nvp\nTitle: Is there a non-colonial language in Cyprus? And if yes, should we all speak Eteo-Cypriot?\nDate: 2017\nSource: https://movementsarchive.org/doku.php?id=en:digital:kontrasousta:kontrasousta_language_nvp\n\n No one can argue that language is not, at a certain level of analysis, a political tool. People in Cyprus intuitively know this, and that’s why I won’t go into the theory, but instead focus on the practical. \n Language is political, and we, as individuals and groups, are doing politics. Sometimes consciously, other times less so. This website was also created by a series of political decisions, some of which quite conscious (it is a website which doesn’t limit itself to one part of Cyprus, even though the default option is to segregate). It is, among other things, a spirit…",
          "link": "https://theanarchistlibrary.org/library/nvp-is-there-a-non-colonial-language-in-cyprus-and-if-yes-should-we-all-speak-eteo-cypriot?v=1723779471",
          "publishedOn": "2024-08-16T03:37:51.000Z",
          "wordCount": 2158,
          "title": "nvp - Is there a non-colonial language in Cyprus? And if yes, should we all speak Eteo-Cypriot?",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "8749",
            "url": "https://theanarchistlibrary.org/library/nvp-is-there-a-non-colonial-language-in-cyprus-and-if-yes-should-we-all-speak-eteo-cypriot.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/antifascists-on-the-expulsion-of-fascists-in-faneromeni?v=1723779406",
          "author": null,
          "description": "Author: Antifascists\nTitle: On the expulsion of fascists in Faneromeni\nDate: 2013\nSource: https://movementsarchive.org/doku.php?id=en:digital:unclassified:faneromeni_fasistes\n\n The provocative show which took place two weeks ago, by members of ELAM (who also have a 5-year temporary contract working for the Cypriot national army) wearing Golden Dawn t-shirts in a cafe in Faneromeni square in Nicosia, could only get a dynamic antifascist response. By the time they were spotted in the square, a lot of people isolated them and threw them away shouting antifascist songs and showing them efficiently that there is zero tolerance in neo-nazism expressions. Why did all this happen? Why did a group of people attacked people wearing Golden Dawn t-shirts? Isn’t it a democratic right for anyone to wear…",
          "link": "https://theanarchistlibrary.org/library/antifascists-on-the-expulsion-of-fascists-in-faneromeni?v=1723779406",
          "publishedOn": "2024-08-16T03:36:46.000Z",
          "wordCount": 965,
          "title": "Antifascists - On the expulsion of fascists in Faneromeni",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "5855",
            "url": "https://theanarchistlibrary.org/library/antifascists-on-the-expulsion-of-fascists-in-faneromeni.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anonymous-get-a-job?v=1723779226",
          "author": null,
          "description": "Author: anonymous\nTitle: Get a Job!\nSubtitle: On the Usefulness of Jobs and Small Businessess for Illegalist Anarchists\nDate: 08/08/2024\nSource: https://unravel.noblogs.org/the-unemployment-problem/\n\n Anarchists sometimes need money: we need to pay our cell phone bills; buy bus tickets to the hopout; get enough money to buy the squat that we’re about to get evicted from. Some things are just hard to steal, like guns, or are only available online, like decent scanner radios or jamming equipment. \n Individualist and lifestyle anarchists hold their nose and do legitimate work just long enough to get what they need, aiming for enough money to comfortably hit the road, hit the hay, or hit the target. \n Socialist anarchists, on the other hand, are willing to engage in legitimate work, seeing it …",
          "link": "https://theanarchistlibrary.org/library/anonymous-get-a-job?v=1723779226",
          "publishedOn": "2024-08-16T03:33:46.000Z",
          "wordCount": 1902,
          "title": "anonymous - Get a Job!",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "11146",
            "url": "https://theanarchistlibrary.org/library/anonymous-get-a-job.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}