{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "1acc45900a7fda30d9bf8fb9760ddc9d5552bb16",
          "author": "Betty Zheng (郑予彬)",
          "description": "As we move into the second week of 2025, China is celebrating Laba Festival (腊八节), a traditional holiday, which marks the beginning of Chinese New Year preparations. On this day, Chinese people prepare Laba congee, a special porridge combining various grains, dried fruits, and nuts. This nutritious mixture symbolizes harmony, prosperity, and good fortune — […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-new-asia-pacific-region-dynamodb-updates-amazon-q-developer-and-more-january-13-2025/",
          "publishedOn": "2025-01-13T17:29:48.000Z",
          "wordCount": 1726,
          "title": "AWS Weekly Roundup: New Asia Pacific Region, DynamoDB updates, Amazon Q developer, and more (January 13, 2025)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/08/13/AWS-WIR-default.png"
        },
        {
          "id": "3acab191e810ab04e856c629a911bcd01c319944",
          "author": "Donnie Prakoso",
          "description": "AWS launches Asia Pacific (Thailand) Region with 3 Availability Zones, accelerating cloud adoption. Strategically located to meet data residency needs, it drives innovation across industries. Early AWS adopters in Thailand share transformative success stories. Get started now!",
          "link": "https://aws.amazon.com/blogs/aws/announcing-the-new-aws-asia-pacific-thailand-region/",
          "publishedOn": "2025-01-08T02:30:36.000Z",
          "wordCount": 2083,
          "title": "Announcing the new AWS Asia Pacific (Thailand) Region",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/12/11/RL_Mango__Blog_Thumbnail_800x400.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": [
        {
          "id": "fd3cb31ad717b211b9d8b69c5026317bbc10338b",
          "author": "Suresh Kanniappan",
          "description": "This post shows how cloud-based services can transform traditional B2B communication processes, offering supply chain companies a path to improved efficiency, compliance, and customer satisfaction. For supply chain providers facing similar challenges, this solution offers a blueprint for modernizing file transfer systems while maintaining compliance with industry standards.",
          "link": "https://aws.amazon.com/blogs/architecture/tvs-supply-chain-solutions-built-a-file-transfer-platform-using-aws-transfer-family-for-as2-for-b2b-collaboration/",
          "publishedOn": "2025-01-13T21:52:14.000Z",
          "wordCount": 2262,
          "title": "TVS Supply Chain Solutions built a file transfer platform using AWS Transfer Family for AS2 for B2B collaboration",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fc074d501302eb2b93e2554793fcaf50b3bf7291/2025/01/06/ARCHBLOG-1059-Image03-1260x574.jpg"
        }
      ]
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps & Developer Productivity Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": [
        {
          "id": "1e9253b5106cc05b2207ede3364004b821c94b8d",
          "author": "Marco Frattallone",
          "description": "Introduction Developers, IT Operators, and in some cases, Site Reliability Engineers (SREs) are responsible for deploying and operating infrastructure and applications, as well as responding to and resolving incidents effectively and in a timely manner. Effective incident management requires quick diagnosis, root cause analysis, and implementation of corrective actions. Diagnosing the root cause can be […]",
          "link": "https://aws.amazon.com/blogs/devops/unlocking-aws-console-diagnosing-errors-with-amazon-q-developer/",
          "publishedOn": "2025-01-10T13:58:57.000Z",
          "wordCount": 3097,
          "title": "Unlocking AWS Console: Diagnosing Errors with Amazon Q Developer",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2025/01/10/Slide1.png"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": []
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=350131",
          "author": "Elliot Sperber",
          "description": "The late great Kei Utsume Who lived there all his life Except when he was forced Off locked in Manzanar Got on stage at Al’s Bar And declaimed: It isn’t the City of Angels It’s the city of La Reina De Los Angeles The Queen of Angels Mary, man You could call it Maryland The  More\nThe post The Queen of Angels appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/14/the-queen-of-angels/",
          "publishedOn": "2025-01-14T05:20:55.000Z",
          "wordCount": null,
          "title": "The Queen of Angels",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349927",
          "author": "Thomas Drake",
          "description": "What’s possible with Trump 2.0? As pie in the sky as it might seem or appear (and chances that admittedly approach zero), the incoming Trump 2.0 Administration does have a golden opportunity to reform the federal government, the administrative state, the ‘deep state’ and truly re-make democracy in America for, of and by the People — without dismantling or demolishing it in the process. More\nThe post Pre-Inauguration Perceptions on Eve of Trump 2.0 appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/13/pre-inauguration-perceptions-on-eve-of-trump-2-0/",
          "publishedOn": "2025-01-13T07:00:12.000Z",
          "wordCount": null,
          "title": "Pre-Inauguration Perceptions on Eve of Trump 2.0",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=350002",
          "author": "David Rovics",
          "description": "LA completely embodies the concept of the endless American suburb, where people have historically gone to buy their little patch of paradise, or their big patch of paradise, depending on how wealthy they may be.  But now paradise has burned, again.  And whether you're one of the estimated 70,000 people in Los Angeles County living on the streets (some of whom may be staying warm in the winter with propane heaters in their tents), or a movie star in a mansion with a nice, safe, fireplace, we're all equal under the Santa Anna winds, just as prone to the errant cigarette butt as everyone else, just as strong as the weakest link in the chain. More\nThe post The Coming Fires appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/13/the-coming-fires/",
          "publishedOn": "2025-01-13T06:57:26.000Z",
          "wordCount": null,
          "title": "The Coming Fires",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=350045",
          "author": "Aaron Kirshenbaum",
          "description": "Earlier on Wednesday, January 8th, I saw a prominent Zionist commentator and Twitter/X User post, “Has Greta Thunberg taken her keffiyeh off to address the fires in LA yet or are there too many Jews living here for her to be concerned?” The weird implications about a mythical antisemitic malice that climate activist Greta Thunberg has to supposedly fuel her anti-genocide and ecocide beliefs aside, the post is equally embarrassing in its lack of understanding about the exacerbators of Los Angeles’ most destructive fires in the metropolitan area’s history. Sadly, the disconnect that this post showcases is representative of many people and institutions, not only in explicitly pro-Israel spaces but also in the environmental movement. The US military is the #1 institutional polluter in the world. Cities across the country have been sacrificed by the local and federal prioritization of militarism and policing. Our endless wars have pushed forward the climate crisis, and now its catastrophic results are once again terrifyingly visible inside the belly of the beast. More\nThe post The Fires in Gaza are the Fires in LA appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/13/the-fires-in-gaza-are-the-fires-in-la/",
          "publishedOn": "2025-01-13T06:56:54.000Z",
          "wordCount": null,
          "title": "The Fires in Gaza are the Fires in LA",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349911",
          "author": "Edgar Kaskla",
          "description": "There are plenty of people lining up to lay blame for the thousands of buildings destroyed during the recent firestorms, fueled by Santa Ana winds. The incoming president blames the governor who is supposedly more interested in saving Sacramento river smelt than anything else, resulting—so it is claimed—in water shortages in Southern California. Wait, what?  More\nThe post Santa Ana Winds and the New Normal appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/13/santa-ana-winds-the-new-normal/",
          "publishedOn": "2025-01-13T06:56:42.000Z",
          "wordCount": null,
          "title": "Santa Ana Winds and the New Normal",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=350023",
          "author": "Harvey Wasserman",
          "description": "Los Angeles is now being destroyed by fire. Next will be the “Big One” earthquake everyone knows is coming. And then—unless we take immediate action—Diablo Canyon’s radioactive cloud will make this region a radioactive dead zone. My family is now besieged by four fires raging less than four miles away.  We don’t know how long our  More\nThe post Newsom’s Atomic Folly: Now By Fire, Next by Quake, Then by Apocalyptic Radiation?   appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/13/newsoms-atomic-folly-now-by-fire-next-by-quake-then-by-apocalyptic-radiation/",
          "publishedOn": "2025-01-13T06:56:23.000Z",
          "wordCount": null,
          "title": "Newsom’s Atomic Folly: Now By Fire, Next by Quake, Then by Apocalyptic Radiation?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=350065",
          "author": "Nick Licata",
          "description": "Conservatives claim that Donald Trump’s electoral victories show that his Republican Party, not the Democrats, now represents the working class. Sen. Josh Hawley tweeted on election night 2020, “We are a working-class party now. That’s the future.”  Although unions only represent 10% of the working-class labor force, since 1980, Democrats have not dipped below 51%. However, as  More\nThe post Are the Republicans Now the Working-Class Party? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/13/are-the-republicans-now-the-working-class-party/",
          "publishedOn": "2025-01-13T06:55:35.000Z",
          "wordCount": null,
          "title": "Are the Republicans Now the Working-Class Party?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=350069",
          "author": "M. Reza Behnam",
          "description": "As gatekeepers of the corporate information bazaar, you have served Israel well.  Echoing the propaganda of Tel Aviv and Washington has become mainstream fare, with omission at the heart of the campaign.   Thomas Jefferson, America’s third president, judiciously wrote in 1789: “Whenever the people are well informed, they may be trusted with their own government.”  Unfortunately, today’s media mind  More\nThe post Israel Bombs, America Yawns and Gatekeepers Con appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/13/israel-bombs-america-yawns-and-gatekeepers-con/",
          "publishedOn": "2025-01-13T06:55:34.000Z",
          "wordCount": null,
          "title": "Israel Bombs, America Yawns and Gatekeepers Con",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=350067",
          "author": "Binoy Kampmark",
          "description": "Climate change, like any crisis afflicting earth and humanity, is bound to bring out the best and the worst of a species that soils its nest, salts the earth, and poisons its nourishing rivers.  For those benefiting from plunder and bounty, change is a hard thing to accept.  Kleptocrats and the extractive industries, renters of land, and  More\nThe post Targeting Climate Change Protests appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/13/targeting-climate-change-protests/",
          "publishedOn": "2025-01-13T06:55:02.000Z",
          "wordCount": null,
          "title": "Targeting Climate Change Protests",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=350071",
          "author": "George Ochenski",
          "description": "In his recent inaugural speech, Montana Gov. Greg Gianforte spoke about how we have what the rest of the nation wants, saying: “The American dream lives in Montana and it’s here where we are proving what is possible when the government gets out of the way and empowers the people.” If anything, his words reflect  More\nThe post Beware ‘Unleashing Freedom’ to Plunder and Pollute appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/13/beware-unleashing-freedom-to-plunder-and-pollute/",
          "publishedOn": "2025-01-13T06:54:52.000Z",
          "wordCount": null,
          "title": "Beware ‘Unleashing Freedom’ to Plunder and Pollute",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=350029",
          "author": "Ramzy Baroud",
          "description": "The first official reference to Gaza becoming increasingly uninhabitable was made by the United Nations Conference on Trade and Development (UNCTAD) in 2012, when the population of the Gaza Strip was estimated at 1.8 million inhabitants. The intention of the report, “The Gaza Strip: The Economic Situation and the Prospects for Development,” was not merely  More\nThe post Israel Destroyed Gaza ‘for Generations to Come’ and the World Stayed Silent appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/13/israel-destroyed-gaza-for-generations-to-come-and-the-world-stayed-silent/",
          "publishedOn": "2025-01-13T06:52:39.000Z",
          "wordCount": null,
          "title": "Israel Destroyed Gaza ‘for Generations to Come’ and the World Stayed Silent",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349941",
          "author": "Sarah Hyden",
          "description": "Smokey Bear tells us “only you can prevent wildfires.” That has been Smokey’s simple message since 1944, but nevertheless he has been long associated with the policy of immediately suppressing all wildfires. This policy was called the 10 AM policy, and it meant that all wildfires should be suppressed by 10 AM of the morning  More\nThe post Smokey Bear is Partially Right appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/13/smokey-bear-is-partially-right/",
          "publishedOn": "2025-01-13T06:50:42.000Z",
          "wordCount": null,
          "title": "Smokey Bear is Partially Right",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=350036",
          "author": "Kathy Kelly",
          "description": "Over the past three years, a collective of volunteer researchers, lawyers, and commentators created The Merchants of Death War Crimes Tribunal, dedicated to holding accountable four weapon manufacturing corporations based in the U.S. Their tribunal amassed copious evidence to prove that Boeing, Lockheed Martin, RTX (formerly Raytheon), and General Atomics (a company which manufactures weaponized  More\nThe post Dr. Martin Luther King’s Prophetic Warning, Denouncing the Merchants of Death appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/13/dr-martin-luther-kings-prophetic-warning-denouncing-the-merchants-of-death/",
          "publishedOn": "2025-01-13T06:50:22.000Z",
          "wordCount": null,
          "title": "Dr. Martin Luther King’s Prophetic Warning, Denouncing the Merchants of Death",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349947",
          "author": "Rick Baum",
          "description": "Reductions in the purchasing power of one’s income occur when cost-of-living increases just keep up with the rate of inflation and are simultaneously accompanied by greater imposed costs. This has happened to Social Security recipients who are on Medicare. The 2025 Social Security Cost of Living Adjustment (COLA) of 2.5% is being undermined by the  More\nThe post The Unfairness and Inadequacy of Social Security Cost of Living Adjustment Increases appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/13/the-unfairness-and-inadequacy-of-social-security-cost-of-living-adjustment-increases/",
          "publishedOn": "2025-01-13T06:48:57.000Z",
          "wordCount": null,
          "title": "The Unfairness and Inadequacy of Social Security Cost of Living Adjustment Increases",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=350001",
          "author": "Dean Baker",
          "description": "Donald Trump seems confused about how tariffs work, but that doesn’t mean the rest of us need to be also. It actually is fairly simple, let’s take the case where we are shopping at Temu. Temu advertises this neat icemaker for $52.62. Trump says he wants to place a 100 percent tariff on the goods  More\nThe post Trump’s Tariffs Mean Taxes at Temu appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/13/trumps-tariffs-mean-taxes-at-temu/",
          "publishedOn": "2025-01-13T06:25:32.000Z",
          "wordCount": null,
          "title": "Trump’s Tariffs Mean Taxes at Temu",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349724",
          "author": "Pete Dolack",
          "description": "People in Global South countries have agency. They can and do understand the realities of their material conditions. Apparently it is necessary to write the preceding two sentences.\nYou, dear reader, may be wondering why I have written such obvious statements. Don’t people everywhere possess agency, the ability to understand and act upon the political, cultural and social conditions of their community, nation and country? Yes of course they do. So why write the obvious? Because it appears that there are those, sadly partisans of the Left, that don’t believe the peoples of the Global South have agency.\nTo read this article, log in here or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post The Uses and Misuses of Ideology in Analyzing the Syrian Overthrow appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/12/the-uses-and-misuses-of-ideology-in-analyzing-the-syrian-overthrow/",
          "publishedOn": "2025-01-12T06:50:32.000Z",
          "wordCount": null,
          "title": "The Uses and Misuses of Ideology in Analyzing the Syrian Overthrow",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349934",
          "author": "T.J. Coles",
          "description": "Still from Eyes Wide Shut. Still from Eyes Wide Shut. Still from Eyes Wide Shut. Still from Eyes Wide Shut. Still from Eyes Wide Shut. Still from Eyes Wide Shut. Still from Eyes Wide Shut. Still from Eyes Wide Shut. Still from Eyes Wide Shut. Still from Eyes Wide Shut. Still from Eyes Wide Shut. […]\nTo read this article, log in here or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post We Still Have Our Eyes Wide Shut to Modern Slavery appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/12/we-still-have-our-eyes-wide-shut-to-modern-slavery/",
          "publishedOn": "2025-01-12T05:50:49.000Z",
          "wordCount": null,
          "title": "We Still Have Our Eyes Wide Shut to Modern Slavery",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349901",
          "author": "Jeffrey St. Clair",
          "description": "To be a journalist in Gaza is to be a target of the Israelis. To be a Palestinian journalist is to be a target of the Israelis and the international press, which refuses to recognize you as a media of their tribe. How else to explain the otherwise incomprehensible indifference to the systematic slaughter of […]\nTo read this article, log in here or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Dead Consciences appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/11/dead-consciences/",
          "publishedOn": "2025-01-11T15:45:39.000Z",
          "wordCount": null,
          "title": "Dead Consciences",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349843",
          "author": "Josh Frank",
          "description": "On this episode of CounterPunch Radio, Joshua Frank and Erik Wallenberg talk with Kim Kelly and Hamilton Nolan about what to expect in the next four years of Trump and how to build labor power in a world dominated by billionaires.\nKim Kelly is a writer and labor activist based in Philadelphia. She is the author of Fight Like Hell: The Untold History of American Labor.\nHamilton Nolan is a labor journalist who writes regularly for In These Times magazine and The Guardian. His new book is The Hammer: Power, Inequality, and the Struggle for the Soul of Labor. More\nThe post Kim Kelly and Hamilton Nolan: Labor in the Age of Trump appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/kim-kelly-and-hamilton-nolan-labor-in-the-age-of-trump/",
          "publishedOn": "2025-01-10T17:44:10.000Z",
          "wordCount": null,
          "title": "Kim Kelly and Hamilton Nolan: Labor in the Age of Trump",
          "itunes": {
            "duration": "51:44"
          },
          "enclosure": {
            "url": "https://media.blubrry.com/counterpunch_radio/content.blubrry.com/counterpunch_radio/KimandHam.mp3",
            "length": "99326248",
            "type": "audio/mpeg"
          },
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349765",
          "author": "Joshua Frank",
          "description": "As I sit at my desk to write, the light shining through my office window is a distinct orange, and the sky outside is a murky, polluted shade of brown. The air quality is horrendous, and my eyes are dry and itchy. My throat is sore. Two major fires are still raging out of control in Los Angeles, the city I love, with little to no containment. Another has just erupted in Woodland Hills. Fortunately, we're in a safe zone away from the infernos. Many more are not so lucky.\nScrolling through the latest fire updates on social media, I quickly read commenters who are cheering on the flames as if they’ve been ignited to smoke out the wealthy elites from their mansions. They seem gleeful. A few conspiracists I come across believe this is all a planned land grab (by whom I'm unsure), while others spread lies that the shadowy Deep State, the ones behind weather-altering chemtrails, is somehow responsible.  More\nThe post Burn, Hollywood, Burn? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/burn-hollywood-burn/",
          "publishedOn": "2025-01-10T07:01:34.000Z",
          "wordCount": null,
          "title": "Burn, Hollywood, Burn?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349665",
          "author": "Jeffrey St. Clair",
          "description": "There’s nothing so terrifying as a nightmare come to life. The Santa Ana winds have haunted the dreams of southern Angelinos for decades. Like the Chinooks of the Rockies and the Mistrals of the Rhone Valley, these winds play on the mind. They tell you they’re coming for you. They whisper the dangers they bring with them. Van Gogh believed the mistral inflamed his madness. Another kind of madness seems to be inflicting LA, the madness of boundless consumption. More\nThe post Roaming Charges: Hurricane of Fire appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/roaming-charges-hurricane-of-fire/",
          "publishedOn": "2025-01-10T07:00:55.000Z",
          "wordCount": null,
          "title": "Roaming Charges: Hurricane of Fire",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349642",
          "author": "Vijay Prashad",
          "description": "From early December 2024 to early January 2025, the body temperature of eight babies fell below any acceptable amount and they froze to death. This condition is known as hypothermia. The most recent of these children to die, Yousef, was sleeping beside his mother because, as she told Al Jazeera, of the very cold weather. Temperatures in Gaza have fallen to just above freezing, which in the context of a lack of housing, blankets, and warm bedclothes is deadly. Body heat is the only protection, which is minimal for an infant. Yousef’s mother said, “He slept next to me and in the morning I found him frozen and dead. I don’t know what to say. No one can feel my misery. No one in the world can understand our catastrophic situation.” More\nThe post The Children of Gaza Are Freezing to Death appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/the-children-of-gaza-are-freezing-to-death/",
          "publishedOn": "2025-01-10T07:00:54.000Z",
          "wordCount": null,
          "title": "The Children of Gaza Are Freezing to Death",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349822",
          "author": "David Yearsley",
          "description": "On the last Sunday of this past October, a Timothée Chalamet look-alike contest broke out in Washington Square Park in New York City. Dozens of participants and thousands of onlookers thronged to the event and when, in the midst of the proceedings, the famed actor himself appeared the throng went into paroxysms of ecstasy. Seemingly equipped with endless stores of good humor, good looks, and God-given talent, Chalamet made his way through the roiling sea of admirers and impersonators and let himself be photographed with the winner, Miles Mitchell, who had come costumed as Chalamet as Willy Wonka, the title role assumed by the actor in the latest movie remake devoted to the campy chocolatier. More\nThe post Hands, Fingers, Nose and Throat: Re-Doing Dylan appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/hands-fingers-nose-and-throat-re-doing-dylan/",
          "publishedOn": "2025-01-10T06:59:48.000Z",
          "wordCount": null,
          "title": "Hands, Fingers, Nose and Throat: Re-Doing Dylan",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349520",
          "author": "Charles Pierson",
          "description": "Towards the end of Sinclair Lewis’ 1935 novel, It Can’t Happen Here, the fascist dictatorship which has come to power in the US has launched a war of aggression against Mexico. I thought of this as I read that President-Elect Donald Trump has been talking about using US special operations units against Mexican drug cartels.  More\nThe post The Yanquis Are Coming: Trump Threatens a “Soft Invasion” of Mexico appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/the-yanquis-are-coming-trump-threatens-a-soft-invasion-of-mexico/",
          "publishedOn": "2025-01-10T06:57:52.000Z",
          "wordCount": null,
          "title": "The Yanquis Are Coming: Trump Threatens a “Soft Invasion” of Mexico",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349714",
          "author": "Robert Hunziker",
          "description": "Net Zero/2050 Fantasy or Reality may be the most significant issue of the 21st century. Net Zero refers to the balance between the amount of greenhouse gas (GHG), such as CO2, that’s produced and the amount that’s removed from the atmosphere. It can be achieved through a combination of emission reduction and emission removal. The  More\nThe post Net Zero/2050 Fantasy or Reality? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/net-zero-2050-fantasy-or-reality/",
          "publishedOn": "2025-01-10T06:57:38.000Z",
          "wordCount": null,
          "title": "Net Zero/2050 Fantasy or Reality?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349719",
          "author": "Henry Giroux",
          "description": "Before even taking office, Trump has conjured grotesque visions of what he once called the dreams of a “unified Reich.” His delusions of grandeur, disdain for reason and truth, sycophantic worship of billionaires and despots, militarism, and embrace of white supremacy signal the rebirth of authoritarianism on a scale that recalls the horrors of the Third Reich, Pinochet’s Chile, and Putin’s Russia. More\nThe post Beyond the Illusion: The Dark Dream of a Totalitarian Empire appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/beyond-the-illusion-the-dark-dream-of-a-totatitarian-empire/",
          "publishedOn": "2025-01-10T06:57:38.000Z",
          "wordCount": null,
          "title": "Beyond the Illusion: The Dark Dream of a Totalitarian Empire",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349709",
          "author": "Joseph Natoli",
          "description": "“The wind blows to the south and goes around to the north; Around and around goes the wind, and on its circuits the wind returns.” – Ecclesiastes I won’t bury the lead: There are two existential bullet points Americans face along with the entire planet: Human driven global warming rendering the Earth unlivable for species,  More\nThe post What Can He Do? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/what-can-he-do/",
          "publishedOn": "2025-01-10T06:56:57.000Z",
          "wordCount": null,
          "title": "What Can He Do?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349521",
          "author": "Jerry Long",
          "description": "As an older man, I’ve learned to fully embrace joy in whatever form it chooses to reveal itself. To caress the fleeting happiness of existential pleasures. To cherish sensation, be it the foam of an ocean breaker or the feel of a productive bowel movement. And although I’ve spent a lifetime refusing to suffer fools,  More\nThe post Searching for Joy in the Democratic Party appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/searching-for-joy-in-the-democratic-party/",
          "publishedOn": "2025-01-10T06:56:51.000Z",
          "wordCount": null,
          "title": "Searching for Joy in the Democratic Party",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349718",
          "author": "Ramzy Baroud",
          "description": "Suddenly, Yoav Gallant, Israel’s notorious Minister of Defense, disappeared into obscurity. The man who served in his country’s military for about 35 years, in politics for nearly 10, and oversaw major wars, including the ongoing genocide in Gaza, quickly retreated from headlines and political significance. In his resignation letter, Gallant accused Israeli Prime Minister Benjamin  More\nThe post The War Criminal ‘Victim’: Netanyahu’s Inevitable Fate appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/the-war-criminal-victim-netanyahus-inevitable-fate/",
          "publishedOn": "2025-01-10T06:56:00.000Z",
          "wordCount": null,
          "title": "The War Criminal ‘Victim’: Netanyahu’s Inevitable Fate",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349660",
          "author": "Stephen F. Eisenman",
          "description": "Gwen avocado (attribution), photographer unknown, n.d. “Is this truth I’m delivering up, or is it just plain kvetching? Or is kvetching for people like me a form of truth?” – Philip Roth, Portnoy’s Complaint,1969 Form and content of the expat’s kvetch Harriet knew it would happen eventually but was surprised it was so soon. Barely  More\nThe post Kvetching, the Highest Stage of Capitalism appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/kvetching-the-highest-stage-of-capitalism/",
          "publishedOn": "2025-01-10T06:55:47.000Z",
          "wordCount": null,
          "title": "Kvetching, the Highest Stage of Capitalism",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=285423",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics; Trump transition: Gabbard, Hegseth; \"That's quite an act. What do you call it?\" LA fires; Tintin now in the public domain ~",
          "link": "https://www.nakedcapitalism.com/2025/01/200pm-water-cooler-1-13-2025.html",
          "publishedOn": "2025-01-13T19:00:20.000Z",
          "wordCount": 13487,
          "title": "2:00PM Water Cooler 1/13/2025",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/jeet_heer.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=285407",
          "author": "Lambert Strether",
          "description": "Our kingly daily links.",
          "link": "https://www.nakedcapitalism.com/2025/01/links-1-13-2025.html",
          "publishedOn": "2025-01-13T11:58:23.000Z",
          "wordCount": 18576,
          "title": "Links 1/13/2025",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/lion_grass.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=285350",
          "author": "Yves Smith",
          "description": "Why Russia's seeming high class problem of being able to secure a military victory in Ukraine really is a problem.",
          "link": "https://www.nakedcapitalism.com/2025/01/russias-difficult-ukraine-end-game-choices-and-the-issue-of-imposing-terms.html",
          "publishedOn": "2025-01-13T11:52:43.000Z",
          "wordCount": 16334,
          "title": "Russia’s Difficult Ukraine End Game Choices and the Issue of “Imposing Terms”",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=285386",
          "author": "Conor Gallagher",
          "description": "Meloni offers vassalage to the US under faux nationalist packaging. Musk’s support of the Alternative for Germany shows it might be prepared to do the same.",
          "link": "https://www.nakedcapitalism.com/2025/01/musk-meloni-and-the-afd-trumps-plan-for-reorganizing-eu-vassals-comes-into-focus.html",
          "publishedOn": "2025-01-13T11:00:13.000Z",
          "wordCount": 7532,
          "title": "Musk, Meloni, and the AfD: Trump’s Plan for Reorganizing EU Vassals Comes into Focus",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/Screenshot-2025-01-12-at-7.19.24 AM-1024x923.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=285399",
          "author": "Yves Smith",
          "description": "The pace of rebuilding after the Santa Cruz Mountains wildfire in 2000 bodes ill for the likely speed of Los Angeles reconstruction.",
          "link": "https://www.nakedcapitalism.com/2025/01/rebuilding-rate-for-santa-cruz-mountains-lightning-complex-fire-bodes-ill-for-los-angeles-reconstruction-even-before-getting-to-insolvency-of-california-state-fair-plan-wildfire-insurance.html",
          "publishedOn": "2025-01-13T06:59:43.000Z",
          "wordCount": 9096,
          "title": "Rebuilding Rate for Santa Cruz Mountains Lightning Complex Fire Bodes Ill for Los Angeles Reconstruction, Even Before Getting to Insolvency of California State FAIR Plan Wildfire Insurance",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/Maps-Santa-Monica-Mountains-National-Recreation-Area-U.S.-National-Park-Service.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=285368",
          "author": "Lambert Strether",
          "description": "DOGE depends on Elon Musk's charismatic authority. That's a bad thing.",
          "link": "https://www.nakedcapitalism.com/2025/01/the-department-of-governmental-efficiency-doge-lacks-legal-structure-promised-transparency.html",
          "publishedOn": "2025-01-12T21:25:42.000Z",
          "wordCount": 9006,
          "title": "The Department of Governmental Efficiency (DOGE) Lacks Legal Structure and Promised Transparency",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=285356",
          "author": "Lambert Strether",
          "description": "Our fire-breaking daily links.",
          "link": "https://www.nakedcapitalism.com/2025/01/links-1-12-2025.html",
          "publishedOn": "2025-01-12T11:58:01.000Z",
          "wordCount": 23794,
          "title": "Links 1/12/2025",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/lion_in_tree.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=285353",
          "author": "Lambert Strether",
          "description": "Artificial intelligence systems require consistent monitoring and staffing to put in place and to keep them working well. In essence: You need people, and more machines, to make sure the new tools don’t mess up.",
          "link": "https://www.nakedcapitalism.com/2025/01/health-care-ai-intended-to-save-money-turns-out-to-require-a-lot-of-expensive-humans.html",
          "publishedOn": "2025-01-12T11:50:43.000Z",
          "wordCount": 5845,
          "title": "Health Care AI, Intended To Save Money, Turns Out To Require a Lot of Expensive Humans",
          "imageUrl": "https://kffhealthnews.org/?republication-pixel=true&post=1957030&ga4=G-J74WWTKFM0"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=285297",
          "author": "Yves Smith",
          "description": "Our apocalytipic daily links: improperly rewilded lynx, lasting weight loss principles, Trump v. Netanyahu on hostages, Scholz blocked Ukraine €3B, moar spying apps, Trump land grabs? Obamacare subsidy fight, LAPD fire chief blasts mayor, \"uninsurable\" crisis coming? Supremes for Tik-Tok ban?",
          "link": "https://www.nakedcapitalism.com/2025/01/links-1-11-2025-2.html",
          "publishedOn": "2025-01-11T11:55:14.000Z",
          "wordCount": 24409,
          "title": "Links 1/11/2025",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/Screen-Shot-2025-01-11-at-4.54.46-PM.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=285340",
          "author": "Yves Smith",
          "description": "Michael Hudson refines and extends recent discussions on the future of the dollar, particularly under Trump, and finance-dominated capitalism",
          "link": "https://www.nakedcapitalism.com/2025/01/weaponizing-the-us-dollar-can-it-work.html",
          "publishedOn": "2025-01-11T11:54:50.000Z",
          "wordCount": 13988,
          "title": "Weaponizing the US Dollar. Can It Work?",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "6HAo0CAvmODAhYHnIF5Hbr",
          "author": "Kim Jeske",
          "description": "At Cloudflare, we treat developer content like an open source product. This collaborative approach enables global contributions to enhance quality and relevance for a wide range of users. This year,",
          "link": "https://blog.cloudflare.com/open-source-all-the-way-down-upgrading-our-developer-documentation/",
          "publishedOn": "2025-01-08T14:00:00.000Z",
          "wordCount": 2071,
          "title": "Open source all the way down: Upgrading our developer documentation",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/unu6xNHqGPZdNnccHPWhz/b45b02ee55cd04ae92bb01324207cfce/BLOG-2600_OG.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": [
        {
          "id": "https://medium.com/p/3f1d83cd0e8b",
          "author": "Capital One Tech",
          "description": "Maximizing data management efficiency through TTL implementation.",
          "link": "https://medium.com/capital-one-tech/introducing-database-time-to-live-ttl-for-data-management-3f1d83cd0e8b?source=rss----3db3a67cb648---4",
          "publishedOn": "2025-01-09T18:11:24.000Z",
          "wordCount": 6671,
          "title": "Introducing database time-to-live (TTL) for data management",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Engineering at Slack",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": [
        {
          "id": "https://slack.engineering/?p=17358",
          "author": "nstormann",
          "description": "At Slack, customer love is our first priority and accessibility is a core tenet of customer trust. We have our own Slack Accessibility Standards that product teams follow to guarantee their features are compliant with Web Content Accessibility Guidelines (WCAG). Our dedicated accessibility team supports developers in following these guidelines throughout the development process. We…\nThe post Automated Accessibility Testing at Slack appeared first on Engineering at Slack.",
          "link": "https://slack.engineering/automated-accessibility-testing-at-slack/",
          "publishedOn": "2025-01-07T20:46:20.000Z",
          "wordCount": 3385,
          "title": "Automated Accessibility Testing at Slack",
          "imageUrl": "https://slack.engineering/wp-content/uploads/sites/7/2024/12/joachim-schnurle-4j732BLw0BI-unsplash.jpg?w=640"
        }
      ]
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=22128",
          "author": null,
          "description": "Today’s rapidly evolving landscape of use cases that demand highly performant and efficient network infrastructure is placing new emphasis on how in-line amplifiers (ILAs) are designed and deployed. Meta’s ILA Evo effort seeks to reimagine how an ILA site could be deployed to improve speed and cost while making a step function improvement in power [...]\nRead More...\nThe post ILA Evo: Meta’s journey to reimagine fiber optic in-line amplifier sites appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2025/01/10/production-engineering/ila-evo-in-line-amplifier-sites-meta/",
          "publishedOn": "2025-01-10T17:00:20.000Z",
          "wordCount": 3353,
          "title": "ILA Evo: Meta’s journey to reimagine fiber optic in-line amplifier sites",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2025/01/Meta-ILA-Evo-HERO-Render-SMALL.jpg"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=42691458",
          "author": "sixo",
          "description": "people could not be more clear that their preference is for reliable and easy-to-use centralized services maintained by professionals, and not decentralized systems that require a great deal of user expertise",
          "link": "https://news.ycombinator.com/item?id=42691458",
          "publishedOn": "2025-01-14T00:10:18.000Z",
          "wordCount": 1621,
          "title": "New comment by sixo in \"GitHub Git Operations Are Down\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42690034",
          "author": "dguido",
          "description": "Please stop putting salespeople in charge of highly technical product companies like Sonos. I'm so glad that Tom Conrad is an engineer by training. I hope he can turn this mess around.\nThe key technical change that broke Sonos was abandoning their reliable UPnP (Universal Plug and Play) system for device discovery in favor of mDNS, while also shifting from direct device communication to a cloud-based API approach. This new architecture made all network traffic encrypted and routed through Sonos cloud servers (even for local operations), adding significant overhead and latency, especially for older Sonos devices with limited processing power. They also switched from native platform-specific UX frameworks to a JavaScript-based interface while moving music service interactions through their cloud instead of direct SMAPI calls, resulting in slower performance and reduced functionality.\nFor a more extended discussion, see this excellent LinkedIn post from Andy Pennell, a principal engineer at Microsoft with a deep technical understanding of Sonos systems. He created one of the most successful third-party Sonos apps for Windows Phone and worked directly with Sonos on their official Windows Phone 8 app.\nhttps://www.linkedin.com/pulse/what-happened-sonos-app-techn...",
          "link": "https://news.ycombinator.com/item?id=42690034",
          "publishedOn": "2025-01-13T22:02:02.000Z",
          "wordCount": 8227,
          "title": "New comment by dguido in \"Sonos CEO steps down after app update debacle\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42687513",
          "author": "cmdli",
          "description": "“Woke”, for the most part, is a boogeyman that the conservative right uses as a summary label for various political movements on the left. Basically nobody on the left talks about “woke” except for perhaps a period of six months back in 2017.\nMany political groups do this: they identify some aspect of the opposition, preferably one that is easy to ridicule, and then repeat those accusations ad-nauseum. The complaints about, say, LatinX have far surpassed the number of actual proponents of it, which were a small number of people of the left. However, it still brought up again and again because it forms a useful image of what people are fighting against.\nThe trouble with this is that a groups idea of the “enemy” typically outlasts and often surpasses the actual enemy that idea is based off of. People on the right will write endless articles and videos about wokeness not because there actually exists a problem with wokeness but to try to gain political and social status with their political group.",
          "link": "https://news.ycombinator.com/item?id=42687513",
          "publishedOn": "2025-01-13T19:19:50.000Z",
          "wordCount": 23597,
          "title": "New comment by cmdli in \"The Origins of Wokeness\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42686978",
          "author": "yapyap",
          "description": "I think the word “woke” means very different things to some people.\nAs an example I think people from the American political left to somewhere(?) in the middle see it as what it has been introduced as, that being looking past the status quo and instead looking at your own values, i.e. the morality of homelessness and not having a disdain for them but empathy for them instead.\nand then on the other side it feels like the people on the American political right see it as what this website describes it as “ A self-righteously moralistic person who behaves as if superior to others.”\nI think the divide has originated from taking unlikeable behaviour and labeling that as ‘woke’ (in bad faith of course) and some people have just bonded to that definition so much that they see it as that.\nAt least that’s what I’ve noticed online over the past few (bonkers) years",
          "link": "https://news.ycombinator.com/item?id=42686978",
          "publishedOn": "2025-01-13T18:44:52.000Z",
          "wordCount": null,
          "title": "New comment by yapyap in \"The Origins of Wokeness\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42684750",
          "author": "Ukv",
          "description": "> Imagine having to explain to a well-meaning visitor from another planet why using the phrase \"people of color\" is considered particularly enlightened, but saying \"colored people\" gets you fired. [...] There are no underlying principles.\nTo understand much of our language, Gnorts would have to already be aware that our words and symbols gain meaning from how they're used, and you couldn't, for instance, determine that a swastika is offensive (in the west) by its shape alone.\nIn this case, the term \"colored people\" gained racist connotations from its history of being used for discrimination and segregation - and avoiding it for that reason is the primary principle at play. There's also the secondary/less universal principle of preferring \"person-first language\".",
          "link": "https://news.ycombinator.com/item?id=42684750",
          "publishedOn": "2025-01-13T15:49:49.000Z",
          "wordCount": 6698,
          "title": "New comment by Ukv in \"The Origins of Wokeness\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42683648",
          "author": "jsheard",
          "description": "LBAL and Balatro being banned or 18+ age-gated for having gambling \"vibes\" despite not actually simulating gambling, while the stores are full of gacha games which are designed to bleed players dry through real-money gambling mechanics is a ridiculous state of affairs. The latter makes Google and Apple insane amounts of money though so of course they're not going to do anything about them unless their hand is forced.",
          "link": "https://news.ycombinator.com/item?id=42683648",
          "publishedOn": "2025-01-13T14:19:49.000Z",
          "wordCount": 4794,
          "title": "New comment by jsheard in \"Luck Be a Landlord Might Be Banned from Google Play\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42679402",
          "author": "lapcat",
          "description": "There are a ton of products on the market that are vastly more dangerous than computers: guns, cars, motorcycles, bicycles, chainsaws, table saws, cigarettes, alcohol, junk food. Yes, consumers do sometimes harm themselves by using these products. That's the price of freedom. I think it's bizarre that we treat computers as the most dangerous products in the world that for some reason demand paternalism, when none of these other products are locked down by the vendor.\nThe reason that computers are locked down by the vendors is not that computers are somehow more dangerous than other things we buy. The reason is simply that it's technically possible to lock down computers, and vendors have found that it's massively, MASSIVELY profitable to do so. It's all about protecting their profits, not protecting us. We know that the crApp Store is full of scams that steal literally millions of dollars from consumers, and we know that the computer vendors violate our privacy by phoning home with \"analytics\" covering everything we do on the devices. This is not intended for our benefit but rather for theirs.",
          "link": "https://news.ycombinator.com/item?id=42679402",
          "publishedOn": "2025-01-13T02:27:20.000Z",
          "wordCount": 17509,
          "title": "New comment by lapcat in \"Right to root access\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42678769",
          "author": "coldtea",
          "description": "Nah, we better abandon this kind of retroactive policing of language instead from people with nothing better to do.\nNobody who uses the term \"cargo cult\" in a technical settings does it out of spite or even refers to specific nations or peoples. Just refers to the core takeaway of a practice which might as we be all lore.\nCare about politics and colonialism and injustice and what have you? There are 1000000 causes you could devote your time and make an active  difference to people actually suffering this very moment, rather than language policing tech terms.",
          "link": "https://news.ycombinator.com/item?id=42678769",
          "publishedOn": "2025-01-13T00:53:15.000Z",
          "wordCount": 25377,
          "title": "New comment by coldtea in \"It's time to abandon the cargo cult metaphor\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42678031",
          "author": "nindalf",
          "description": "This advice to quit social media is always a hit on HN. When I was 10 years younger I read the same thing on HN, was thoroughly convinced and quit social media. I even followed the advice of trying to stay in touch by email. Sure.\nTurns out that a lot of people I knew posted huge life updates that I completely missed out on. I asked them why they didn’t tell me and they were confused. They said the posted it on social media. I can’t speak for everyone, but I know a lack of social media meant that I have lost touch with old acquaintances completely. I have a few close friends and that’s it.\nMaybe that’s an ok tradeoff to make, but it’s worth knowing that before getting into it.",
          "link": "https://news.ycombinator.com/item?id=42678031",
          "publishedOn": "2025-01-12T23:17:26.000Z",
          "wordCount": null,
          "title": "New comment by nindalf in \"I deleted my social media accounts\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42677699",
          "author": "imgabe",
          "description": "Nope, we’re not doing this in 2025. Cargo cult succinctly expresses an important concept. We’re not catering to imaginary offenses somebody hallucinates on behalf of some supposedly marginalized people anymore.",
          "link": "https://news.ycombinator.com/item?id=42677699",
          "publishedOn": "2025-01-12T22:38:19.000Z",
          "wordCount": 5661,
          "title": "New comment by imgabe in \"It's time to abandon the cargo cult metaphor\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42669910",
          "author": "rmccue",
          "description": "This isn’t unexpected; I’ve been deactivated on Slack since very early in this dispute, and later banned from the issue tracker as well. I’ve been contributing for 20 years to the project, am a committer, and built several large parts of WordPress including the REST API.\nMatt is banning anyone who speaks out at all, even when they agree with points he’s made. A large group of contributors felt they had to make an anonymous statement from fear of the same retribution I suffered: https://www.therepository.email/core-contributors-voice-conc...\n(I am a less active direct contributor these days, so I’m still able to contribute even while blocked - but many people’s livelihoods depend on it, as sponsored contributors.)",
          "link": "https://news.ycombinator.com/item?id=42669910",
          "publishedOn": "2025-01-11T23:44:04.000Z",
          "wordCount": 4244,
          "title": "New comment by rmccue in \"Matt Mullenweg deactivates WordPress accounts of contributors planning a fork\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42668429",
          "author": "Centigonal",
          "description": "> The trick is to not care enough about your job to get hurt but not care so little that you could short-term be hurt.\nIt really depends on your personal psychology. After I burnt out in a demanding role that I adopted as a big part of my identity, I joined a new company vowing to not take work as seriously (I remember telling myself, \"if excess effort isn't rewarded, the optimal strategy is to maximize compensation, minimize necessary effort, and eliminate excess effort\").\nAfter a few months of recovery and ruminating on why I still felt so bad (plus therapy), I learned a few things about myself:\n1. I feel like garbage when I'm half-assing something at work or not giving my all -- especially when the people around me are putting in the work.\n2. When I am giving my all and I feel like I'm …",
          "link": "https://news.ycombinator.com/item?id=42668429",
          "publishedOn": "2025-01-11T19:45:29.000Z",
          "wordCount": null,
          "title": "New comment by Centigonal in \"The Tsunami of Burnout Few See\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42660571",
          "author": "lolinder",
          "description": "Yes. What too few people realized was that the rollout of DEI was driven by what was trending at the time, designed to win political points with the groups that were politically ascendant. These programs were never a victory for the principles or the people, they were marketing.\nSo it should come as no shock whatsoever that now that another political group is politically ascendant the marketing that is valuable has changed, so there go the marketing programs that were designed for the old power structure.\nChange that occurs through fear of your power can only last as long as your power. Lasting change is only possible by actually changing hearts and minds. Progressives have forgotten in the last 10-15 years that the progress which we've won took generations not because our predecessors were weak and slow but because it inherently takes generations to effect lasting change. It's a slow, painful process, and if you think you accomplished it in a decade you're almost certainly wrong.",
          "link": "https://news.ycombinator.com/item?id=42660571",
          "publishedOn": "2025-01-10T21:39:13.000Z",
          "wordCount": null,
          "title": "New comment by lolinder in \"Meta's memo to employees rolling back DEI programs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42660165",
          "author": "antics",
          "description": "I am Wasq'u (a tribe in the PNW), I am connected to my tribe, and I am one of a handful of remaining speakers of the language. I am really tired of being caught in the maw of people fighting about my identity, what I am owed, and to some extent what place my identity has in society.\nTo the pro-DEI crowd: I have some hard truths for you. Actual change requires commitment and focus over an extremely long period of time. That means you have to choose probably 1 cause among the many worthy causes, and then invest in it instead of the others. You can't do everything. The problems that afflict my community are running water, drug addiction, lack of educational resources, and secular trends have have made our traditional industries obsolete. I am not saying that land acknowledgements and sports t…",
          "link": "https://news.ycombinator.com/item?id=42660165",
          "publishedOn": "2025-01-10T21:01:27.000Z",
          "wordCount": 3827,
          "title": "New comment by antics in \"Meta's memo to employees rolling back DEI programs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42658998",
          "author": "firefoxd",
          "description": "I wrote about my experience working as a software developer and being black in the industry and I was lucky to have it published on BBC [1].\nWhat immediately followed, every large company reached out to have me work as a consultant for their diversity program. I found it fascinating that they had a team of DEI experts in place already. Like what makes one an expert?\nIn addition to my job, I spent nights developing programs trying to help these companies. Some folks right here on HN shared their successful experiences and I presented it to several companies. I was met with resistance every step of the way.\nOver the course of a year and hundreds of candidates I presented, I've managed to place just one developer in a company.\nHowever, most these companies were happy to change their social media profile to a solid black image or black lives matters. They sent memos, they organized lunches, even sold merch and donated. But hiring, that was too much to ask. A lot of graduates told me they never even got to do a technical interview.\nThose DEI programs like to produce a show. Something visible that gives the impression that important work is being done. Like Microsoft reading who owned the land where the campus was built [2] in the beginning of every program. It eerily reminds me of \"the loyalty oath crusade\" in Catch-22.\n[1]: https://news.ycombinator.com/item?id=23669188\n[2]: https://youtu.be/87JXB0t6de4?si=wtnQtBOE-fs4V7gR",
          "link": "https://news.ycombinator.com/item?id=42658998",
          "publishedOn": "2025-01-10T19:17:20.000Z",
          "wordCount": 53898,
          "title": "New comment by firefoxd in \"Meta's memo to employees rolling back DEI programs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42658015",
          "author": "JohnMakin",
          "description": "I'm a PoC, and stuff like this reads extremely bizarre to me. On the one hand, you're acknowledging rolling back DEI initiatives in part because of the \"political landscape,\" and that you were already committed to diversity on your teams. That's all well and good, but then, why the initiative in the first place? It seems to me you're doing at least 1 thing here, and acknowledging that such DEI program was performative in the first place. This kind of announcement seems extremely self defeating and unlikely to please anyone and piss off just about anyone that cares about this in any way shape or form, on either side.",
          "link": "https://news.ycombinator.com/item?id=42658015",
          "publishedOn": "2025-01-10T17:57:26.000Z",
          "wordCount": 23245,
          "title": "New comment by JohnMakin in \"Meta's memo to employees rolling back DEI programs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42656869",
          "author": "Workaccount2",
          "description": "At a local bar they had a game machine, and if you got a high score on any of the games, your tab for the evening was free.\nOne of the games was a \"spot the differences\" between two pictures with an ever decreasing timer for each round. Using this trick I was able to easily surpass the high score, and garner a crowd watching me perform this mind numbing feat.\nProbably my peak fame right there.",
          "link": "https://news.ycombinator.com/item?id=42656869",
          "publishedOn": "2025-01-10T16:08:05.000Z",
          "wordCount": 8438,
          "title": "New comment by Workaccount2 in \"I've acquired a new superpower\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42647926",
          "author": "hiAndrewQuinn",
          "description": "SQL NULLs aren't weird, they're just based off of Kleene's TRUE-FALSE-UNKNOWN logic!\nIf you want you can read NULL as UNKNOWN and suddenly a whole bunch of operations involving them become a lot more intuitive:\n1. TRUE OR UNKNOWN = TRUE, because you know you have at least one TRUE already.\n2. TRUE AND UNKNOWN = UNKNOWN, because you don't know whether you have two TRUEs or not. It's just out there.\n3. UNKNOWN XOR UNKNOWN = UNKNOWN, because it could darn near be anything: TRUE XOR TRUE, TRUE XOR FALSE, FALSE XOR FALSE, FALSE XOR TRUE... Internalizing this is where SQL's use of NULL / UNKNOWN really becomes intuitive.\n4. (TRUE AND FALSE) XOR (TRUE OR UNKNOWN) = (FALSE) XOR (TRUE) per #1 = TRUE. See, it's consistent, you just need to keep in mind that if you have a lot of known UNKNOWNs they're quite parasitic and your final outcome is likely to be, itself, an UNKNOWN. Just like in real life!",
          "link": "https://news.ycombinator.com/item?id=42647926",
          "publishedOn": "2025-01-09T17:37:12.000Z",
          "wordCount": 8894,
          "title": "New comment by hiAndrewQuinn in \"SQL nulls are weird\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42640931",
          "author": "tokinonagare",
          "description": "Upvoting too.\n> Unless, that is, I agree to work on a comparable solution for the university focused on solving the underlying problem I was building HuskySwap for. They would presumably own the IP and were clear that I wouldn’t be compensated. But it was implied that they would then remove the hold, allowing me to graduate.\nWow. Literally blackmailing a student to do illegal work (at least would be categorized like that in my country). A student that already paid money for class and potentially a degree the univ is trying to block, mind blowing. OP, 1000% lawyer up.",
          "link": "https://news.ycombinator.com/item?id=42640931",
          "publishedOn": "2025-01-09T02:22:29.000Z",
          "wordCount": null,
          "title": "New comment by tokinonagare in \"I had to take down my course-swapping site or be expelled\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42640222",
          "author": "eykanal",
          "description": "Just piling on here because upvotes are not visible. The one thing you can guarantee is that your good faith is not reciprocated by the university. Get a lawyer.\nTo make it easier: it sounds like you're still registered. University of Washington offers Student Legal Services ( https://depts.washington.edu/slsuw/ ). Set up a referral with one of them and talk to them. Even if they're employees of the university and don't want to work with you to sue the university itself they may be able to give you good advice about how to proceed.",
          "link": "https://news.ycombinator.com/item?id=42640222",
          "publishedOn": "2025-01-09T00:31:37.000Z",
          "wordCount": 4504,
          "title": "New comment by eykanal in \"I had to take down my course-swapping site or be expelled\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42639886",
          "author": "GrantMoyer",
          "description": "> I am not planning to get a lawyer involved as I have faith that UW leadership will make it right in the end.\nAll evidence so far indicates they will not make it right, but instead they may make it even worse. Your faith is wildly misplaced. Seriously, talk to a lawyer.\nKeep in mind, just because you seek advice from a lawyer doesn't mean you need to take legal action against the school. Talking to a lawyer is not an escalation; the school doesn't even need to know you consulted one. A lawyer will advise whether you should take legal action and any more amicable alternatives available before they do anything on your behalf.",
          "link": "https://news.ycombinator.com/item?id=42639886",
          "publishedOn": "2025-01-08T23:47:03.000Z",
          "wordCount": null,
          "title": "New comment by GrantMoyer in \"I had to take down my course-swapping site or be expelled\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42639834",
          "author": "didgeoridoo",
          "description": "I was at Salesforce for 4 years, and during those years the company made a massive deal about:\n2020: the first AI craze, introducing “Einstein” as their name for their analytics platform, and officially changing the corporate vision to being the “No. 1 AI CRM company”.\n2021: Now it’s all about “Customer 360”, i.e. account-based marketing, i.e. what basically everyone else does without such a memeable name. You wouldn’t believe the number of slide decks I had to sit through with all our little product logos orbiting this stock art character straight out of Women Laughing While Eating Salad.\n2022: Never mind, now we’re betting the company on a real-time unified database called Genie, which was neither real-time nor unified (and eventually not called Genie either). Got sued for that one.\n2024: AGENTS. AGENTS EVERYWHERE. WE ARE AN AGENT COMPANY NOW.\nSo, let’s see how this holds up in the face of the next hot thing.",
          "link": "https://news.ycombinator.com/item?id=42639834",
          "publishedOn": "2025-01-08T23:42:34.000Z",
          "wordCount": 3462,
          "title": "New comment by didgeoridoo in \"Salesforce will hire no more software engineers in 2025, says Marc Benioff\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42639791",
          "author": "bb611",
          "description": "Current SFDC software engineer - this is just cover for a widespread engineering hiring freeze since the layoffs in January 2023. There's a ton of pressure to control costs after the near shareholder revolt that caused the layoffs.\nThe public nature of the announcement is certainly marketing for our AI offerings as well, but at this point I think most engineers are just worried there will be additional layoffs, in the event management cannibalizes product for short term stock gains again.",
          "link": "https://news.ycombinator.com/item?id=42639791",
          "publishedOn": "2025-01-08T23:39:03.000Z",
          "wordCount": null,
          "title": "New comment by bb611 in \"Salesforce will hire no more software engineers in 2025, says Marc Benioff\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42639347",
          "author": "NBJack",
          "description": "You may want to consult with a lawyer. This is starting to sound like extortion.",
          "link": "https://news.ycombinator.com/item?id=42639347",
          "publishedOn": "2025-01-08T22:49:02.000Z",
          "wordCount": 2567,
          "title": "New comment by NBJack in \"I had to take down my course-swapping site or be expelled\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42639331",
          "author": "jdkaim",
          "description": "Update: I immediately took down my class project site after receiving yesterday’s ultimatum. I still don’t think the simple demo site violated the letter or spirit of the registration rules, but I took it down because I always want to operate in good faith.\nThey followed up today to thank me for doing it, but also indicated that they were putting a hold on my account anyway. As a result, I am not going to be able to register for my final quarter and have been de facto expelled at the end of this quarter.\nUnless, that is, I agree to work on a comparable solution for the university focused on solving the underlying problem I was building HuskySwap for. They would presumably own the IP and were clear that I wouldn’t be compensated. But it was implied that they would then remove the hold, allowing me to graduate.\nI really love UW and have had a wonderful time here. But this is so demoralizing.\nUpdate #2:\nI appreciate you guys for all of your advice.\nThis platform was never intended to be monetized, and I am not planning to get a lawyer involved as I have faith that UW leadership will make it right in the end.\nI'm not planning to pursue this project at this point. If they came up to me at first with the offer to work with them it might be different, but the way they handled it makes me just want to walk away.",
          "link": "https://news.ycombinator.com/item?id=42639331",
          "publishedOn": "2025-01-08T22:46:52.000Z",
          "wordCount": null,
          "title": "New comment by jdkaim in \"I had to take down my course-swapping site or be expelled\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42633965",
          "author": "jgrahamc",
          "description": "Me writing over 14 years ago: https://blog.jgc.org/2010/06/facebooks-dkim-rsa-key-should-b... This was doable 14 years ago for 512-bit keys.",
          "link": "https://news.ycombinator.com/item?id=42633965",
          "publishedOn": "2025-01-08T13:28:53.000Z",
          "wordCount": null,
          "title": "New comment by jgrahamc in \"Cracking a 512-bit DKIM key for less than $8 in the cloud\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42628594",
          "author": "peterldowns",
          "description": "I agree that consistency is important — but what about when the existing codebase is already inconsistent? Even worse, what if the existing codebase is both inconsistent and the \"right way to do things\" is undocumented? That's much closer to what I've experienced when joining companies with lots of existing code.\nIn this scenario, I've found that the only productive way forward is to do the best job you can, in your own isolated code, and share loudly and frequently why you're doing things your new different way. Write your code to be re-used and shared. Write docs for it. Explain why it's the correct approach. Ask for feedback from the wider engineering org (although don't block on it if they're not directly involved with your work.) You'll quickly find out if other engineers agree that your approach is better. If it's actually better, others will start following your lead. If it's not, you'll be able to adjust.\nOf course, when working in the existing code, try to be as locally consistent as possible with the surrounding code, even if it's terrible. I like to think of this as \"getting in and out\" as quickly as possible.\nIf you encounter particularly sticky/unhelpful/reticent team members, it can help to remind them that (a) the existing code is worse than what you're writing, (b) there is no documented pattern that you're breaking, (c) your work is an experiment and you will later revise it. Often asking them to simply document the convention that you are supposedly breaking is enough to get them to go away, since they won't bother to spend the effort.",
          "link": "https://news.ycombinator.com/item?id=42628594",
          "publishedOn": "2025-01-07T22:44:50.000Z",
          "wordCount": null,
          "title": "New comment by peterldowns in \"Mistakes engineers make in large established codebases\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/The-Urgent-Need-to-Better-Measure-Household-Debt",
          "author": "Arnaud Natal, Isabelle Guérin, Sébastien Michiels, Timothée Narring",
          "description": "Sébastien Michiels, Arnaud Natal, Isabelle Guérin and Timothée Narring have authored a paper on household debt in the North and Global South, which CADTM is pleased to publish. The paper looks at the measurement of household debt, the use of credit cards, and the gendered and racial dimensions of debt. It also proposes a reading in terms of social classes.\n Sushovan Dhar and Vicki Briault Manus have translated the paper. (...)\nEnglish\n\n/ \nPrivate debt, \nSouth, \nFinance against people, \nNorth",
          "link": "https://www.cadtm.org/The-Urgent-Need-to-Better-Measure-Household-Debt",
          "publishedOn": "2025-01-10T10:03:26.000Z",
          "wordCount": 860,
          "title": "The Urgent Need to Better Measure Household Debt",
          "enclosure": {
            "url": "https://www.cadtm.org/IMG/pdf/note.pdf",
            "length": "347842",
            "type": "application/pdf"
          },
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/d34e6523feec8f23abe1cf1cba88d1-2fd84.png"
        },
        {
          "id": "https://www.cadtm.org/CADTM-and-the-experience-of-the-Greek-Truth-Committee-on-Public-Debt",
          "author": "Christoph Sorg",
          "description": "2025 marks the 10th anniversary of the capitulation of a government that had promised to put an end to the ordeal of the Greek people by obtaining, among other things, the cancellation of most of the Greek debt. Throughout the year, the CADTM will be publishing analyses and documents to help us understand what happened. In this spirit, we are publishing a new extract from Christoph Sorg's doctoral thesis. This extract covers the CADTM's action in Greece from 2010 onwards. This includes the (...)\nEnglish\n\n/ \nAlternatives, \nGreece, \nCADTM, \nSorg EN",
          "link": "https://www.cadtm.org/CADTM-and-the-experience-of-the-Greek-Truth-Committee-on-Public-Debt",
          "publishedOn": "2025-01-09T19:20:13.000Z",
          "wordCount": 5289,
          "title": "CADTM and the experience of the Greek Truth Committee on Public Debt",
          "enclosure": {
            "url": "https://www.cadtm.org/IMG/jpg/sans_titre-13.jpg",
            "length": "88806",
            "type": "image/jpeg"
          },
          "imageUrl": "https://www.cadtm.org/IMG/jpg/sans_titre-13.jpg"
        },
        {
          "id": "https://www.cadtm.org/Democracy-and-Debt-Has-the-Link",
          "author": "Michael Hudson",
          "description": "The year 2025 is considered by Christians to be a jubilee year under the banner of debt cancellation. To mark the occasion, the CADTM is republishing a series of articles on debt cancellation, the struggles for debt cancellation and the role of debt in political, social and geostrategic conflicts throughout history. \nEnglish\n\n/ \nAlternatives, \nDebt in History, \nFinance against people, \nHistoire Jubi EN",
          "link": "https://www.cadtm.org/Democracy-and-Debt-Has-the-Link",
          "publishedOn": "2025-01-08T06:00:00.000Z",
          "wordCount": 5161,
          "title": "Democracy and Debt: Has the Link been Broken?",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L500xH263/9c02240a46b454be002ba436cc1840-88559.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=9077",
          "author": "disassociated.com",
          "description": "Research from Massachusetts General Hospital, I believe, in the United States, possibly underscores what many of us already suspect: that prolonged use of social media may not be the best: This kind of study cannot prove that your hours of doomscrolling is directly making you Tik’d off, but in light of known associations of irritability […]",
          "link": "https://disassociated.com/prolonged-social-media-short-tempered/",
          "publishedOn": "2025-01-12T20:00:45.000Z",
          "wordCount": 207,
          "title": "Prolonged use of social media may make you short tempered",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9080",
          "author": "disassociated.com",
          "description": "PRINT’s annual list of the best book covers of 2024, features double the number of entries as 2023, one-hundred, up from fifty. Either a record number of books were published in 2024, or cover design has become so good more books needed to be included. Among inclusions is a cover for Intermezzo, Sally Rooney’s latest […]",
          "link": "https://disassociated.com/one-hundred-best-book-covers-2024/",
          "publishedOn": "2025-01-12T19:30:33.000Z",
          "wordCount": 232,
          "title": "The one-hundred best book covers of 2024 by PRINT",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9067",
          "author": "disassociated.com",
          "description": "Tim Carmody, writing for Wired: Because HTML looks easy and lacks features like formal conditional logic and Turing-completeness, it’s often dismissed as not a programming language. “That’s not real code; it’s just markup” is a common refrain. Now, I’m no stranger to the austere beauty of the command line, from automating scripts to training machine-learning […]",
          "link": "https://disassociated.com/html-programming-language-not-markup/",
          "publishedOn": "2025-01-08T20:00:22.000Z",
          "wordCount": 260,
          "title": "HTML: a programming language, not mere markup",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9064",
          "author": "disassociated.com",
          "description": "Justine Calma, writing for The Verge: Meta is essentially shifting responsibility to users to weed out lies on Facebook, Instagram, Threads, and WhatsApp, raising fears that it’ll be easier to spread misleading information about climate change, clean energy, public health risks, and communities often targeted with violence. The policy revision seemed surprising initially, but less […]",
          "link": "https://disassociated.com/meta-major-changes-content-moderation/",
          "publishedOn": "2025-01-08T19:30:37.000Z",
          "wordCount": 236,
          "title": "Meta announces major changes to content moderation polices",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9060",
          "author": "disassociated.com",
          "description": "Tom Saunders writing for ABC News: Your average La Niña forms in winter, peaks in late spring, then gradually weakens through summer. However, the current edition has not played by the rule book — for only the second time in 75 years, its onset has arrived in the middle of summer. This is something I’ve […]",
          "link": "https://disassociated.com/summer-time-forming-la-nina-possible/",
          "publishedOn": "2025-01-07T20:00:06.000Z",
          "wordCount": 458,
          "title": "Summer time forming La Nina possibly coming to Australia",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2025/20250109",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2025/20250109",
          "publishedOn": "2025-01-09T06:20:00.000Z",
          "wordCount": 428,
          "title": "Week Ending January 5, 2025",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/the-franc-zone",
          "author": null,
          "description": "Twilight of Françafrique?",
          "link": "https://newleftreview.org/sidecar/posts/the-franc-zone",
          "publishedOn": "2025-01-10T17:58:22.000Z",
          "wordCount": 3491,
          "title": "Martin Barnay: &ldquo;The Franc Zone&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2025/01/barnay.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/artist-as-filmmaker",
          "author": null,
          "description": "Malcolm Le Grice (1940-2024).",
          "link": "https://newleftreview.org/sidecar/posts/artist-as-filmmaker",
          "publishedOn": "2025-01-10T11:18:30.000Z",
          "wordCount": 2520,
          "title": "Maria Palacios Cruz: &ldquo;Artist as Filmmaker&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2025/01/le-grice-horror-film-1-0.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/broken-voices",
          "author": null,
          "description": "On Anna Gréki.",
          "link": "https://newleftreview.org/sidecar/posts/broken-voices",
          "publishedOn": "2025-01-09T13:35:45.000Z",
          "wordCount": 2224,
          "title": "Luke Roberts: &ldquo;Broken Voices&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2025/01/image-for-roberts.jpg"
        }
      ]
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    },
    {
      "title": "News Minimalist",
      "feedUrl": "https://rss.beehiiv.com/feeds/4aF2pGVAEN.xml",
      "siteUrl": "https://newsletter.newsminimalist.com/",
      "articles": [
        {
          "id": "https://newsletter.newsminimalist.com/p/researchers-engineer-bacteria-that-break-down-microplastics-2-more-stories",
          "author": null,
          "description": "Qatar presents final ceasefire draft to Israel and Hamas; University of Waterloo engineers bacteria to decompose microplastics; UK government announces significant AI investment initiative.",
          "link": "https://newsletter.newsminimalist.com/p/researchers-engineer-bacteria-that-break-down-microplastics-2-more-stories",
          "publishedOn": "2025-01-13T17:22:34.000Z",
          "wordCount": 6440,
          "title": "Researchers engineer bacteria that break down microplastics + 2 more stories",
          "imageUrl": "https://beehiiv-images-production.s3.amazonaws.com/uploads/publication/thumbnail/d0318cb6-0493-4e34-b055-76456e6c0f76/landscape_template__3_.png"
        },
        {
          "id": "https://newsletter.newsminimalist.com/p/global-temperatures-surpassed-1-5c-2-more-stories",
          "author": null,
          "description": "Global temperatures surpassed 1.5C this year; the World Economic Forum forecasts 170 million new jobs by 2030; Russia halts gas supplies to Europe.",
          "link": "https://newsletter.newsminimalist.com/p/global-temperatures-surpassed-1-5c-2-more-stories",
          "publishedOn": "2025-01-11T16:42:01.000Z",
          "wordCount": 6647,
          "title": "Global temperatures surpassed 1.5C + 2 more stories",
          "imageUrl": "https://beehiiv-images-production.s3.amazonaws.com/uploads/publication/thumbnail/d0318cb6-0493-4e34-b055-76456e6c0f76/landscape_template__3_.png"
        },
        {
          "id": "https://newsletter.newsminimalist.com/p/scientists-extract-1-2-million-year-old-ice-core-from-antarctica-3-more-stories",
          "author": null,
          "description": "James Webb Telescope finds 44 stars in the Dragon Arc galaxy; Greenland's importance escalates due to climate change; scientists drill 1.2 million-year-old ice core; Trump considers national economic emergency for tariffs.",
          "link": "https://newsletter.newsminimalist.com/p/scientists-extract-1-2-million-year-old-ice-core-from-antarctica-3-more-stories",
          "publishedOn": "2025-01-09T17:52:38.000Z",
          "wordCount": 7508,
          "title": "Scientists extract 1.2 million-year-old ice core from Antarctica + 3 more stories",
          "imageUrl": "https://beehiiv-images-production.s3.amazonaws.com/uploads/publication/thumbnail/d0318cb6-0493-4e34-b055-76456e6c0f76/landscape_template__3_.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}