{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "b3f588f5745d41e324b4aff7dfd2cbe3ae71a674",
          "author": "Channy Yun",
          "description": "The Llama 3.1 models are a collection of 8B, 70B, and 405B parameter size multilingual models that demonstrate state-of-the-art performance on a wide range of industry benchmarks, offering new capabilities for your generative AI applications.",
          "link": "https://aws.amazon.com/blogs/aws/announcing-llama-3-1-405b-70b-and-8b-models-from-meta-in-amazon-bedrock/",
          "publishedOn": "2024-07-23T16:20:18.000Z",
          "wordCount": 2345,
          "title": "Announcing Llama 3.1 405B, 70B, and 8B models from Meta in Amazon Bedrock",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/07/22/Bedrock-models-feat-img.png"
        },
        {
          "id": "3b081c60311072864e5cf1c6d6441da57ae491ca",
          "author": "Donnie Prakoso",
          "description": "Last week, AWS Heroes from around the world gathered to celebrate the 10th anniversary of the AWS Heroes program at Global AWS Heroes Summit. This program recognizes a select group of AWS experts worldwide who go above and beyond in sharing their knowledge and making an impact within developer communities. Matt Garman, CEO of AWS […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-global-aws-heroes-summit-aws-lambda-amazon-redshift-and-more-july-22-2024/",
          "publishedOn": "2024-07-22T17:03:59.000Z",
          "wordCount": 1606,
          "title": "AWS Weekly Roundup: Global AWS Heroes Summit, AWS Lambda, Amazon Redshift, and more (July 22, 2024)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/08/13/AWS-WIR-default.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": []
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": [
        {
          "id": "7b4f30aa5139d59db24b0c92c6d45ed59b18e7f5",
          "author": "Rodney Bozo",
          "description": "Customers can migrate their AWS CodeCommit Git repositories to other Git providers using several methods, such as cloning the repository, mirroring, or migrating specific branches. This blog describes a basic use case to mirror a repository to a generic provider, and links to instructions for mirroring to more specific providers. Your exact steps could vary […]",
          "link": "https://aws.amazon.com/blogs/devops/how-to-migrate-your-aws-codecommit-repository-to-another-git-provider/",
          "publishedOn": "2024-07-25T16:20:00.000Z",
          "wordCount": 1560,
          "title": "How to migrate your AWS CodeCommit repository to another Git provider",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/07/23/How-to-migrate-your-AWS-CodeCommit-repository-to-another-Git-provider.png"
        },
        {
          "id": "bba8f9032da39f3ffdf7150385f778f13e2a1674",
          "author": "Rodney Bozo",
          "description": "Building with AWS requires you to interact with and manipulate your AWS resources, whether it’s to manage infrastructure, deploy applications, or troubleshoot issues and many AWS customers use AWS Cloud9 to do so today. However, developers want the ability to work with AWS resources within their own Integrated Development Environment (IDE) because it allows them […]",
          "link": "https://aws.amazon.com/blogs/devops/how-to-migrate-from-aws-cloud9-to-aws-ide-toolkits-or-aws-cloudshell/",
          "publishedOn": "2024-07-25T16:19:56.000Z",
          "wordCount": 1354,
          "title": "How to migrate from AWS Cloud9 to AWS IDE Toolkits or AWS Cloudshell",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/827bfc458708f0b442009c9c9836f7e4b65557fb/2020/06/03/Blog-Post_thumbnail.png"
        },
        {
          "id": "a5390f9c40a3179e15eb2141a20938f5470dc8ad",
          "author": "Dr. Rahul Sharad Gaikwad",
          "description": "In this post, we guide you through five common components of efficient code debugging. We also show you how Amazon Q Developer can significantly reduce the time and effort required to manually identify and fix errors across numerous lines of code. With Amazon Q Developer on your side, you can focus on other aspects of […]",
          "link": "https://aws.amazon.com/blogs/devops/leveraging-amazon-q-developer-for-efficient-code-debugging-and-maintenance/",
          "publishedOn": "2024-07-24T14:05:21.000Z",
          "wordCount": 2456,
          "title": "Leveraging Amazon Q Developer for Efficient Code Debugging and Maintenance",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/07/01/Slide1.png"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/ee13a06f9c78",
          "author": "Netflix Technology Blog",
          "description": "By Jun He, Natallia Dzenisenka, Praneeth Yenugutala, Yingyi Zhang, and Anjali Norwood",
          "link": "https://netflixtechblog.com/maestro-netflixs-workflow-orchestrator-ee13a06f9c78?source=rss----2615bd06b42e---4",
          "publishedOn": "2024-07-22T17:38:23.000Z",
          "wordCount": 9086,
          "title": "Maestro: Netflix’s Workflow Orchestrator",
          "imageUrl": "https://miro.medium.com/v2/da:true/resize:fit:1200/0*d7XTqfPjAkuCBv6C"
        }
      ]
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": []
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=328995",
          "author": "Ray Acheson",
          "description": "Image by Heather Mount.\nBetween armed violence and fascism within the United States and the US government’s support for genocide abroad, manufacturers of weapons are profiting wildly. Within the US, arms producers are responsible for fueling war crimes in Gaza and mass shootings across the United States. The profit models of these companies are the same: more violence means more customers. Stoke the fear, fury, and legitimacy of conflict to sell more of your product. Generate a public culture receptive to the idea of weapons as the answer to insecurity, including through the construction and entrenchment of gender and racial power dynamics.\nProfitmaking requires marketing. Enter the so-called militainment industry—the marketing of guns and militarism through films, television, video games, and now social media influencers. Gun manufacturers and military agencies, especially in the United States, have long had an outsized influence on the entertainment industry, and they use gendered and racialized tropes to promote gun sales along with a wider culture of militarism, war, and armed violence. But over the last two decades, the methods by which gun manufacturers and other military contractors have been able to influence people across many geographies—in particular young, white, cisgendered, heteronormative men—have become increasingly insidious. And the ramifications for violence are profound.\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Gun Violence and the Marketing of Militarism appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/28/gun-violence-and-the-marketing-of-militarism/",
          "publishedOn": "2024-07-28T05:56:38.000Z",
          "wordCount": null,
          "title": "Gun Violence and the Marketing of Militarism",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329341",
          "author": "Timothy Messer-Kruse",
          "description": "Since the first laws and executive orders banning ‘divisive concepts’, such as the idea that racism can be systemic, were implemented in 2021, critics charged that they would censor the past and force teachers to avoid uncomfortable but vital issues of history. Many accused the GOP of attempting to impose a sanitized version of America’s […]\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Idiocracy in Virginia appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/28/idiocracy-in-virginia/",
          "publishedOn": "2024-07-28T05:55:23.000Z",
          "wordCount": null,
          "title": "Idiocracy in Virginia",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329314",
          "author": "Jeffrey St. Clair",
          "description": "Whether they want to or not, the Arab people today face a wholesale attack on their future by an imperial power, America, that acts in concert with Israel to pacify, subdue, and finally reduce us to a bunch of warring fiefdoms whose first loyalty is not to their people but to the great superpower (and […]\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Talk, Talk; Bang-Bang appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/27/talk-talk-bang-bang/",
          "publishedOn": "2024-07-27T14:43:11.000Z",
          "wordCount": null,
          "title": "Talk, Talk; Bang-Bang",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329197",
          "author": "Jeffrey St. Clair",
          "description": "Before Biden revealed his incompetence at the debate with Trump, he'd already lost his reelection bid by showing his gross immorality in arming the genocide in Gaza. Biden had been trailing Trump in the polls since last October and deservedly so. His withdrawal won't redeem his reputation, which will forever be stained by the mounds of dead Palestinian children he helped kill and showed no remorse for. More\nThe post The Spirit of Jezebel appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/the-spirit-of-jezebel/",
          "publishedOn": "2024-07-26T06:02:29.000Z",
          "wordCount": null,
          "title": "The Spirit of Jezebel",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329234",
          "author": "Richard Rubenstein",
          "description": "I returned home from Wednesday’s anti-Netanyahu demonstration on Capitol Hill in time to watch the Israeli prime minister address a joint session of the U.S. Congress.  The vilest thing about the event was not the speech itself, which was predictably bloodthirsty and mendacious, but the reactions of the assembled Congresspeople.  Almost all of them stood and cheered lengthily while their invited guest smeared those protesting his appearance in the streets outside the Capitol as pro-Hamas “idiots” who “stand with rapists and murderers,” and whose protests are “paid for by Iran.”  More\nThe post Netanyahu in Congress: the Crime Boss Fulminates, While His Accomplices Cheer appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/netanyahu-in-congress-the-crime-boss-fulminates-while-his-accomplices-cheer/",
          "publishedOn": "2024-07-26T06:00:54.000Z",
          "wordCount": null,
          "title": "Netanyahu in Congress: the Crime Boss Fulminates, While His Accomplices Cheer",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329212",
          "author": "Farrah Hassen",
          "description": "There is overwhelming evidence that Israeli forces under Netanyahu’s leadership have committed massive human rights atrocities against Palestinians in Gaza. And that’s against the backdrop of an illegal military occupation of Palestinian territory and apartheid, as another ICJ ruling confirmed recently. More\nThe post The US Must Stop Arming Israel appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/the-us-must-stop-arming-israel/",
          "publishedOn": "2024-07-26T06:00:37.000Z",
          "wordCount": null,
          "title": "The US Must Stop Arming Israel",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329150",
          "author": "M. V. Ramana - Jixiang Wang",
          "description": "Rafael Grossi, the International Atomic Energy Agency’s Director General, has been busy over the last few years. The media has often reported on his efforts to highlight “the risk of a major nuclear accident” at the Zaporizhzhia nuclear plant. Grossi has also met with Russian President Vladimir Putin twice to discuss the situation at Zaporizhzhia, arguing that a “severe nuclear accident…would recognize no borders” and “we must do everything possible to prevent” such an accident. More\nThe post More Nuclear Reactors? Deceptive Tunes from the Pied Piper of Vienna appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/more-nuclear-reactors-deceptive-tunes-from-the-pied-piper-of-vienna/",
          "publishedOn": "2024-07-26T06:00:04.000Z",
          "wordCount": null,
          "title": "More Nuclear Reactors? Deceptive Tunes from the Pied Piper of Vienna",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329222",
          "author": "Ramzy Baroud",
          "description": "Targeting a school during a war could be justified or, at least, argued to have been a mistake. But striking over 120 schools, killing and wounding thousands of civilians sheltered inside, can only be intentional and horrific war crimes. Between October 7 and July 18, Israel has done precisely that, targeting with total impunity, United  More\nThe post ‘Terrorist Organization’? What’s Behind the Israeli War on UNRWA appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/terrorist-organization-whats-behind-the-israeli-war-on-unrwa/",
          "publishedOn": "2024-07-26T05:58:41.000Z",
          "wordCount": null,
          "title": "‘Terrorist Organization’? What’s Behind the Israeli War on UNRWA",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329161",
          "author": "Matthew Stevenson",
          "description": "I know it’s vogue to imagine Joe as the next FDR, stitching together safety nets for those juggling on life’s high wires, but it makes more sense to think of Biden the Elder as a croupier or maybe a floor manager in the American Casino—overseeing the roulette wheels to make sure that the high rollers come away with more than complimentary drinks. More\nThe post Bye Bye Biden and the Kamala Sutra appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/bye-bye-biden-and-the-kamala-sutra/",
          "publishedOn": "2024-07-26T05:58:36.000Z",
          "wordCount": null,
          "title": "Bye Bye Biden and the Kamala Sutra",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329242",
          "author": "Vijay Prashad",
          "description": "Caracas. On 28 July, the people of Venezeula will go to the polls to conduct the sixth presidential election since the 1999 Bolivarian Constitution. The two previous elections (2013 and 2018) were won by Nicolás Maduro Moros, the incumbent president. Maduro is running for a third term that will begin in 2025 and run for  More\nThe post Venezuela Faces a Test This Sunday appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/venezuela-faces-a-test-this-sunday/",
          "publishedOn": "2024-07-26T05:58:05.000Z",
          "wordCount": null,
          "title": "Venezuela Faces a Test This Sunday",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329278",
          "author": "Mays Smithwick - Jacqui Drechsler",
          "description": "With the passing of the ADVANCE Act (S870, section B), or the Accelerating Deployment of Versatile, Advanced Nuclear for Clean Energy Act, the nuclear lobby has seized our democratic processes and co-opted the climate movement with pervasive lies and profit grabbing. The bipartisan support of the bill arose through widespread corruption, coupled with a nearsighted  More\nThe post The ADVANCE Act: a Bipartisan Surrender to the Nuclear Lobby appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/the-advance-act-a-bipartisan-surrender-to-the-nuclear-lobby/",
          "publishedOn": "2024-07-26T05:57:23.000Z",
          "wordCount": null,
          "title": "The ADVANCE Act: a Bipartisan Surrender to the Nuclear Lobby",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329096",
          "author": "Joseph Natoli",
          "description": "“No, I don’t mean love, when I say patriotism. I mean fear. The fear of the other. And its expressions are political, not poetical: hate, rivalry, aggression.” ― Ursula K. Le Guin, The Left Hand of Darkness What you are reading is a translation from the Martian.  I have no reason to doubt the translator and the  More\nThe post Stranger From Another Planet Attends RNC 2024 appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/stranger-from-another-planet-attends-rnc-2024/",
          "publishedOn": "2024-07-26T05:57:13.000Z",
          "wordCount": null,
          "title": "Stranger From Another Planet Attends RNC 2024",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329282",
          "author": "Karl Grossman",
          "description": "“Nuclear risks are on the rise. The chance of nuclear weapons use [is] higher than at any time in my—and many others in this room’s—lifetime,” said Naomi Zoka at a meeting this week of the Preparatory Committee for the Eleventh Nuclear Non-Proliferation Review Conference. “The path to a world without nuclear weapons lies through the  More\nThe post Nuclear Risks on the Rise appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/nuclear-risks-on-the-rise/",
          "publishedOn": "2024-07-26T05:56:56.000Z",
          "wordCount": null,
          "title": "Nuclear Risks on the Rise",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329102",
          "author": "Daniel Warner",
          "description": "What location is for real estate, timing is for politics. Under intense pressure from leaders of the Democratic Party, major donors and negative polls, President Biden finally withdrew as a candidate for re-election after long hesitation. On the Republican side, the Trump/Vance ticket continues its aggressive campaign after Donald Trump’s promising start at the Republican  More\nThe post The Missed Opportunities of Biden and Trump appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/the-missed-opportunities-of-biden-and-trump/",
          "publishedOn": "2024-07-26T05:55:52.000Z",
          "wordCount": null,
          "title": "The Missed Opportunities of Biden and Trump",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329266",
          "author": "Eve Ottenberg",
          "description": "It’s somewhat reassuring that Donald Trump vows to make peace between Russia and Ukraine pronto, upon becoming president. But it will all be absolutely for naught if Washington then pivots to war with Beijing, a war that will quickly become nuclear. And not just because of an Atomic Apocalypse – if Trump thinks Russian troops  More\nThe post War with China Will Negate Peace with Russia appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/war-with-china-will-negate-peace-with-russia/",
          "publishedOn": "2024-07-26T05:55:19.000Z",
          "wordCount": null,
          "title": "War with China Will Negate Peace with Russia",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329180",
          "author": "Nick Turse",
          "description": "At the end of the last century, hoping to drive the United States from Saudi Arabia, the home of Islam’s holiest sites, al-Qaeda leader Osama bin Laden sought to draw in the American military. He reportedly wanted to “bring the Americans into a fight on Muslim soil,” provoking savage asymmetric conflicts that would send home a  More\nThe post Suicide Squad appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/suicide-squad-2/",
          "publishedOn": "2024-07-26T05:55:18.000Z",
          "wordCount": null,
          "title": "Suicide Squad",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329182",
          "author": "Jake Johnston",
          "description": "This Sunday, July 28, Venezuelans will head to the polls in what has been framed as the opposition’s best chance to unseat President Nicolás Maduro, who has been in office since 2013. From the media coverage, one comes away with the impression of only two options: an opposition win, or massive pro-Maduro fraud. There are  More\nThe post What Do the Polls Really Show About Venezuela’s Election? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/what-do-the-polls-really-show-about-venezuelas-election/",
          "publishedOn": "2024-07-26T05:55:10.000Z",
          "wordCount": null,
          "title": "What Do the Polls Really Show About Venezuela’s Election?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329203",
          "author": "Thomas Knapp",
          "description": "“You should get a one-year jail sentence if you do anything to desecrate the American flag,” former (and possibly future) president Donald Trump told the hosts of Fox & Friends on July 25. In a rare moment of at least partial agreement with Trump, likely Democratic presidential nominee Kamala Harris says “I condemn the burning  More\nThe post I’d Rather See A Flag On Fire Than Wrapped Around a Politician appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/id-rather-see-a-flag-on-fire-than-wrapped-around-a-politician/",
          "publishedOn": "2024-07-26T05:55:07.000Z",
          "wordCount": null,
          "title": "I’d Rather See A Flag On Fire Than Wrapped Around a Politician",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329201",
          "author": "Dr. Nancy L. Segal",
          "description": "Fascination with twins and what twin studies tell us about human nature is universal. There is no question that behavioral and medical science advances have happened largely because twins yield a wealth of information just by being themselves. Twin research takes place at two levels: (1) Studies that are strictly for twins. Such studies examine the pros  More\nThe post The Science of Twins and the Human Fascination With Them appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/the-science-of-twins-and-the-human-fascination-with-them/",
          "publishedOn": "2024-07-26T05:54:55.000Z",
          "wordCount": null,
          "title": "The Science of Twins and the Human Fascination With Them",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329218",
          "author": "Paul Street",
          "description": "Ancient Greek mythology warns of the siren songs. Homer’s Odyssey depicted the sirens, beautiful bird-women who would croon out to sailors. The sailors couldn’t resist the seductive sounds even when they knew the calls were lethal. They would leap off their ships and drown while trying to swim to the melodies or crash their ships  More\nThe post Kamala Harris and the Maddening Siren of US Electoral Politics appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/kamala-harris-and-the-maddening-siren-of-us-electoral-politics/",
          "publishedOn": "2024-07-26T05:54:52.000Z",
          "wordCount": null,
          "title": "Kamala Harris and the Maddening Siren of US Electoral Politics",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329170",
          "author": "Robert Hunziker",
          "description": "A few years ago, China’s climate envoy Xie Zhenhua and U.S. climate envoy John Kerry shook hands on a pledge to triple renewable energy by 2030. China took the challenge seriously, very seriously, it will meet its end-of-2030 emissions target this year (2014), six years early. In the blink of an eye, China is constructing  More\nThe post China’s Lightning-Fast Renewable Triumphs appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/chinas-lightning-fast-renewable-triumphs/",
          "publishedOn": "2024-07-26T05:54:25.000Z",
          "wordCount": null,
          "title": "China’s Lightning-Fast Renewable Triumphs",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329263",
          "author": "Christopher Ketcham",
          "description": "How billionaire elites help fund an Oxford statistics lab that makes the destruction of Earth look just great. Roughly a decade ago, a 30-year-old economic statistician at Oxford University named Max Roser set out to transform the way we see the world using datasets. As he later described his mission in a statement of purpose,he wanted to instill “trust in ourselves”  More\nThe post The Unbearable Anthropocentrism of Our World in Data appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/the-unbearable-anthropocentrism-of-our-world-in-data/",
          "publishedOn": "2024-07-26T05:53:57.000Z",
          "wordCount": null,
          "title": "The Unbearable Anthropocentrism of Our World in Data",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329191",
          "author": "CounterPunch News Service",
          "description": "The post American Physicians’ and Nurses’ Observations From the Gaza Strip Since October 7, 2023 appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/american-physicians-and-nurses-observations-from-the-gaza-strip-since-october-7-2023/",
          "publishedOn": "2024-07-26T05:53:43.000Z",
          "wordCount": null,
          "title": "American Physicians’ and Nurses’ Observations From the Gaza Strip Since October 7, 2023",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329100",
          "author": "Alfred de Zayas",
          "description": "While cycling this summer through France, Italy and Switzerland it struck me how many war memorials, plaques, statues to generals and admirals grace the streets and boulevards, even of small towns.  Personally, I have much respect for true patriotism, for self-sacrifice and individual heroism.  I bow my head in reverence and remembrance of the suffering  More\nThe post Honor and Glory appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/honor-and-glory/",
          "publishedOn": "2024-07-26T05:53:06.000Z",
          "wordCount": null,
          "title": "Honor and Glory",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329276",
          "author": "Nicholas Levis",
          "description": "Following his death at age 89 on July 23 in Rome, Harper’s today compares its long-time editor and essayist Lewis H. Lapham to Montaigne, Twain, and Mencken, and quotes from him a truism as relevant as ever in these days of interminable praises for Biden farewell speeches and worse: “What so annoys people about the  More\nThe post A Non-Conformist of the Power Elite:  Lewis Lapham, 1935-2024 appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/a-non-conformist-of-the-power-elite-lewis-lapham-1935-2024/",
          "publishedOn": "2024-07-26T05:52:11.000Z",
          "wordCount": null,
          "title": "A Non-Conformist of the Power Elite:  Lewis Lapham, 1935-2024",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329247",
          "author": "Mike Bader",
          "description": "The Madison-Gallatin region in southwest Montana is part of one of the most intact, diverse and wildlife rich areas in the temperate zones of the Earth called the Greater Yellowstone Ecosystem. There are 94 mammal species in these two ranges including the omnivorous grizzly bear and black bear, bobcat, lynx, coyote, fisher, wolf, marten, mountain  More\nThe post Recreation Act Threatens Greater Yellowstone appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/recreation-act-threatens-greater-yellowstone/",
          "publishedOn": "2024-07-26T05:51:13.000Z",
          "wordCount": null,
          "title": "Recreation Act Threatens Greater Yellowstone",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329119",
          "author": "James Bovard",
          "description": "Americans should tolerate no president invoking “the will of the people” to sanctify his crimes. Since late 2020, President Joe Biden has invoked “the will of the people” dozens of times to sanctify his power, including arbitrary decrees that were illegal or unconstitutional. Biden’s invocations did not prevent his re-election campaign from being terminated behind  More\nThe post Biden And The Mirage Of American Democracy appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/biden-and-the-mirage-of-american-democracy/",
          "publishedOn": "2024-07-26T05:50:49.000Z",
          "wordCount": null,
          "title": "Biden And The Mirage Of American Democracy",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329103",
          "author": "Ron Jacobs",
          "description": "For many residents of the United States, especially those in its cities and larger suburbs, the fact of homelessness is quite well established. Camps made up of lean-tos, tents, small fire pits and people exist in parks, woods, along city streets and under freeway bridges around the nation. The reaction to these settlements by residents  More\nThe post Down and Out in San Francisco appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/down-and-out-in-san-francisco/",
          "publishedOn": "2024-07-26T05:47:48.000Z",
          "wordCount": null,
          "title": "Down and Out in San Francisco",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329308",
          "author": "David Yearsley",
          "description": "One of the most telling aspects of the first Trump presidency was the absence of music. The boxers’ clutch of Melania and Donald at their 2017 inaugural ball shuffling across the boards to Frank Sinatra’s “I Did It My Way” said everything about the new Commander-in-Chief’s utter lack of groove and humanity.  The Euterpe, the  More\nThe post The Political Lyre appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/the-political-lyre-3/",
          "publishedOn": "2024-07-26T05:47:24.000Z",
          "wordCount": null,
          "title": "The Political Lyre",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=329204",
          "author": "Kim C. Domenico",
          "description": "I’m an outsider by choice, but not truly.  It’s the unpleasantness of the system that keeps me out.  I’d rather be in, in a good system.  That’s where my discontent comes from: being forced to choose to stay outside.            –George Carlin, preface, When Will Jesus Bring the Pork Chops?  The purpose of life in America…is to be free. Yet  More\nThe post Carlin, Conrad, & the Cafe: Why We Must Have Our Trauma appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/26/carlin-conrad-the-cafe-why-we-must-have-our-trauma/",
          "publishedOn": "2024-07-26T05:45:52.000Z",
          "wordCount": null,
          "title": "Carlin, Conrad, & the Cafe: Why We Must Have Our Trauma",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": []
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45495",
          "author": "Editor",
          "description": "from C. P. Chandrasekhar and Jayati Ghosh In the past three years, global food prices have been on a roller coaster, rising rapidly especially in the first half of 2022 due to a speculative bubble and then falling from July 2022 onwards (Figure 1). The phase of rising food prices led to increasing food prices […]",
          "link": "https://rwer.wordpress.com/2024/07/25/why-do-domestic-food-prices-keep-going-up-when-global-prices-fall/",
          "publishedOn": "2024-07-25T15:08:00.000Z",
          "wordCount": 5246,
          "title": "Why do domestic food prices keep going up when global prices fall?",
          "imageUrl": "https://www.networkideas.org/wp-content/uploads/2024/07/DFP1.jpg"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45492",
          "author": "deanbaker1",
          "description": "from Dean Baker Leading media outlets like The New York Times, The Atlantic, and The New Yorker have about as much concern for intellectual consistency as TikTok videos. In very serious and somber tones they will warn the rest of us about a major problem and then in the next issue, or the next article, […]",
          "link": "https://rwer.wordpress.com/2024/07/24/ai-guaranteed-income-and-the-which-way-is-up-problem-afflicting-our-elites/",
          "publishedOn": "2024-07-24T20:31:32.000Z",
          "wordCount": 6327,
          "title": "AI, guaranteed income, and the “Which way is up?” problem afflicting our elites",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45490",
          "author": "Lars Syll",
          "description": "from Lars Syll The fallacy of composition basically consists of the false belief that the whole is nothing but the sum of its parts.  In society and in the economy this is arguably not the case. An adequate analysis of society and economy a fortiori can’t proceed by just adding up the acts and decisions of individuals. The whole […]",
          "link": "https://rwer.wordpress.com/2024/07/22/the-teaching-of-economics-captured-by-a-small-and-dangerous-sect/",
          "publishedOn": "2024-07-22T19:44:47.000Z",
          "wordCount": 4727,
          "title": "The teaching of economics — captured by a small and dangerous sect",
          "imageUrl": "https://larspsyll.wordpress.com/wp-content/uploads/2014/02/dept_of_econ_fac_pic.jpg?w=539&h=404"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=275783",
          "author": "Lambert Strether",
          "description": "Our over-easy daily links",
          "link": "https://www.nakedcapitalism.com/2024/07/links-7-28-2024.html",
          "publishedOn": "2024-07-28T10:58:41.000Z",
          "wordCount": 20786,
          "title": "Links 7/28/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/sand_lizard.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275790",
          "author": "Lambert Strether",
          "description": "The best way for the authorities to respond to AI is to develop their own AI engines, set up AI-to-AI links, implement automatic standing facilities, and make use of public-private partnerships",
          "link": "https://www.nakedcapitalism.com/2024/07/how-the-financial-authorities-can-respond-to-ai-threats-to-financial-stability.html",
          "publishedOn": "2024-07-28T10:50:10.000Z",
          "wordCount": 5326,
          "title": "How the Financial Authorities Can Respond to AI Threats to Financial Stability",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275693",
          "author": "Yves Smith",
          "description": "Our trippy dally links: WA plane disrobing, Biscuit Basin blows, eco-milk from seaweed fed cows, coal forever, China stockpiling, Europe self-destruction, Thames Water nationalization? Gaza half million deaths, Trump bullet row, Team Kamala protests too much re coronation, AI as bullshit confirmed, Crowdstrike bezzle",
          "link": "https://www.nakedcapitalism.com/2024/07/links-7-27-2024.html",
          "publishedOn": "2024-07-27T10:55:32.000Z",
          "wordCount": 20204,
          "title": "Links 7/27/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/00-fish.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275773",
          "author": "Yves Smith",
          "description": "Yves here. We are introducing most of you to Luca Placidi, founder of an Italian YouTube channel called “Tracce di Classe”. Placidi who started his blog and website in late 2023, “after the war in Ukraine and the one in Gaza made the mainstream media narrative impossible to be listened to.” He discussed politics and […]",
          "link": "https://www.nakedcapitalism.com/2024/07/michael-hudson-speaks-to-luca-placidi-about-global-south-debt-peonage-and-the-inevitability-of-multipolarity.html",
          "publishedOn": "2024-07-27T10:33:43.000Z",
          "wordCount": 13857,
          "title": "Michael Hudson Speaks to Luca Placidi About Global South Debt Peonage and the Inevitability of Multipolarity",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275771",
          "author": "Yves Smith",
          "description": "Little Free Library’s book-sharing boxes promote literacy and strengthen communities.",
          "link": "https://www.nakedcapitalism.com/2024/07/little-free-librarys-not-so-little-commitment-to-getting-the-word-out.html",
          "publishedOn": "2024-07-27T10:10:02.000Z",
          "wordCount": 6022,
          "title": "Little Free Library’s Not-So-Little Commitment to Getting the Word Out",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275742",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics; who engineered the bait and switch?; Kamala and Lina Khan; abolish your lawn ~",
          "link": "https://www.nakedcapitalism.com/2024/07/200pm-water-cooler-7-26-2024.html",
          "publishedOn": "2024-07-26T18:00:52.000Z",
          "wordCount": 22869,
          "title": "2:00PM Water Cooler 7/26/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/rcp_2024-07-26.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275730",
          "author": "Yves Smith",
          "description": "Influential studies from the VA St. Louis take a broad view of long Covid. Not every expert agrees with the approach.",
          "link": "https://www.nakedcapitalism.com/2024/07/looking-for-long-covid-a-clash-of-definition-and-study-design.html",
          "publishedOn": "2024-07-26T14:49:21.000Z",
          "wordCount": 13472,
          "title": "Looking for Long Covid: A Clash of Definition and Study Design",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/Screen-Shot-2024-07-26-at-9.38.02-PM-1024x666.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275724",
          "author": "Yves Smith",
          "description": "The US economy looks a bit perky. Party on! But will the Fed continue to apply the interest rate brakes?",
          "link": "https://www.nakedcapitalism.com/2024/07/economy-re-accelerates-in-q2-our-drunken-sailors-splurge-on-durable-goods-investment-jumps-federal-gov-undoes-blip.html",
          "publishedOn": "2024-07-26T13:45:45.000Z",
          "wordCount": 4312,
          "title": "Economy Re-Accelerates in Q2. Our Drunken Sailors Splurge on Durable Goods, Investment Jumps, Federal Gov Undoes Blip",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/00-economy-.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275700",
          "author": "Lambert Strether",
          "description": "Our bratty daily links",
          "link": "https://www.nakedcapitalism.com/2024/07/links-7-26-2024.html",
          "publishedOn": "2024-07-26T10:58:36.000Z",
          "wordCount": 19056,
          "title": "Links 7/26/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/seagull.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275699",
          "author": "Yves Smith",
          "description": "Israel 's economy is buckling due to its campaign against Palestinians. But despite what may be irreparable damage, it is not turning back.",
          "link": "https://www.nakedcapitalism.com/2024/07/israel-economy-bleeding-out-as-damage-compounds.html",
          "publishedOn": "2024-07-26T10:44:45.000Z",
          "wordCount": 8543,
          "title": "Israel Economy Bleeding Out as Damage Compounds",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/Screen-Shot-2024-07-26-at-5.22.24-PM.png"
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "66a0edd358eb3b000a36905a",
          "author": "Alex Bocharov",
          "description": "In this post, we discuss the performance optimizations we've implemented for our WAF ML product. We'll guide you through specific code examples and benchmark numbers, and we'll share the impressive latency reduction numbers observed after the rollout",
          "link": "https://blog.cloudflare.com/making-waf-ai-models-go-brr",
          "publishedOn": "2024-07-25T13:00:46.000Z",
          "wordCount": 4512,
          "title": "Making WAF ML models go brrr: saving decades of processing time",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/Making-WAF-ML-models-go-brrr--saving-decades-of-processing-time-OG-1.png"
        },
        {
          "id": "669fb2b358eb3b000a368f3a",
          "author": "Michelle Chen",
          "description": "Cloudflare is excited to be a launch partner with Meta to introduce Workers AI support for Llama 3.1",
          "link": "https://blog.cloudflare.com/meta-llama-3-1-available-on-workers-ai",
          "publishedOn": "2024-07-23T15:15:55.000Z",
          "wordCount": 1082,
          "title": "Meta Llama 3.1 now available on Workers AI",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/Meta-Llama-3.1-now-available-on-Workers-AI-OG-1.png"
        },
        {
          "id": "669e3bbb58eb3b000a368bbf",
          "author": "João Tomé",
          "description": "As the Paris 2024 Olympics approach, our analysis reveals France, the host nation, leads in DNS traffic to official Olympic sites, followed by the UK, the US, and Australia",
          "link": "https://blog.cloudflare.com/countdown-to-paris-2024-france-leads-in-olympic-web-interest",
          "publishedOn": "2024-07-22T14:41:52.000Z",
          "wordCount": 1661,
          "title": "Countdown to Paris 2024 Olympics: France leads in web interest",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/Countdown-to-Paris-2024--France-leads-in-Olympic-web-interest--OG-3.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": []
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": []
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=41090797",
          "author": "ARandomerDude",
          "description": "If you or I did this, we would already be in jail for phishing plus whatever add-on charges the Feds could file.\nMeta has Washington in their pocket so this will never leave civil court.  The penalty will be less than the money made, meaning somebody gets a bonus for being creative.",
          "link": "https://news.ycombinator.com/item?id=41090797",
          "publishedOn": "2024-07-28T02:20:18.000Z",
          "wordCount": 2146,
          "title": "New comment by ARandomerDude in \"How did Facebook intercept their competitor's encrypted mobile app traffic?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41084227",
          "author": "teddyh",
          "description": "The eternal problem with companies like Tailscale (and Cloudflare, Google, etc. etc.) is that, by solving a problem with the modern internet which the internet should have been designed to solve by itself, like simple end-to-end secure connectivity, Tailscale becomes incentivized to keep the problem. What the internet would need is something like IPv6 with automatic encryption via IPsec, with PKI provided by DNSSEC. But Tailscale has every incentive to prevent such things to be widely and compatibly implemented, because it would destroy their business. Their whole business depends on the problem persisting.\n(Repost of https://news.ycombinator.com/item?id=38570370>)",
          "link": "https://news.ycombinator.com/item?id=41084227",
          "publishedOn": "2024-07-27T03:19:45.000Z",
          "wordCount": 8094,
          "title": "New comment by teddyh in \"The New Internet\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41082452",
          "author": "KaiserPro",
          "description": "A company that provides a phone service (mobile or other) has to conform to a large amount of regulatory red tape. Why? because either a company before tried to monopolise the entire country, or they killed someone.\nNow, large tech companies haven't wholesale killed people (unlike say tobacco, or talc powder, 3M and half of their solvents, weed killer, most car makers, etc etc)\nbut they have been trying desperately to stop all competition.\nThey've also been trying to extract as much personal info as possible for profit. Because regulators in the USA are hamstrung, they are used to being able to basically doing stuff that would be illegal if it were in physical stores/pre-existing industries.",
          "link": "https://news.ycombinator.com/item?id=41082452",
          "publishedOn": "2024-07-26T21:29:28.000Z",
          "wordCount": 15061,
          "title": "New comment by KaiserPro in \"Europe is in danger of regulating its tech market out of existence\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41076198",
          "author": "miklosz",
          "description": "The city of Cracow in Poland banned billboards (and other visual advertising quite aggressively) about 2 years ago. Great outcomes. There are still some workarounds that companies do to put this s..t out in the public (e.g. covers of renovation works can contain up to 50% of advertising area, so we have renovations of just finished buildings only to put the covers with ads). \nNow, when I visit another city when there's no such ban I cannot stand this visual garbage.\nThis should be banned everywhere.",
          "link": "https://news.ycombinator.com/item?id=41076198",
          "publishedOn": "2024-07-26T06:16:54.000Z",
          "wordCount": 5620,
          "title": "New comment by miklosz in \"A Swiss town banned billboards. Zurich, Bern may soon follow\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41075886",
          "author": "slipheen",
          "description": "The American state of Vermont has banned billboards since 1968. It makes spending time in the state extraordinarily pleasant.",
          "link": "https://news.ycombinator.com/item?id=41075886",
          "publishedOn": "2024-07-26T05:00:45.000Z",
          "wordCount": null,
          "title": "New comment by slipheen in \"A Swiss town banned billboards. Zurich, Bern may soon follow\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41070629",
          "author": "wonger_",
          "description": "Personally, I like how HN focuses on content and discussions rather than individual users. If I wanted to follow experts, I'd probably curate a selection on a social network like Mastodon, or kludge together some RSS feeds.\nAlso, I feel like this tool selects for active commenters, not for knowledgeable experts. Not to mention throwaway accounts.\nStill a cool project.",
          "link": "https://news.ycombinator.com/item?id=41070629",
          "publishedOn": "2024-07-25T16:37:16.000Z",
          "wordCount": 2179,
          "title": "New comment by wonger_ in \"Mapping Hacker News to find who knows what in the HN community\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41070333",
          "author": "Smaug123",
          "description": "So I am extremely hyped about this, but it's not clear to me how much heavy lifting this sentence is doing:\n> First, the problems were manually translated into formal mathematical language for our systems to understand.\nThe non-geometry problems which were solved were all of the form \"Determine all X such that…\", and the resulting theorem statements are all of the form \"We show that the set of all X is {foo}\". The downloadable solutions from https://storage.googleapis.com/deepmind-media/DeepMind.com/B... don't make it clear whether the set {foo} was decided by a human during this translation step, or whether the computer found it. I want to believe that the computer found it, but I can't find anything to confirm. Anyone know?",
          "link": "https://news.ycombinator.com/item?id=41070333",
          "publishedOn": "2024-07-25T16:11:00.000Z",
          "wordCount": 4802,
          "title": "New comment by Smaug123 in \"AI solves International Math Olympiad problems at silver medal level\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41069823",
          "author": "kstrauser",
          "description": "So you’re setting up a multi-region RDS. If region A goes down, do you continue to accept writes to region B?\nA bank: No! If region A goes down, do not process updates in B until A is back up! We’d rather be down than wrong!\nA web forum: Yes! We can reconcile later when A comes back up. Until then keep serving traffic!\nCAP theorem doesn’t let you treat the cloud as a magic infinite availability box. You still have to design your system to pick the appropriate behavior when something breaks. No one without deep insight into your business needs can decide for you, either. You’re on the hook for choosing.",
          "link": "https://news.ycombinator.com/item?id=41069823",
          "publishedOn": "2024-07-25T15:28:59.000Z",
          "wordCount": null,
          "title": "New comment by kstrauser in \"Let's consign CAP to the cabinet of curiosities\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41065880",
          "author": "stavros",
          "description": "Then maybe \"taking over the market\" is a bad metric, and we should be optimizing for making a company that makes the workers' lives better. The US cultural bias is showing here, as it's assumed that profit is above all else, and a company that forgoes profit to make workers happier must thus be less good.\nThe vast majority of people in companies are workers. Let's stop optimizing for owner wealth and start optimizing for worker happiness instead.",
          "link": "https://news.ycombinator.com/item?id=41065880",
          "publishedOn": "2024-07-25T07:42:09.000Z",
          "wordCount": 21157,
          "title": "New comment by stavros in \"Every company should be owned by its employees\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41065750",
          "author": "dash2",
          "description": "Employee stock options are not a new idea, obviously.\nIf the story is \"every company should offer stock options to its employees\", then sure, that's often a good business plan. The reason not every company does it to all its employees is probably that for those employees, it wouldn't affect incentives much and it would make payment subject to the vagaries of the stock market. Your barista at Starbucks is not going to increase the stock price no matter how well he fills your order; at the same time, maybe he wants to know how much he takes home every day.\nIf the story is \"it should be the law that every company offers stock options\", then that would be a dumb law for the reasons above.\nIf the story is \"all companies must be fully employee-owned workers' cooperatives\", then first, note that you are calling for a restriction on workers' rights: they have to be given part of their pay as stocks, and they can't sell them freely. Second, that will probably make markets work worse. There's a large economics literature on this: worker-owned cooperatives have not taken over the market, although they are an available institutional form, because (a) they find it hard to raise capital (b) they tend to make decisions that maximize worker welfare rather than profit, e.g. they won't sack underperforming divisions or expand in ways that dilute existing workers' stake.",
          "link": "https://news.ycombinator.com/item?id=41065750",
          "publishedOn": "2024-07-25T07:24:08.000Z",
          "wordCount": null,
          "title": "New comment by dash2 in \"Every company should be owned by its employees\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41065551",
          "author": "r-spaghetti",
          "description": "Ha ha ha Apple still thinks 'the web' is Apple or Microsoft\n(https://support.apple.com/en-us/120585) and Firefox is not supported at all.\nIt's time to shake the last rotten apple from the tree.",
          "link": "https://news.ycombinator.com/item?id=41065551",
          "publishedOn": "2024-07-25T06:59:59.000Z",
          "wordCount": null,
          "title": "New comment by r-spaghetti in \"Apple Maps on the web launches in beta\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41065376",
          "author": "zarzavat",
          "description": "One thing to note is that it is impossible to strip types from TypeScript without a grammar of TypeScript. Stripping types is not a token-level operation, and the TypeScript grammar is changing all the time.\nConsider for example: `foo  ( x )`. In TypeScript 1.5 this parsed as (foo (x)) because bar&baz wasn’t a valid type expression yet. When the type intersection operator was added, the parse changed to foo(x) which desugared to foo(x). I realise I’m going back in time here but it’s a nice simple example.\nIf you want to continue to use new TypeScript features you are going to need to keep compiling to JS, or else keep your node version up to date. For people who like to stick on node LTS releases this may be an unacceptable compromise.",
          "link": "https://news.ycombinator.com/item?id=41065376",
          "publishedOn": "2024-07-25T06:35:25.000Z",
          "wordCount": null,
          "title": "New comment by zarzavat in \"Node.js adds experimental support for TypeScript\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41061752",
          "author": "crazygringo",
          "description": "This a million times.\nI swear I will never understand why Amazon's supply, organization, and pricing for household goods is such a disaster.\nBecause their experience for mainstream books is mostly perfectly fine -- there's a single listing for each book, and the price doesn't change much, just some discount from list. It works.\nBut for things like paper towels or Tide or whatever, it's utter chaos. Multiple listings for the same item, sizes and quantities that mysteriously move from one listing to another, prices that vary 10x or more...\nIt's utterly baffling to me why Amazon created this consumer-hostile nightmare. I buy a lot of stuff from Amazon, but everything home and toiletries I buy from Target online, simply because the listings and prices are totally consistent. Even though I have Prime! I don't understand why Amazon doesn't figure out that Prime consumers like me buy from Target instead because Amazon's household supplies listings are such utter unpredictable garbage, while Target just works like a normal store.",
          "link": "https://news.ycombinator.com/item?id=41061752",
          "publishedOn": "2024-07-24T20:35:28.000Z",
          "wordCount": null,
          "title": "New comment by crazygringo in \"Alexa is in millions of households and Amazon is losing billions\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41061136",
          "author": "hackerbirds",
          "description": "Users should never be expected to know these gotchas for a feature called \"private\", documented or not. It's disappointing to see GitHub calling it a feature instead of a bug, to me it just shows a complete lack of care about security. Privacy features should _always_ have a strict, safe default.\nIn the meantime I'll be calling \"private\" repos \"unlisted\", seems more appropriate",
          "link": "https://news.ycombinator.com/item?id=41061136",
          "publishedOn": "2024-07-24T19:46:01.000Z",
          "wordCount": null,
          "title": "New comment by hackerbirds in \"Anyone can access deleted and private repository data on GitHub\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41060827",
          "author": "jonahx",
          "description": "Surprised at the comments minimizing this.\nI've used github for a long time, would not have expected these results, and was unnerved by them.\nI'd recommend reading the article yourself.  It does a good job explaining the vulnerabilities.",
          "link": "https://news.ycombinator.com/item?id=41060827",
          "publishedOn": "2024-07-24T19:22:17.000Z",
          "wordCount": null,
          "title": "New comment by jonahx in \"Anyone can access deleted and private repository data on GitHub\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41060617",
          "author": "andersa",
          "description": "I reported this on their HackerOne many years ago (2018 it seems) and they said it was working as intended. Conclusion: don't use private forks. Copy the repository instead.\nHere is their full response from back then:\n> Thanks for the submission! We have reviewed your report and validated your findings. After internally assessing the finding we have determined it is a known low risk issue. We may make this functionality more strict in the future, but don't have anything to announce now. As a result, this is not eligible for reward under the Bug Bounty program.\n> GitHub stores the parent repository along with forks in a \"repository network\". It is a known behavior that objects from one network member are readable via other network members. Blobs and commits are stored together, while refs are stored separately for each fork. This shared storage model is what allows for pull requests between members of the same network. When a repository's visibility changes (Eg. public->private) we remove it from the network to prevent private commits/blobs from being readable via another network member.",
          "link": "https://news.ycombinator.com/item?id=41060617",
          "publishedOn": "2024-07-24T19:03:22.000Z",
          "wordCount": null,
          "title": "New comment by andersa in \"Anyone can access deleted and private repository data on GitHub\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41060334",
          "author": "swatcoder",
          "description": "> I always want to see a page with the product details and price before I click \"buy\". Reducing the number of clicks is not going to make me change my decision.\nThis is compounded by the multi-headed monster that large orgs like theirs have no choice but to become. If customers could trust that every day essentials had a relatively stable price and availability pattern like they trust from their local grocery store (rightly or wrongly), blind ordering might be more tenable.\nBut some other head on the beast wants to keep Amazon shaped like an unmonitored digital marketplace where orders are fulfilled dynamically by bidders and algorithms, so your Tide Pods could be anywhere from $6.99 to $64.99, and you might get anywhere between 10 and 100, and they might arrive tomorrow or next week, and they might come in retail packaging or as a bag of tide-pod-resembling-mystery-objects, etc.\nOf course blind ordering won't work when you can't give your customers any  assurances (let alone guarantees) about price, quality, volume, etc",
          "link": "https://news.ycombinator.com/item?id=41060334",
          "publishedOn": "2024-07-24T18:42:52.000Z",
          "wordCount": null,
          "title": "New comment by swatcoder in \"Alexa is in millions of households and Amazon is losing billions\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41060162",
          "author": "paxys",
          "description": "The core issue is that Amazon envisioned Alexa as a product that would help it increase sales. Smart home features were always an afterthought. How convenient would it be if people could shout \"Alexa order me Tide Pods\" from wherever they were in their home and the order got magically processed? That demo definitely got applause from a boardroom full of execs.\nThe problem is that consumers don't behave like that. This is also why Amazon's Dash buttons failed. I always want to see a page with the product details and price before I click \"buy\". Reducing the number of clicks is not going to make me change my decision and suddenly order more things.\nIf they want to salvage Alexa, they need to forget shopping and start doubling down on the smart home and assistant experience. The tech is still pretty much where it was in 2014. Alexa can set timers and tell me the weather, and...that's basically it. Make it a value add in my life and I wouldn't mind paying a subscription fee for it.",
          "link": "https://news.ycombinator.com/item?id=41060162",
          "publishedOn": "2024-07-24T18:28:23.000Z",
          "wordCount": null,
          "title": "New comment by paxys in \"Alexa is in millions of households and Amazon is losing billions\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41058510",
          "author": "dogleash",
          "description": ">  # Reddit believes in an open internet, but not the misuse of public content.\nCalling it \"public\" content in the very act of exercising their ownership over it. The balls on whoever wrote that.",
          "link": "https://news.ycombinator.com/item?id=41058510",
          "publishedOn": "2024-07-24T16:09:18.000Z",
          "wordCount": null,
          "title": "New comment by dogleash in \"Google is the only search engine that works on Reddit now, thanks to AI deal\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41058321",
          "author": "indigodaddy",
          "description": "‘ On Wednesday, some of the people who posted about the gift card said that when they went to redeem the offer, they got an error message saying the voucher had been canceled. When TechCrunch checked the voucher, the Uber Eats page provided an error message that said the gift card “has been canceled by the issuing party and is no longer valid.”’",
          "link": "https://news.ycombinator.com/item?id=41058321",
          "publishedOn": "2024-07-24T15:54:50.000Z",
          "wordCount": null,
          "title": "New comment by indigodaddy in \"CrowdStrike offers a $10 apology gift card to say sorry for outage\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41057517",
          "author": "jklinger410",
          "description": "What I've learned that, as an adult in 2024 in the United States, you cannot take for granted:\n- That your medical professionals are acting in your best interest\n- That your insurance company is acting in your best interest\n- That your medical professional knows what they are talking about\n- That things that are legal to put in your body will not cause irreparable harm to you\n- That the legal level of pollutants in the water, air, ground, walls, floors, etc are actually safe or even being measured properly\n- That you aren't being subjected to something that later will be found to be unhealthy, even if it is currently known, until it is litigated in retrospect\n- That you can afford the treatment that would be necessary to make yourself healthy\n- That anyone in the industries that would normally protect you (healthcare, insurance, public health, government, etc) even care to do so\nI understand that some people would look at that list and say I should have never expected some of those, but pardon me for being propagandized at a very young age that we lived in a country that was good and just. That's my bad.\nSo I am not surprised to see this, and expect to see more of it.",
          "link": "https://news.ycombinator.com/item?id=41057517",
          "publishedOn": "2024-07-24T14:33:12.000Z",
          "wordCount": null,
          "title": "New comment by jklinger410 in \"Taking my diabetes treatment into my own hands\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41057127",
          "author": "tefkah",
          "description": "You could publish it in the Journal of Trial and Error (https://journal.trialanderror.org), which I created with a number of colleagues a couple years ago!\nOur editor-in-chief was interviewed for this related Nature article a couple months ago (https://www.nature.com/articles/d41586-024-01389-7).\nWhile it’s easy pickings, it’s still always worth pointing out the hypocrisy of Nature publishing pieces like this, given that they are key drivers of this phenomenon by rarely publishing null results in their mainline journals. They are have extremely little incentive to change anything about the way scientific publishing works, as they are currently profiting the most from the existing structures, so them publishing something like this always leaves a bit of a sour taste.",
          "link": "https://news.ycombinator.com/item?id=41057127",
          "publishedOn": "2024-07-24T13:51:55.000Z",
          "wordCount": null,
          "title": "New comment by tefkah in \"You got a null result. Will anyone publish it?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41052152",
          "author": "oceanplexian",
          "description": "I opted out at Boston International Airport. It involved arguing with the TSA for about 5 minutes while holding up a 150 person line. Then the supervisor came over, told me that I \"was required to have to have my photo taken\" and opting out consisted of checking a box in the software to not save my photo. My alternative was to not get on the flight.\nThe whole idea of opting out is a scam. They are 100% planning to force mandatory facial recognition on the general public.",
          "link": "https://news.ycombinator.com/item?id=41052152",
          "publishedOn": "2024-07-23T23:34:11.000Z",
          "wordCount": null,
          "title": "New comment by oceanplexian in \"You can opt out of airport face scans\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41051324",
          "author": "0xdde",
          "description": ">  A mathematical and statistical person would have a lot of fun building prediction models for all the different geysers.\nIt's so popular that one of the datasets immediately available in base R is the set of waiting times between eruptions for a Yellowstone geyser [1].\n[1] https://www.rdocumentation.org/packages/datasets/versions/3....",
          "link": "https://news.ycombinator.com/item?id=41051324",
          "publishedOn": "2024-07-23T21:50:00.000Z",
          "wordCount": null,
          "title": "New comment by 0xdde in \"Hydrothermal explosion at Yellowstone National Park\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41050467",
          "author": "Aeroi",
          "description": "Used to guide in Yellowstone. This has no bearing on the greater Yellowstone Caldera (supervolcano) which spans nearly 30miles by 40miles. In my time there I never saw anything like this. If you're ever in a situation similar to this, run as fast and as far as you can.\nThe interesting thing about geysers and pools is how relatively predictable they are... until they are not. A mathematical and statistical person would have a lot of fun building prediction models for all the different geysers.",
          "link": "https://news.ycombinator.com/item?id=41050467",
          "publishedOn": "2024-07-23T20:30:16.000Z",
          "wordCount": null,
          "title": "New comment by Aeroi in \"Hydrothermal explosion at Yellowstone National Park\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41047467",
          "author": "cs702",
          "description": "> We’re releasing Llama 3.1 405B, the first frontier-level open source AI model, as well as new and improved Llama 3.1 70B and 8B models.\nBravo! While I don't agree with Zuck's views and actions on many fronts, on this occasion I think he and the AI folks at Meta deserve our praise and gratitude. With this release, they have brought the cost of pretraining a frontier 400B+ parameter model to ZERO for pretty much everyone -- well, everyone except Meta's key competitors.[a] THANK YOU ZUCK.\nMeanwhile, the business-minded people at Meta surely won't mind if the release of these frontier models to the public happens to completely mess up the AI plans of competitors like OpenAI/Microsoft, Google, Anthropic, etc. Come to think of it, the negative impact on such competitors was likely a key motivation for releasing the new models.\n---\n[a] The license is not open to the handful of companies worldwide which have more than 700M users.",
          "link": "https://news.ycombinator.com/item?id=41047467",
          "publishedOn": "2024-07-23T15:59:29.000Z",
          "wordCount": null,
          "title": "New comment by cs702 in \"Open source AI is the path forward\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41047366",
          "author": "epaulson",
          "description": "The National Science Foundation has been doing this for decades, starting with the supercomputing centers in the 80s. Long before anyone talked about cloud credits, NSF has had a bunch of different programs to allocate time on supercomputers to researchers at no cost, these days mostly run out of the Office of Advanced Cyberinfrastruture. (The office name is from the early 00s) - https://new.nsf.gov/cise/oac\n(To connect universities to the different supercomputing centers, the NSF funded the NSFnet network in the 80s, which was basically the backbone of the Internet in the 80s and early 90s. The supercomputing funding has really, really paid off for the USA)",
          "link": "https://news.ycombinator.com/item?id=41047366",
          "publishedOn": "2024-07-23T15:53:00.000Z",
          "wordCount": null,
          "title": "New comment by epaulson in \"Open source AI is the path forward\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41047141",
          "author": "the8thbit",
          "description": "\"Eventually though, open source Linux gained popularity – initially because it allowed developers to modify its code however they wanted ...\"\nI find the language around \"open source AI\" to be confusing. With \"open source\" there's usually \"source\" to open, right? As in, there is human legible code that can be read and modified by the user? If so, then how can current ML models be open source? They're very large matrices that are, for the most part, inscrutable to the user. They seem akin to binaries, which, yes, can be modified by the user, but are extremely obscured to the user, and require enormous effort to understand and effectively modify.\n\"Open source\" code is not just code that isn't executed remotely over an API, and it seems like maybe its being conflated with that here?",
          "link": "https://news.ycombinator.com/item?id=41047141",
          "publishedOn": "2024-07-23T15:37:01.000Z",
          "wordCount": null,
          "title": "New comment by the8thbit in \"Open source AI is the path forward\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41047116",
          "author": "JumpCrisscross",
          "description": "“The Heavy Press Program was a Cold War-era program of the United States Air Force to build the largest forging presses and extrusion presses in the world.” This ”program began in 1944 and concluded in 1957 after construction of four forging presses and six extruders, at an overall cost of $279 million. Six of them are still in operation today, manufacturing structural parts for military and commercial aircraft” [1].\n$279mm in 1957 dollars is about $3.2bn today [2]. A public cluster of GPUs provided for free to American universities, companies and non-profits might not be a bad idea.\n[1] https://en.m.wikipedia.org/wiki/Heavy_Press_Program\n[2] https://data.bls.gov/cgi-bin/cpicalc.pl?cost1=279&year1=1957...",
          "link": "https://news.ycombinator.com/item?id=41047116",
          "publishedOn": "2024-07-23T15:35:23.000Z",
          "wordCount": null,
          "title": "New comment by JumpCrisscross in \"Open source AI is the path forward\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41046892",
          "author": "Rinzler89",
          "description": "> instead of learning how to start and run a business\nBecause the stress and risks of running a small business as a solo inexperienced first time business owner are insane compared to a regular 9-5.\nEspecially if you start hiring other people, your liability then  increases 10 fold as now anything can happen with them (sick leave, absenteism, low performance, sabotage, etc) but you're still bound to the same deadlines you agreed with your customers or you'll get sued for damages by them.\nAs an employee you have some basic rights and protections from the state on the limits your employer can squeeze from you, more or less, depending on where you live. As a contractor or company however, you don't, and can be fully liable in court for your failures to deliver regardless of your personal circumstances. Unless you know what you're getting into and have the know-how, experience, or mentorship, it's not worth it in most cases.",
          "link": "https://news.ycombinator.com/item?id=41046892",
          "publishedOn": "2024-07-23T15:19:26.000Z",
          "wordCount": null,
          "title": "New comment by Rinzler89 in \"Ask HN: Is it possible to make FAANG salaries without working there?\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=52889",
          "author": "Chris Bertram",
          "description": "Visit the post for more.",
          "link": "https://crookedtimber.org/2024/07/28/sunday-photoblogging-liverpool-2/",
          "publishedOn": "2024-07-28T07:53:29.000Z",
          "wordCount": 1678,
          "title": "Sunday photoblogging: Liverpool",
          "imageUrl": "https://live.staticflickr.com/65535/53886338469_a627c3cfbc.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52883",
          "author": "Belle Waring",
          "description": "Do you all experience flow? Or rather, as I think everyone does at times, do you experience it often? Obviously I have written plenty of words in my life, but this is not generally something you experience when writing blog posts unless you are maybe excoriating someone in an unnecessarily profane way that is–fundamentally–unfair. Like, […]",
          "link": "https://crookedtimber.org/2024/07/27/flow/",
          "publishedOn": "2024-07-27T22:56:51.000Z",
          "wordCount": 3954,
          "title": "Flow",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52876",
          "author": "John Q",
          "description": "From The Guardian Among many other challenges in dealing with the failure of urban policy in Australia, the Minns (NSW state) government is faced with the task of renegotiating, or repudiating, the disastrous set of contracts for toll roads in New South Wales made by its predecessors (Labor and Liberal) with the Transurban group. As […]",
          "link": "https://crookedtimber.org/2024/07/25/the-era-of-privatisation-is-nearly-over-but-cleaning-up-the-mess-left-behind-will-take-years/",
          "publishedOn": "2024-07-25T04:28:10.000Z",
          "wordCount": 4358,
          "title": "The era of privatisation is nearly over. But cleaning up the mess left behind will take years",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52873",
          "author": "John Q",
          "description": "Joe Biden’s withdrawal from the US presidential election has prompted me to write down a few thoughts about getting old and being old. First up, I’m going to rant a bit (in classic old-person mode) about how much I loathe the various prissy euphemisms for “old” that appear just about everywhere: “older”, “aging”, “senior” and, […]",
          "link": "https://crookedtimber.org/2024/07/23/getting-old-and-being-old/",
          "publishedOn": "2024-07-23T06:52:40.000Z",
          "wordCount": 5196,
          "title": "Getting old and being old",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/Tax-justice-in-Pakistan",
          "author": "Pakistan Kissan Rabita Committee",
          "description": "Press statement Abolish taxation from electricity bills Reduce the price of electricity to 10 Rupees a unit Impose a super tax on the rich \nEnglish\n\n/ \nPakistan, \nTax Justice, \nInflation",
          "link": "https://www.cadtm.org/Tax-justice-in-Pakistan",
          "publishedOn": "2024-07-27T06:21:29.000Z",
          "wordCount": 2153,
          "title": "Tax justice in Pakistan",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L720xH378/a6571c2553d34fe84186a936a2d0e2-4f03b.jpg"
        },
        {
          "id": "https://www.cadtm.org/STOP-the-IMF-and-the-World-Bank",
          "author": "Collective, CADTM International",
          "description": "This July 22, about a hundred popular movements, networks and social organizations from around the world launch a Call to join forces to put an end to the criminal actions of the International Monetary Fund (IMF), the World Bank (WB) and the illegitimate debt they create. Together with the open invitation to join in coordinating actions, the call to strengthen mobilization and resistance to prevent these institutions, and the development model they promote from continuing to violate the (...)\nEnglish\n\n/ \nEcological debt, \nIMF, \nWorld Bank",
          "link": "https://www.cadtm.org/STOP-the-IMF-and-the-World-Bank",
          "publishedOn": "2024-07-25T11:10:50.000Z",
          "wordCount": 3432,
          "title": "STOP the IMF and the World Bank!",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L254xH133/66891312d5cbdedb8f58e2aff4fe24-5f1d1.png"
        },
        {
          "id": "https://www.cadtm.org/Big-Brother-is-already-at-work-Urgent-resistance-before-it-s-too-late",
          "author": "Yorgos Mitralias",
          "description": "A highlight of the Olympic flame's peregrinations through France was its meeting with a “102-year-old former Resistance fighter”, which was celebrated by the country's media, who were quick to see it as an apotheosis of the flame's... humanist and pacifist virtues. All the more so as this otherwise very sympathetic old lady declared that she wanted to carry the Olympic flame “in the name of the values of friendship between peoples that she defended during the Resistance”. Obviously, the old (...)\nEnglish\n\n/ \nFrance, \nAntifascism, \nNorth",
          "link": "https://www.cadtm.org/Big-Brother-is-already-at-work-Urgent-resistance-before-it-s-too-late",
          "publishedOn": "2024-07-25T09:27:42.000Z",
          "wordCount": 2105,
          "title": "Big Brother is already at work! Urgent resistance before it's too late...",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/4186767f5070b5261b4f34c6a214bc-eec10.jpg"
        },
        {
          "id": "https://www.cadtm.org/Final-Statement-of-the-2024-Summer-University-organised-by-ATTAC-Maroc-in",
          "author": "ATTAC/CADTM Morocco",
          "description": "On July 19, 20 and 21, 2024 in Agadir, ATTAC/CADTM Maroc organized the 18th session of its Summer University, under the banner “Solidarity with the Palestinian people against the imperialist Zionist genocidal war, and in support of the social struggles against neoliberal policies in Morocco”. \nEnglish\n\n/ \nSocial movements, \nMorocco, \nCADTM",
          "link": "https://www.cadtm.org/Final-Statement-of-the-2024-Summer-University-organised-by-ATTAC-Maroc-in",
          "publishedOn": "2024-07-24T14:37:12.000Z",
          "wordCount": 3243,
          "title": "Final Statement of the 2024 Summer University organised by ATTAC Maroc in Agadir on July 19, 20 and 21, 2024",
          "enclosure": {
            "url": "https://www.cadtm.org/IMG/jpg/whatsapp_image_2024-07-19_at_18_37.07.jpg",
            "length": "60628",
            "type": "image/jpeg"
          },
          "imageUrl": "https://www.cadtm.org/IMG/jpg/whatsapp_image_2024-07-19_at_18_37.07.jpg"
        },
        {
          "id": "https://www.cadtm.org/Solidarity-with-Kenyal-people",
          "author": "Collective, CADTM International",
          "description": "The CADTM and Kenyan Allies Declaration \nPress releases\n\n/ \nSocial movements, \nIMF, \nKenya, \nSouth, \nStructural Adjustment Programs",
          "link": "https://www.cadtm.org/Solidarity-with-Kenyal-people",
          "publishedOn": "2024-07-24T08:24:21.000Z",
          "wordCount": 3687,
          "title": "Solidarity with Kenyan people!",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L960xH504/f0ea7d36e67b46b73dab851e46f759-9b970.jpg"
        },
        {
          "id": "https://www.cadtm.org/Corporate-Corruption-of-South-African-Politics-and-Economics",
          "author": "Patrick Bond",
          "description": "‘Accumulation by Dispossession' as a Structural Process, beyond ‘State Capture' \nEnglish\n\n/ \nCorruption / financial criminality, \nSouthern Africa, \nCorporate",
          "link": "https://www.cadtm.org/Corporate-Corruption-of-South-African-Politics-and-Economics",
          "publishedOn": "2024-07-22T08:25:32.000Z",
          "wordCount": 14267,
          "title": "Corporate Corruption of South African Politics and Economics",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/33232c44a4b2586ed559437bfa7b5b-869b4.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=8079",
          "author": "disassociated.com",
          "description": "Canadian actor and director Megan Park’s latest feature, My Old Ass, trailer, would be a sure bet to win movie title of the year, should such an award exist. Otherwise, My Old Ass is on my want-to-see movie list because of the time-travel-like, older-self goes back in time to see their younger-self, and dispense some […]",
          "link": "https://disassociated.com/my-old-ass-film-megan-park-maisy-stella-aubrey-plaza/",
          "publishedOn": "2024-07-25T21:00:39.000Z",
          "wordCount": 297,
          "title": "My Old Ass, a film by Megan Park, with Maisy Stella, Aubrey Plaza",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8057",
          "author": "disassociated.com",
          "description": "Liam Heitmann-Ryce-LeMercier, writing for The Sydney Morning Herald: I suspect restaurant and cafe customers have little idea of the profound, quiet stigma directed towards service workers. There is an assumption in this country that wait staff above a certain age are where they are because they lack the skills or gumption to “get a proper […]",
          "link": "https://disassociated.com/the-way-we-treat-service-staff-says-much-about-who-we-are/",
          "publishedOn": "2024-07-24T21:00:11.000Z",
          "wordCount": 308,
          "title": "The way we treat service staff says much about who we are",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8053",
          "author": "disassociated.com",
          "description": "The shortlists for the 2024 Tiny Awards have been published. Now in their second year, the Tiny Awards honour “interesting, small, craft-y internet projects and spaces which basically make the web a more fun place to be.” Think the work of small, and independent creatives. To be eligible, websites need to be non-commercial, and launched […]",
          "link": "https://disassociated.com/tiny-awards-2024-shortlist-announced-public-voting-open/",
          "publishedOn": "2024-07-23T21:00:45.000Z",
          "wordCount": 193,
          "title": "Tiny Awards 2024 shortlist announced, public voting open",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8050",
          "author": "disassociated.com",
          "description": "This news, via Kurzgesagt, may not be what some people want to hear. Exercising is useful, necessary in fact, but not so much when it comes to trying to lose weight it seems. Active people who work out regularly do burn more than inactive people. But only very little, often as low as 100 calories, […]",
          "link": "https://disassociated.com/fixed-calorie-budget-stops-weight-loss-exercise/",
          "publishedOn": "2024-07-22T21:00:25.000Z",
          "wordCount": 192,
          "title": "Your fixed calorie budget stops weight loss through exercise",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20240723",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20240723",
          "publishedOn": "2024-07-23T23:00:00.000Z",
          "wordCount": 753,
          "title": "Week Ending July 21, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/those-days",
          "author": null,
          "description": "The work of Helen Garner.",
          "link": "https://newleftreview.org/sidecar/posts/those-days",
          "publishedOn": "2024-07-26T14:57:56.000Z",
          "wordCount": 2706,
          "title": "Louis Rogers: &ldquo;Those Days&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/Garner-1.jpeg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/evil-empires",
          "author": null,
          "description": "Africa and the New Cold War.",
          "link": "https://newleftreview.org/sidecar/posts/evil-empires",
          "publishedOn": "2024-07-25T19:23:45.000Z",
          "wordCount": 1764,
          "title": "Elizabeth Schmidt: &ldquo;Evil Empires?&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/ACR-2-Tazara.jpeg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/brechts-scissors",
          "author": null,
          "description": "At Raven Row.",
          "link": "https://newleftreview.org/sidecar/posts/brechts-scissors",
          "publishedOn": "2024-07-25T10:01:56.000Z",
          "wordCount": 2072,
          "title": "Shane Boyle: &ldquo;Brecht&#8217;s Scissors&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/brecht.jpg"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://maharshi.bearblog.dev/tensors-from-scratch-part-1/",
          "author": null,
          "description": "This is a series of blog posts that will let you understand what exactly are Tensors, and how you can too implement them from scratch in C. I will be going from basic definitions, illustrations, and explanations to the actual code implementation in this series.\nDon't worry, I'm here to help :)\nBefore jumping into the implementation of tensors, we first need to understand what are tensors and how can we define them.\nTensors\nWhat the hell do I mean when I say the word tensor? Let's start from the beginning.\nImagine a number say,\n$$\nx = 33\n$$\nThis number $x$ is just a value and it is \"dimensionless\" i.e. we cannot attach any arrows to this number in the sense that tells us what this number is made up of. We call numbers like this Scalars. The dimensionality of a scalar is $0$.\nNote: in order …",
          "link": "https://maharshi.bearblog.dev/tensors-from-scratch-part-1/",
          "publishedOn": "2024-07-27T07:20:00.000Z",
          "wordCount": 1649,
          "title": "Tensors from Scratch #1: Tensors and their Shapes",
          "imageUrl": "https://i.ibb.co/Qrk8fdb/33.png"
        },
        {
          "id": "https://veronique.ink/tonight/",
          "author": null,
          "description": "Sitting on the balcony, listening to America by Simon & Garfunkel, and drinking a glass of rosé. Almost Famous comes to mind. Great film.\n\nIt's all happening...\nThinking about lost friendships. How one minute you're saying i love you, and the next, they're gone, and you're left wondering what they're doing with their time, and wishing you could to talk to them like it was the old days.\njuly songs so far:",
          "link": "https://veronique.ink/tonight/",
          "publishedOn": "2024-07-27T00:00:00.000Z",
          "wordCount": 605,
          "title": "tonight",
          "imageUrl": "![IMG_3659](https://bear-images.sfo2.cdn.digitaloceanspaces.com/veronique-1722037238.jpeg)"
        },
        {
          "id": "https://notes.jeddacp.com/week-notes-015/",
          "author": null,
          "description": "🗓️ // 072024 - 072624\nI typically look at my private/personal journal to do these weekly recaps but this week has been not so great that I didn’t have the energy to do much introspective writing.\nSomething happened at work this week that broke my heart and grateful at the same time. It’s such a contradictory feeling that has left me feeling torn and emotionally exhausted. It is continuing to happen and I’m just hoping I have the energy to endure all of it in the coming days.\nI have a lot of things upcoming that I am absolutely dreading, but don’t have the power to change or control. For now, I am trying my best to put it aside and consider it a tomorrow/next week/next month problem. It’s causing me unnecessary stress, but I don’t know what else to do.\nI got so much feedback after I wrote …",
          "link": "https://notes.jeddacp.com/week-notes-015/",
          "publishedOn": "2024-07-26T23:11:00.000Z",
          "wordCount": 1212,
          "title": "Week Notes 015",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1721425535.png"
        },
        {
          "id": "https://martinschuhmann.com/bear-blog-is-fun/",
          "author": null,
          "description": "I haven't written much on my blog in the last few weeks...\nI've started some blog posts here and there but haven't finished them. Or I simply didn't publish them for various reasons.\nInstead, I created a few slash pages, experimented with my site design, jotted down a few new ideas, read plenty of blog posts from the discovery feed and emailed with some wonderful Bear Blog bloggers.\nAnd I had a lot of fun doing these things...\nAt first, it felt weird not to finish and publish any blog posts. It also caused me some anxiety. But blogging should be fun...\nFor me, Bear Blog is fun.\nSo instead of thinking too much about writing…\nI enjoyed experimenting, reading and socializing on Bear Blog.",
          "link": "https://martinschuhmann.com/bear-blog-is-fun/",
          "publishedOn": "2024-07-26T14:15:00.000Z",
          "wordCount": 602,
          "title": "Bear Blog is Fun",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://alexandrawolfe.ca/bullet-journalling-one-notebook-to-replace-them-all/",
          "author": null,
          "description": "\"In the journal I do not just express myself more openly than I could do to any person; I create myself.\" — Susan Sontag\nTo keep myself organised and, because I love paper and all things stationery, I've been a journalist all my life. From writing in little spiral-bound notebooks and school exercise books as a child, right on through to a fancy leather-bound Midori (an expensive Japanese notebook) that was a birthday gift. I've been an avid note-maker since I was able to hold a pencil and write.\nI've used all sorts of notebooks to scribble in, and even tried the made for journaling journal by Baron Fig—yes, what a great name! Never mind the journal that everyone seems to hold as sacred, the Leuchtturm1917. But amongst them all, big, small, ruled, dotted or blank, fancy, plain, expensive or…",
          "link": "https://alexandrawolfe.ca/bullet-journalling-one-notebook-to-replace-them-all/",
          "publishedOn": "2024-07-25T19:15:42.715Z",
          "wordCount": 940,
          "title": "Bullet Journalling — One notebook to replace them all!",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/awolfe-1720898838.png"
        },
        {
          "id": "https://veronique.ink/pivoting-drawings-and-the-passage-of-time/",
          "author": null,
          "description": "I spent the morning making some drawings for my summer art project. Four of them are done and on their way to their forever homes to be read and tucked away in books, to be pinned on a fridge or placed on a shelf perhaps. Tiny paper notes traveling across the globe.\n\nfinished postcards...can you guess which one is yours?\nThinking about the passage of time and trying not to spiral about the end of summer and the reality of finding work again. Can time not slow down? Will I be able to find work that doesn't make me want to unalive myself?\n\nThings Seen by Annie Ernaux\nmy fanciful summer wishlist:\nreading print magazines/books\nsending handwritten postcards and letters\nhandmade bed quilt > duvet\nplaying cards by candlelight\nmore candles and boxes of matches\ngoing to a drive-in (i've never been)…",
          "link": "https://veronique.ink/pivoting-drawings-and-the-passage-of-time/",
          "publishedOn": "2024-07-25T19:14:00.000Z",
          "wordCount": 969,
          "title": "pivoting, drawings, and the passage of time",
          "imageUrl": "![13BDA3F7-C535-4B26-9C55-A1C97937EE6B](https://bear-images.sfo2.cdn.digitaloceanspaces.com/veronique-1721606707.jpeg)"
        },
        {
          "id": "https://froggy.bearblog.dev/birdwatching-saved-my-life/",
          "author": null,
          "description": "Like many people, my view of birdwatching (\"birding\") and its practitioners were neutral at best, holding their stereotypical focal gear, donning vests and hats.\nI learned that my friend casually did it on his walks and stuff, and was able to identify birds. That was cool, and made the hobby a bit more approachable for me.\nIt wasn't until COVID when I saw a pair of cute yellow birds in the tree. Because the leaves haven't grown in yet, I was able to watch them fly around the tree, landing in different spots, and ultimately move on to other spots. I was so mesmerized, I thought I had just seen a legendary pokemon. I immediately went to google, and found that it was an American Goldfinch.\nIt wasn't really easy to find though. Google took me down an old-web looking site with the title \"Birds …",
          "link": "https://froggy.bearblog.dev/birdwatching-saved-my-life/",
          "publishedOn": "2024-07-25T03:14:00.000Z",
          "wordCount": 992,
          "title": "birdwatching saved my life",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://blog.avas.space/falling-out-of-love-with-coding/",
          "author": null,
          "description": "I've been feeling rather listless about coding recently. I briefly tried some things on a sideproject website of mine to get back into it, and it was like pulling teeth. I haven't properly coded in months, so I am sure that adds to it, but there's more to it.\nI thought about it, and something else came to my mind. Years ago, I was teaching myself 3D modeling. For a few years, I had planned to get into game design as a prop artist and also applied to a university program centered on this. It needed a portfolio, so for three years I worked hard and got rejected each year because 600 people applied for 40 spots, haha. But what I specifically remembered is how I fell out of love with that too for a very similar feeling. I was making a dumpster in 3DS Max and I ran into the same bug over and ov…",
          "link": "https://blog.avas.space/falling-out-of-love-with-coding/",
          "publishedOn": "2024-07-24T11:21:00.000Z",
          "wordCount": 1728,
          "title": "falling out of love with coding",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/avas-1709500835-0.png"
        },
        {
          "id": "https://notes.jeddacp.com/when-every-day-feels-the-same/",
          "author": null,
          "description": "I woke up this morning with a sense of déjà vu.\nMy alarm hadn't gone off yet, but I was already awake, rolling over in bed with a familiar sense of dread. The routine was the same: get ready for work, make coffee, and head to my home office to start the work day.\nAs I attended meetings, smiled for the camera, and updated my product roadmap for what felt like the millionth time, that same feeling stayed— I’ve done this before.\nThis feeling has been with me since yesterday, last week, months before, and maybe even longer. It’s like living in my own version of Groundhog Day1, where every day is identical to the day before.\nI wake up too early (for me, at least)2, work all day, and by the end of my work day, I'm so drained (emotionally and mentally) that all I want to do is curl up in a ball and sleep. The only break to this repetition is the weekends, and even then, I try not to think about work.\nI can’t help but ask myself, is this really all there is to life?\nUgh, I think I just need a vacation.\n16/100\n💬 Community Echoes\nthe coffee quest by oak\nReply by email\nA movie from 1993 where “A narcissistic, self-centered weatherman finds himself in a time loop on Groundhog Day.” I’m not narcissistic but I do feel like I’m stuck in some loop I want to break free from.↩\n\n\nI’m not a morning person↩",
          "link": "https://notes.jeddacp.com/when-every-day-feels-the-same/",
          "publishedOn": "2024-07-23T21:49:00.000Z",
          "wordCount": 975,
          "title": "When Every Day Feels the Same",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1721771238.png"
        },
        {
          "id": "https://bones-ai.bearblog.dev/anti-resume/",
          "author": null,
          "description": "I saw this really cool post on Twitter and thought I'd make my own version of it\nHere's my anti-resume,\nI don't specialise in any particular programming language. To me, languages are just syntax on top of ideologies and principles. I've come to appreciate the essence of programming itself.\nI don't follow clean code, I don't follow any programming patterns. When I write code I only strive for simplicity.\nI overvalue simplicity, to the point that I believe that its the most critical thing when it comes to software development. I don't like it when I see python one-liner in a codebase\nI do a lot of recreational coding. I don't care a lot about how many people use the things I build. I build things simply because I love building things.\nI love Lua, it's beautiful. Again, I like simplicity in things, when I code in any other language, I usually use a subset of its features. I don't like using iterators over loops, I don't do operator overloading, I don't like it when languages offer multiple ways of accomplishing the same thing. This is also the reason I'm starting to like C.\nI rely a lot on intuition.\nI’m not a fan of TDD.\nI value data structures over algorithms.\nI don't like Jira. I often end up not using it during projects. I don't like Docker either, I try to avoid it whenever possible.\nI prefer monoliths over microservices. While microservices can be useful, I think they are often misused.\nI'm not very good at math. I need a pen and a paper whenever I encounter problems involving matrices, trigonometry, or anything beyond basic math\nThat's it for now :)",
          "link": "https://bones-ai.bearblog.dev/anti-resume/",
          "publishedOn": "2024-07-23T15:46:00.000Z",
          "wordCount": 701,
          "title": "Anti-Resume",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://iamyourboon.com/my-run-in-with-the-russian-mafia/",
          "author": null,
          "description": "On my history with sports betting.\nDisclaimer: I am not a fan of gambling. I do not condone it. I do not recommend it. In fact, I believe online gambling and sports betting will irrevocably damage entire generations. I was terribly addicted and it really gave me bad thoughts all the time. Do not, do not gamble.\nWith that being said, I used to gamble, a lot. I started really young: when I was 11. It began innocuously with Team Fortress 2, betting in-game currencies like refined metals in raffle groups for larger prizes. I was on the edge of my seat for pennies. I never told my parents (hint: my family was poor). While this wasn't particularly profitable, it was my introduction to the habit. Trading virtual items in Team Fortress 2 was more lucrative and in fact how I made most of my early s…",
          "link": "https://iamyourboon.com/my-run-in-with-the-russian-mafia/",
          "publishedOn": "2024-07-23T15:01:00.000Z",
          "wordCount": 1086,
          "title": "My run in with the Russian Mafia",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://lebacafables.bearblog.dev/avant-de-passer-a-la-suite/",
          "author": null,
          "description": "En écrivant ces lignes, j’écoute ça : Open in new tab\nDans mon article précédent, j’ai constaté un malaise :\nde nombreuses campagnes de jeu de rôle m’ont déçu.\nJe suis parti en envolées lyriques.\nMaintenant, j’ai envie d’agir.\nJ’ai déjà commencé, en réalité,\ndepuis plusieurs semaines.\nJ’expérimente des trucs.\nJ’en ré-applique d’autres que j’avais laissés de côté.\nDans mes prochains articles,\nje vais probablement me concentrer à nouveau\nsur du plus \"jeu de rôle\".\nMais j'ai l'intuition que parler de créativité en général,\nça apporte aussi quelque chose.\nMe contenter de parler \"techniques de jeu de rôle\",\nc'est comme brûler une étape.\nDonc... Je vais encore parler de moi.\n(Et peut-être de toi)\nOn nous a tendu un piège\nOn va parler du circuit de la récompense,\nde créativité, et de neurobullshi…",
          "link": "https://lebacafables.bearblog.dev/avant-de-passer-a-la-suite/",
          "publishedOn": "2024-07-23T14:32:00.000Z",
          "wordCount": 3320,
          "title": "Avant de passer à la suite...",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://goofpunk.com/theres-so-many-of-you/",
          "author": null,
          "description": "Looks like since I started regularly updating this blog in June, there’s been 500 unique visitors and nearly a thousand reads. That’s kind of insane to me, I was pretty sure no one was going to read this thing, and I’m still not 100% sure why people do. I’m just some person!! I didn’t think I had enough interesting things to say to warrant being read a thousand times, but it looks like you all disagree. So thank you to everyone who’s reading, I appreciate you being here!\nAlso, shout out to the person reading this blog from Fraidycat. I know someone is cool when they use Fraidycat.",
          "link": "https://goofpunk.com/theres-so-many-of-you/",
          "publishedOn": "2024-07-23T12:05:00.000Z",
          "wordCount": 354,
          "title": "there’s so many of you",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://alexandrawolfe.ca/the-retirement-i-never-asked-for/",
          "author": null,
          "description": "Back in early 2016 I had a medical emergency I never saw coming and had something happen to me that resulted in my having to take early retirement. Though I am thankful it wasn't permanent retirement to the grave.\nThe event? My brain blew a gasket.\nThe event so powerful, I lost three days of my life and woke up in hospital wondering what the hell had happened. I can't say I was scared at the time because I had no real idea of what happened or any memories of those lost days. I just woke up. A fact I am forever grateful for.\nThat medical emergency took me out for a whole year. I was laid up not really able to do much for a good few months. And then, slowly, bit by bit, I got back on my feet and tried to think about nothing else than what I was doing that day, and what I could look forward t…",
          "link": "https://alexandrawolfe.ca/the-retirement-i-never-asked-for/",
          "publishedOn": "2024-07-22T16:08:53.945Z",
          "wordCount": 1006,
          "title": "The Retirement I Never Asked For",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/awolfe-1720898838.png"
        },
        {
          "id": "https://iamyourboon.com/almost-getting-suspended-from-cmu/",
          "author": null,
          "description": "A story of the time I got a disciplinary hearing after hacking into CMU's dining system.\nI graduated from Carnegie Mellon University last semester. It’s a modest school in the rust belt city of Pittsburgh, Pennsylvania. The CS department is renowned, and its PhDs are coveted.\nPittsburgh is a city past its prime, with abandoned steel mills as quaint witnesses to an older time. It's citizens are resilient, enduring the constant rain and wind, trying their best to navigate life between Steelers' losses. Carnegie Mellon was founded by Andrew Carnegie. Carnegie was a philanthropist, but also a terrible employer. And his employees were the type to be driven more by sheer necessity than ambition (to be fair, they were factory workers).\nSimilarly, CMU students are driven not by dreams of passion o…",
          "link": "https://iamyourboon.com/almost-getting-suspended-from-cmu/",
          "publishedOn": "2024-07-22T12:28:00.000Z",
          "wordCount": 1505,
          "title": "Almost Getting Suspended from CMU",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/alex-gorrion-we-want-to-be-great-like-our-crime?v=1722015984",
          "author": null,
          "description": "Author: Alex Gorrion\nTitle: We Want to Be Great Like Our Crime\nSubtitle: The Criminal Ego and the Struggle in Society\nDate: June 20, 2010\nSource: The Anvil Review\n\n On Isabelle Eberhardt's “Criminal” and Renzo Novatore's “Toward the Creative Nothing” \n Quotes refer to the Eberhardt Press edition and the Venomous Butterfly Publications edition, respectively. \nCrime\n In “Criminal,” Isabelle Eberhardt's memoir of land colonization in Algeria written around the turn of the last century, the farmer Mohammed Achouri cuts an interesting figure. A “tall thin old man with the face of an ascetic, his hard features set in an expression of constant preoccupation”, a quiet character who stands “a bit apart from the others”, he is not a likely hero. Though he stands out, and in fact his inability to fit…",
          "link": "https://theanarchistlibrary.org/library/alex-gorrion-we-want-to-be-great-like-our-crime?v=1722015984",
          "publishedOn": "2024-07-26T17:46:24.000Z",
          "wordCount": 3235,
          "title": "Alex Gorrion - We Want to Be Great Like Our Crime",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "11473",
            "url": "https://theanarchistlibrary.org/library/alex-gorrion-we-want-to-be-great-like-our-crime.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/sophia-nachalo-and-yarostan-vochek-letters-of-insurgents?v=1721655357",
          "author": null,
          "description": "Author: Sophia Nachalo and Yarostan Vochek\nTitle: Letters of Insurgents\nDate: 1976\nNotes: Published by Black and Red Press, Detroit, 1976.\n\nYarostan’s first letter\n Dear Sophia, \n Forgive me for addressing you familiarly, as a friend; I have no way of knowing if you’re still the person I once knew. I can’t remember the sound of your voice, the shape of your face or the feel of your hand. I vaguely remember admiring the energy and intelligence in someone so young, but I regret that you didn’t leave a lasting mark, you didn’t become my guide in my journey through hell. \n I wouldn’t even remember your name if you hadn’t written me twelve years ago. My wife Mirna memorized the name and address on the envelope because she attributed a strange power to your letter. Unfortunately I never saw that…",
          "link": "https://theanarchistlibrary.org/library/sophia-nachalo-and-yarostan-vochek-letters-of-insurgents?v=1721655357",
          "publishedOn": "2024-07-22T13:35:57.000Z",
          "wordCount": 397052,
          "title": "Sophia Nachalo and Yarostan Vochek - Letters of Insurgents",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "825776",
            "url": "https://theanarchistlibrary.org/library/sophia-nachalo-and-yarostan-vochek-letters-of-insurgents.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}