{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "3ec4a6e752f974d277f95d9da7228e9f5bba4ba4",
          "author": "Sébastien Stormacq",
          "description": "AWS Summit season is in full swing around the world, with last week’s events in Bengaluru, Berlin, and  Seoul, where my blog colleague Channy delivered one of the keynotes. Last week’s launches Here are some launches that got my attention: Amazon S3 will no longer charge for several HTTP error codes – A customer reported […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-application-load-balancer-ipv6-amazon-s3-pricing-update-amazon-ec2-flex-instances-and-more-may-20-2024/",
          "publishedOn": "2024-05-20T15:49:05.000Z",
          "wordCount": 1709,
          "title": "AWS Weekly Roundup – Application Load Balancer IPv6, Amazon S3 pricing update, Amazon EC2 Flex instances, and more (May 20, 2024)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/08/13/AWS-WIR-default.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": [
        {
          "id": "dcd98043e309fb462fb16c1c99293fceecad41fd",
          "author": "Wang Rui",
          "description": "Introduction ComfyUI is an open-source node-based workflow solution for Stable Diffusion. It offers the following advantages: Significant performance optimization for SDXL model inference High customizability, allowing users granular control Portable workflows that can be shared easily Developer-friendly Due to these advantages, ComfyUI is increasingly being used by artistic creators. In this post, we will introduce […]",
          "link": "https://aws.amazon.com/blogs/architecture/deploy-stable-diffusion-comfyui-on-aws-elastically-and-efficiently/",
          "publishedOn": "2024-05-16T15:25:06.000Z",
          "wordCount": 2619,
          "title": "Deploy Stable Diffusion ComfyUI on AWS elastically and efficiently",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fc074d501302eb2b93e2554793fcaf50b3bf7291/2024/05/15/fig1-comfyui-stable-diffusion.png"
        }
      ]
    },
    {
      "title": "The GitHub Blog: Engineering News and Updates",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/category/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": []
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "6094b32da7c2d5cacc202444ec0b024d73ee06c4",
          "author": "Sebastian Lee",
          "description": "Independent Service Vendor (ISV) users often offer their end-user solutions hosted on a multi-tenant architecture to reduce cost and operational management. However, this approach can lead Kubernetes clusters to resource exhaustion or network starvation issues that impact neighboring workloads. By default, Kubernetes provides capabilities to enforce resource availability such as CPU and memory to prevent […]",
          "link": "https://aws.amazon.com/blogs/containers/ensuring-fair-bandwidth-allocation-for-amazon-eks-workloads/",
          "publishedOn": "2024-05-21T19:56:45.000Z",
          "wordCount": 3248,
          "title": "Ensuring fair bandwidth allocation for Amazon EKS Workloads",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/05/08/Featured-images-for-Containers-Blog-1-1260x630.jpg"
        },
        {
          "id": "f2c6d73c0a99a5e7cc62d68bc9a22528e5bead29",
          "author": "Mirash Gjolaj",
          "description": "Containers have become the dominant method for deploying and managing applications in recent years. Their widespread adoption is attributed to numerous advantages, such as isolation, efficient hardware use, scalability, and portability. In situations where resource isolation is critical for system security, many users are forced to rely on virtual machines (VMs) to mitigate the impact […]",
          "link": "https://aws.amazon.com/blogs/containers/enhancing-kubernetes-workload-isolation-and-security-using-kata-containers/",
          "publishedOn": "2024-05-16T22:47:06.000Z",
          "wordCount": 3432,
          "title": "Enhancing Kubernetes workload isolation and security using Kata Containers",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/05/09/Featured-images-for-Containers-Blog-4-1260x630.jpg"
        },
        {
          "id": "ef56de61f8631e9846e056ddafcc46ba422f73dd",
          "author": "Bentzi Lifshitz",
          "description": "Mobileye (Nasdaq: MBLY), a global leader in advanced driver-assistance systems (ADAS), is at the forefront of the autonomous driving revolution. Founded in 1999, they have pioneered groundbreaking technologies such as REM™ crowdsourced mapping, True-Redundancy™ sensing, and Responsibility-Sensitive Safety (RSS). These innovations are paving the way for a future filled with self-driving vehicles and advanced mobility […]",
          "link": "https://aws.amazon.com/blogs/containers/mobileye-revolutionizing-hd-map-creation-for-autonomous-vehicles-with-spark-on-amazon-eks/",
          "publishedOn": "2024-05-16T22:45:40.000Z",
          "wordCount": 4162,
          "title": "Mobileye: Revolutionizing HD map creation for autonomous vehicles with Spark on Amazon EKS",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/05/16/Featured-images-for-Containers-Blog-6-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=323426",
          "author": "Peter Byrne",
          "description": "Protestors probe his political psyche and we follow the money Northern California congressperson Jared Huffman, 60, held his annual “Hootenanny” campaign fundraiser at Lagunitas Brewery in Petaluma, California. Press were denied entry to the private party, but the real story was outside, as CounterPunch discovered. The fundraising event did not go karmically well for the  More\nThe post Who is Pro-Israel California Rep. Jared Huffman—Really? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/22/who-is-california-rep-jared-huffman-really/",
          "publishedOn": "2024-05-22T06:02:13.000Z",
          "wordCount": null,
          "title": "Who is Pro-Israel California Rep. Jared Huffman—Really?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323257",
          "author": "Henry Giroux",
          "description": "In the spirit of ruthless equity firms and asset-stripping hedge fund managers, pedagogies of conformity, silencing, and ethical abandonment now proliferate under the guise of budget cuts or overt attempts to transform higher education into white nationalist indoctrination centers. Universities are now viewed as businesses, students as clients, and faculty as a serf-like, casual labor force. Furthermore, administrative leadership has regressed, modeling itself after hedge fund managers and embracing a market-driven ideology that believes the irrational belief that the market to solve all problems and control not only the economy but all aspects of social life. More\nThe post Welcome to the Hedge-Fund Driven Neoliberal University appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/22/welcome-to-the-hedge-fund-driven-neoliberal-university/",
          "publishedOn": "2024-05-22T05:58:51.000Z",
          "wordCount": null,
          "title": "Welcome to the Hedge-Fund Driven Neoliberal University",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323473",
          "author": "Binoy Kampmark",
          "description": "It was faint, but there was more than just a flicker of hope.  In the tormented (and tormenting) journey the WikiLeaks founder and publisher, Julian Assange, has endured, May 20, 2024 provided another pitstop.  As with many such stops over the years, it involved lawyers.  Many of them. The occasion was whether the UK High Court of Justice  More\nThe post The Assange Case: A Flicker of Hope in the UK High Court appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/22/the-assange-case-a-flicker-of-hope-in-the-uk-high-court/",
          "publishedOn": "2024-05-22T05:55:34.000Z",
          "wordCount": null,
          "title": "The Assange Case: A Flicker of Hope in the UK High Court",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323256",
          "author": "Roger Harris",
          "description": "For all the hullabaloo about “free and fair elections” in Venezuela by the US government, its sycophantic corporate press deliberately ignores the elephant in the room – namely, the so-called sanctions designed to make life so miserable that the people will acquiesce to Washington’s plan for regime change. As Foreign Policy puts it, “Venezuelan President  More\nThe post The Biggest Obstacle to Free and Fair Elections in Venezuela is the US appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/22/the-biggest-obstacle-to-free-and-fair-elections-in-venezuela-is-the-us/",
          "publishedOn": "2024-05-22T05:54:12.000Z",
          "wordCount": null,
          "title": "The Biggest Obstacle to Free and Fair Elections in Venezuela is the US",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323385",
          "author": "Andrew Moss",
          "description": "As Israeli troops continue their assault in Rafah, increasing the death toll and displacing – yet again – hundreds of thousands of Gazans, there’s much to be learned from recalling Dr. Martin Luther King’s visionary words on Vietnam 57 years ago. Breaking his silence on a war that by then had claimed over 20,000 American  More\nThe post Dr. King’s Words on Vietnam Still Ring True for Gaza appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/22/dr-kings-words-on-vietnam-still-ring-true-for-gaza/",
          "publishedOn": "2024-05-22T05:37:24.000Z",
          "wordCount": null,
          "title": "Dr. King’s Words on Vietnam Still Ring True for Gaza",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323280",
          "author": "Dean Baker",
          "description": "In the wake of the release of the 2024 Social Security Trustees Report, we have seen a wave of columns and news articles telling us that we won’t have enough workers to support a growing population of retirees. The story is that all of us baby boomer types are now retiring and the later generations  More\nThe post Social Security: Productivity Growth and the Scary Stories About Rising Retiree to Worker Ratios appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/22/social-security-productivity-growth-and-the-scary-stories-about-rising-retiree-to-worker-ratios/",
          "publishedOn": "2024-05-22T05:30:56.000Z",
          "wordCount": null,
          "title": "Social Security: Productivity Growth and the Scary Stories About Rising Retiree to Worker Ratios",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323383",
          "author": "Judith Deutsch",
          "description": "“It was the best of times, it was the worst of times, it was the age of wisdom, it was the age of foolishness, it was the epoch of belief, it was the epoch of incredulity, it was the season of light, it was the season of darkness, it was the spring of hope, it  More\nThe post The Nadir of Human Behavior appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/22/the-nadir-of-human-behavior/",
          "publishedOn": "2024-05-22T05:01:04.000Z",
          "wordCount": null,
          "title": "The Nadir of Human Behavior",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323264",
          "author": "Alex Richwine – Algernon Austin",
          "description": "The crisis of student debt has reached proportions never before seen in the United States. Collectively, students owed $1.6 trillion in federal student loans at the end of 2023. However, that total is slightly lower than it was two years prior, thanks to some proactive actions from the Biden administration. The administration has pursued a  More\nThe post Why the Student Debt Crisis Would Likely Worsen Under a Second Trump Administration appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/22/why-the-student-debt-crisis-would-likely-worsen-under-a-second-trump-administration/",
          "publishedOn": "2024-05-22T04:46:37.000Z",
          "wordCount": null,
          "title": "Why the Student Debt Crisis Would Likely Worsen Under a Second Trump Administration",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323343",
          "author": "Abba Solomon - Norman Solomon",
          "description": "A significant number of American Jews are now willing to challenge the Zionist project while pointing out that it is inherently fated to suppress the human rights of non-Jews in Palestine. Speaking at a protest near Sen. Chuck Schumer’s home in Brooklyn last month, Naomi Klein said: “We don’t need or want the false idol of Zionism. We want freedom from the project that commits genocide in our name.” More\nThe post The Dead End of Liberal American Zionism appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/21/the-dead-end-of-liberal-american-zionism/",
          "publishedOn": "2024-05-21T06:06:00.000Z",
          "wordCount": null,
          "title": "The Dead End of Liberal American Zionism",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323274",
          "author": "Steve Kelly",
          "description": "To a working family “camping” on the street or a homeless single mother, this is what political collapse feels like.  The UK is #1 in homelessness, the USA “leads” the developed world in percentage of its population living on the street.  Meanwhile, endless billions are borrowed and sent abroad to senselessly genocide millions.  These sure signs of Imperialist decline can’t be ignored forever.    More\nThe post Empire Stumbling Toward Irrelevance appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/21/empire-stumbling-toward-irrelevance/",
          "publishedOn": "2024-05-21T06:00:21.000Z",
          "wordCount": null,
          "title": "Empire Stumbling Toward Irrelevance",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323374",
          "author": "Ed Rampell",
          "description": "In the classic 1952 Western High Noon, Katy Jurado portrays Helen Ramirez, former lover of Will Kane (Gary Cooper), the outnumbered, embattled Marshal at Hadleyville, who is being menaced by a looming shootout with a gang of gunslingers. Ramirez confronts Will’s newlywed, Amy Fowler (Grace Kelly), telling the bride that she should pick up a  More\nThe post High Noon at LA’s City Council appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/21/high-noon-at-las-city-council/",
          "publishedOn": "2024-05-21T05:59:36.000Z",
          "wordCount": null,
          "title": "High Noon at LA’s City Council",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323175",
          "author": "John Feffer",
          "description": "Given all this Green rhetoric and crude (oil) action, it’s hard to find examples around the world where people are actually doing something to end fossil fuel production. One of those places is Ecuador, which held a referendum last August about keeping oil under the ground of a certain plot of land in the Yasuní national park. “Yasuní is the most important park in Ecuador,” observes Esperanza Martínez, of Acción Ecológica in Ecuador. “It has been recognized as the most biodiverse region in the world, and it’s also home to many indigenous peoples.” More\nThe post The Race to End Fossil Fuel Production appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/21/the-race-to-end-fossil-fuel-production/",
          "publishedOn": "2024-05-21T05:57:22.000Z",
          "wordCount": null,
          "title": "The Race to End Fossil Fuel Production",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323381",
          "author": "Clarence Lusane",
          "description": "Consider Donald Trump to be in a racial bind when it comes to election 2024. After all, he needs Black voters to at least defect from Joe Biden in swing states, if not actually vote for him. Yet, more than ever, he also needs his white nationalist base to believe that a second Trump term  More\nThe post Black MAGA Is Still MAGA appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/21/black-maga-is-still-maga/",
          "publishedOn": "2024-05-21T05:57:13.000Z",
          "wordCount": null,
          "title": "Black MAGA Is Still MAGA",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323408",
          "author": "Francis Brodsky",
          "description": "What can we gain from a better understanding of the police as an American institution? A new documentary digs deep into the history, philosophy, and legality of US policing, tying historical injustices to the contemporary use and abuse of state violence. Following much praise for Power at Sundance and CPH:DOX earlier this year, Oscar-nominated director Yance Ford (Strong Island) brings his  More\nThe post Power, or the Purpose of the Police appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/21/power-or-the-purpose-of-the-police/",
          "publishedOn": "2024-05-21T05:55:56.000Z",
          "wordCount": null,
          "title": "Power, or the Purpose of the Police",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323409",
          "author": "Dave McCall",
          "description": "Management at Amfuel tried to bully Jo Tucker and her 200 co-workers—most of them Black women, a number of them single moms—into accepting dozens of unnecessary concessions in a new contract. For four years, however, the manufacturing workers in Magnolia, Arkansas remained strong and resolute as the company tried to break the union and wear them  More\nThe post How Solidarity Triumphs Over Corporate Greed appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/21/how-solidarity-triumphs-over-corporate-greed/",
          "publishedOn": "2024-05-21T05:55:50.000Z",
          "wordCount": null,
          "title": "How Solidarity Triumphs Over Corporate Greed",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323412",
          "author": "Sonali Kolhatkar",
          "description": "Manufacturers of new weight loss drugs are salivating at the prospect of profit. What Americans eat, how they diet and exercise, the sugar content of their sodas, and the high fructose corn syrup in their processed foods have long been objects of endless gambling on Wall Street. Now, with drugs like Mounjaro, Wegovy, and Ozempic,  More\nThe post The Big Business of Obesity and Shame appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/21/the-big-business-of-obesity-and-shame/",
          "publishedOn": "2024-05-21T05:55:04.000Z",
          "wordCount": null,
          "title": "The Big Business of Obesity and Shame",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323146",
          "author": "Algernon Austin",
          "description": "Affordable rental housing policy fails to provide sufficient affordable rental housing decade after decade, yet policymakers continue to do largely the same things. A researcher at the Joint Center for Housing Studies recently observed that in 1960, about 45 percent of renters in the bottom income quintile spent more than 50 percent of their income  More\nThe post US Affordable Rental Housing Policy Either Doesn’t Make Any Sense or Is Working as Intended appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/21/us-affordable-rental-housing-policy-either-doesnt-make-any-sense-or-is-working-as-intended/",
          "publishedOn": "2024-05-21T05:36:33.000Z",
          "wordCount": null,
          "title": "US Affordable Rental Housing Policy Either Doesn’t Make Any Sense or Is Working as Intended",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323379",
          "author": "Lawrence Wittner",
          "description": "Although Donald Trump, as president, proclaimed in his 2020 State of the Union address that he had produced a “blue-collar boom” in workers’ wages, the reality was quite different. Using his control of the executive branch of the U.S. government, Trump repeatedly undermined the wages of American workers by blocking raises and imposing wage reductions.  More\nThe post Donald Trump’s Assault on the Wages of American Workers appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/21/donald-trumps-assault-on-the-wages-of-american-workers/",
          "publishedOn": "2024-05-21T05:34:46.000Z",
          "wordCount": null,
          "title": "Donald Trump’s Assault on the Wages of American Workers",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323418",
          "author": "Douglas Lummis",
          "description": "Remember those language puzzles that used to stump us in our school days. that grow out of the human ability to say things that are not true? They come in many forms, some complex, some simple. Among the more complex, there was The Evil Emperor. Evil Emperor: Make a statement about anything.  If it’s true  More\nThe post The Liar Puzzle appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/21/the-liar-puzzle/",
          "publishedOn": "2024-05-21T05:05:22.000Z",
          "wordCount": null,
          "title": "The Liar Puzzle",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323174",
          "author": "Giorgos Mitralias",
          "description": "If some people think they can repeat what they’ve seen in other countries and occupy universities, pitch tents and make a mess, they’re deeply mistaken”. This – so eminently delicate – statement by the Greek Prime Minister, which followed the brutal “evacuation” of the law faculty on Tuesday May 14 (28 arrests), can only surprise  More\nThe post From South Africa to Israel, the Greek State Has Always Had a Soft Spot for Apartheid appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/21/from-south-africa-to-israel-the-greek-state-has-always-had-a-soft-spot-for-apartheid/",
          "publishedOn": "2024-05-21T04:59:37.000Z",
          "wordCount": null,
          "title": "From South Africa to Israel, the Greek State Has Always Had a Soft Spot for Apartheid",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323355",
          "author": "John Whitbeck",
          "description": "The decision to announce these applications for arrest warrants prior to their formal approval may have been motivated by a sense that the conditions under which the people of Gaza are striving to survive are deteriorating so rapidly and horrifically that there is no time to waste and by a hope that announcing the applications now might have a positive impact on the decisions of relevant decision-makers for whom arrest warrants are not yet being sought but could be sought later. More\nThe post On the ICC’s Announcement of Arrest Warrants for Netanyahu, Gallant and Hamas’ Leadership appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/20/on-the-iccs-announcement-of-arrest-warrants-for-netanyahu-gallant-and-hamas-leadership/",
          "publishedOn": "2024-05-20T15:46:28.000Z",
          "wordCount": null,
          "title": "On the ICC’s Announcement of Arrest Warrants for Netanyahu, Gallant and Hamas’ Leadership",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323145",
          "author": "Christian G. Appy",
          "description": "I have been a history professor at the University of Massachusetts, Amherst for twenty years. On May 7, I was one of a handful of faculty members arrested for standing in support of hundreds of students who were engaged in nonviolent protest of university complicity in the ongoing slaughter and suffering of Palestinians in Gaza. They want the school to divest from companies profiting from the carnage. More\nThe post UMass Arrests: What Would Daniel Ellsberg Do? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/20/umass-arrests-what-would-daniel-ellsberg-do/",
          "publishedOn": "2024-05-20T06:00:52.000Z",
          "wordCount": null,
          "title": "UMass Arrests: What Would Daniel Ellsberg Do?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323147",
          "author": "Sonali Kolhatkar",
          "description": "Workers in Towson, Maryland, have earned the distinction of becoming the first Apple retail workers in the nation to vote to strike over failed union negotiations with their employer. The approximately 100 Apple workers were also the first in the nation to successfully form a union. They did so in 2022, as the Coalition of Organized Retail Employees (CORE), joining the International Association of Machinists and Aerospace Workers (IAM). Two-thirds of the store’s workers voted to join the union, a resounding success at a company that has long staved off union activity. More\nThe post Why Corporations Choose Lawlessness to Fight Unions appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/20/why-corporations-choose-lawlessness-to-fight-unions/",
          "publishedOn": "2024-05-20T05:59:24.000Z",
          "wordCount": null,
          "title": "Why Corporations Choose Lawlessness to Fight Unions",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323143",
          "author": "Sam Pizzigati",
          "description": "New York currently hosts, researchers at the London-based Henley & Partners have just reported, more centi-millionaires than any other city on Earth. And if hosting centi-millionaires ever became an Olympic sport, the Henley stats show, the USA would be bringing home gold, silver, and bronze. The San Francisco Bay Area — now teeming with 675 centi-millionaires — rates as the world’s second-most-popular home to fortunes worth over $100 million. Los Angeles sits third with 496. More\nThe post The Toughest Job Today’s Richest Ever Face? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/20/the-toughest-job-todays-richest-ever-face/",
          "publishedOn": "2024-05-20T05:55:45.000Z",
          "wordCount": null,
          "title": "The Toughest Job Today’s Richest Ever Face?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323295",
          "author": "Laurel Sutherlin",
          "description": "Since the turn of the century, there has been a consistent average annual loss of 3 to 4 million hectares (7.4 to 9.9 million acres) of tropical forest globally. This puts us far from reaching the goal of zero deforestation by 2030, a target embraced in 2021 by 145 countries during the COP26 climate summit in Glasgow. Besides  More\nThe post Procter & Gamble, Mondelēz, and Nestlé Are Among 10 of the Leading Consumer Brands Driving Global Deforestation appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/20/procter-gamble-mondelez-and-nestle-are-among-10-of-the-leading-consumer-brands-driving-global-deforestation/",
          "publishedOn": "2024-05-20T05:55:38.000Z",
          "wordCount": null,
          "title": "Procter & Gamble, Mondelēz, and Nestlé Are Among 10 of the Leading Consumer Brands Driving Global Deforestation",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323312",
          "author": "Jessica Garcia",
          "description": "In an era of climate disasters, Americans in vulnerable regions will need to rely more than ever on their home insurance. But as floods, wildfires, and severe storms become more common, a troubling practice known as “bluelining” threatens to leave many communities unable to afford insurance — or obtain it at any price. Bluelining is  More\nThe post How Bluelining Leaves Climate Vulnerable Communities Without Home Insurance appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/20/how-bluelining-leaves-climate-vulnerable-communities-without-home-insurance/",
          "publishedOn": "2024-05-20T05:55:23.000Z",
          "wordCount": null,
          "title": "How Bluelining Leaves Climate Vulnerable Communities Without Home Insurance",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323293",
          "author": "Binoy Kampmark",
          "description": "Things are looking dire for the Ukrainian war effort.  Promises of victory are becoming even hollower than they were last summer, when US President Joe Biden could state with breathtaking obliviousness that Russia had “already lost the war”.   The worst offender in this regard remains the United States, which has been the most vocal proponent of fanciful victory over  More\nThe post Promising the Impossible: Blinken’s Out of Tune Performance in Kyiv appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/20/promising-the-impossible-blinkens-out-of-tune-performance-in-kyiv/",
          "publishedOn": "2024-05-20T05:55:04.000Z",
          "wordCount": null,
          "title": "Promising the Impossible: Blinken’s Out of Tune Performance in Kyiv",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323359",
          "author": "CounterPunch News Service",
          "description": "ICC Prosecutor Khan on application for arrest warrants in the situation in the State of Palestine Today I am filing applications for warrants of arrest before Pre-Trial Chamber I of the International Criminal Court in the Situation in the State of Palestine. Yahya Sinwar, Mohammed Diab Ibrahim Al-Masri (Deif), Ismail Haniyeh On the basis of  More\nThe post Statement of ICC Prosecutor Karim A.A. Khan KC: Applications for arrest warrants in the situation in the State of Palestine appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/20/statement-of-icc-prosecutor-karim-a-a-khan-kc-applications-for-arrest-warrants-in-the-situation-in-the-state-of-palestine/",
          "publishedOn": "2024-05-20T05:52:27.000Z",
          "wordCount": null,
          "title": "Statement of ICC Prosecutor Karim A.A. Khan KC: Applications for arrest warrants in the situation in the State of Palestine",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323162",
          "author": "Yoav Litvin",
          "description": "In the vast expanse of the intellectual cosmos, there exists a luminary whose brilliance outshines even the brightest stars. Professor Yuval Noah Harari, a name whispered with reverence among the learned denizens of the galaxy, is a beacon of knowledge, whose canon traverses the celestial planes of history, philosophy, human psychology and beyond. Informed by  More\nThe post Yuval Noah Harari’s Odyssey into a Parallel Zionist Universe appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/20/yuval-noah-hararis-odyssey-into-a-parallel-zionist-universe/",
          "publishedOn": "2024-05-20T05:52:26.000Z",
          "wordCount": null,
          "title": "Yuval Noah Harari’s Odyssey into a Parallel Zionist Universe",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323160",
          "author": "Ralph Nader",
          "description": "A recent newspaper article reports that GEICO, one of the largest auto insurers in the U.S., has amassed a staggering $189 billion in cash, apart from the reserves required by law to insure the volume of potential claims by its policyholders. Angry consumers have cried out about auto insurance premiums going up as the prices  More\nThe post Tapping Into the Vast Safety Potential of “Loss Prevention” by the Insurance Industry appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/20/tapping-into-the-vast-safety-potential-of-loss-prevention-by-the-insurance-industry/",
          "publishedOn": "2024-05-20T05:45:03.000Z",
          "wordCount": null,
          "title": "Tapping Into the Vast Safety Potential of “Loss Prevention” by the Insurance Industry",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": [
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=29773",
          "author": "Rajashri Chakrabarti, Dan Garcia, and Maxim Pinkovskiy",
          "description": "Veterans constitute a significant segment of the male labor force, and understanding labor market disparities between veterans and non‑veterans is an important component of studying disparities in the economy as a whole. In a previous Liberty Street Economics post, we have shown that even relative to a group of comparable non-veterans, veterans have lower employment and labor force participation rates. One year later, we see that veterans continue to experience lower labor market attachment and the employment gap has widened, though the earnings gap has closed.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/05/veterans-are-doing-better-in-the-labor-market/",
          "publishedOn": "2024-05-22T13:30:00.000Z",
          "wordCount": 3987,
          "title": "Veterans in the Labor Market: 2024 Update",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/05/LSE_2024_veterans_garcia_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=29223",
          "author": "Nina Boyarchenko and Leonardo Elias",
          "description": "Firms’ access to credit is a crucial determinant of their investment, employment, and overall growth decisions. While we usually think of their ability to borrow as determined by aggregate credit conditions, in reality firms have a number of markets where they can borrow, and conditions can vary across those markets. In this post, we investigate how the composition of debt instruments on U.S. firms’ balance sheets has evolved over the last twenty years.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/05/the-changing-landscape-of-corporate-credit/",
          "publishedOn": "2024-05-21T11:00:00.000Z",
          "wordCount": 4200,
          "title": "The Changing Landscape of Corporate Credit",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/05/LSE_2024_landscape-corp-credit_elias_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=30028",
          "author": "Jaison R. Abel and Richard Deitz",
          "description": "Supply chain disruptions became a major headache for businesses in the aftermath of the pandemic. Indeed, in October 2021, nearly all firms in our regional business surveys reported at least some difficulty obtaining the supplies they needed. These supply chain disruptions were a key contributor to the surge in inflation that occurred as the economy recovered from the pandemic recession. In this post, we present new measures of supply availability from our Business Leaders Survey and Empire State Manufacturing Survey that closely track the New York Fed’s Global Supply Chain Pressure Index (GSCPI). We will begin publishing these data on a monthly basis starting in June. These indexes indicate that supply availability had generally been improving since early 2023, but over the past couple of months, improvement has stalled. This trend is concerning since our May Supplemental Survey indicates that between a third and a half of businesses in the region are experiencing difficulties obtaining supplies, and many are reducing operations and raising prices to compensate, though to a lesser extent than a few years ago.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/05/supply-chain-disruptions-have-eased-but-remain-a-concern/",
          "publishedOn": "2024-05-20T12:30:00.000Z",
          "wordCount": 4190,
          "title": "Supply Chain Disruptions Have Eased, But Remain a Concern",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/05/LSE_2024_supply-chain-disruptions_deitz_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=29961",
          "author": "Martín Almuzara, Babur Kocaoglu, and Argia Sbordone",
          "description": "In the aftermath of the COVID-19 pandemic, inflation rose almost simultaneously in most economies around the world. After peaking in mid-2022, inflation then went into decline—a fall that was just as universal as the initial rise. In this post, we explore the interrelation of inflation dynamics across OECD countries by constructing a measure of the persistence of global inflation. We then study the extent to which the persistence of global inflation reflects broad-based swings, as opposed to idiosyncratic country-level movements. Our main finding is that the spike and subsequent moderation in global inflation in the post-pandemic period were driven by persistent movements. When we look at measures of inflation that include food and energy prices, most of the persistence appears to be broad-based, suggesting that international oil and commodity prices played an important role in global inflation dynamics. Excluding food and energy prices in the analysis still shows a broad-based persistence, although with a substantial increase in the role of country-specific factors.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/05/is-the-recent-inflationary-spike-a-global-phenomenon/",
          "publishedOn": "2024-05-16T11:00:00.000Z",
          "wordCount": 4443,
          "title": "Is the Recent Inflationary Spike a Global Phenomenon?",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/05/LSE_2024_global-inflation_almuzara_460.jpg"
        }
      ]
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45375",
          "author": "Lars Syll",
          "description": "from Lars Syll While one can understand that some of the elements in DSGE models seem to appeal to Keynesians at first sight, after closer examination, these models are in fundamental contradiction to Post-Keynesian and even traditional Keynesian thinking. The DSGE model is a model in which output is determined in the labour market as […]",
          "link": "https://rwer.wordpress.com/2024/05/20/dsge-models-a-total-waste-of-time/",
          "publishedOn": "2024-05-20T00:52:00.000Z",
          "wordCount": 5214,
          "title": "DSGE models — a total waste of time",
          "imageUrl": "https://larspsyll.wordpress.com/wp-content/uploads/2013/12/12-02-03-ostwc3a4rts-dullien-01.jpeg?w=550"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45372",
          "author": "peterradford",
          "description": "from Peter Radford A pile of bricks is not a house.  A group of individuals is not an economy. A lot has to happen between the one and the other.  Which is why writing theories about economies as if it were simply an accumulation of individuals and their associated capital base misses the mark.  Nor […]",
          "link": "https://rwer.wordpress.com/2024/05/16/lost-opportunities/",
          "publishedOn": "2024-05-16T19:49:14.000Z",
          "wordCount": 5705,
          "title": "Lost opportunities?",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "The Money Illusion",
      "feedUrl": "https://feeds.feedblitz.com/themoneyillusion",
      "siteUrl": "https://www.themoneyillusion.com",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=272027",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics, Stefanik files ethics complaint against Merchan, Greenhalgh publishes ginormous, magisterial study, stomps anti-maskers and droplet dogmatists, \"trust your immune system.\" ~",
          "link": "https://www.nakedcapitalism.com/2024/05/200pm-water-cooler-5-22-2024.html",
          "publishedOn": "2024-05-22T18:00:37.000Z",
          "wordCount": 7597,
          "title": "2:00PM Water Cooler 5/22/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/rcp_05-17-2024.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272024",
          "author": "Yves Smith",
          "description": "The Rafah operation is speeding the pace of genocide in Gaza.  That looks to be its primary aim.",
          "link": "https://www.nakedcapitalism.com/2024/05/israel-gaza-starvation-ploy-intensifies-with-seizure-of-rafah-crossings.html",
          "publishedOn": "2024-05-22T14:20:44.000Z",
          "wordCount": 4884,
          "title": "Israel Gaza Starvation Ploy Intensifies With Seizure of Rafah Crossings",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=271982",
          "author": "Yves Smith",
          "description": "Our blistering daily links: moar cat bird flu victims, coffee drinking decline, Taiwan factory kill switches, police getting DNA via false Covid tests, AfD, Netanyahu doubles down on genocide, Zelensky meltdown, Trump beats Biden $ haul, Supremes, confused Fed, private equity v. pet owners",
          "link": "https://www.nakedcapitalism.com/2024/05/links-5-22-2024.html",
          "publishedOn": "2024-05-22T10:59:13.000Z",
          "wordCount": 12611,
          "title": "Links 5/22/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/Screen-Shot-2024-05-22-at-5.47.57-PM.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272018",
          "author": "Yves Smith",
          "description": "Science publication has become so corrupted that entire journals have been shut down over running fake research. How did we get here?",
          "link": "https://www.nakedcapitalism.com/2024/05/greshams-law-comes-for-science.html",
          "publishedOn": "2024-05-22T09:42:17.000Z",
          "wordCount": 9574,
          "title": "Gresham’s Law Comes for Science",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272014",
          "author": "Yves Smith",
          "description": "How the UK is using the extremist label to act against people holding mainstream views. The US is not far behind.",
          "link": "https://www.nakedcapitalism.com/2024/05/am-i-an-extremist.html",
          "publishedOn": "2024-05-22T09:15:56.000Z",
          "wordCount": 7408,
          "title": "“Am I An Extremist? ”",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=271988",
          "author": "Yves Smith",
          "description": "US policy towards the homeless becomes ever more mean-spirited, apparently to justify not dealing with the problem of unaffordable housing.",
          "link": "https://www.nakedcapitalism.com/2024/05/housing-not-handcuffs.html",
          "publishedOn": "2024-05-22T04:51:36.000Z",
          "wordCount": 8395,
          "title": "Housing, Not Handcuffs",
          "imageUrl": "https://tomdispatch.com/wp-content/uploads/2021/11/Screen-Shot-2021-11-04-at-10.01.48-AM.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=271992",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics, Trump trial winding down, Biden's path to victory, a one-liner to revert Google search results to a list of blue links again ~",
          "link": "https://www.nakedcapitalism.com/2024/05/200pm-water-cooler-5-21-2024.html",
          "publishedOn": "2024-05-21T18:00:52.000Z",
          "wordCount": 17174,
          "title": "2:00PM Water Cooler 5/21/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/rcp_05-17-2024.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=271983",
          "author": "Yves Smith",
          "description": "For those looking  for the libretto to the Middle East version of Gotterdammerung, a compact retelling of the First Intifada.",
          "link": "https://www.nakedcapitalism.com/2024/05/from-the-history-of-israel%e2%88%92palestine-conflict-the-first-palestinian-intifada-against-the-state-of-israel-1987%e2%88%921993-and-its-political-consequences.html",
          "publishedOn": "2024-05-21T13:55:00.000Z",
          "wordCount": 4371,
          "title": "From the History of Israel−Palestine Conflict: The First Palestinian Intifada Against the State of Israel (1987−1993) and its Political Consequences",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=271876",
          "author": "Yves Smith",
          "description": "Our ferocious daily links: Darwin award winner, Singapore Covid outbreak, EU China poking doubts, Assange appeal, UK water investor heist, ICC Israel prosecution plan, DR Congo coup defeated, Russia growth, Iran succession, RFK, Jr. address questions, toxic Biden? real wages rising?",
          "link": "https://www.nakedcapitalism.com/2024/05/links-5-21-2024.html",
          "publishedOn": "2024-05-21T10:55:15.000Z",
          "wordCount": 16570,
          "title": "Links 5/21/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/00-lion.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=271869",
          "author": "Nick Corbishley",
          "description": "“We have found ourselves in a situation where we feel the need to move forward unilaterally because the European response has been so weak.”",
          "link": "https://www.nakedcapitalism.com/2024/05/amid-gaza-genocide-why-is-it-taking-so-long-for-spain-and-other-eu-countries-to-recognise-palestine-as-a-state.html",
          "publishedOn": "2024-05-21T10:45:20.000Z",
          "wordCount": 6842,
          "title": "Why Is It Taking So Painfully Long for Spain, Ireland and Other EU Countries to Recognise Palestinian Statehood?",
          "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Palestine_recognition_only.svg/450px-Palestine_recognition_only.svg.png"
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "66448139abf9e2000aee8587",
          "author": "Wesley Evans",
          "description": "Today we're happy to announce expanded capabilities that will allow you to configure Regional Services for an increased set of defined regions to help you meet your specific requirements for being able to control where your traffic is handled",
          "link": "https://blog.cloudflare.com/expanding-regional-services-configuration-flexibility-for-customers",
          "publishedOn": "2024-05-22T13:00:54.000Z",
          "wordCount": 1912,
          "title": "Expanding Regional Services configuration flexibility for customers",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/05/Expanding-Regional-Services-configuration-flexibility-for-customers-OG-1.png"
        },
        {
          "id": "664cf64607441c000a06e4ed",
          "author": "Kathy Liao",
          "description": "AI Gateway is an AI ops platform that provides speed, reliability, and observability for your AI applications. With a single line of code, you can unlock powerful features including rate limiting, custom caching, real-time logs, and aggregated analytics across multiple providers",
          "link": "https://blog.cloudflare.com/ai-gateway-is-generally-available",
          "publishedOn": "2024-05-22T13:00:17.000Z",
          "wordCount": 1590,
          "title": "AI Gateway is generally available: a unified interface for managing and scaling your generative AI workloads",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/05/AI-Gateway-is-generally-available--a-unified-interface-for-managing-and-scaling-your-generative-AI-workloads-OG-1.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": [
        {
          "id": "https://kubernetes.io/blog/2024/05/20/completing-cloud-provider-migration/",
          "author": null,
          "description": "Since as early as Kubernetes v1.7, the Kubernetes project has pursued the ambitious goal of removing built-in cloud provider integrations (KEP-2395).\nWhile these integrations were instrumental in Kubernetes' early development and growth, their removal was driven by two key factors:\nthe growing complexity of maintaining native support for every cloud provider across millions of lines of Go code, and the desire to establish\nKubernetes as a truly vendor-neutral platform.\nAfter many releases, we're thrilled to announce that all cloud provider integrations have been successfully migrated from the core Kubernetes repository to external plugins.\nIn addition to achieving our initial objectives, we've also significantly streamlined Kubernetes by removing roughly 1.5 million lines of code and reduci…",
          "link": "https://kubernetes.io/blog/2024/05/20/completing-cloud-provider-migration/",
          "publishedOn": "2024-05-20T00:00:00.000Z",
          "wordCount": 4800,
          "title": "Completing the largest migration in Kubernetes history",
          "imageUrl": "/images/docs/components-of-kubernetes.svg"
        }
      ]
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=21235",
          "author": null,
          "description": "In recent years, Meta’s data management systems have evolved into a composable architecture that creates interoperability, promotes reusability, and improves engineering efficiency.  We’re sharing how we’ve achieved this, in part, by leveraging Velox, Meta’s open source execution engine, as well as work ahead as we continue to rethink our data management systems.  Data is at [...]\nRead More...\nThe post Composable data management at Meta appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/05/22/data-infrastructure/composable-data-management-at-meta/",
          "publishedOn": "2024-05-22T17:15:38.000Z",
          "wordCount": 3488,
          "title": "Composable data management at Meta",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/05/Composable-Data-Management-at-Meta-1.png"
        },
        {
          "id": "https://engineering.fb.com/?p=21222",
          "author": null,
          "description": "Today, the internet (like most digital infrastructure in general) relies heavily on the security offered by public-key cryptosystems such as RSA, Diffie-Hellman (DH), and elliptic curve cryptography (ECC). But the advent of quantum computers has raised real questions about the long-term privacy of data exchanged over the internet. In the future, significant advances in quantum [...]\nRead More...\nThe post Post-quantum readiness for TLS at Meta appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/05/22/security/post-quantum-readiness-tls-pqr-meta/",
          "publishedOn": "2024-05-22T16:35:59.000Z",
          "wordCount": 3293,
          "title": "Post-quantum readiness for TLS at Meta",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/05/Eng-Blog-Self-Serve-Hero-Images-PRIVACY-103-Orange.jpg"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=40441616",
          "author": "7thpower",
          "description": "I am a high school dropout and who learned math using Khan Academy after never having completed more than pre-algebra in middle school.\nSal Khan’s work changed my life and allowed me to build a foundation in not only math, but also finance and economics, that allowed me to feel confident enough to go to college. I did not have a support system or people in my life who could teach me these things, but I had the internet and patience, which meant I had opportunities that did not exist even a few years before (this was in 2014).\nNow I work in AI and generally have a life I could not have dreamed of. Every time I go to the grocery store to buy something and don’t have to worry about my card being declined, it feels like magic. Even years later.\nIf I had been in that situation a few years earlier, my life would be very different.\nI’m excited to live in a world where my daughters and countless others will have a tutor that can help them maximize their potential throughout their lives. I’m excited not only for them, but for society. What a time to be alive.",
          "link": "https://news.ycombinator.com/item?id=40441616",
          "publishedOn": "2024-05-22T14:43:34.000Z",
          "wordCount": 2093,
          "title": "New comment by 7thpower in \"Sal Khan is pioneering innovation in education again\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40435890",
          "author": "bragr",
          "description": "This is commercial bribery in most places.\n>California Code, Penal Code - PEN § 641.3\n>(a) Any employee who solicits, accepts, or agrees to accept money or any thing of value from a person other than his or her employer, other than in trust for the employer, corruptly and without the knowledge or consent of the employer, in return for using or agreeing to use his or her position for the benefit of that other person, and any person who offers or gives an employee money or any thing of value under those circumstances, is guilty of commercial bribery.\n>(b) This section does not apply where the amount of money or monetary worth of the thing of value is two hundred fifty dollars ($250) or less.",
          "link": "https://news.ycombinator.com/item?id=40435890",
          "publishedOn": "2024-05-22T00:14:41.000Z",
          "wordCount": null,
          "title": "New comment by bragr in \"Show HN: Pls Fix – Hire big tech employees to appeal account suspensions\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40435022",
          "author": "tgsovlerkhgsel",
          "description": "It is indeed a massive ethics issue, but that's actually the aspect I love the most about it: Due to the ethics/compliance/corruption aspect, it has a chance of drawing immense attention inside the companies, possibly leading to actual durable improvements on the underlying issue.",
          "link": "https://news.ycombinator.com/item?id=40435022",
          "publishedOn": "2024-05-21T22:49:43.000Z",
          "wordCount": null,
          "title": "New comment by tgsovlerkhgsel in \"Show HN: Pls Fix – Hire big tech employees to appeal account suspensions\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40434884",
          "author": "panarky",
          "description": "Altman would have us believe it's all just an innocent misunderstanding but without actually saying so:\n\"We cast the voice actor behind Sky’s voice before any outreach to Ms. Johansson.\"\nIs he trying to suggest the company did not try to make the voice sound like her without her permission?\nThe statement sounds like it's written by a lawyer to be technically true while implying something that is actually false.\nThese are weasel words.\nHe sounds sneaky, evasive and intentionally deceptive.\nWe should not give a sneaky, deceptive and manipulative person this much power over our future.",
          "link": "https://news.ycombinator.com/item?id=40434884",
          "publishedOn": "2024-05-21T22:37:32.000Z",
          "wordCount": 9145,
          "title": "New comment by panarky in \"Sam Altman is showing us who he really is\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40433333",
          "author": "constantcrying",
          "description": "Seems insane. Surely every single company would fire you for doing that. If you put this in its proper term it is \"corruption\" and you should definitely worry about the legal implications of doing this.",
          "link": "https://news.ycombinator.com/item?id=40433333",
          "publishedOn": "2024-05-21T20:17:54.000Z",
          "wordCount": null,
          "title": "New comment by constantcrying in \"Show HN: Pls Fix – Hire big tech employees to appeal account suspensions\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40433060",
          "author": "jpgvm",
          "description": "Gordon was the first investor in my first startup, the first guy that believed in us.\nEven though I only met him later in his life he was still sharp as a tack, never lost the mind of the engineer. Sometimes it's best not to meet your heroes but Gordon lived up to the hype and then some.\nSuper gentle, generous with his time, the consummate gentleman.\nOne of my fondest memories from my startup years was enjoying dinner with Gordon and his wife in Sydney, she made the most amazing cookies. To this day I don't think I have had a better cookie haha.\nVisited the computer history museum with him once for a bit of a VIP tour I guess. So many stories about PDPs and all the friends he made along the way.\nThanks for all the stories and memories old man, you have earned your rest.\nRIP.",
          "link": "https://news.ycombinator.com/item?id=40433060",
          "publishedOn": "2024-05-21T19:54:44.000Z",
          "wordCount": 417,
          "title": "New comment by jpgvm in \"Gordon Bell has died\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40432845",
          "author": "cchance",
          "description": "Seriously confused, the article first screws up royally saying its not opensource, which they correct, but then discuss \"shoved down their throats\" ... a feature that exists but is not enabled by default and doesn't even work if you don't provide a key.\nIt's absolutely rediculous that supporting something, thats opt-in not opt-out is causing a ruckus lol, people really have too much fuckin time on their hands to bitch about things.\nThis is like bitching that Firefox allows us to enable a proxy server, and throwing a fit that a feature exists even as an option to be enabled.",
          "link": "https://news.ycombinator.com/item?id=40432845",
          "publishedOn": "2024-05-21T19:37:41.000Z",
          "wordCount": null,
          "title": "New comment by cchance in \"iTerm2 and AI Hype Overload\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40432486",
          "author": "evmar",
          "description": "> A portion of this code implemented a SMTP client.\nIf I wanted to root cause this, the real problem is right there.  Implementing protocols correctly is hard and bugs like in the post are common.  A properly implemented SMTP client library, like one you would pull off the shelf, would accept text and encode it properly per the SMTP protocol, regardless of where the periods were in the input.  The templating layer shouldn't be worrying about SMTP.",
          "link": "https://news.ycombinator.com/item?id=40432486",
          "publishedOn": "2024-05-21T19:05:32.000Z",
          "wordCount": null,
          "title": "New comment by evmar in \"The curious case of the missing period\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40431738",
          "author": "paol",
          "description": "Ha! I was subscribed to this bug for most of those 25 years. Note that Firefox didn't exist at the time, this was filed against Netscape Navigator.\nDon't remember why I was subscribed to the bug, must have commented on it or something. Got the occasional email notification about it over the years, always got a chuckle out of it. Then a couple of days ago, lo and behold, it was fixed!",
          "link": "https://news.ycombinator.com/item?id=40431738",
          "publishedOn": "2024-05-21T18:07:21.000Z",
          "wordCount": null,
          "title": "New comment by paol in \"Firefox bug gets fixed after 25 years\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40431495",
          "author": "jsheard",
          "description": "Your loss, I will keep expanding my brain with the wisdom of Googles powerful AI\nhttps://imgur.com/a/g4qOU9a",
          "link": "https://news.ycombinator.com/item?id=40431495",
          "publishedOn": "2024-05-21T17:46:34.000Z",
          "wordCount": null,
          "title": "New comment by jsheard in \"How to Turn Off AI Overview in Google and Set \"Web\" as Default\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40430177",
          "author": "pants2",
          "description": "This explains exactly why physical restaurant menus are so much better vs mobile site menus. If I'm viewing the menu of a restaurant on my phone, I always look in Google Maps for someone who took a picture of the menu, because it's a dense UI. Every \"mobile friendly\" menu site is able to show maybe 5 items on the page at once, so it takes many pages of scrolling to see everything.",
          "link": "https://news.ycombinator.com/item?id=40430177",
          "publishedOn": "2024-05-21T15:59:35.000Z",
          "wordCount": null,
          "title": "New comment by pants2 in \"What UI density means and how to design for it\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40425855",
          "author": "SilverBirch",
          "description": "It really is incredible how something as small and simple as this gives such incredible bad vibes. This is like early 2010s facebook vibes. It's just... if they're going to steal her voice, what would they do to yours?\nBut it also points to a wider problem in OpenAI's existence. They're built on theft. If you wrote something on the internet in the last 20 years, they've stolen it. They've stolen it, they're put it into their little magic box and now they want to sell it back to you. OpenAI is amazing technology, and once the equity of the company is redistributed back to the content owners who actually provided the value, it'll be great to see what they can do from there.",
          "link": "https://news.ycombinator.com/item?id=40425855",
          "publishedOn": "2024-05-21T09:05:57.000Z",
          "wordCount": null,
          "title": "New comment by SilverBirch in \"The OpenAI board was right\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40424722",
          "author": "trustno2",
          "description": "Altman wants to be a part of AI regulation in the same way Bankman Fried wanted to be a part of cryptocurrency regulation.",
          "link": "https://news.ycombinator.com/item?id=40424722",
          "publishedOn": "2024-05-21T06:10:20.000Z",
          "wordCount": null,
          "title": "New comment by trustno2 in \"Statement from Scarlett Johansson on the OpenAI \"Sky\" voice\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40423772",
          "author": "ocodo",
          "description": "Altman has proven time and again that he is little more than a huckster wrt technology, and in business he is a stone cold shark.\nConman plain and simple.",
          "link": "https://news.ycombinator.com/item?id=40423772",
          "publishedOn": "2024-05-21T03:28:44.000Z",
          "wordCount": null,
          "title": "New comment by ocodo in \"Statement from Scarlett Johansson on the OpenAI \"Sky\" voice\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40423483",
          "author": "windexh8er",
          "description": "The thing about the situation is that Altman is willing to lie and steal a celebrity's voice for use in ChatGPT.  What he did, the timeline, everything - is sleazy if, in fact, that's the story.\nThe really concerning part here is that Altman is, and wants to be, a large part of AI regulation [0].  Quite the public contradiction.\n[0] https://www.businessinsider.com/sam-altman-openai-artificial...",
          "link": "https://news.ycombinator.com/item?id=40423483",
          "publishedOn": "2024-05-21T02:43:47.000Z",
          "wordCount": null,
          "title": "New comment by windexh8er in \"Statement from Scarlett Johansson on the OpenAI \"Sky\" voice\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40421850",
          "author": "npunt",
          "description": "When people cheat on (relatively) small things, it's usually an indication they'll cheat on big things too",
          "link": "https://news.ycombinator.com/item?id=40421850",
          "publishedOn": "2024-05-20T23:23:15.000Z",
          "wordCount": 795,
          "title": "New comment by npunt in \"Statement from Scarlett Johansson on the OpenAI \"Sky\" voice\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40421712",
          "author": "nickthegreek",
          "description": "This statement from scarlet really changed my perspective. I use and loved the Sky voice and I did feel it sounded a little like her, but moreover it was the best of their voice offerings. I was mad when they removed it. But now I’m mad it was ever there to begin with. This timeline makes it clear that this wasn’t a coincidence and maybe not even a hiring of an impressionist (which is where things get a little more wishy washy for me).",
          "link": "https://news.ycombinator.com/item?id=40421712",
          "publishedOn": "2024-05-20T23:10:38.000Z",
          "wordCount": 19879,
          "title": "New comment by nickthegreek in \"Statement from Scarlett Johansson on the OpenAI \"Sky\" voice\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40421564",
          "author": "anon373839",
          "description": "Well, that statement lays out a damning timeline:\n- OpenAI approached Scarlett last fall, and she refused.\n- Two days before the GPT-4o launch, they contacted her agent and asked that she reconsider. (Two days! This means they already had everything they needed to ship  the product with Scarlett’s  cloned voice.)\n- Not receiving a response, OpenAI demos the product anyway, with Sam tweeting “her” in reference to Scarlett’s film.\n- When Scarlett’s counsel asked for an explanation of how the “Sky” voice was created, OpenAI yanked the voice from their product line.\nPerhaps Sam’s next tweet should read “red-handed”.",
          "link": "https://news.ycombinator.com/item?id=40421564",
          "publishedOn": "2024-05-20T22:58:41.000Z",
          "wordCount": null,
          "title": "New comment by anon373839 in \"Statement from Scarlett Johansson on the OpenAI \"Sky\" voice\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40421489",
          "author": "steveBK123",
          "description": "She choose to forego being a billion lonely guys AI girlfriend\nNot a bad call for someone already rich",
          "link": "https://news.ycombinator.com/item?id=40421489",
          "publishedOn": "2024-05-20T22:52:04.000Z",
          "wordCount": null,
          "title": "New comment by steveBK123 in \"Statement from Scarlett Johansson on the OpenAI \"Sky\" voice\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40421334",
          "author": "aaronharnly",
          "description": "Well, this confirms that OpenAI have been shooting from the hip, not that we needed much confirmation. The fact that they repeatedly tried to hire Johansson, then went ahead and made a soundalike while explicitly describing that they were trying to make it be like her voice in the movie … is pretty bad for them.",
          "link": "https://news.ycombinator.com/item?id=40421334",
          "publishedOn": "2024-05-20T22:38:40.000Z",
          "wordCount": null,
          "title": "New comment by aaronharnly in \"Statement from Scarlett Johansson on the OpenAI \"Sky\" voice\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40421293",
          "author": "alsodumb",
          "description": "Why do I feel like Sam's 'her' tweet pretty much gave Scarlett Johansson's legal counsel all the ammo they needed lol.",
          "link": "https://news.ycombinator.com/item?id=40421293",
          "publishedOn": "2024-05-20T22:35:34.000Z",
          "wordCount": null,
          "title": "New comment by alsodumb in \"Statement from Scarlett Johansson on the OpenAI \"Sky\" voice\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40421113",
          "author": "dist1ll",
          "description": "I would say the compiler explorer[0] fits the definition perfectly. It may seem like a straightforward piece of software, but it has immensely changed the way people discuss and share knowledge around compilers and performance optimization.\nI regularly feel the impact on the quality of forum discussions. There's a lot less speculation about if \"call X gets inlined\", or \"Y gets vectorized\". Bold claims can be supported or disproven quickly by sharing a link. And then you have tools like llvm-mca[1] or uiCA[2], if you don't mind going into the weeds.\n[0] https://godbolt.org/\n[1] https://llvm.org/docs/CommandGuide/llvm-mca.html\n[2] https://uica.uops.info/",
          "link": "https://news.ycombinator.com/item?id=40421113",
          "publishedOn": "2024-05-20T22:16:34.000Z",
          "wordCount": null,
          "title": "New comment by dist1ll in \"Enlightenmentware\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40420123",
          "author": "orph",
          "description": "It made sense when I named GitHub Copilot, since that product was a passive addition to your regular workflow.\nThe name was sticky enough that they've run with it, misunderstanding or ignoring that fundamental metaphor.",
          "link": "https://news.ycombinator.com/item?id=40420123",
          "publishedOn": "2024-05-20T20:44:51.000Z",
          "wordCount": 189,
          "title": "New comment by orph in \"Introducing Copilot+ PCs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40420077",
          "author": "bambax",
          "description": "> We set out to solve one of the most frustrating problems we encounter daily – finding something we know we have seen before on our PC. Today, we must remember what file folder it was stored in, what website it was on, or scroll through hundreds of emails trying to find it.\nIt is indeed frustrating that one still cannot search effectively a local device, but it doesn't need AI to solve. It needs a proper search engine, and Microsoft has resisted that, for some mysterious reason, for 30+ years.",
          "link": "https://news.ycombinator.com/item?id=40420077",
          "publishedOn": "2024-05-20T20:40:41.000Z",
          "wordCount": 1735,
          "title": "New comment by bambax in \"Introducing Copilot+ PCs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40419292",
          "author": "EvanAnderson",
          "description": "> Their \"copilot\" brand is so weird and... muddled.\nMicrosoft can't brand anything cleanly and unambiguously.\n\"MSN Messenger\" / \"Windows Messenger\" / \"Windows Live Messenger\" / \"Microsoft Lync\"\n\"Internet Explorer\" / \"Windows Explorer\" / \"MSN Explorer\"\nWindows 95 email client \"Exchange\" / email server platform \"Exchange\"\n\"Outlook\" / \"Outlook Web Access\" / \"Outlook Web App\" / \"Outlook.com\" / \"new Outlook for Windows\"\n\"Microsoft Teams\" / \"New Microsoft Teams\"\n\"Office Communicator\" / \"Microsoft Lync\" / \"Skype for Business\" / \"Skype\" / \"Skype for Business Online\" / \"Skype for Business for Microsoft 365\"\nThe most guffaw-inducing branding, to me, was the recently-announced remote desktop client called \"Windows App\". That's going to be an easy one for users to search for.\n(For guffaw-inducing I suppose there's also the Windows 98-era \"Critical Update Notification Tool\"[0])\n[0] https://en.wikipedia.org/wiki/Windows_Update#Critical_Update...\n(Edit: Yikes. I didn't even consider .NET. Windows.NET server. .NET Framework. ASP.NET. .NET Core. Ugh...)\nMore editing because I can't stop myself:\n\"Great Plains\" / \"Navision\" / \"Solomon\" / \"Axapta\" / \"Dynamics AX\" / \"Dynamics GP\" / \"Dynamics SL\" / \"Dynamics NAV\" / \"Dynamics 365\" / \"Dynamics 365 for Finance and Operations\" / \"Dynamics 365 Business Central\"\nMore editing because I was egged-on... >smile",
          "link": "https://news.ycombinator.com/item?id=40419292",
          "publishedOn": "2024-05-20T19:34:13.000Z",
          "wordCount": 1987,
          "title": "New comment by EvanAnderson in \"Introducing Copilot+ PCs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40418956",
          "author": "dang",
          "description": "All: if you're going to comment in this thread, please review the site guidelines (https://news.ycombinator.com/newsguidelines.html). Make sure that your comment is following them, and that you are posting in the intended spirit: intellectually curious, respectful conversation.\n\"Respectful\" here means respectful to the people who are wrong (in your view) and most respectful to the people who are most wrong (in your view). If you can't do that, that's ok, but please don't post until you can. Comments should get more thoughtful and substantive, not less, as a topic gets more divisive - https://news.ycombinator.com/newsguidelines.html.\nHellish flamewars in deep subthreads are not ok. I'm going to lower the bar for banning accounts that do this, so please don't do this. If you're hotly indignant, step away from the keyboard until that changes. Nobody 'wins' on the internet anyway, and it's not worth destroying this community for. Not to mention your heart.",
          "link": "https://news.ycombinator.com/item?id=40418956",
          "publishedOn": "2024-05-20T19:05:51.000Z",
          "wordCount": null,
          "title": "New comment by dang in \"ICC prosecutor seeks arrest warrants against Sinwar and Netanyahu for war crimes\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40418816",
          "author": "isoprophlex",
          "description": "Their \"copilot\" brand is so weird and... muddled.\nThere's the AI code assistant thing that github actually started, there's the horrible chatbot maker GUI demoware, there's AI stuff you might be able to do with your sharepoint (if only you could get hold of the right ms sales rep to take your money), there's an app that does genai things on your personal MS account... And now there's a Surface rebrand?\nThat org chart meme about Microsoft being little fiefdoms pointing guns at eachother never stops being relevant.\n[1] https://www.microsoft.com/en-us/microsoft-copilot/microsoft-...\n[2] https://www.microsoft.com/en-us/microsoft-365/blog/2023/05/0...\n[3] https://copilot.microsoft.com/\nAnd [4] the meme itself, as you really can't convince me the above is the result of a coherent company-wide strategy https://i.insider.com/51dfec8469bedd5e19000017",
          "link": "https://news.ycombinator.com/item?id=40418816",
          "publishedOn": "2024-05-20T18:55:26.000Z",
          "wordCount": null,
          "title": "New comment by isoprophlex in \"Introducing Copilot+ PCs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40418192",
          "author": "delusional",
          "description": "The AI is the least interesting part of this announcement. Microsoft is giving ARM another try with a special branding that's supposed to guarantee some level of performance and quality. That's possibly huge news.",
          "link": "https://news.ycombinator.com/item?id=40418192",
          "publishedOn": "2024-05-20T18:03:04.000Z",
          "wordCount": null,
          "title": "New comment by delusional in \"Introducing Copilot+ PCs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40410017",
          "author": "miki123211",
          "description": "If you like this, it's also worth looking at llama2.c[1], an implementation of the Llama 2 architecture in about 1000 lines of plain, dependency-free C, tokenizer and all. THe fact that this 960-line file and a somewhat modern C compiler is all you really need to run a state-of-the-art language model is really surprising to many.\nOf course, this is not all there is to a modern LLM, it would probably take another thousand lines or two to implement training, and many more than that to make it fast on all the major CPU and GPU architectures. If you want a flexible framework that lets a developer define any model you want and still goes as fast as it can, the complexity spirals.\nMost programmers have an intuition that duplicating a large software project from scratch, like Linux or Chromium for example, would require incredible amounts of expertise, manpower and time. It's not something that a small team can achieve in a few months. You're limited by talent, not hardware.\nLLMs are very different. THe code isn't that complicated, you could probably implement training and inference for a single model architecture, from scratch, on a single kind of GPU, with reasonable performance, as an individual with a background in programming and who still remembers their calculus and linear algebra, with a year or so of self study. What makes LLMs difficult is getting access to all the hardware to train them, getting the data, and being able to preprocess that data.",
          "link": "https://news.ycombinator.com/item?id=40410017",
          "publishedOn": "2024-05-19T21:51:30.000Z",
          "wordCount": null,
          "title": "New comment by miki123211 in \"Llama3 implemented from scratch\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40409320",
          "author": "xivzgrev",
          "description": "Disclaimer: I used to work at a live video streaming company as a financial analyst so quite familiar with this\nThe biggest cost is as you imagine the streaming - getting the video to the viewer.  It was a large part of our variable cost and we had a (literal) mad genius dev ops person holed up in his own office cave that managed the whole operation.\nIve long forgotten the special optimizations he did but he would keep finding ways to improve margin / efficiency.\nEncoding is a cost but I don’t recall it being significant\nStorage isnt generally expensive. Think about how cheap you as a consumer can go get 2 TB of storage, and extrapolate.\nThe other big expense - people!  All those engineers to build back and front end systems. That’s what ruined us - too many people were needed and not enough money coming in so we were burning cash.",
          "link": "https://news.ycombinator.com/item?id=40409320",
          "publishedOn": "2024-05-19T19:50:40.000Z",
          "wordCount": null,
          "title": "New comment by xivzgrev in \"Ask HN: Video streaming is expensive yet YouTube \"seems\" to do it for free. How?\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=52714",
          "author": "Ingrid Robeyns",
          "description": "I believe that no-one deserves to be a billionaire. In the public realm, defenders of wealth concentration often come up with an example of a person who has created all their wealth themselves – the selfmade billionaire. They didn’t get their money from inheritance or some other form of luck, but from entrepreneurial instincts and […]",
          "link": "https://crookedtimber.org/2024/05/22/a-genuine-selfmade-billionaire/",
          "publishedOn": "2024-05-22T08:10:52.000Z",
          "wordCount": 4530,
          "title": "A genuine selfmade billionaire",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52709",
          "author": "Chris Bertram",
          "description": "Visit the post for more.",
          "link": "https://crookedtimber.org/2024/05/19/sunday-photoblogging-pezenas-5/",
          "publishedOn": "2024-05-19T07:23:30.000Z",
          "wordCount": 1764,
          "title": "Sunday photoblogging: Pézenas",
          "imageUrl": "https://live.staticflickr.com/65535/53718888843_95f592d913.jpg"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/James-Wolfensohn-switches-on-the-charm-1995-2005",
          "author": "Eric Toussaint",
          "description": "In July 2024, the World Bank and the IMF will be 80 years old. 80 years of financial neo-colonialism and the imposition of austerity policies in the name of debt repayment. 80 years is enough! The Bretton Woods institutions must be abolished and replaced by democratic institutions serving an ecological, feminist and anti-racist bifurcation. To mark these 80 years, we are republishing a series of articles every Wednesday until July, looking in detail at the history and damage caused by these (...)\nEnglish\n\n/ \nIMF, \nWorld Bank, \nFinance against people, \n80 ans BM FMI EN",
          "link": "https://www.cadtm.org/James-Wolfensohn-switches-on-the-charm-1995-2005",
          "publishedOn": "2024-05-22T07:00:00.000Z",
          "wordCount": 6128,
          "title": "James Wolfensohn switches on the charm (1995-2005)",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L153xH80/7d67b536955c2d468284cb35bf57de-31f2b.png"
        },
        {
          "id": "https://www.cadtm.org/When-Mr-Mitsotakis-criminalizes-threatens-and-represses-students-who-defend",
          "author": "Yorgos Mitralias",
          "description": "“If some people think they can repeat what they've seen in other countries and occupy universities, pitch tents and make a mess, they're deeply mistaken”. This - so eminently delicate - statement by the Greek Prime Minister, which followed the brutal “evacuation” of the law faculty on Tuesday May 14 (28 arrests), can only surprise the uninformed: the Greek state and its governments have always had a soft spot for anything to do with apartheid and apartheid regimes! Today Israel, formerly South (...)\nEnglish\n\n/ \nGreece, \nPalestine, \nNorth",
          "link": "https://www.cadtm.org/When-Mr-Mitsotakis-criminalizes-threatens-and-represses-students-who-defend",
          "publishedOn": "2024-05-21T09:25:18.000Z",
          "wordCount": 1623,
          "title": "When Mr. Mitsotakis criminalizes, threatens and represses students who defend international legality!",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/9b079b626e24c10e45e9e1c0a22ccb-044e8.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=7631",
          "author": "J",
          "description": "Two and bit years ago, I spotted an entry on Fandom about a “remake” of the Stanley Kubrick sci-fi classic, 2001: A Space Odyssey. Being a 2001 fan, I naturally wrote about it. I’ve had a lot of fun with the post ever since. People stumble upon it every now and again, and link to […]",
          "link": "https://disassociated.com/2001-a-space-odyssey-remake-joke-post-trained-google-ai/",
          "publishedOn": "2024-05-21T21:00:21.000Z",
          "wordCount": 422,
          "title": "My 2001: A Space Odyssey remake joke post trained Google AI?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7637",
          "author": "J",
          "description": "She is the Earth, a work of verse, written by Yankunytjatjara (South Australia) poet Ali Cobby Eckermann, was named the NSW Premiers Literary Awards book of the year, on Monday 20 May 2024. Award judges were unstinting in their praise of Eckermann’s writing: She is the Earth is a stunning verse novel that takes the […]",
          "link": "https://disassociated.com/she-is-the-earth-wins-nsw-premiers-literary-awards-book-year-2024/",
          "publishedOn": "2024-05-21T20:30:32.000Z",
          "wordCount": 228,
          "title": "She is the Earth wins NSW Premiers Literary Awards book of year 2024",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7641",
          "author": "J",
          "description": "Sydney based product designer Wing Pang, whom I wrote about last week, has published a comprehensive guide to the IndieWeb. Coming from a design background, joining the IndieWeb was an incredibly exciting and rewarding, yet maze-like journey. To be honest, almost every step of the way was like a leap! But I’ve learnt so much […]",
          "link": "https://disassociated.com/indie-guide-indieweb-wing-pang/",
          "publishedOn": "2024-05-21T20:00:07.000Z",
          "wordCount": 180,
          "title": "An indie guide to the IndieWeb, by Wing Pang",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7643",
          "author": "J",
          "description": "Blog of the .Day, yes, styled as Blog of the .Day, a collaboration between James of James’ Coffee Blog, and Joe Crawford, will highlight a new blog every day. Aside from casting the spotlight daily on a blog, another goal of the project is to bring the term blogosphere back into popular usage. For those […]",
          "link": "https://disassociated.com/blog-of-the-day-bringing-back-blogosphere-one-blog-time/",
          "publishedOn": "2024-05-21T19:30:32.000Z",
          "wordCount": 193,
          "title": "Blog of the .Day, bringing back the blogosphere one blog at a time",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7628",
          "author": "J",
          "description": "As with many things we consume, the science on coffee can be conflicted. One decade caffeine consumption is a no-no, the next it seems coffee is quite beneficial. Regular readers will know I’m a coffee drinker, but in — what I consider to be — moderation: two (large serve) cups per day. But some people […]",
          "link": "https://disassociated.com/health-benefits-giving-up-drinking-coffee/",
          "publishedOn": "2024-05-20T21:00:32.000Z",
          "wordCount": 287,
          "title": "The health benefits of giving up drinking coffee",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7624",
          "author": "J",
          "description": "Every week, Australian radio station Triple J, invites a band or musician to record a cover of a song, for their Like A Version show. Anything goes here. About two years ago, Sydney based Australian DJ Dave Winnel performed a cover of Africa, by Toto, not the sort of music you’d usually hear on the […]",
          "link": "https://disassociated.com/what-happened-cover-versions-popular-songs/",
          "publishedOn": "2024-05-19T21:00:17.000Z",
          "wordCount": 331,
          "title": "What has happened to cover versions of popular songs?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7606",
          "author": "J",
          "description": "Chris, writing at uncountable thoughts: RSS is a pervasive, but little known, web technology that allows you aggregate all your content into one place for easy reading. There are very few websites without an RSS feed, although many don’t advertise the link (or, even realise they have it). When you put an RSS feed link […]",
          "link": "https://disassociated.com/rss-really-simple-why-complicated/",
          "publishedOn": "2024-05-16T21:00:08.000Z",
          "wordCount": 789,
          "title": "RSS is really simple, why do so many find it complicated?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": []
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/a-reprieve-for-assange",
          "author": null,
          "description": "Journalism as ‘espionage’.",
          "link": "https://newleftreview.org/sidecar/posts/a-reprieve-for-assange",
          "publishedOn": "2024-05-20T17:06:21.000Z",
          "wordCount": 1019,
          "title": "Tariq Ali: &ldquo;A Reprieve for Assange&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/05/assange.jpeg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/battle-machine",
          "author": null,
          "description": "Retrospectives on Podemos.",
          "link": "https://newleftreview.org/sidecar/posts/battle-machine",
          "publishedOn": "2024-05-20T11:51:49.000Z",
          "wordCount": 4347,
          "title": "Rachel Godfrey Wood: &ldquo;Battle Machine&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/05/0x0-ezgif.com-webp-to-jpg-converter.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/crosshairs",
          "author": null,
          "description": "The shooting of Robert Fico.",
          "link": "https://newleftreview.org/sidecar/posts/crosshairs",
          "publishedOn": "2024-05-16T22:52:12.000Z",
          "wordCount": 1227,
          "title": "Lily Lynch: &ldquo;Crosshairs&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/05/GettyImages-1700884950-scaled-ezgif.com-webp-to-jpg-converter.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/a-bronx-tale",
          "author": null,
          "description": "Cooperativism in New York.",
          "link": "https://newleftreview.org/sidecar/posts/a-bronx-tale",
          "publishedOn": "2024-05-16T10:47:57.000Z",
          "wordCount": 3448,
          "title": "Michael Casper: &ldquo;A Bronx Tale&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/05/0631-ezgif.com-webp-to-jpg-converter.jpg"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://pesto.bearblog.dev/apartment-hunting-and-finding-meaning-in-living-alone/",
          "author": null,
          "description": "In the fall, I'll be moving to a new city to pursue graduate studies. I thought it'd be a good idea to move in a few months early to get a feel for the area - and also avoid fighting over good areas around campus, especially if I wait too long.\nNext week I'm flying out to visit some apartments. It dawned upon me that this would be the first time where I live truly alone - no housemates, roommates, parents, pets - it'll be just me, in a new city. I'm excited of course, but also quite scared. The thought of being free and landing into a new city is something amazing, but for the first time, I'm really on my own.\nI moved back with my parents to save on rent a year ago. And while I do appreciate them for their generosity, I think it's time for me to leave; I've been paying rent with my mental health, something a lot of Asian kids can relate to. I also feel restricted when I came back to the city where I attended high school. It was like I'm in purgatory: suffering for some time before entering heaven (a place of my own).\nIt's a big step, despite something I'm excited for. Yet very scary. But if I'm scared to do it, it's exactly because I'm scared that I should do it.\nI think I'm ready now. Ready to take that big leap, into a new home, nearly a thousand miles away from where I grew up.\nThe (paper) journal I've kept since 2020 is reaching the last few pages, appropriately. It's as if it knew that my journey here was coming to an end, and a new one will begin soon.\nI'll be buying a new notebook once in Seattle. Only appropriate when closing a chapter, no?",
          "link": "https://pesto.bearblog.dev/apartment-hunting-and-finding-meaning-in-living-alone/",
          "publishedOn": "2024-05-22T05:38:01.193Z",
          "wordCount": 548,
          "title": "apartment hunting, and finding meaning in living alone",
          "imageUrl": null
        },
        {
          "id": "https://blog.memothon.com/why-do-i-have-to-write-my-own-anki-cards/",
          "author": null,
          "description": "You really shouldn't have to write your own Anki cards today.\nThere's a really common sentiment that using pre-made or llm generated decks can't replace creating your own.\nThis is probably true. Writing your own flashcards forces you into a state where you have to actually think and organize the concepts together in your head into things that are digestible.\nOften the flashcards that people create are not conducive to review. It's hard to create cards that aren't easy to remember the \"shape\" of later on instead of actually remembering the content. And drilling one small piece of the puzzle doesn't fill in the rest of the pie.\nLLMs are sophisticated enough now to generate variations on flashcards on-demand. But nobody has wired up LLMs natively with spaced repetition for learning. It seems like everyone has stopped at \"generate 100 flashcards for me based on this pdf,\" which does result in flashcards that aren't going to help you remember things.",
          "link": "https://blog.memothon.com/why-do-i-have-to-write-my-own-anki-cards/",
          "publishedOn": "2024-05-22T01:14:11.309Z",
          "wordCount": 606,
          "title": "Why do I have to write my own Anki cards?",
          "imageUrl": null
        },
        {
          "id": "https://tiramisu.bearblog.dev/2024-tokyo-0/",
          "author": null,
          "description": "I'm feeling lazy, so the travel recaps I'm going to do for this trip are going to be less thorough than my usual fare, more like annotated photo dumps than anything. I hope they're still fun to scroll through and read!\nWe flew ANA from LAX to Tokyo and United Airlines on the way back. The ANA meals were more Japanese and tasted better than the UA ones.\nI noticed the Rolls Royce logo on the turbines on of our plane. Maybe they manufacture them?\n\n\n\n\nMy first photograph in Japan! No surprise that it's of public transit. I love how accessible and easy to use the metro system is. The subway cars are unbelievably clean and well-designed.\n\nGinza\nI spent my first day in Ginza, near where I stayed. Ginza is cleaner, glitzier Fifth Ave: lots of luxury stores and boutiques, not a lot in the way of (r…",
          "link": "https://tiramisu.bearblog.dev/2024-tokyo-0/",
          "publishedOn": "2024-05-21T16:16:47.885Z",
          "wordCount": 1227,
          "title": "tokyo, day 0-1: ginza, tsukiji, ueno",
          "imageUrl": null
        },
        {
          "id": "https://that-bloke.com/mouth-dildos/",
          "author": null,
          "description": "People that use mouth dildos annoy the shit out of me. Either commit and smoke a cigarette, or give it up.\nI hate smoking. I think it's fucking disgusting and I don't understand why anyone would want to do it. I especially hate it when there's a gaggle of smokers huddled around the front door of a pub, tooting away on their fags. It's vile and I don't want my pink fluffy lungs affected by that shit.\nBut do you know what I hate more than smoking?\nMouth dildos.\nWhat the fuck is a mouth dildo?\n-- Everyone\nThis is a mouth dildo:\n\nNot only do you look ridiculous putting that stupid fucking contraption in your mouth, but the plumes of flavoured vapour that bellow from these things make you look even more like an utter cunt.\nI don't want to be subjected to the cherry ice cream vapour pouring from your mouth dildos, seemingly by the bucket load. At least smokers are committing, knowing they're gonna kill themselves, have decided to enjoy it while they're here.\nBut you mouth dildo fuckers are the worst. We don't want to smell your stupid fucking vape. So put it away because you look (and smell) like a dick head.\nPeace ✌🏻\nReply by email",
          "link": "https://that-bloke.com/mouth-dildos/",
          "publishedOn": "2024-05-21T12:41:59.234Z",
          "wordCount": 885,
          "title": "Mouth Dildos",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/thatbloke-1713812790-0.webp"
        },
        {
          "id": "https://mgx.me/ranking-of-kings/",
          "author": null,
          "description": "Besides the Godzilla trilogy, I haven't watched any full anime series for the past few years. Thanks to the YouTube algorithm, I discovered a gem of a series called Ranking of Kings. I was drawn in by the beautiful animation style and the intriguing premise of a deaf-mute boy named Bojji aiming to become king. On a whim, I started the first episode. Right from the opening scenes, I got engrossed in this fantastical yet grounded world. Bojji's kind spirit shone through despite his adversity. By the end of the episode, I was already invested in his journey. I'm now 11 episodes into the first season and loving every minute. His bond with Kage also struck a chord. All the other characters are so compelling, too, even the ones I initially disliked. The animation by studio WIT is also a visual treat.",
          "link": "https://mgx.me/ranking-of-kings/",
          "publishedOn": "2024-05-21T05:32:31.371Z",
          "wordCount": 1199,
          "title": "Ranking of Kings ∞",
          "imageUrl": "https://static.mgx.me/images/2024/bojji-kage.jpg"
        },
        {
          "id": "https://quincyzikmund.com/why-im-blogging-again/",
          "author": null,
          "description": "Back in the glory days of the internet, when social media was just becoming mainstream, I used to blog regularly. I would write and publish a post anywhere from 1 - 3 times a week.\nI didn't monetize my blog and I had no dreams of my personal site becoming a business. It was simply a place for me to share things that were on my mind and lessons learned from books I was reading.\nFast forward many years and what we have is the current state of the internet.\nEverything is an ad. Everyone is an influencer. And the algorithms determine what we see and dictate what we post. And for some reason they insist on the entire population becoming video producers.\nIt's an endless game that I lost my taste for long ago.\nThat's why I'm attempting to blog again. I need somewhere to get my thoughts and opinions out without distraction and without too much tech.\nIf the internet stresses you out as much as it does me, might I suggest starting your own blog?\nOr heck, maybe just quit the social internet altogether.",
          "link": "https://quincyzikmund.com/why-im-blogging-again/",
          "publishedOn": "2024-05-20T17:55:38.443Z",
          "wordCount": 620,
          "title": "Why I'm blogging again",
          "imageUrl": null
        },
        {
          "id": "https://paulogpd.bearblog.dev/o-povo-pelo-povo-e-o-rs-acaba-em-menos-de-seis-meses/",
          "author": null,
          "description": "A direita, os anarcocapitalistas (embora este termo seja discutível) e a extrema-direita brasileira, diante do crime ambiental praticado no Rio Grande do Sul, conseguiram emplacar uma bela história: o povo pelo povo.\nÉ muito importante salientar como o povo brasileiro se uniu para ajudar o povo do Rio Grande do Sul. É reconfortante observar que o próprio povo, especialmente os mais pobres, uniu-se no próprio RS para ajudar os outros. Voluntários que não têm muito em casa saem às 5h para atender 12h em um abrigo onde as pessoas perderam tudo. Isso é significativo, especialmente após o período de 2018 a 2023, em que o Brasil parecia uma poça de sangue (e ainda parece, em certa medida), pois mostra que o povo ainda é solidário, mesmo que precise de uma tragédia para uni-los.\nO problema é que …",
          "link": "https://paulogpd.bearblog.dev/o-povo-pelo-povo-e-o-rs-acaba-em-menos-de-seis-meses/",
          "publishedOn": "2024-05-20T13:31:41.361Z",
          "wordCount": 1557,
          "title": "O povo pelo povo e o RS acaba em menos de seis meses",
          "imageUrl": null
        },
        {
          "id": "https://meineeds.rest/hello-world-i-guess/",
          "author": null,
          "description": "Okay... exhales\nHere we go.\nHi, I'm Meï ! And welcome to this blog. Or this attempt at a blog.\nIt's been a few weeks since I felt a lot of nostalgia for the Internet of old, the one I discovered as a lil' kid, on my tenth birthday, circa 2007.\nA friend, Seeker, began working on his own blog a few months back. I really liked his articles about DIY and Game Dev, and on a whim asked him his tech stack with the intent of setting something up for myself.\nI used to write quite a bit a few years ago. Especially when I got to the big city after high school. Welcome to Fucktopia1 was a small series detailing my new life far from the countryside.\nAs of late, I've been trying to get back into writing. Essays to recommend some games, some small fictions, and lore for TTRPGs, I've been slowly but surely getting back into it. But I didn't really manage to find a public, even for the essays in places (well, Discord servers in this case) dedicated to the exact IP I was trying to promote.\nThis built up as a bit of frustration, and is another of the reasons I felt like doing a blog. I wanted to be more open to the world, able to write in a place anyone could read if they stumble on the place.\nSo once again, here we go!\n1. As a note, the \"Fucktopia\" is a reference to Souillon's comic book \"Hello Fucktopia\". Couldn't find a listing in English, sorry! It's available in French & Spanish, at least..\nMy small rules of writing\nTry to write regularly. Not necessarily everyday, but I should strive for a post per week at least.\nFocus! I'm super prone to tangents and often stray off-topic. A post should be on a single subject, unless this is a post consciously made for tangents and chaos.\nNo stressing over this. I already stress over too much, let's keep this place as my comfy Internet place.\nLet's hope it goes well. And I hope you'll enjoy this blog and its topics.\nFan-art of Cyberpunk Bartender Action: VA-11 HALL-A, by rnna_7",
          "link": "https://meineeds.rest/hello-world-i-guess/",
          "publishedOn": "2024-05-19T16:28:15.910Z",
          "wordCount": 1828,
          "title": "Hello World, I guess?",
          "imageUrl": null
        },
        {
          "id": "https://kartikay.bearblog.dev/smart-generalist/",
          "author": null,
          "description": "A bear in a circus is interesting. So is a juggler and a man on the unicycle. A bear on a unicycle juggling swords on the other hand is something extremely unique. Something you would pay good money to see. A smart generalist is kinda like that.\nA smart generalist is a person who is 80/20 across multiple fields. This means they have reached 80 Percent understanding/capability across multiple fields leveraging around 20 percent of the effort that would typically be needed to fully master it. It makes them unique.\nThe primary skill of a smart generalist is the ability to get from 0 to 80 in a new field quickly. They can quickly identify high ROI leverage points of a subject. It is a learned skill. They also have strong convictions that anything can be learned and learned fast. Even things considered 'tough' by society.\nOn the other hand, we have the cracked specialists. People really good at one thing. Getting to the frontiers and advancing human knowledge. Creating absolutely beautiful works in that 'one thing'.\nIt is a sliding scale. We all lie somewhere between a specialist and a generalist. But we could all do some good to realise we are not limited. We can do multiple things if we want to. It is easy to be hemmed in. To define your identity as 'Software Engineer' or 'Writer' or 'XYZ'. That is what school teaches -'Specialisation'. But humans are versatile. We are the OG general intelligence. Capable of adapting and doing multiple things.\nDon't forget the 'General' in General Intelligence.",
          "link": "https://kartikay.bearblog.dev/smart-generalist/",
          "publishedOn": "2024-05-19T00:00:00.000Z",
          "wordCount": 702,
          "title": "Smart Generalist",
          "imageUrl": null
        },
        {
          "id": "https://lvrz.org/to-my-sunflower-i/",
          "author": null,
          "description": "A little bird came to see me,\nWhat’s you name? - I asked.\nAnd he chirped the following words:\nLeave a comment or Stay in touch",
          "link": "https://lvrz.org/to-my-sunflower-i/",
          "publishedOn": "2024-05-17T20:26:07.405Z",
          "wordCount": 590,
          "title": "To my Sunflower",
          "imageUrl": null
        },
        {
          "id": "https://savetooru.bearblog.dev/dont-skip-the-openings/",
          "author": null,
          "description": "the absolute worst thing someone can tell me about their anime viewing preferences has nothing to do with the kind of show they watch but how they watch it.\nimage from director nakayama ryū's chainsaw man (2022).\nskipping openings just because you're on a binge can so easily rob you of what i'd argue are the best narrative and collective highs a series can offer.1\nfrom a purely functional standpoint, they give us time to breathe and process what exactly we're watching. take, for example, the three versions of shippuden's penultimate opening— blood circulator. each variant denotes which point of the story you're at, and primes you for what's to come. (if you pay attention, you'll notice they lead into each other seamlessly! so neat.)\nsometimes it's instinctual and more about building antici…",
          "link": "https://savetooru.bearblog.dev/dont-skip-the-openings/",
          "publishedOn": "2024-05-17T15:35:12.065Z",
          "wordCount": 1410,
          "title": "don't skip the openings",
          "imageUrl": null
        },
        {
          "id": "https://bowlofmisua.bearblog.dev/rainbow-bridge/",
          "author": null,
          "description": "we lost our second dog today.\nsherlock, my aunt’s darling boy, passed at 4:20 in the morning. at 3am, she knocked on my door saying the fateful words—i think sherlock’s dying. it was like my whole world came to a stop.\nhe died in her arms.\n10 and a half beautiful years of his company. our kind, kind sherlock who sometimes snapped at us when we kissed him too much. our darling, darling boy who was great at finding toys we’d hide from him; who liked to eat the cheese crackers my grandma fed him when no one was looking.\nhe had chronic heart failure. we were counting down the months, really, but nothing could’ve ever prepared me for that 3am knock, his fading heartbeat, and his little eyes that wouldn’t close.\nten years ago today, my aunt’s dog quli—a botched attempt of naming him 去来, a dog wh…",
          "link": "https://bowlofmisua.bearblog.dev/rainbow-bridge/",
          "publishedOn": "2024-05-17T15:27:15.392Z",
          "wordCount": 729,
          "title": "traversing across a rainbow bridge",
          "imageUrl": null
        },
        {
          "id": "https://tiramisu.bearblog.dev/fear-expectations/",
          "author": null,
          "description": "(This open letter is inspired by a post I read yesterday by Gabby of woolgathering fame.)\nDear Gabby,\nIt’s not just you: getting over the fear of expectations is hard. I still struggle with it, after 300 something posts. I have a feeling I’ll never get completely over it, but here’s what’s helped me so far.\nPosting a lot helps. I’ve posted so much nonsense on this blog that these days there’s not much I can do that will be worse than something I’ve written before. Somehow, I still have regular readers. Realizing that there are people out there still interested in what I have to say after all the good and not so good is a great comfort. From what you write, you seem to have discovered as much.\nAnother perk of having a large body of work is that each new piece you create becomes a smaller and smaller part of your entire oeuvre. When you’re first starting out, it feels like each creation you put out defines you. After all, if you only have one post, it’s the only thing people can judge you on. If you have a hundred, a wayward post is a drop in the bucket.\nThat said, wouldn’t you still want to see the creations your friends or favorite creators aren’t proud of? Or see their art even if it doesn’t quite fit the niche they’ve carved out for themselves? Everybody half-asses things in their own unique way. There’s a beauty in doing things imperfectly, too.\nAll that is to say, keep up what you’re doing. Creative inertia is a very real thing. You’re doing the right thing by posting, even if you feel like you’re just posting to break the streak of inactivity. Writing in any form begets more writing.\nAnyway, welcome back to Bear! It’s good to have you back.\nYours,\nmisu",
          "link": "https://tiramisu.bearblog.dev/fear-expectations/",
          "publishedOn": "2024-05-17T06:07:27.208Z",
          "wordCount": 771,
          "title": "re: the fear of audience expectations, by gabby",
          "imageUrl": null
        },
        {
          "id": "https://woolgathering.bearblog.dev/catching-up/",
          "author": null,
          "description": "woah, hello bear! it sure has been a while since i've last written.\na little bit after my last post, i went on some back-to-back trips around asia. i spent a few days in seoul and about a week in bali. i did actually write about both of those trips with the intention of sharing them with all of you on here but for some reason i couldn't quite bring myself to publish it. i've never really written on any sort of platform before this, but i'm assuming that just like visual art, some writing is just meant to be kept to yourself.\nwith the only things i had written in that span of 4 weeks being private, i didn't really have much else to post. and the longer i went without posting, the harder it was to come back. this always happens to me. it was the exact same mindset i had with my art account o…",
          "link": "https://woolgathering.bearblog.dev/catching-up/",
          "publishedOn": "2024-05-16T07:28:05.926Z",
          "wordCount": 1502,
          "title": "catching up",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/ilya-kharkow-the-advice-led-to-hell-cs?v=1716239906",
          "author": null,
          "description": "Author: Ilya Kharkow\nTitle: The Advice Led to Hell\nDate: May 16, 2024\nSource: https://actionweek.noblogs.org/post/2024/05/16/rady-vedou-do-pekla-ilya-kharkow/#more-1104\n\n I wrote about how difficult it was to get from Kyiv to Lviv on the first day of a full-scale war in the novel THE MINING BOYS. But when I finally got there, it only got worse. \n The people who sheltered me sincerely did not understand why I did not want to defend the country with weapons in my hands. My hope to go to Europe seemed like a betrayal to them. At the same time, I had to hide from them not only my fear, but also my culture and my orientation. \n These same people advised me to voluntarily join the territorial defense. Their acquaintances, who also didn’t want to fight, deliberately signed up there so they wouldn…",
          "link": "https://theanarchistlibrary.org/library/ilya-kharkow-the-advice-led-to-hell-cs?v=1716239906",
          "publishedOn": "2024-05-20T21:18:26.000Z",
          "wordCount": 1044,
          "title": "Ilya Kharkow - The Advice Led to Hell",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "5931",
            "url": "https://theanarchistlibrary.org/library/ilya-kharkow-the-advice-led-to-hell-cs.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anarchy-in-action-anarchy-in-the-haitian-revolution?v=1716166084",
          "author": null,
          "description": "Author: Anarchy In Action\nTitle: Anarchy in the Haitian Revolution\nSource: Retrieved on 19 May 2024 from anarchyinaction.org/index.php?title=Anarchy_in_the_Haitian_Revolution\n\n Following many years of hidden and small-scale resistance, African slaves in the French colony of Saint Domingue (or San Domingo) rose up in 1791 against their colonizers and slave masters. By 1804, they abolished slavery, expelled the French colonizers, and established the independent republic of Haiti. Haiti was the name given to the Caribbean island by the Tainos before colonizers arrived, slaughtered the entire indigenous population, and imported African slaves. \n While the 1776 and 1789 revolutions of the USA and France were grounded in exclusionary “citizens’ rights,” the Haitian Revolution stood out for a com…",
          "link": "https://theanarchistlibrary.org/library/anarchy-in-action-anarchy-in-the-haitian-revolution?v=1716166084",
          "publishedOn": "2024-05-20T00:48:04.000Z",
          "wordCount": 2749,
          "title": "Anarchy In Action - Anarchy in the Haitian Revolution",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "14012",
            "url": "https://theanarchistlibrary.org/library/anarchy-in-action-anarchy-in-the-haitian-revolution.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/john-zerzan-he-means-it-do-you?v=1715942581",
          "author": null,
          "description": "Author: John Zerzan\nTitle: He Means it — Do you?\nDate: 2002\nSource: Retrieved on May 2024 from archive.org\n\n Today opposition is anarchist or it is non-existent. This is the barest minimum coherence in the struggle against an engulfing totality. \n And while ten years ago the milieu generally called anti-authoritarian was largely syndicalist, those leftist residues are fading out altogether. Very few now find a vista of work and production at all liberatory. \n As the smell of this false and rotting order rises to the heavens, registering an unprecedented toll on all living beings, faith in the whole modern world evaporates. Industrialism and its ensemble looks like it has been a very bad idea, sort of a wrong turn begun still earlier. Civilization itself, with its logic of domestication and…",
          "link": "https://theanarchistlibrary.org/library/john-zerzan-he-means-it-do-you?v=1715942581",
          "publishedOn": "2024-05-17T10:43:01.000Z",
          "wordCount": 810,
          "title": "John Zerzan - He Means it — Do you?",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "5632",
            "url": "https://theanarchistlibrary.org/library/john-zerzan-he-means-it-do-you.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/hugh-owen-pentecost-thomas-paine?v=1715846977",
          "author": null,
          "description": "Author: Hugh Owen Pentecost\nTitle: Thomas Paine\nDate: February 6, 1890\nNotes: Delivered on February 2, 1890 to the Unity Congregation at Newark, Brooklyn, and Manhattan. Published in Twentieth Century February 6, 1890. Edited and annotated by Robert P. Helms.\nSource: Retrieved on 16th May 2024 from www.deadanarchists.org\n\n Thomas Paine is one of the most maligned and least understood of men. One of the noblest minded of men in most respects, he has been represented for nearly a century as a groveling nature and a monster of iniquity. Supremely generous in all his public career, he is said to have been mean and self-seeking. Having refused to profit by the copyright of his religious and political works, he is called parsimonious. A rarely equaled friend of mankind, he is scorned as the enem…",
          "link": "https://theanarchistlibrary.org/library/hugh-owen-pentecost-thomas-paine?v=1715846977",
          "publishedOn": "2024-05-16T08:09:37.000Z",
          "wordCount": 5296,
          "title": "Hugh Owen Pentecost - Thomas Paine",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "15356",
            "url": "https://theanarchistlibrary.org/library/hugh-owen-pentecost-thomas-paine.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/hugh-owen-pentecost-the-sins-of-government?v=1715846855",
          "author": null,
          "description": "Author: Hugh Owen Pentecost\nTitle: The Sins of Government\nDate: March 13, 1890\nNotes: Delivered on March 9, 1890 to the Unity Congregation at Newark, Brooklyn, and Manhattan. Published in Twentieth Century on March 13, 1890. Edited and annotated by Robert P. Helms.\nSource: Retrieved on 16th May 2024 from www.deadanarchists.org\n\n I am aware that in delivering a number of addresses with the object of persuading you that government by physical force is the real cause of poverty and the slowness of human development mentally and morally, I am opposing preconceived opinions, prejudices and superstitions even stronger than are aroused by open declarations of Atheism. Political superstition is more deeply rooted than religious superstition. Multitudes of persons have ceased to believe in Jehovah …",
          "link": "https://theanarchistlibrary.org/library/hugh-owen-pentecost-the-sins-of-government?v=1715846855",
          "publishedOn": "2024-05-16T08:07:35.000Z",
          "wordCount": 2830,
          "title": "Hugh Owen Pentecost - The Sins of Government",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "9864",
            "url": "https://theanarchistlibrary.org/library/hugh-owen-pentecost-the-sins-of-government.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/hugh-owen-pentecost-first-anniversary-address?v=1715846738",
          "author": null,
          "description": "Author: Hugh Owen Pentecost\nTitle: ​First Anniversary Address\nDate: January 10, 1889\nNotes: Delivered on January 6, 1889 to the Unity Congregation at Newark, Brooklyn, and Manhattan. Published in Twentieth Century on January 10, 1889.\nSource: Retrieved on 16th May 2024 from www.deadanarchists.org\n\n Unity Congregation has completed its first year of existence and, I hope, of usefulness. As we look back on that year I think we shall agree that it has been a year of peace and prosperity for which we should be profoundly grateful. Our career thus far has exceeded my most sanguine expectations. The congregation shave been large and enthusiastic, probably averaging during the year nearly two thousand persons in the three cities where our meetings have been held each Sunday.[1] They have come tog…",
          "link": "https://theanarchistlibrary.org/library/hugh-owen-pentecost-first-anniversary-address?v=1715846738",
          "publishedOn": "2024-05-16T08:05:38.000Z",
          "wordCount": 3690,
          "title": "Hugh Owen Pentecost - ​First Anniversary Address",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "12081",
            "url": "https://theanarchistlibrary.org/library/hugh-owen-pentecost-first-anniversary-address.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/hugh-owen-pentecost-anarchism?v=1715846565",
          "author": null,
          "description": "Author: Hugh Owen Pentecost\nTitle: Anarchism\nDate: July 4, 1889\nNotes: Delivered on June 30, 1889 to the Unity Congregation at Newark, Brooklyn, and Manhattan. Published in Twentieth Century on July 4, 1889. Edited and annotated by Robert P. Helms.\nSource: Retrieved on 16th May 2024 from www.deadanarchists.org\n\n Good people who hold opinions not commonly understood generally have a bad name. The world is ready to believe almost anything of a man except that he is a genuinely good man. If his life is stainless but unconventional, the world suspects some hidden shame or base motive. So far are most people from understanding or desiring what is true and right that the highest truth is often believed to be the lowest lie, and the purest right is looked upon as the blackest wrong. \n Thus Jesus,…",
          "link": "https://theanarchistlibrary.org/library/hugh-owen-pentecost-anarchism?v=1715846565",
          "publishedOn": "2024-05-16T08:02:45.000Z",
          "wordCount": 3686,
          "title": "Hugh Owen Pentecost - Anarchism",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "11812",
            "url": "https://theanarchistlibrary.org/library/hugh-owen-pentecost-anarchism.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/robert-p-helms-hugh-owen-pentecost-1848-1907?v=1715846400",
          "author": null,
          "description": "Author: Robert P. Helms\nTitle: ​Hugh Owen Pentecost (1848–1907)\nSubtitle: A Biographical Sketch\nSource: Retrieved on 16th May 2024 from www.deadanarchists.org\n\n Because he changed into so many different suits during his long career, historians have not focused on the dashing radical orator Hugh O. Pentecost. \n Born September 30, 1848 at New Harmony, Indiana, Pentecost was given his middle name for Robert Owen, whose followers had established the town as a Fourierist colony a generation earlier. His parents, Emma Flower and Hugh Lockett Pentecost, were of English descent, with many Protestant clergy in their family tree. Hugh moved at age two to Albion, Illinois, which was founded by his grandfather, Scarborough Pentecost, Jr. \n Hugh went as a boy to Kentucky during the Civil War, where he …",
          "link": "https://theanarchistlibrary.org/library/robert-p-helms-hugh-owen-pentecost-1848-1907?v=1715846400",
          "publishedOn": "2024-05-16T08:00:00.000Z",
          "wordCount": 2153,
          "title": "Robert P. Helms - ​Hugh Owen Pentecost (1848–1907)",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "9376",
            "url": "https://theanarchistlibrary.org/library/robert-p-helms-hugh-owen-pentecost-1848-1907.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}