{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "1fd3ff20bcccaf56da4bc38e70780bfd8ba588bb",
          "author": "Abhishek Gupta",
          "description": "July 16, 2024: Updated link for “IDE workspace context awareness in Amazon Q Developer chat” As expected, there were lots of exciting launches and updates announced during the AWS Summit New York. You can quickly scan the highlights in Top Announcements of the AWS Summit in New York, 2024. My colleagues and fellow AWS News […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-advanced-capabilities-in-amazon-bedrock-and-amazon-q-and-more-july-15-2024/",
          "publishedOn": "2024-07-15T18:19:06.000Z",
          "wordCount": 2102,
          "title": "AWS Weekly Roundup: Advanced capabilities in Amazon Bedrock and Amazon Q, and more (July 15, 2024).",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/08/13/AWS-WIR-default.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": []
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/category/engineering/",
      "articles": [
        {
          "id": "https://github.blog/2024-07-12-github-availability-report-june-2024/",
          "author": null,
          "description": "<p>In June, we experienced two incidents that resulted in degraded performance across GitHub services. </p>\n<p>The post <a href=\"https://github.blog/2024-07-12-github-availability-report-june-2024/\">GitHub Availability Report: June 2024</a> appeared first on <a href=\"https://github.blog\">The GitHub Blog</a>.</p>",
          "link": "https://github.blog/2024-07-12-github-availability-report-june-2024/",
          "publishedOn": "2024-07-12T20:32:20.000Z",
          "wordCount": 1173,
          "title": "GitHub Availability Report: June 2024",
          "imageUrl": "https://github.blog/wp-content/uploads/2024/01/Enterprise-DarkMode-1.png"
        }
      ]
    },
    {
      "title": "AWS DevOps Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": []
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "910ef3a53d9d7fb2e0aa32c2b41b897b162560a8",
          "author": "Alicia Plotnikov",
          "description": "AppsFlyer is a global leader in mobile attribution and marketing analytics. AppsFlyer helps businesses understand the impact and their marketing efforts across every channel and device, through a comprehensive measurement platform and privacy cloud that fosters ecosystem collaboration while preserving customers’ privacy. Within AppsFlyer, data is the core, it gives the ability to expose detailed […]",
          "link": "https://aws.amazon.com/blogs/containers/harnessing-karpenter-transitioning-kafka-to-amazon-eks-with-aws-solutions/",
          "publishedOn": "2024-07-17T17:28:07.000Z",
          "wordCount": 2900,
          "title": "Harnessing Karpenter: Transitioning Kafka to Amazon EKS with AWS solutions",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/07/10/Featured-images-for-Containers-Blog-2-1260x630.jpg"
        },
        {
          "id": "cb24bb84b9abe4d08c13bcea2f3f6bb640f40ccf",
          "author": "Henry Yan",
          "description": "Introduction In today’s dynamic business landscape, operational efficiency and cost optimization are two critical ingredients for a successful business outcome. This is especially true for companies navigating through digital transformation. In 2020, Thomson Reuters (TR), a leader at the intersection of content and technology with trusted data, committed to a cloud-first strategy with Amazon Web […]",
          "link": "https://aws.amazon.com/blogs/containers/how-thomson-reuters-achieved-5x-operational-efficiency-and-30-cost-optimization-with-plexus-on-amazon-eks/",
          "publishedOn": "2024-07-17T16:31:57.000Z",
          "wordCount": 2630,
          "title": "How Thomson Reuters achieved 5X operational efficiency and 30% cost optimization with Plexus on Amazon EKS",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/07/17/Featured-images-for-Containers-Blog-3-1260x630.jpg"
        },
        {
          "id": "ce26d458d598d4737adde02742504651c450ef09",
          "author": "Tom Wright",
          "description": "Introduction Culture Amp is an employee experience platform that provides the insights into employee engagement, performance, and development that organizations need to build a category-defining culture. Culture Amp’s mission is to create a better world of work. Developer feedback loops An efficient developer feedback loop is a critical part of an effective development process – […]",
          "link": "https://aws.amazon.com/blogs/containers/accelerating-development-feedback-loops-with-aws-cdk-hotswap-deployments-for-amazon-ecs/",
          "publishedOn": "2024-07-16T04:43:25.000Z",
          "wordCount": 2406,
          "title": "Accelerating development feedback loops with AWS CDK hotswap deployments for Amazon ECS",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/07/04/Featured-images-for-Containers-Blog-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=328422",
          "author": "Kathryn Claire Higgins",
          "description": "First, it was a breaking-news headline. Loud bangs heard at Trump rally in Pennsylvania. Then, an explanatory update. Shots fired. Then, it was named. Assassination attempt. Sounds became actions, actions became intentions. Then, finally—but thanks to the internet, so quickly—the image: Trump being ushered off-stage by his security detail, a grimace across his face, a smack of red blood above his right ear, his fist raised in defiance. More\nThe post Trump and the Age of Victim-could appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/18/trump-and-the-age-of-victimcould/",
          "publishedOn": "2024-07-18T06:11:15.000Z",
          "wordCount": null,
          "title": "Trump and the Age of Victim-could",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328318",
          "author": "Neve Gordon",
          "description": "Most people probably don’t know this but Wikipedia has a page called “List of Israeli assassinations”. It begins in July 1956 and stretches over 68 years until today. The majority on the list are Palestinians; among them are famous Palestinian leaders PFLP’s Ghassan Kanafani, Fatah’s Khalil Ibrahim al-Wazir - also known as Abu Jihad, Hamas’s Sheikh Ahmed Yassin, and Islamic Jihad’s Fathi Shaqaqi. More\nThe post Israel Seeks to Redraw the Laws of War appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/18/israel-seeks-to-redraw-the-laws-of-war/",
          "publishedOn": "2024-07-18T06:00:23.000Z",
          "wordCount": null,
          "title": "Israel Seeks to Redraw the Laws of War",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328451",
          "author": "James C. Nelson",
          "description": "On June 10, 2024, Articles of Impeachment were introduced in the U.S. House of Representatives against Justices Clarence Thomas and Samuel Alito, by Congresswoman Alexandria Ocasio-Cortez (NY-14), Vice Ranking Member of the Committee on Oversight and Accountability. Read the two Resolutions in the press release at this link:  https://www.cnn.com/2021/09/13/politics/amy-coney-barrett-supreme-court-not-partisan/index.html The two Resolutions were grounded in the two  More\nThe post High Court; No Integrity appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/18/high-court-no-integrity/",
          "publishedOn": "2024-07-18T05:55:08.000Z",
          "wordCount": null,
          "title": "High Court; No Integrity",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328452",
          "author": "B. Nimri Aziz",
          "description": "Weekends are often points for transitions. The past one certainly is proving so. One man, close to being eased out of the White House, hasn’t appeared this presidential in months. Taking a superb opportunity to reunite the nation, his words are replete with authority and resolve. With his unlimited powers, he launches an intensive investigation.  More\nThe post Tragedy and Irony in America’s Presidential Politics appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/18/tragedy-and-irony-in-americas-presidential-politics/",
          "publishedOn": "2024-07-18T05:55:08.000Z",
          "wordCount": null,
          "title": "Tragedy and Irony in America’s Presidential Politics",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328449",
          "author": "Jonah Raskin",
          "description": "The Brits have them, the French have them and so do the Swedes and the Poles. All Europeans have cop dramas and police procedurals that reflect their national identities, many of them on Netflix, PBS and Amazon and available for binge watching. I’ve watched a dozen or so of these shows and have come to  More\nThe post Rocco Schavone: Italy’s Red Hot Cop in Ice Cold Murders  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/18/rocco-schavone-italys-red-hot-cop-in-ice-cold-murders/",
          "publishedOn": "2024-07-18T05:54:47.000Z",
          "wordCount": null,
          "title": "Rocco Schavone: Italy’s Red Hot Cop in Ice Cold Murders",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328315",
          "author": "Mark Weisbrot",
          "description": "Recent polls show that the economy is still chosen by more voters than any other issue as the most important in this election. A recent Washington Post/Schar School survey shows this to be true also for the swing voters in the swing states — Arizona, Georgia, Michigan, Nevada, Pennsylvania, and Wisconsin — the people who  More\nThe post The US Economy and the Fate of Minority Rule appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/18/the-us-economy-and-the-fate-of-minority-rule/",
          "publishedOn": "2024-07-18T05:45:36.000Z",
          "wordCount": null,
          "title": "The US Economy and the Fate of Minority Rule",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328320",
          "author": "Steve Early",
          "description": "The symbols of public-sector infrastructure are often associated with urban areas: major highways and subway systems, for instance; bridges and tunnels; large ports and airports; billions of gallons of fresh water to deliver and hundreds of tons of solid waste to cart away every day. Yet public works departments are no less important in rural  More\nThe post A Small Town Union Leader on Building Vermont’s Labor Movement for a New Generation appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/18/a-small-town-union-leader-on-building-vermonts-labor-movement-for-a-new-generation/",
          "publishedOn": "2024-07-18T05:45:36.000Z",
          "wordCount": null,
          "title": "A Small Town Union Leader on Building Vermont’s Labor Movement for a New Generation",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328476",
          "author": "Karl Grossman",
          "description": "President Joe Biden has signed the ADVANCE Act, a measure passed overwhelmingly by both houses of the U.S. Congress which promotes nuclear power. “I signed the ADVANCE Act, a bipartisan win for American energy security, innovation and achieving economy-wide, net-zero emissions by 2050. Clean nuclear power and good union jobs. That’s what the ADVANCE Act  More\nThe post Biden Goes Nuclear with ADVANCE Act appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/18/biden-goes-nuclear-with-advance-act/",
          "publishedOn": "2024-07-18T05:43:24.000Z",
          "wordCount": null,
          "title": "Biden Goes Nuclear with ADVANCE Act",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328271",
          "author": "Sy Montgomery",
          "description": "In Native American lore, bees symbolize community; Celtic myths tell us bees are spirit messengers from the Otherworld. Around the world, butterflies evoke the promise of metamorphosis. And the sparkling, hovering hummingbirds, because they are impossibly tiny and fast and beautiful, are emblems of irrepressible life. The Aztecs believed hummingbirds, who are furious fighters, are  More\nThe post Why Humingbirds are in Rapid Decline appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/18/why-humingbirds-are-in-rapid-decline/",
          "publishedOn": "2024-07-18T05:35:44.000Z",
          "wordCount": null,
          "title": "Why Humingbirds are in Rapid Decline",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328479",
          "author": "Chris Houston",
          "description": "Filipe Faria, a humanitarian pilot, shares the traumatic event that led to his Post Traumatic Stress Disorder (PTSD): “being taken hostage by child soldiers.” We chat over Chinese food about his work flying humanitarian workers and goods around countries like the Democratic Republic of the Congo and Uganda. Filipe just got recertified for his pilot’s  More\nThe post Surviving Trauma: Filipe Faria’s Journey to Recovery from PTSD appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/18/surviving-trauma-filipe-farias-journey-to-recovery-from-ptsd/",
          "publishedOn": "2024-07-18T05:06:41.000Z",
          "wordCount": null,
          "title": "Surviving Trauma: Filipe Faria’s Journey to Recovery from PTSD",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328322",
          "author": "Walden Bello",
          "description": "Thirty years ago, U.S. corporate capital, along with the Clinton administration, envisioned globalization, achieved through trade, investment, and financial liberalization, as the spearhead of its greater domination of the global economy. Wall Street and Washington were wrong. It was China that was the biggest beneficiary of globalization and the United States one of its main victims. More\nThe post Crisis in the West, Opportunity for the Rest? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/17/crisis-in-the-west-opportunity-for-the-rest/",
          "publishedOn": "2024-07-17T06:03:39.000Z",
          "wordCount": null,
          "title": "Crisis in the West, Opportunity for the Rest?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328358",
          "author": "Ashley Smith",
          "description": "Israel’s genocidal war is both massacring Palestinians and destroying their physical and social infrastructure. In particular, Israel has targeted Palestinian educational institutions. In late April, UN experts concluded, “with more than 80% of schools in Gaza damaged or destroyed, it may be reasonable to ask if there is an intentional effort to comprehensively destroy the Palestinian education system, an action known as ‘scholasticide’.”1 The aim of this settler-colonial project is to eradicate the physical, intellectual, and political reproduction of the Palestinian people. As Maya Wind documents in her new book Towers of Ivory and Steel, the Israeli higher education system plays a key role in this agenda. Spectre’s Ashley Smith interviews Wind about the current war, the nature of Zionist higher educational institutions, and the case for a boycott of Israeli universities. More\nThe post Resisting Israeli Scholasticide and Academic Apartheid appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/17/resisting-israeli-scholasticide-and-academic-apartheid/",
          "publishedOn": "2024-07-17T05:57:27.000Z",
          "wordCount": null,
          "title": "Resisting Israeli Scholasticide and Academic Apartheid",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328401",
          "author": "W. T. Whitney",
          "description": "Cuba and Cuban science gained acclaim worldwide for producing their own very effective Covid-19 vaccines. The achievement stood out among nations of the Global South. The feat reflects Cuba’s development over decades of a formidable scientific establishment engaged in the development and marketing of biologic products oriented to healthcare mostly, and also to food production.  More\nThe post How the Knowledge Economy and Science Bolster Cuba’s Socialist Revolution appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/17/how-the-knowledge-economy-and-science-bolster-cubas-socialist-revolution/",
          "publishedOn": "2024-07-17T05:55:42.000Z",
          "wordCount": null,
          "title": "How the Knowledge Economy and Science Bolster Cuba’s Socialist Revolution",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328404",
          "author": "Giuliana Perrone",
          "description": "If you’re looking for a rare bit of good news, look no further: California is finally taking steps to abolish slavery from its constitution by banning it in state prisons. On June 27, 2024, the state legislature passed the End Slavery in California Act, teeing up a statewide vote this fall on whether to end  More\nThe post California Moves to Ban Forced Prison Labor, But There’s Still More to Do appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/17/california-moves-to-ban-forced-prison-labor-but-theres-still-more-to-do/",
          "publishedOn": "2024-07-17T05:55:29.000Z",
          "wordCount": null,
          "title": "California Moves to Ban Forced Prison Labor, But There’s Still More to Do",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328407",
          "author": "Martha Rosenberg",
          "description": "In 2019, a ban on junk food advertising across London’s entire public transport network–– foods and drinks high in fat, salt and ads for foods––resulted in prevention of 100,000 obesity cases according to some academics. Yet the U.S. love affair with the new semaglutide-based weight loss drugs like Ozempic gives junk food advertising and availability a huge  More\nThe post Rapid Weight Loss Drugs Give Junk Food Sellers a Pass appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/17/rapid-weight-loss-drugs-give-junk-food-sellers-a-pass/",
          "publishedOn": "2024-07-17T05:54:05.000Z",
          "wordCount": null,
          "title": "Rapid Weight Loss Drugs Give Junk Food Sellers a Pass",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328419",
          "author": "Nan Levinson",
          "description": "It began with Aaron Bushnell and a visceral response of mine: Why would anyone do such a thing? Bushnell was the 25-year-old active-duty airman who set himself ablaze on February 25th in front of the Israeli embassy in Washington, D.C., to protest that country’s brutal war in Gaza. The first question was tough enough, but  More\nThe post Assessing the Flames of Protest appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/17/assessing-the-flames-of-protest/",
          "publishedOn": "2024-07-17T05:52:43.000Z",
          "wordCount": null,
          "title": "Assessing the Flames of Protest",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328226",
          "author": "Peter Bach",
          "description": "Another four people died last week after their dinghy capsized in the Channel. ‘When you’re drowning, you don’t say ‘I would be incredibly pleased if someone would have the foresight to notice me drowning and come and help me,’ you just scream,’ once said former Beatle John Lennon. Attempting foresight, our new UK Home Secretary  More\nThe post Letter from London: Offshore Man and the Wages of Foresight appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/17/letter-from-london-offshore-man-and-the-wages-of-foresight/",
          "publishedOn": "2024-07-17T05:50:21.000Z",
          "wordCount": null,
          "title": "Letter from London: Offshore Man and the Wages of Foresight",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328417",
          "author": "Nick Pemberton",
          "description": "“Friends, Romans, countrymen, lend me your ears; I come to bury Caesar, not to praise him.” —Shakespeare, from Julias Ceasar, spoken by Marc Antony “A proposition might fall kindly on your ear.” —Prop Joe, The Wire But do you condemn Thomas Matthew Crooks? With or without their ears, none of the ruling class hears the  More\nThe post An Ear For An Ear Leaves The Whole World What? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/17/an-ear-for-an-ear-leaves-the-whole-world-what/",
          "publishedOn": "2024-07-17T05:47:44.000Z",
          "wordCount": null,
          "title": "An Ear For An Ear Leaves The Whole World What?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328228",
          "author": "Dave Kraft",
          "description": "On Wednesday July 10th President Joe Biden signed the “ADVANCE Act,” which stands for “Accelerating Deployment of Versatile, Advanced Nuclear for Clean Energy.” The controversial bill aggressively promotes the narrow, short-term interests of the U.S. nuclear industry in ways that threaten the long-term national environmental, climate and national/international security interests. Further, it functionally rewrites the  More\nThe post The “ADVANCE Act” appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/17/328228/",
          "publishedOn": "2024-07-17T05:45:31.000Z",
          "wordCount": null,
          "title": "The “ADVANCE Act”",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328225",
          "author": "John Feffer",
          "description": "The Right is resurgent! The Left is Back! The Center is on the march! It’s always tempting to declare, on the basis of a few elections, that a political tendency is on the ascendant. I should know: I’ve done it myself. But the only commonality in the most recent consequential elections—France, the UK, and Iran—is  More\nThe post What Do Voters Want? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/17/what-do-voters-want/",
          "publishedOn": "2024-07-17T05:45:27.000Z",
          "wordCount": null,
          "title": "What Do Voters Want?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328334",
          "author": "Kary Love",
          "description": "The US has a long, chequered relationship with assassination. On one hand, the myths of 1776 recount of a nation born through resistance to the tyranny that it holds at the core of its identity. Values legitimizing tyrannicide can be imputed from the second paragraph of the Declaration of Independence. On the other hand, the US  More\nThe post Tyrannicide: An American Value? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/17/tyrannicide-an-american-value/",
          "publishedOn": "2024-07-17T05:31:12.000Z",
          "wordCount": null,
          "title": "Tyrannicide: An American Value?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328436",
          "author": "Dan La Botz",
          "description": "Teamster President Sean O’Brien gave a rip-roaring speech to the Republican National Convention in which he denounced politicians, condemned the banks and corporations, and demanded justice for workers. It was a ringing, rousing, radical speech on behalf of the underdogs of America presented to a party that represents the very banks, corporations, and politicians that  More\nThe post Teamster President Sean O’Brien’s Pro-Worker Speech at RNC  Only Helped Trump and His Anti-Worker Agenda appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/17/teamster-president-sean-obriens-pro-worker-speech-at-rnc-only-helped-trump-and-his-anti-worker-agenda/",
          "publishedOn": "2024-07-17T05:30:47.000Z",
          "wordCount": null,
          "title": "Teamster President Sean O’Brien’s Pro-Worker Speech at RNC  Only Helped Trump and His Anti-Worker Agenda",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328254",
          "author": "Matthew Hoh",
          "description": "The elected majorities of both political parties argue Israel’s genocide of Palestinians must be supported because Israel is the only democracy in the Middle East. $175 billion, in just 2 1/2 years, has been appropriated for war in Ukraine to defend democracy. The GOP and the Democrats have brought about a needless and reckless cold  More\nThe post Defending Democracy: When Wars Come Home appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/17/defending-democracy-when-wars-come-home/",
          "publishedOn": "2024-07-17T05:28:22.000Z",
          "wordCount": null,
          "title": "Defending Democracy: When Wars Come Home",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328298",
          "author": "Ellen Cantarow",
          "description": "In 1979, I made the first of what would turn out to be decades of periodic visits to Israel and the West Bank. I traveled there for the New York alternative publication The Village Voice to investigate Israel’s growing settler movement, Gush Emunim (or the Bloc of the Faithful). The English-language Israeli newspaper, The Jerusalem Post, then reported that settlers from Kiryat Arba, a Jewish West Bank outpost, had murdered two Palestinian teenagers from the village of Halhoul. There, in one of the earliest West Bank settlements established by Gush Emunim, a distant cousin of my husband had two acquaintances. Under cover of being a Jew in search of enlightenment, I spent several days and nights with them. More\nThe post A Cancer on the West Bank appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/16/a-cancer-on-the-west-bank/",
          "publishedOn": "2024-07-16T05:59:44.000Z",
          "wordCount": null,
          "title": "A Cancer on the West Bank",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328176",
          "author": "Kevin Foster",
          "description": "The near century of oppression and occupation, massive waves of media coverage and the unprecedented damage Israel has done in its war all play a role in people’s dissent. Even more so, frustration grows with the fact that the US could take immediate steps to stop this, but instead actively aids and abets a genocide.  More\nThe post “Selective Outrage” Towards Israel appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/16/selective-outrage-towards-israel/",
          "publishedOn": "2024-07-16T05:57:58.000Z",
          "wordCount": null,
          "title": "“Selective Outrage” Towards Israel",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328347",
          "author": "CounterPunch News Service",
          "description": "Milwaukee, WI  In an incident of political thuggery and intimidation at the RNC, CODEPINK’s Palestinian campaign organizer, Nour Jaghama, has been unjustly arrested by police on accusation of assaulting a member of Congress. While peacefully waiting in line to enter the event, Nour, a visibly Palestinian woman, was intentionally bumped into by a bald, white  More\nThe post CODEPINK’s Palestinian-American Staff Member Arrested on False Accusation of Assault by Member of Congress appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/16/codepinks-palestinian-american-staff-member-arrested-on-false-accusation-of-assault-by-member-of-congress/",
          "publishedOn": "2024-07-16T05:57:25.000Z",
          "wordCount": null,
          "title": "CODEPINK’s Palestinian-American Staff Member Arrested on False Accusation of Assault by Member of Congress",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328145",
          "author": "Henry Giroux",
          "description": "In the aftermath of over five hundred shootings during the July 4th weekend, reports indicate that “a Texas-based company has developed vending machines that sell bullets and installed them at a handful of grocery stores in Texas, Oklahoma, and Alabama, with plans for expansion into other states.”1 Violence has become an organizing and governing principle  More\nThe post Childcide in the Age of Fascist Theocracies appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/16/childcide-in-the-age-of-fascist-theocracies/",
          "publishedOn": "2024-07-16T05:55:52.000Z",
          "wordCount": null,
          "title": "Childcide in the Age of Fascist Theocracies",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328283",
          "author": "David Rosen",
          "description": "The June 28th debate between Joe Biden and Donald Trump was a two-pronged disaster.  Much has been made of Biden’s “senior moments” as well as Trump’s 30-plus false claims.  There is a growing number of “liberal” national media outlets, led by The New York Times, calling for Biden to step aside for a younger and more coherent candidate. Sadly, less attention has been  More\nThe post Trump on Immigrants: “They’re Not Humans, They’re Animals” appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/16/trump-on-immigrants-theyre-not-humans-theyre-animals/",
          "publishedOn": "2024-07-16T05:55:30.000Z",
          "wordCount": null,
          "title": "Trump on Immigrants: “They’re Not Humans, They’re Animals”",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328277",
          "author": "Prabir Purkayastha",
          "description": "Boeing has agreed to plead guilty to a criminal fraud charge regarding the two crashes of 737 Max airplanes that caused the death of 346 passengers on two flights: a Lion Air flight out of Indonesia in October 2018 and an Ethiopian Airlines flight in March 2019. Though Boeing had tried hard to convince the world that  More\nThe post Boeing Pleads Guilty to Criminal Fraud: the Continuing 737 Max Saga appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/16/boeing-pleads-guilty-to-criminal-fraud-the-continuing-737-max-saga/",
          "publishedOn": "2024-07-16T05:55:27.000Z",
          "wordCount": null,
          "title": "Boeing Pleads Guilty to Criminal Fraud: the Continuing 737 Max Saga",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328275",
          "author": "Binoy Kampmark",
          "description": "There is something to be said about ignoring actors.  They assume roles, quite literally, camouflage themselves in scripts where personalities are created, and behave accordingly.  Given that they are paid liars, their political promptings should be treated with caution.  It is no accident that much the same thing can be said about the members of Congress. Given that  More\nThe post “We Love you Joe, but…”: Hollywood’s Advice to President Biden appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/16/we-love-you-joe-but-hollywoods-advice-to-president-biden/",
          "publishedOn": "2024-07-16T05:55:14.000Z",
          "wordCount": null,
          "title": "“We Love you Joe, but…”: Hollywood’s Advice to President Biden",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": [
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=30761",
          "author": "Ben Hyman, Brian Kovak, and Adam Leive",
          "description": "Despite the existing safety net, worker displacement continues to have severe consequences that motivate the consideration of new social insurance programs. Wage insurance is a novel policy that temporarily provides additional income to workers who lose their job and become re-employed at a lower wage. In this post, we draw on evidence from our recent working paper analyzing the effects of a U.S. wage insurance program on worker earnings and employment outcomes. Among workers displaced by international trade, we find that eligibility for wage insurance increased the probability of employment in the first two years following job loss and led to higher long-term earnings. The program resulted in net savings to the government because workers collected fewer benefits and paid taxes on their increased earnings. Together, these findings suggest that wage insurance could support displaced workers more effectively than traditional social insurance programs.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/07/wage-insurance-a-potential-policy-for-displaced-workers/",
          "publishedOn": "2024-07-17T11:00:00.000Z",
          "wordCount": 4389,
          "title": "Wage Insurance: A Potential Policy for Displaced Workers",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/07/LSE_2024_wage-insurance_hyman_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=30757",
          "author": "Thomas Klitgaard",
          "description": "The consumer price index for groceries has risen more than the overall price index since the start of the pandemic, with a particularly large jump in 2022. In looking for explanations, a starting place is the behavior of raw commodity prices, which surged from early 2021 to mid-2022. In addition, wages for low-paid grocery workers have gone up faster than wages for the workforce as a whole. Finally, even though profit margins for grocery stores have gone up, the increase appears to be only a small contributor to the rise in food prices relative to the increase in their operating costs. This analysis suggests that the significant moderation in food inflation since the start of 2023 is due to still-high wage inflation for grocery workers being offset by the retreat in commodity prices.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/07/what-was-up-with-grocery-prices/",
          "publishedOn": "2024-07-16T11:00:00.000Z",
          "wordCount": 4157,
          "title": "What Was Up with Grocery Prices?",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/07/LSE_2024_grocery-store-prices_klitgaard_460.jpg"
        }
      ]
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45483",
          "author": "Editor",
          "description": "from Asad Zaman and WEA Pedagogy Blog In this sequence of posts, I will present the contents of the video podcast entitled “Michael Hudson: Why the US has a unique place in the history of imperialism? ” For me, Hudson’s book Super Imperialism: The Economic Strategy of the American Empire was an amazing eye-opener, essential reading […]",
          "link": "https://rwer.wordpress.com/2024/07/18/hudson-on-super-imperialism-1/",
          "publishedOn": "2024-07-18T17:22:07.000Z",
          "wordCount": 5037,
          "title": "Hudson on Super Imperialism 1",
          "imageUrl": "http://img.youtube.com/vi/K9nbj4X556A/0.jpg"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45472",
          "author": "Editor",
          "description": "Visit the post for more.",
          "link": "https://rwer.wordpress.com/2024/07/15/u-s-top-1-now-have-more-wealth-than-the-middle-class/",
          "publishedOn": "2024-07-15T16:41:13.000Z",
          "wordCount": 3945,
          "title": "U.S. Top 1% now have more wealth than the middle class",
          "imageUrl": "https://rwer.wordpress.com/wp-content/uploads/2024/07/wealth-inequality-usa-2.png"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45469",
          "author": "Lars Syll",
          "description": "from Lars Syll ZEIT: Today, the debate focuses on the labor shortages facing many industrialized countries. Angus Deaton: I am always cautious when people talk about a scarcity of labor but don’t talk about wages. The argument always is: Americans don’t want to do these jobs, Germans don’t want to do these jobs. So we have to […]",
          "link": "https://rwer.wordpress.com/2024/07/12/deaton-on-labour-shortages-and-wages/",
          "publishedOn": "2024-07-12T15:48:06.000Z",
          "wordCount": 4361,
          "title": "Deaton on labour shortages and wages",
          "imageUrl": "https://i.insider.com/60a6cfeff27b4c0019445c17"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=275213",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics; A former Navy SEAL takes a view on Trump's assempted assassination;  the Republican National Convention  and  J.D. Vance; unelecting Biden: irresistible (albeit private) force, immovable (albeit ill) object; Marimekko patterns online. ~",
          "link": "https://www.nakedcapitalism.com/2024/07/200pm-water-cooler-7-18-2024.html",
          "publishedOn": "2024-07-18T18:00:36.000Z",
          "wordCount": 7478,
          "title": "2:00PM Water Cooler 7/18/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/rcp_2024-07-12.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275208",
          "author": "Yves Smith",
          "description": "New investigation reveals unequal access to life-saving meds across Europe thanks to Big Pharma system that favors the rich",
          "link": "https://www.nakedcapitalism.com/2024/07/how-big-pharma-preys-on-poor-countries-and-patients-pay-the-price.html",
          "publishedOn": "2024-07-18T13:55:07.000Z",
          "wordCount": 4420,
          "title": "How Big Pharma Preys on Poor Countries – and Patients Pay the Price",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275178",
          "author": "Lambert Strether",
          "description": "Our cuddly daily links",
          "link": "https://www.nakedcapitalism.com/2024/07/links-7-18-2024.html",
          "publishedOn": "2024-07-18T10:58:34.000Z",
          "wordCount": 16237,
          "title": "Links 7/18/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/Koala_with_young.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275179",
          "author": "Yves Smith",
          "description": "The Biden political survival watch has resumed.",
          "link": "https://www.nakedcapitalism.com/2024/07/biden-2024-run-back-in-play-as-democratic-pushback-escalates-covid-case-offers-face-saving-out.html",
          "publishedOn": "2024-07-18T10:52:36.000Z",
          "wordCount": 11203,
          "title": "Biden 2024 Run Back in Play as Democratic Pushback Escalates, Covid Case Offers Face-Saving Out",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/Screen-Shot-2024-07-18-at-5.14.19-PM.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275176",
          "author": "Yves Smith",
          "description": "Many of the wealthy have  taken to recoiling against hypertrophied houses, although they don't 'splain why very well.",
          "link": "https://www.nakedcapitalism.com/2024/07/wealthy-enclaves-belatedly-rebelling-against-supersized-houses.html",
          "publishedOn": "2024-07-18T08:44:12.000Z",
          "wordCount": 6764,
          "title": "Wealthy Enclaves Belatedly Rebelling Against Supersized Houses",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275153",
          "author": "Yves Smith",
          "description": "A new report, Exporting Extinction, delves into the economic and political drivers of species-destroying resource exploitation.",
          "link": "https://www.nakedcapitalism.com/2024/07/exporting-extinction-the-global-political-economy-of-biodiversity-loss.html",
          "publishedOn": "2024-07-18T06:14:24.000Z",
          "wordCount": 6025,
          "title": "Exporting Extinction: The Global Political Economy of Biodiversity Loss",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275154",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, pandemics; Crooks remains an enigma; unelecting Biden: irresistable force, immovable object; Republican National Convention and J.D. Vance; how to sing ~",
          "link": "https://www.nakedcapitalism.com/2024/07/200pm-water-cooler-7-17-2024.html",
          "publishedOn": "2024-07-17T18:00:24.000Z",
          "wordCount": 22143,
          "title": "2:00PM Water Cooler 7/17/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/rcp_2024-07-12.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275145",
          "author": "Yves Smith",
          "description": "Some prognostications on how Mr. Market will react to election maneuvering and possible outcomes.",
          "link": "https://www.nakedcapitalism.com/2024/07/us-election-risks-and-the-impact-of-trumps-re-election-odds-on-financial-markets.html",
          "publishedOn": "2024-07-17T13:55:06.000Z",
          "wordCount": 5652,
          "title": "US Election Risks and the Impact of Trump’s Re-Election Odds on Financial Markets",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/00-election-.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275002",
          "author": "Yves Smith",
          "description": "Our tawdry daily links: Neanderthal-human contacts, Cuba cancer vaccine, Covid v. exercise, CA power survives swelter, China EVs for EU still? German permanent econ losses, moar Gaza bombing, Lavrov, intel fail, Trump shooting post-mortems, JD Vance, Biden v. Supremes, Amazon enforcing worker attendance",
          "link": "https://www.nakedcapitalism.com/2024/07/links-7-17-2024.html",
          "publishedOn": "2024-07-17T10:55:42.000Z",
          "wordCount": 22470,
          "title": "Links 7/17/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/Screen-Shot-2024-07-17-at-4.30.22-PM.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275130",
          "author": "Yves Smith",
          "description": "How concept anchoring creates attachment to and supports funding for not-so-hot ideas, such as in Alzheimer's research.",
          "link": "https://www.nakedcapitalism.com/2024/07/updates-concept-anchoring-in-biomedical-science-and-its-resolution.html",
          "publishedOn": "2024-07-17T10:54:49.000Z",
          "wordCount": 6570,
          "title": "Updates: Concept Anchoring in Biomedical Science and Its Resolution",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/00-MDD.jpg"
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "6690757a58eb3b000a367f33",
          "author": "Noah Crouch",
          "description": "Cloudflare is adding support for end-to-end private traffic flows to our local traffic management (LTM) load balancing solution, and allowing for the replacement of hardware load balancers",
          "link": "https://blog.cloudflare.com/eliminating-hardware-with-load-balancing-and-cloudflare-one",
          "publishedOn": "2024-07-16T13:02:00.000Z",
          "wordCount": 2024,
          "title": "Eliminating hardware with Load Balancing and Cloudflare One",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/Eliminating-hardware-with-Load-Balancing-and-Cloudflare-One-OG-1.png"
        },
        {
          "id": "6694b67558eb3b000a368051",
          "author": "David Belson",
          "description": "Government directed shutdowns and cable cuts were both significant sources of Internet outages in Q2 2024. This post explores these disruptions, as well as others caused by power outages, maintenance, technical problems, military action, and unknown causes",
          "link": "https://blog.cloudflare.com/q2-2024-internet-disruption-summary",
          "publishedOn": "2024-07-16T13:00:01.000Z",
          "wordCount": 4289,
          "title": "Q2 2024 Internet disruption summary",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/Q2-2024-Internet-disruption-summary-OG-1.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": []
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=21495",
          "author": null,
          "description": "What happens when a team of mechanical engineers get tired of looking at flat images of 3D models over Zoom? Meet the team behind Caddy, a new CAD app for mixed reality. They join Pascal Hartig (@passy) on the Meta Tech Podcast to talk about teaching themselves to code, disrupting the CAD software space, how [...]\nRead More...\nThe post Meet Caddy – Meta’s next-gen mixed reality CAD software appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/07/18/virtual-reality/caddy-cad-mixed-reality-mr-meta/",
          "publishedOn": "2024-07-18T13:00:26.000Z",
          "wordCount": 1598,
          "title": "Meet Caddy – Meta’s next-gen mixed reality CAD software",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/07/Meta-Tech-Podcast-Caddy.webp"
        },
        {
          "id": "https://engineering.fb.com/?p=21470",
          "author": null,
          "description": "The key to developer velocity across AI lies in minimizing time to first batch (TTFB) for machine learning (ML) engineers. AI Lab is a pre-production framework used internally at Meta. It allows us to continuously A/B test common ML workflows – enabling proactive improvements and automatically preventing regressions on TTFB.  AI Lab prevents TTFB regressions [...]\nRead More...\nThe post AI Lab: The secrets to keeping machine learning engineers moving fast appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/07/16/developer-tools/ai-lab-secrets-machine-learning-engineers-moving-fast/",
          "publishedOn": "2024-07-16T16:00:51.000Z",
          "wordCount": 2885,
          "title": "AI Lab: The secrets to keeping machine learning engineers moving fast",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/07/AI-Lab-Hero2.png"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=40995658",
          "author": "phpnode",
          "description": "The author of this article has a reputation for an incredible sense of self-entitlement, he's the person who tried to do a hostile takeover of Redis after making a few minor contributions[0]. In light of that it's not too surprising that he's finding it difficult to find a job that meets his expectations.\n[0] https://news.ycombinator.com/item?id=9176800",
          "link": "https://news.ycombinator.com/item?id=40995658",
          "publishedOn": "2024-07-18T13:59:53.000Z",
          "wordCount": 506,
          "title": "New comment by phpnode in \"Panic at the Job Market\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40992756",
          "author": "weatherlite",
          "description": "Sometimes I feel really bummed out I am getting 1/2 (or less?) of Google compensation. But then I open my eyes - see the workers in my daughter's kindergarten slaving away taking care of 30 toddlers for less than half what I make, nurses and doctors working in conditions I wouldn't be able to tolerate for more than a few months without mentally collapsing, the people in the supermarkets, gas stations, police, fire departments, social workers, teachers etc etc.\nReally I don't see what we have to complain about - whether its a 3 man startup with \"low\" compensation or anything else. \nYou're getting paid for solving code riddles the whole day.  You're getting paid a lot. Quit comparing yourself to your friends that work in Google and try to learn how to cultivate a peaceful and happy mind.",
          "link": "https://news.ycombinator.com/item?id=40992756",
          "publishedOn": "2024-07-18T05:29:20.000Z",
          "wordCount": 3306,
          "title": "New comment by weatherlite in \"Panic at the Job Market\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40991915",
          "author": "justinclift",
          "description": "For Nvidia, the most likely reason they've strongly avoided Open Sourcing their drivers isn't anything like that.\nIt's simply a function of their history. They used to have high priced professional level graphics cards (\"Nvidia Quadro\") using exactly the same chips as their consumer graphics cards.\nThe BIOS of the cards was different, enabling different features. So people wanting those features cheaply would buy the consumer graphics cards and flash the matching Quadro BIOS to them. Worked perfectly fine.\nNvidia naturally wasn't happy about those \"lost sales\", so began a game of whack-a-mole to stop BIOS flashing from working. They did stuff like adding resistors to the boards to tell the card whether it was a Geforce or Quadro card, and when that was promptly reverse engineered they started getting creative in other ways.\nMeanwhile, they couldn't really Open Source their drivers because then people could see what the \"Geforce vs Quadro\" software checks were. That would open up software countermeasures being developed.\n---\nIn the most recent few years the professional cards and gaming cards now use different chips. So the BIOS tricks are no longer relevant.\nWhich means Nvidia can \"safely\" Open Source their drivers now, and they've begun doing so.\n--\nNote that this is a copy of my comment from several months ago, as it's just as relevant now as it was then: https://news.ycombinator.com/item?id=38418278",
          "link": "https://news.ycombinator.com/item?id=40991915",
          "publishedOn": "2024-07-18T02:07:55.000Z",
          "wordCount": null,
          "title": "New comment by justinclift in \"NVIDIA Transitions Fully Towards Open-Source Linux GPU Kernel Modules\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40988832",
          "author": "klyrs",
          "description": "As a literal graph theorist, I cannot tell you how frustrating it is that (a) nobody seems to understand my work except (b) interviewers use it as a shibboleth to exclude people from jobs that will never need high performance graph algorithms.  That, I never get called for these interviews because I don't use react angles or something, but if they did, I'd crush the interview and fall asleep at my desk once they start giving me work.",
          "link": "https://news.ycombinator.com/item?id=40988832",
          "publishedOn": "2024-07-17T18:28:14.000Z",
          "wordCount": 3171,
          "title": "New comment by klyrs in \"Panic at the Job Market\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40988609",
          "author": "bmitc",
          "description": "> Most jobs are now hoops after hoops, not taking into consideration your particular profile or the contributions you can make.\nThis is really key. I have applied for jobs before, and then get questions like: \"what's your experience with C++ or advanced graph algorithms?\". Only that, none of that shows up in my profile or resume. But they act surprised and completely shrug off how a decade of software and other relevant experience is suddenly invalidated. As in, a person who has used and learned a dozen plus languages but only tacitly used C++ suddenly will be a complete invalid when trying to write in C++? Another company advertised that Python experience wasn't needed, but then the first phone interview peppered me with low-level Python implementation questions. Why even bother to interview me? It's a waste of everyone's time.\nWhat it boils down to is that companies have zero idea how to hire. And they have zero idea how to mentor and train, basically for the exact same reasons for why they don't know how to hire.\nWhile tough, it's often a good thing for the applicant as a natural filter. If someone can't hire well, it's not a good place to work. Sometimes it is, but it's relatively rare.",
          "link": "https://news.ycombinator.com/item?id=40988609",
          "publishedOn": "2024-07-17T18:05:10.000Z",
          "wordCount": 15094,
          "title": "New comment by bmitc in \"Panic at the Job Market\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40988078",
          "author": "ykl",
          "description": "I unapologetically love this thing. It's of course very silly, and I'm sure commenters here are going to talk about all the ways that it isn't practical or that it's a niche idea, but I love whimsical silly niche hardware ideas that make it into actual hardware. I love that they put in all of the effort to figure out a mechanical linkage between the clickwheel and the digital crown!\nI don't think all hardware needs to be take-over-the-world hundred-million-unit ideas; I think sometimes it's fine for hardware to be whimsical niche things like this Apple Watch case or Andrew McCalip's doomscroller doo-dad [1]!\n[1] https://doomscroller.xyz",
          "link": "https://news.ycombinator.com/item?id=40988078",
          "publishedOn": "2024-07-17T17:15:41.000Z",
          "wordCount": 2059,
          "title": "New comment by ykl in \"TinyPod – Apple Watch case with scroll wheel\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40988032",
          "author": "mrbluecoat",
          "description": "> logs include:\nYour precise GPS locations (which are also sent to their servers).\nYour WiFi network name.\nThe IDs of nearby cell towers (even with no SIM card inserted, also sent to their servers).\nYour internet-facing IP address.\nThe user token used by the device to authenticate with Rabbit's back-end API.\nBase64-encoded MP3s of everything the Rabbit has ever spoken to you (and the text transcript thereof).\nNasty :0",
          "link": "https://news.ycombinator.com/item?id=40988032",
          "publishedOn": "2024-07-17T17:11:36.000Z",
          "wordCount": null,
          "title": "New comment by mrbluecoat in \"Jailbreaking RabbitOS\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40988004",
          "author": "0vermorrow",
          "description": "It's funny how we went from using iPod Nano as a watch with a third party case, to using an Apple Watch  as an iPod Nano with a third party case.",
          "link": "https://news.ycombinator.com/item?id=40988004",
          "publishedOn": "2024-07-17T17:09:00.000Z",
          "wordCount": 567,
          "title": "New comment by 0vermorrow in \"TinyPod – Apple Watch case with scroll wheel\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40987804",
          "author": "scottLobster",
          "description": "There's coding interviews and coding interviews.\nAsking basic questions that will be directly applicable to the job?  Sure\nFiltering for basic knowledge to make sure the candidate isn't lying about their experience?  Sure.\nExamining my thought process and producing working code is a nice-to-have?  Sure.\nAsking me to solve an extremely esoteric problem that has zero relevance to my day-to-day and if the solution I come up with on the spot under time pressure is incorrect or even just not the most efficient I'm rejected?  At that point you're just filtering for starry-eyed recent grads you can underpay.",
          "link": "https://news.ycombinator.com/item?id=40987804",
          "publishedOn": "2024-07-17T16:50:07.000Z",
          "wordCount": 15607,
          "title": "New comment by scottLobster in \"Panic at the Job Market\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40987450",
          "author": "caesil",
          "description": ">According to all the interviews I’ve failed over the years (I don’t think I’ve ever passed an actual “coding interview” anywhere?), the entire goal of tech hiring is just finding people in the 100 to 115 midwit block then outright rejecting everybody else as too much of an unknown risk.\nAs a (now) senior/staff-level engineer back out on the job market for the first time in a while, I'm begrudgingly coming to accept that coding interviews might not actually be all that bad. Mostly because I find myself passing them due to having picked up skills in the past few years rather than spending a ton of time studying, which suggests they might actually be picking up some signal. I once thought they were purely hazing with zero relevance to day to day work, but as I get more senior I drift further away from that opinion.",
          "link": "https://news.ycombinator.com/item?id=40987450",
          "publishedOn": "2024-07-17T16:12:50.000Z",
          "wordCount": null,
          "title": "New comment by caesil in \"Panic at the Job Market\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40987413",
          "author": "masterj",
          "description": "There might be some good points buried in this post, but all I get is bitterness without much self-reflection. They seem like they'd be difficult to work with and would blame you for it.",
          "link": "https://news.ycombinator.com/item?id=40987413",
          "publishedOn": "2024-07-17T16:09:46.000Z",
          "wordCount": null,
          "title": "New comment by masterj in \"Panic at the Job Market\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40987359",
          "author": "lovich",
          "description": "I generally like the article but the author seems to have a really inflated view of what jobs are paying. At one point he’s claiming that a stable non tech company like a tractor manufacturer is paying 5k-10k.\nEven assuming that’s including taxes so divide by two, and constraining to just software employees for that claim. There is no way the average pay is nearly a million a year. The average software engineer in the US is making around 135-150k a year and that average is including all the faang engineers with the top end salary",
          "link": "https://news.ycombinator.com/item?id=40987359",
          "publishedOn": "2024-07-17T16:03:12.000Z",
          "wordCount": null,
          "title": "New comment by lovich in \"Panic at the Job Market\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40987331",
          "author": "evrimoztamur",
          "description": "I will add my two cents for people who believe that this might be related only to the SWE and tangent industries: It's really not. I have many friends (in Europe) who are trying to get through to different jobs in unrelated industries ranging from finance to fashion, or just trying to get promoted vertically (or horizontally), failing rather miserably.\nMost jobs are now hoops after hoops, not taking into consideration your particular profile or the contributions you can make. Keep in mind also that a CV in the pile via a job portal is always going to be sediment at the bottom of the barrel. Try to make use of your networks and friends as much as possible.\nAs for my situation, I too feel a bit burned by the diminishing number of tech jobs, as I was in the process of trying to get a job via a software consultancy firm, but remained benched for 8 months. I dropped it, went back to doing corporate and tax valuations. Being underemployed is, thus far, better than nothing at all, especially mentally.\nP.S. Here's a nice little tidbit in the source:\n  \n\nI have to admit, I did slip up on this banana by being a lazy monkey.",
          "link": "https://news.ycombinator.com/item?id=40987331",
          "publishedOn": "2024-07-17T16:00:57.000Z",
          "wordCount": null,
          "title": "New comment by evrimoztamur in \"Panic at the Job Market\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40984859",
          "author": "tomeraberbach",
          "description": "Hey folks, I'm the engineer who implemented the new feature. Just clearing up some confusion.\nA lot of you are noticing the preexisting automatic detection feature from 2022 [1], which I also worked on. That's NOT what this newly announced feature is. The new feature supports full import/export, but it's still rolling out so you're likely not seeing it yet!\nHope you like it once it reaches you :)\n[1] https://workspaceupdates.googleblog.com/2022/03/compose-with...",
          "link": "https://news.ycombinator.com/item?id=40984859",
          "publishedOn": "2024-07-17T11:53:17.000Z",
          "wordCount": null,
          "title": "New comment by tomeraberbach in \"Import and Export Markdown in Google Docs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40981844",
          "author": "mrandish",
          "description": "I believe a great product in this area is certainly possible and Karpathy probably has the technical chops to create it.\nI'm skeptical that the product described in the announcement will result in a business able to generate VC-level returns. Based on my experience as a tech entrepreneur with edu-focused products across multiple startups and decades, scaling sales revenue to significant levels in edu is extremely challenging for unique and non-obvious reasons. None of the edu-specific challenges are directly related to the effectiveness or relative value of the product itself. They are structural problems related to the three main types of buyers, which are: 1. Schools, (K-12, Univ), 2. Companies (employee training, compliance, etc), 3. Individuals (self-learners). There are other types of…",
          "link": "https://news.ycombinator.com/item?id=40981844",
          "publishedOn": "2024-07-17T01:30:12.000Z",
          "wordCount": null,
          "title": "New comment by mrandish in \"I am starting an AI+Education company\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40980299",
          "author": "KothuRoti",
          "description": "My personal experience with story points is that the number never really mattered, but the process of the team discussing how to rate the complexity of a task was very useful. In terms of having utility of estimating how long something will take, I personally have never been able to translate story points into a reliable indicator for that for many reasons (e.g team changing, domain changing, variability in operational load outside of development work).\nOverall I tend to avoid using story points, but on the few teams I worked on who really wanted to use it, I always framed it around building shared understanding rather than a metric that is actually useful for estimating work.",
          "link": "https://news.ycombinator.com/item?id=40980299",
          "publishedOn": "2024-07-16T21:02:40.000Z",
          "wordCount": null,
          "title": "New comment by KothuRoti in \"Story points are pointless, measure queues\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40980229",
          "author": "whyoh",
          "description": "This kinda reminds me of a feature Windows (Phone) used to have, where it would share your Wi-Fi password with the device's contacts automatically. To opt-out you had to add _optout to the SSID name. https://www.theregister.com/2015/06/30/windows_10_wi_fi_sens...\nIt looks like this feature was removed eventually, but it's just one of those tasteless things that MS does every once in a while.",
          "link": "https://news.ycombinator.com/item?id=40980229",
          "publishedOn": "2024-07-16T20:52:27.000Z",
          "wordCount": null,
          "title": "New comment by whyoh in \"Stop Microsoft users sending 'reactions' to email by adding a postfix header\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40979009",
          "author": "MarcScott",
          "description": "I think teaching is one of the few roles that can't be replaced by AI. If you're a self-motivated learner, eager to gain new skills, then AI is perfect for you. Having a virtual Feynman coach you through a Physics course is perfect.\nMost learners, the world over, are not self-motivated. The pandemic showed us exactly what children would prefer to do, when they don't have a physical teacher standing over them, which is bugger all. We send kids to school, in the hope they get some education, but the reality is that we use schools for free childcare while we work. If parents have to additionally monitor their child's learning, it breaks down pretty quickly.\nI see AI being more of a teaching assistant, rather than a replacement for teachers. Having been in the education game for over twenty five years, I know the difference in impact when comparing virtual learning to in-person training.",
          "link": "https://news.ycombinator.com/item?id=40979009",
          "publishedOn": "2024-07-16T18:29:21.000Z",
          "wordCount": null,
          "title": "New comment by MarcScott in \"I am starting an AI+Education company\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40975303",
          "author": "temporarely",
          "description": "Enough of this waiting for virtuous entities to address legitimate concerns of the public.\nThe \"ad industry\" is a cancer and we need legal protection against this \"industry\". The solution is political not technical and definitely can not be left to \"the market\".\nHaven't you had enough?",
          "link": "https://news.ycombinator.com/item?id=40975303",
          "publishedOn": "2024-07-16T10:51:14.000Z",
          "wordCount": null,
          "title": "New comment by temporarely in \"For advertising, Firefox now collects user data by default\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40974860",
          "author": "latexr",
          "description": "> It’s clear in retrospect that we should have communicated more on this one\nWhat isn’t clear, in retrospect or otherwise, is why companies/apps/services need to keep learning this lesson. The user outcry was utterly predictable from even before the first web article was out. The fact that no one with decision power at Mozilla saw it coming is worrying: either they have zero understanding of people’s concerns for privacy or they don’t care. Neither is good.",
          "link": "https://news.ycombinator.com/item?id=40974860",
          "publishedOn": "2024-07-16T09:28:00.000Z",
          "wordCount": null,
          "title": "New comment by latexr in \"For advertising, Firefox now collects user data by default\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40974648",
          "author": "crimsoneer",
          "description": "As someone who used to be a cop, this is absolute peak cops justifying the evidence not supporting their intuition by just making bullshit up.\nIf it actually worked, they'd have data and results.  But, spoilers, they don't.",
          "link": "https://news.ycombinator.com/item?id=40974648",
          "publishedOn": "2024-07-16T08:43:30.000Z",
          "wordCount": null,
          "title": "New comment by crimsoneer in \"The Delusion of the Polygraph\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40974286",
          "author": "quadhome",
          "description": "Except there is no evidence it helps even “good” interviewers “extract” anything resembling truth. And there is lots of evidence it does not.\nThis comment is a perfect study of this almost uniquely American insane phenomenon.\nBut then I don’t question Koreans about fan death.",
          "link": "https://news.ycombinator.com/item?id=40974286",
          "publishedOn": "2024-07-16T07:19:23.000Z",
          "wordCount": null,
          "title": "New comment by quadhome in \"The Delusion of the Polygraph\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40972590",
          "author": "jimt1234",
          "description": "I worked at a PBM back in the late-90s/early-2000s. It was where I was introduced to the value of customer data and the strange world of lawyers, all in a single corporate meeting:\n- The company is launching a new service. We already sell customer drug-prescription data to drug companies, and the drug companies analyze this data to understand where/when/why/to-whom their drugs are being prescribed. Now we're going to help the drug companies advise doctors on where/when/why/to-whom they prescribe drugs.\n- Sounds great. Where do we come in?\n- The new service will act as a middleman, processing payments from drug companies to doctors.\n- So, a service to manage kickbacks?\n[Meeting room full of suits goes silent.]\n- The payments aren't \"kickbacks\". They're \"rebates\".\n- Is there a difference?\n- Absolutely. [silence]\n- So...what's the difference?\n- Please be sure to only use the term \"rebate\" in all communications, especially email. Never use the term \"kickback\".\nAnd that was pretty much it. The company processed prescriptions for pharmacies, then sold that data to drug companies, who in turn used that data to provide kickbacks to doctors for pushing their drugs over a competitor. And it was all legal, thanks to the lawyers and their select word usage. Oh, and I think we weren't supposed to use the term \"middleman\", either.",
          "link": "https://news.ycombinator.com/item?id=40972590",
          "publishedOn": "2024-07-16T00:12:46.000Z",
          "wordCount": null,
          "title": "New comment by jimt1234 in \"The Mafia of Pharma Pricing\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40970717",
          "author": "modeless",
          "description": "A lot of people think AMD should support these translation layers but I think it's a bad idea. CUDA is not designed to be vendor agnostic and Nvidia can make things arbitrarily difficult both technically and legally. For example I think it would be against the license agreement of cuDNN or cuBLAS to run them on this. So those and other Nvidia libraries would become part of the API boundary that AMD would need to reimplement and support.\nChasing bug-for-bug compatibility is a fool's errand. The important users of CUDA are open source. AMD can implement support directly in the upstream projects like pytorch or llama.cpp. And once support is there it can be maintained by the community.",
          "link": "https://news.ycombinator.com/item?id=40970717",
          "publishedOn": "2024-07-15T19:22:27.000Z",
          "wordCount": null,
          "title": "New comment by modeless in \"Run CUDA, unmodified, on AMD GPUs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40956186",
          "author": "munificent",
          "description": "Author here. Seeing all of the positive comments about my book is really warming my heart. I appreciate everyone and I'm glad so many people have enjoyed the book. I put a ton of time and love into it and it's gratifying to see it had the effect I'd hoped for.",
          "link": "https://news.ycombinator.com/item?id=40956186",
          "publishedOn": "2024-07-13T19:17:42.000Z",
          "wordCount": null,
          "title": "New comment by munificent in \"Crafting Interpreters\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40951316",
          "author": "Sean-Der",
          "description": "I wrote this to solve a few things I cared about.\n* I want to show people that native WebRTC players can be a thing. I hope this encourages hangouts/discord/$x to implement WHIP and WHEP it would let people do so much more\n* I wanted to make low latency sharing easier. I saw the need for this working on adding WebRTC to OBS and Broadcast Box[0]\n* I wanted to show devs what a great ecosystem exists for WebRTC. Lots of great implementations in different languages.\n* Was a bit of a ‘frustration project’. I saw a company claiming only their proprietary protocol can do latency this low. So I thought ‘screw you I will make an open source version!’\n[0] https://github.com/glimesh/broadcast-box",
          "link": "https://news.ycombinator.com/item?id=40951316",
          "publishedOn": "2024-07-13T02:34:44.000Z",
          "wordCount": null,
          "title": "New comment by Sean-Der in \"Show HN: 30ms latency screen sharing in Rust\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40951259",
          "author": "simpaticoder",
          "description": "The benefit of journaling is not just reentry, but that you begin to solidify the mental model into a concrete branching of possibilities that is tightly coupled to the specific problem. Your work becomes traversal and mutation of this tree. Several benefits accrue: you begin to see gaps in the tree, and can fill them in. You begin to have confidence in your mental model, recovering the time you used to spend going over the same nodes again and again in a haphazard way. In distributed systems in particular, the work is often detailed, manual, error prone and high latency - with a solid mental model you can get through a checklist of steps with minimum difficulty and high confidence that you didn't miss anything. This ability to take something abstract and make it more concrete on the fly is a critical skill.\nPerhaps the greatest barrier to using it is akin to envy. We see others who apparently do this without written materials, in their head. I think we see this as evidence of intellectual superiority and harbor the doubt that using an aid like a journal means we are somehow lacking in skill or ability. This is wrong. Using an aid to map out complex problems isn't a failure, it's essential, especially for problems in systems you've never used before. Over time you may yourself build up your expertise such that you no longer need the aid, but  that doesn't signal anything about your intelligence or ability either, only your experience.",
          "link": "https://news.ycombinator.com/item?id=40951259",
          "publishedOn": "2024-07-13T02:20:25.000Z",
          "wordCount": null,
          "title": "New comment by simpaticoder in \"Use a work journal\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40950716",
          "author": "trompetenaccoun",
          "description": "It surprises me that there isn't a single comment pointing out that corporations like AT&T don't collect all that data for fun. This actually costs them a lot of money, but they're legally required by the government. While everyone is blaming the company, did you not take a second and contemplate how weird it is that you're fine with the government (and now everyone else es well) getting a record of all your phone activity? I'm old, back in my youth we'd have referred to that as a dystopian surveillance state.",
          "link": "https://news.ycombinator.com/item?id=40950716",
          "publishedOn": "2024-07-13T00:28:10.000Z",
          "wordCount": null,
          "title": "New comment by trompetenaccoun in \"AT&T says criminals stole phone records of 'nearly all' customers in data breach\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40949629",
          "author": "academia_hack",
          "description": "Until the US federal government pays civilian tech talent competitively, this is always going to be an issue.\nYour typical hands-on-keyboard blue team engineer in federal government is a GS-12 getting paid around $68,000 per year (or $99k in very high cost of living areas like DC). They have expensive health benefits, 13 days of PTO a year, put a huge chunk of their paycheck (almost 5%) into a mandatory pension plan that consistently underperforms the market, and can literally go to jail for making mistakes at work depending on the statutory context they work in.\nThe best people in these jobs burn out fast and quit or they end up having to abandon IC work for GS-14/15 jobs (max pay is around $190 for those) in order to keep up with cost-of-living and justify their careers.\nAs a result, you have almost zero genuinely capable principal/senior engineers in government who have the authority to architect complex IT systems for security. Instead you get contractors who charge the taxpayers enormous overhead costs and cut corners wherever possible.\nIf there's one letter to write your congress person to improve government - my vote would be for civil service reform to attract and retain actual top tech talent. They've done it for doctors and lawyers (both of whom can get paid well above the $190k GS pay ceiling), but engineering is still not treated as a comparably skilled professional trade.",
          "link": "https://news.ycombinator.com/item?id=40949629",
          "publishedOn": "2024-07-12T21:30:24.000Z",
          "wordCount": null,
          "title": "New comment by academia_hack in \"CISA broke into a US federal agency, and no one noticed for a full 5 months\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40949181",
          "author": "whyenot",
          "description": "AT&T has 110 million customers. Let's be optimistic and assume that each customer only has to spend one minute of extra time managing their account due to the break-in. That is more than 209 years of lost time.\nLaws related to data breaches need to have much sharper teeth. Companies are going to do the bare minimum when it comes to securing data as long as breaches have almost no real consequences. Maybe pierce the corporate veil and criminally prosecute those whose negligence made this possible. Maybe have fines that are so massive that company leadership and stockholders face real consequences.",
          "link": "https://news.ycombinator.com/item?id=40949181",
          "publishedOn": "2024-07-12T20:37:24.000Z",
          "wordCount": null,
          "title": "New comment by whyenot in \"AT&T says criminals stole phone records of 'nearly all' customers in data breach\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=52864",
          "author": "Chris Bertram",
          "description": "Visit the post for more.",
          "link": "https://crookedtimber.org/2024/07/14/sunday-photoblogging-house-martins/",
          "publishedOn": "2024-07-14T07:28:16.000Z",
          "wordCount": 1708,
          "title": "Sunday photoblogging: house martins",
          "imageUrl": "https://live.staticflickr.com/65535/53823287020_d0db15fffb.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52862",
          "author": "John Q",
          "description": "What to do when we can’t trust our own eyes (or at least, the videos we are looking at. I spoke last weekend at a panel discussion on Navigating Lies, Deepfakes & Fake News, organised by McPherson Independent. This a group promoting the idea of an independent community candidate in the electorate of McPherson south of […]",
          "link": "https://crookedtimber.org/2024/07/14/sex-lies-and-videotape/",
          "publishedOn": "2024-07-14T06:00:40.000Z",
          "wordCount": 4160,
          "title": "Sex, lies and Videotape",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": []
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=8032",
          "author": "disassociated.com",
          "description": "JTR, writing at The Art Of Not Asking Why: Indie blogs are like good spots in town. Sure, they’re on the map, but you need to ask the locals to point them out. In terms of indie blogs, this means other bloggers. Word of mouth is sure a great way to spread the news about […]",
          "link": "https://disassociated.com/to-find-indieweb-more-people-need-know-exists/",
          "publishedOn": "2024-07-17T21:00:08.000Z",
          "wordCount": 389,
          "title": "To find #IndieWeb, more people need to know it exists",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8020",
          "author": "disassociated.com",
          "description": "Stefan Bohacek writing on his Mastodon page: The problem with redesigning your personal website is that it looks great for about a week, and then you start to hate it. This is a problem of the ages. In the late 1990’s I’d redesign my websites (I had several back then) every few weeks. Or what […]",
          "link": "https://disassociated.com/my-personal-website-looks-like-bad-photo-me/",
          "publishedOn": "2024-07-16T21:00:43.000Z",
          "wordCount": 448,
          "title": "Sometimes my personal website looks like a bad photo of me",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8011",
          "author": "disassociated.com",
          "description": "I might be a fan of science-fiction stories, 2001: A Space Odyssey, Star Trek, Star Wars, and the like, but of the seventy-five titles listed by Esquire magazine, on their best sci-fi books of all time, I’ve only read one. The Hitchhiker’s Guide to the Galaxy, by Douglas Adams. That’s it. 1984, by George Orwell? […]",
          "link": "https://disassociated.com/seventy-five-best-sci-fi-books-but-only-ever-read-one/",
          "publishedOn": "2024-07-15T21:00:55.000Z",
          "wordCount": 252,
          "title": "Seventy-five of the best sci-fi books, but I only ever read one",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8007",
          "author": "disassociated.com",
          "description": "Webmentions allow you to notify the publisher of a website that you’ve mentioned, or linked to, one of their pages, from your website or blog. Webmentions are commonly used in the Indie and Small Web communities, and have existed as a W3C recommendation since 2017. But Webmentions have also come to the attention of spammers, […]",
          "link": "https://disassociated.com/webmentions-great-indieweb-unfortunately-spammers/",
          "publishedOn": "2024-07-15T20:30:56.000Z",
          "wordCount": 204,
          "title": "Webmentions, great for IndieWeb, and, unfortunately, spammers",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7997",
          "author": "disassociated.com",
          "description": "Melbourne based Workplace Relations lawyer Paul O’Halloran, writing for the Sydney Morning Herald, on Australian “right to disconnect” workplace laws that come into effect on Monday 26 August 2024: Well, laziness is an increasing trend in the cases I defend for employers. Putting aside pandemic lockdowns where all sorts of things other than work were […]",
          "link": "https://disassociated.com/should-right-disconnect-laws-scrapped-because-lazy-workers/",
          "publishedOn": "2024-07-14T21:00:16.000Z",
          "wordCount": 551,
          "title": "Should right to disconnect laws be scrapped because of lazy workers?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20240717",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20240717",
          "publishedOn": "2024-07-17T22:00:00.000Z",
          "wordCount": 628,
          "title": "Week Ending July 14, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/mutiny-in-bolivia",
          "author": null,
          "description": "The crisis of the MAS.",
          "link": "https://newleftreview.org/sidecar/posts/mutiny-in-bolivia",
          "publishedOn": "2024-07-18T17:23:06.000Z",
          "wordCount": 3042,
          "title": "Sinclair Thomson: &ldquo;Mutiny in Bolivia&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/maria-luisa-pacheco-montanas-1979-trivium-art-history.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/same-blade",
          "author": null,
          "description": "Palestine and Labourism.",
          "link": "https://newleftreview.org/sidecar/posts/same-blade",
          "publishedOn": "2024-07-16T16:03:33.000Z",
          "wordCount": 2523,
          "title": "Daniel Finn: &ldquo;Same Blade&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/GazaProtest-scaled.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/victory-deferred",
          "author": null,
          "description": "France’s new Assembly.",
          "link": "https://newleftreview.org/sidecar/posts/victory-deferred",
          "publishedOn": "2024-07-12T17:24:00.000Z",
          "wordCount": 2491,
          "title": "Serge Halimi: &ldquo;Victory Deferred&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/lepen-scaled.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/washingtonology",
          "author": null,
          "description": "After the debate.",
          "link": "https://newleftreview.org/sidecar/posts/washingtonology",
          "publishedOn": "2024-07-12T14:41:44.000Z",
          "wordCount": 2091,
          "title": "Tim Barker: &ldquo;Washingtonology&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/original.jpg"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://binarydigit.dev/dev-blog/",
          "author": null,
          "description": "It all started with a post on my main blog where I still have the urge to revisit the art of learning software and web tools. Even if they are small things, I want to learn basics again other than simply editing templates or static site generators. I'll keep my main blog for everything else I want to share, but I had to buy-yet-another-domain as a nudge to see if I can seperate this tech space online. I also hope to actually put it on a resume one day.\nI want to focus on fun projects that I might use, such as learning how to create a discord bot, a Twitch bot or overlay, or other tools that I'll use for my current hobbies. I think a to do list of sorts that I come back to now and again is a good start.\n Send a message",
          "link": "https://binarydigit.dev/dev-blog/",
          "publishedOn": "2024-07-18T13:00:00.000Z",
          "wordCount": 720,
          "title": "Hello! A Dev Blog",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/bdev-1721189856.png"
        },
        {
          "id": "https://notes.jeddacp.com/thinking-out-loud-about-my-photos-overload/",
          "author": null,
          "description": "One of the things I’m trying to make a habit of is posting more frequently (or often) in my photoblog page. My posts have always been slightly sporadic, and definitely not consistent since I started that site (last year). Maybe it’s because I have a problem.\nWhen I go on photowalks, or a full day of shooting, I accumulate a lot of photos from that day. I upload all my photos to my external SSD. My folder hierarchy for photos is typically:\nYear > Photos > Camera > Month > Folder Name with date\nSo in some instances that would look something like:\n2004 > Photos > X100V > 07 July > 071724 aWalkInSF\n(Yes, I am a supporter of camelCase instead of snake_case)\nAnyways… my photos are not tagged, and keep their original names. If a particular photo is edited, the original is DSCF3415, and the edited…",
          "link": "https://notes.jeddacp.com/thinking-out-loud-about-my-photos-overload/",
          "publishedOn": "2024-07-17T22:56:00.000Z",
          "wordCount": 1111,
          "title": "Thinking Out Loud About My Photos Overload",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1721256864.png"
        },
        {
          "id": "https://tiramisu.bearblog.dev/goodbye-to-all-that/",
          "author": null,
          "description": "In my last post I didn't finish writing everything I wanted to say before hitting Publish. My posts often get broken up like this in my desire to publish fast and often; when I find a nice place to stop, I put a bow on my draft and send it out, lest I dawdle too long and kill my momentum.\nThat said, this post will be a continuation of sorts. Here are the rest of the thoughts inspired by Misha's post.\nit feels like people are moving forward with their lives, but i’m still stuck at the same place i was when i was when i was 18, choosing a college degree that will change the trajectory of my life.\ni had bigger dreams as a teenager. i wanted to do things—get out more; live a little differently than how my 15 year old self did. instead, i became the type of person who waits for her paycheck twi…",
          "link": "https://tiramisu.bearblog.dev/goodbye-to-all-that/",
          "publishedOn": "2024-07-17T16:49:00.000Z",
          "wordCount": 1194,
          "title": "goodbye to all that",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://rscottjones.bearblog.dev/re-the-privilege-of-optimism/",
          "author": null,
          "description": "Lou's post on the complexities of optimism in the face of personal and global challenges inspired this little riff on optimism.\nDon't apologize for optimism.\nIt's easy to be awash in despair, constant complaints, and unending concern for the future—especially right now, and especially if you spend too much time on the internet. I'm not sure this serves our cause well.\nDo I think that big challenges lie ahead? Oh boy, I sure do. We shouldn't pretend otherwise; you need a clear-eyed view of what you're up against to make the plans necessary to deal with them.\nBut there's no way we'll meet those without optimism.\nBetter futures are made by optimists. Social change happens because of optimism that a better future is indeed possible. Better futures require loads of hard work, and the only way to sustain and accomplish that hard work is to believe that it's possible in the first place. It's the only way you get there. We need optimists.\nI believe that holds true at the personal level, too.\nBe an optimist. Work towards the better future.",
          "link": "https://rscottjones.bearblog.dev/re-the-privilege-of-optimism/",
          "publishedOn": "2024-07-17T13:38:00.000Z",
          "wordCount": 801,
          "title": "Re: The Privilege of Optimism",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://louplummer.lol/the-privilege-of-optimism/",
          "author": null,
          "description": "I think I'm pretty lucky to be an optimist these days about my own life. I'm lucky because having feelings of optimism is rooted deeply in having decent mental health, which through the miracles of modern pharmacology and years and years of practice I have managed to get to. Having endured long years of crushing depression earlier in my 20s, 30s, and 40s, I know what it feels like to be unable to summon optimism.\nThere's a lot of privilege in being an optimist. Even if America falls into the racist fascism it looks headed toward, I'm going to look like all the guys on Trump's cabinet, while society's underdogs get to struggle YET AGAIN with a deck stacked against them for their gender, skin color, or sexual orientation. So, this little optimism exercise of mine is rooted in the deeply pers…",
          "link": "https://louplummer.lol/the-privilege-of-optimism/",
          "publishedOn": "2024-07-17T11:30:00.000Z",
          "wordCount": 1170,
          "title": "The Privilege of Optimism",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/livingoutloud-1721163776.jpg"
        },
        {
          "id": "https://therat.bearblog.dev/re-a-life-lived-diligently/",
          "author": null,
          "description": "Hi Misha!\nI've read your post a life lived diligently, and it made me want to write to you.\nWhen I was younger, I dreamed every day of becoming a product designer. I had convinced myself I was going to go study abroad, become self-employed, and the riches and fame would be mine.\npoor, depressed artist aesthetic, after which I would be discovered and prove everyone wrong about not chasing your dreams. My peers would see me on TV and gawk. Grand finale: let the curtain fall; everyone applauds.\nI'm happy to say none of that came true.\nThe truth is, your 20s are a little bit of a bitch. These are the years someone can either be going steady with a child on each hip or they can be partying 'til the sun goes down. Comparison is hard to keep at bay since everyone is going at a different pace and …",
          "link": "https://therat.bearblog.dev/re-a-life-lived-diligently/",
          "publishedOn": "2024-07-17T11:11:15.518Z",
          "wordCount": 1164,
          "title": "Re: a life lived diligently",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://emmasdilemmas.bearblog.dev/emerging/",
          "author": null,
          "description": "Contrary to what the name may suggest, this is not a blog dedicated solely to my problems. As I make my debut into the realm of Bear — thrilled at the thought of reaching other bloggers through the ever-inspiring discovery feed — I must make one thing clear: I love a good rhyme. Sometimes more than logic. And in this case, the tradeoff for choosing a name that rhymes is that the content in my blog won’t always align with the title, and I’m okay with that.\nMy purpose here isn’t to please or to delight; it’s to express — something we rarely get the space to do authentically online. Being here takes a degree of vulnerability for me, but it comes with the gentle comfort of some anonymity.\nHere, I am still Emma as I am in everyday life, but I am also imperceptible behind the words you read. While I plan to share with an open heart and freely exhibit the more anomalous corners of my mind, I know that the stakes are lower than what they seem to be on other platforms, where it often feels like I'm being observed too closely, or slipping into an alter-ego that doesn't truly capture me. Here, it feels like I can say what I want to say without the recurring fear of being perceived or held to a fixed identity. And, no matter who happens to stumble upon the musings of these pages — no matter who thinks what of the words I write — I still intend to make this a space where I can comfortably express whatever may come to the surface of my being.\nAnd so, with a nod of thanks to you, the equally imperceptible reader, and also one to the creator of this charming platform — who happens to be the man I gladly spend my days with — so begins my emergence. Let’s see what this Bear blogness is all about.",
          "link": "https://emmasdilemmas.bearblog.dev/emerging/",
          "publishedOn": "2024-07-17T05:53:00.000Z",
          "wordCount": 831,
          "title": "Emerging",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://usamainsights.com/morning-shower-incident/",
          "author": null,
          "description": "⏱️ Takes about 3 minutes to read \n \n\n___________\n\nYesterday, when I woke up to go for work. I always take a shower & change cloths.\nI was half sleep ironing my pant & shirt while yawning . Then, I went to bathroom to put my cloth on the hooks.\nThe bathroom door look like this ( I kinda trying my hand at pixel art)\n\nThen I remember, I forgot to bring my towel. I went to get my towel and as I was putting the towel on the hook. I saw Grasshopper sitting on that hook .\nMy half sleep state was gone. My brain got in a panic mood, I cant move a muscle or scream. I knew if I did that it will fly and I dont want it to sit on me or near me. I slowly move one step at a time. Then, I slowly put my cloth and swiftly run from the bathroom after opening my door.\nMy grandma saw me shooting like a meteoroid from a bathroom. She worriedly inquired: is everything ok?\nI told her that I saw grasshopper sitting on the door hook. My brother over heard my story as he was ironing cloth from a different room. I asked should I let it flew away or kill it by hitting with besom. He said smash the grasshopper with the besom.\nI cant even say to my bro do it for me. :( Then with a bit of courage, I take a besom in my hand and went to a fight a ferocious battle for a noble cause  of disturbing my morning bath (hahha).\nI was successful in my first strike but he was alive. He start to move that scared the shit out of me. After some more awful hitting it besom he died.\nI felt both awful for killing it but cant have it flying it over my head or in my cloth. I even shudder just thinking about this event.\nReply via email",
          "link": "https://usamainsights.com/morning-shower-incident/",
          "publishedOn": "2024-07-16T17:21:00.000Z",
          "wordCount": 2319,
          "title": "Morning Shower Incident 🦗🦗🦗",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/usamainsights-1721147751.png"
        },
        {
          "id": "https://birming.com/unedited-thoughts/",
          "author": null,
          "description": "I had planned to write a post about which text editor I use and why. Another idea was to write about why my next phone might be a Pixel instead of an iPhone. But it feels so incredibly boring to write about.\nI don't know what it is, but lately these things feel completely pointless to write about. I'm a tech geek, so it's natural for these ideas to come up, but writing serves a different purpose. At least for me.\nAm I saying that writing about technology is \"bad\"? No, of course not. I read blogs like MacRumors and 9to5Google every day with great interest (I used to run similar blogs myself). But that's not what I want to write about, at least not right now.\nNow I like writing mainly for the therapeutic, almost meditative effect it has on me. I write every day, and I find it very rewarding on a personal level.\nThese thoughts also lead me to a topic I've been writing about several times now: my ambivalence toward writing in English. I'm writing this text in Swedish because it's too hard and time-consuming to do it in English (I've tried many times) and then using DeepL to translate it.\nWhy bother with all of that? Well, that's what I'm asking myself.\nIf I'm writing mainly for personal gain, why not just in Swedish? The only thing I can think of is because of the increased attention, which honestly feels like an idiotic argument.\nOk, this was not a text I had planned. Maybe I shouldn't even post it, but that doesn't matter.\nThese are my thoughts here and now, unedited.",
          "link": "https://birming.com/unedited-thoughts/",
          "publishedOn": "2024-07-16T15:09:00.000Z",
          "wordCount": 917,
          "title": "Unedited thoughts",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1717834500-0.jpeg"
        },
        {
          "id": "https://tiramisu.bearblog.dev/lost-dreams/",
          "author": null,
          "description": "This post is inspired by Misha’s post a life lived diligently.\nI started playing the piano when I was five. My first dream was to be a concert pianist like Lang Lang. I was drawn to the glitz and glamor of playing in cavernous concert halls to people in suits sitting on red velvet chairs. I let go of that dream a few years later when it became painfully apparent that I lacked both the talent and the dedication to fulfill it.\nFor a brief period after, I settled on a more realistic goal — playing the viola in a symphony orchestra. There were more orchestras than world-famous concert pianists, after all, and less violists than pianists to go around. I thought it a nice compromise between my childhood fantasies and reality.\nMom pulled the plug on my private lessons when I was seventeen, after …",
          "link": "https://tiramisu.bearblog.dev/lost-dreams/",
          "publishedOn": "2024-07-16T10:02:00.000Z",
          "wordCount": 1341,
          "title": "⭐️ i know love as a fading thing",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://bowlofmisua.bearblog.dev/a-life-lived-diligently/",
          "author": null,
          "description": "two weeks ago, i had an existential crisis so bad, i had to take a leave from work. it was my first ever leave since joining the company in late february. i spent the evening rolling my thoughts around in the darkness of my room.\ni started doing a lot of new things recently.\ngetting back into kpop\nusing actives in my skincare routine to curb my adult acne\nmat pilates at home (i’ve been trying to do them daily, but it’s hard. some days just feel harder than others)\ntrying to lose weight healthily (a point proven difficult by my bulimia that’s graduated to restrictive eating (i barely have any full meals))\nwatching new kdrama to fill up my empty days\nabout the last point: i recently watched because this is my first life. in the show, we meet ji-ho, a 30 something who gave up on her dream to …",
          "link": "https://bowlofmisua.bearblog.dev/a-life-lived-diligently/",
          "publishedOn": "2024-07-16T07:08:00.000Z",
          "wordCount": 1071,
          "title": "a life lived diligently",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://notes.jeddacp.com/on-keeping-a-book-past-its-due-date/",
          "author": null,
          "description": "I consider myself a pretty fast reader. I typically get through a book way before it needs to be returned back on Libby1. I get 21 days to finish a book (although my friends have reported 14 days), and that is usually plenty of time. With that said, I’ve never stressed about finishing a book in time.\nUntil now.\nIt’s taking me forever to finish A Court of Silver Flames by Sarah J. Maas. It’s not that it’s a terrible book but I haven’t been finding enough energy to read lately. I even switched to listening on Spotify Premium, and I’m still not done.\nAnyways.\nThe return due date has come and gone, but I’m still not done with the book. For those who are familiar with the ACOTAR series, it’s pretty popular right now so the wait time is pretty long. I was on hold for several months for each book…",
          "link": "https://notes.jeddacp.com/on-keeping-a-book-past-its-due-date/",
          "publishedOn": "2024-07-15T22:03:00.000Z",
          "wordCount": 1097,
          "title": "On keeping a book past its due date",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1721080785.png"
        },
        {
          "id": "https://passerine.bearblog.dev/cruising/",
          "author": null,
          "description": "it was hard to write anything at all on the cruise ship last may. i'd spend so much of the day walking that by night time my feet were fast asleep before i was. i also generally found that there was so little for me to say. i could only describe X, Y, and Z as “so cool” &  “so interesting” so many times before it got dull. so i’ll say it just once here! each stop was, in fact, so cool and so interesting. i do love good food, old architecture, and scenic views – europe has these aplenty. i just wish i spent more time birdwatching. (but i knew that that would be particularly difficult to do on such a tight schedule).\nhonestly, before my trip, i was 100% convinced i’d hate being on the ocean for such long stretches of time. and this is still partially true now that it's over. i’m prone to motion sickness and i’m afraid of a slow death. i ended up partially bedridden for three days, so i was right to worry about the former. i couldn’t eat anything but apples, and i threw up everytime i moved from my bed. it sucked, but at least i'm not dead.\nwhen i recovered, i discovered that it was ironically grounding to stroll the topmost deck and see nothing but blue and horizon. and that it was especially beautiful at night, even if you couldn't really see the stars at all. instead, i’d watch the water long enough for it to look like a fingerprint. then, even longer to find the unicorns in the sea foam. i found myself returning to the same thought each time: in the grand scheme of all things, i am fortunately very small. i will never run out of earth to explore. nothing is never really just nothing, but nothing feels as good as finally being home too.",
          "link": "https://passerine.bearblog.dev/cruising/",
          "publishedOn": "2024-07-15T15:57:00.000Z",
          "wordCount": 945,
          "title": "cruising",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://dostoynikov.com/finding-peace-in-settling-down-more-than-traveling/",
          "author": null,
          "description": "I guess most of us have been exposed to the promotion of traveling by someone around us at least once in our lives. Like, how traveling around the world, seeing new places, having adventures and visiting museums are important and how life would be so bad without those.\nAlright, I know they are not bad activities at all and they might be one of the ways to enrich our inner selves. But traveling is neither holy nor sacred.\nIn my 20s, I loved exploring new places. I hitchhiked around Eastern Europe, rode my touring bicycle along the coast in western Türkiye and went on numerous camping trips. Back then, these activities gave me a sense of freedom and the joy of meeting interesting people. Nowadays, these activities no longer bring me the same enjoyment.\nThese days, I do not enjoy traveling an…",
          "link": "https://dostoynikov.com/finding-peace-in-settling-down-more-than-traveling/",
          "publishedOn": "2024-07-14T20:35:00.000Z",
          "wordCount": 1113,
          "title": "Finding peace in settling down more than traveling",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://blog.avas.space/online-interactions/",
          "author": null,
          "description": "The longer I am off of any social media and not constantly bombarded with the language and digital mannerisms inherent to it, the more I notice how odd it feels to detect that kind of language in others outside of those timelines and feeds.\nI am active in very few Discord servers and most of them are small, friends-only groups. However, in the few public ones I am in, I often see groups of people whose choices of words and how to express themselves, how to enter conversations, their tone and views make them feel eerily... unreal. I've thought about it, and the best way I could describe it is as if someone trained AI on the most active Twitter users. There is a specific flavor of overly cool, casually careless, sarcastic, flippant, at times vitriolic undertone to everything that is hard to …",
          "link": "https://blog.avas.space/online-interactions/",
          "publishedOn": "2024-07-14T07:02:00.000Z",
          "wordCount": 1680,
          "title": "my issue with online interactions",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/avas-1709500835-0.png"
        },
        {
          "id": "https://monocyte.bearblog.dev/im-ditching-spotify/",
          "author": null,
          "description": "spotify is legal piracy. you can listen to most of your music by just paying a small amount and most of that doesn't go to the artist. hell with the rise of AI, enshittification got to a level that it never has before. I just don't want to be a part of that anymore.\nthere is also another reason I'm doing this. having physical files of your collection feels great. you can take your music collection anywhere you want, convert it to any format you wish and use any music player you fancy. it is at times a bit time consuming but I enjoy growing my collection and not having to throw money at a faceless company just to keep listening to my music.\n\nhow I manage it\nI download most of my music as flacs then convert it to opus at 160kbps. the ones I couldn't get as flacs stay as mp3s. I store them in an SD card and use poweramp as my music app. I am not really settled on it yet, so recommendations are welcome.\nI use last.fm and regular old internet browsing for recommendations. I never really used spotifys recommendation algorithm to begin with, because i value a passionate music fans words more than an algorithm.\nnotes\nyou can also take a look at kit's post for an artists perspective on why spotify is shitty as a platform. kit puts it into words better than I ever could.\nreply via email\nliked this post? you can follow my rss feed for more. i'd also appreciate if you toasted this post below.  🍞",
          "link": "https://monocyte.bearblog.dev/im-ditching-spotify/",
          "publishedOn": "2024-07-13T11:17:37.602Z",
          "wordCount": 1391,
          "title": "I'm ditching spotify",
          "imageUrl": "https://i.ibb.co/B2pyVGQ/images-1.jpg"
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/2022-towards-an-especifista-feminism-in-north-america?v=1721210769",
          "author": null,
          "description": "Author: Various Authors\nTitle: Towards an Especifista Feminism in North America\nDate: 2022\nSource: Scanned from a zine.\n\nIntroduction\nTO BEGIN...\n “We recognize that the feminist camp has made great efforts, by revealing the mechanisms that oppress women and dissidence, and by naming issues that used to be invisible. However, this does not mean that the concepts and categories, and therefore the theoretical frameworks, are all equally valid. As especifist anarchists we task ourselves with taking from these theoretical productions, the concepts and categories that are consistent with our own ideology. Referring to the guiding principles of other currents will not only lead us down a different ideological path but also have concrete effects on the militancy, on the political level as on the …",
          "link": "https://theanarchistlibrary.org/library/2022-towards-an-especifista-feminism-in-north-america?v=1721210769",
          "publishedOn": "2024-07-17T10:06:09.000Z",
          "wordCount": 3145,
          "title": "Various Authors - Towards an Especifista Feminism in North America",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "14864",
            "url": "https://theanarchistlibrary.org/library/2022-towards-an-especifista-feminism-in-north-america.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/leo-tolstoy-three-deaths-bain-translation?v=1721203105",
          "author": null,
          "description": "Author: Leo Tolstoy\nTitle: Three Deaths\nDate: 1859\nNotes: Translated by Robert Nisbet Bain and published in 1902.\nSource: <revoltlib.com/anarchism/three-deaths-bain-translation-tolstoy-leo>\n\nI.\n It was Autumn. A carriage and a calesche were proceeding at a sharp trot along the high-road. In the carriage sat two women. One of them was the mistress, thin and pale. The other was the maid, smug, florid, and buxom. Her short dry tresses peeped forth from under her faded bonnet, her pretty hand in her torn glove readjusted them from time to time; her swelling bosom, covered by a rug, was full of the breath of health; her quick black eyes glanced at one moment out of the window at the scurrying fields, at another stared boldly at her mistress, or glanced uneasily at the corners of the carriage. B…",
          "link": "https://theanarchistlibrary.org/library/leo-tolstoy-three-deaths-bain-translation?v=1721203105",
          "publishedOn": "2024-07-17T07:58:25.000Z",
          "wordCount": 5930,
          "title": "Leo Tolstoy - Three Deaths",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "19529",
            "url": "https://theanarchistlibrary.org/library/leo-tolstoy-three-deaths-bain-translation.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anonymous-words-and-history-mean-things-a-response-to-addicted-to-losing?v=1721164918",
          "author": null,
          "description": "Author: Anonymous\nTitle: Words and History Mean Things\nSubtitle: A Response to “Addicted to Losing”\nDate: 2024-05-02\nSource: Retrieved on 2024-07-16 from https://bbnews.noblogs.org/post/2024/05/02/words-and-history-mean-things-a-response-to-addicted-to-losing/\n\n Most of what comes out in the text “Addicted to Losing” is not new. Black anarchists and anti-authoritarians have been critiquing black non-profits, Black academics, Black activists and black authoritarians for years before the 2020 uprising. Black anarchists who have been active PRIOR to 2020 have been deeply aware of these critiques, mainly based on their experiences. We are unsure how connected the author is to Black anti-authoritarians but, best believe Black anarchists been having these conversations. There has been so much ta…",
          "link": "https://theanarchistlibrary.org/library/anonymous-words-and-history-mean-things-a-response-to-addicted-to-losing?v=1721164918",
          "publishedOn": "2024-07-16T21:21:58.000Z",
          "wordCount": 2168,
          "title": "Anonymous - Words and History Mean Things",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "68487",
            "url": "https://theanarchistlibrary.org/library/anonymous-words-and-history-mean-things-a-response-to-addicted-to-losing.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/special/index?v=1721150856",
          "author": null,
          "description": "Are you in and/or from South Asia and literate in a South Asian language? \n Check out the Initiative for a South Asian Anarchist Library and contact us in our chatrooms. \n Also check out our guide on how to add a new language library. \n There are also initiatives for an Arabic, Farsi, and Hungarian anarchist libraries. \n Please contact us to get in touch with these initiatives.",
          "link": "https://theanarchistlibrary.org/special/index?v=1721150856",
          "publishedOn": "2024-07-16T17:27:36.000Z",
          "wordCount": 371,
          "title": "The Anarchist Library",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "4209",
            "url": "https://theanarchistlibrary.org/special/index.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/tony-parker-jane-e-ferrie-health-and-welfare?v=1721112342",
          "author": null,
          "description": "Author: Tony Parker, Jane E Ferrie\nTitle: Health and welfare\nSubtitle: rejecting the state in the status quo — examples of an Anarchist approach\nDate: December 2016\nSource: International Journal of Epidemiology, Volume 45, Issue 6, December 2016, Pages 1754–1758, DOI: 10.1093/ije/dyx001\n\n For most of the 20th century, all mainstream political parties in Western Europe coalesced around the idea that, ultimately, the state should be the chief provider of social welfare and instrument of social reform. Although Feminist, Anti-Racist, Neo-Marxist, Green and other left-leaning critiques were put forward, particularly in the 1970s,[1] criticism of the welfare state has come predominantly from the free-market right. This has culminated in attacks on the direct provision of welfare by the state in…",
          "link": "https://theanarchistlibrary.org/library/tony-parker-jane-e-ferrie-health-and-welfare?v=1721112342",
          "publishedOn": "2024-07-16T06:45:42.000Z",
          "wordCount": 4803,
          "title": "Tony Parker, Jane E Ferrie - Health and welfare",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "56166",
            "url": "https://theanarchistlibrary.org/library/tony-parker-jane-e-ferrie-health-and-welfare.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anonymous-stop-block-cop-city?v=1721110116",
          "author": null,
          "description": "Author: Anonymous\nTitle: Stop Block Cop City!\nDate: 10/25/23\nSource: https://berkmananarchy.noblogs.org/post/2023/10/26/stop-block-cop-city/\n\nTire fire barricade at the AirBnBs!\n Throw a molotov at the PowerPoint Presentations! Dump a smelly bucket of shrimp on the peaceful protest! We’re going to Stop Block Cop City!! \n Why? \n Because I’m mad that they wasted my time with their awful presentation/book-report/thinly-veiled-business-management-double-speak that tried to sell me and a bunch of other anarchists a program of non-violent civil disobedience to stop the police training facility from being constructed in the Old Prison Farm. \nI had to sit through:\n Being told about the history of the movement in a few awful slides \n …know your fucking audience. \n Being told not only about affinity…",
          "link": "https://theanarchistlibrary.org/library/anonymous-stop-block-cop-city?v=1721110116",
          "publishedOn": "2024-07-16T06:08:36.000Z",
          "wordCount": 1367,
          "title": "Anonymous - Stop Block Cop City!",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "82471",
            "url": "https://theanarchistlibrary.org/library/anonymous-stop-block-cop-city.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/uploads/en/thumbnails/a-s-anonymous-stop-block-cop-city-1.jpg.large.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/nim-thorn-traveler-s-guide-to-the-acronym-wasteland?v=1721109436",
          "author": null,
          "description": "Author: Nim Thorn\nTitle: Traveler’s Guide to the Acronym Wasteland\nSubtitle: Tankies and Authoritarian Entryist Groups in Philadelphia\nDate: July 10, 2024\nNotes: From the original post: A general, group-by-group overview of some tankie and authoritarian entryist Left orgs in Philly (though partly relevant to other contexts; many are national groups), to help more autonomous, uncontrollable rebels better understand and defend against their manipulations. Includes some reflections and propositions at the end (‘Anti-Social Social War?’). pdf for reading pdf for printing\nSource: Retrieved on July 15, 2024 from Reeking Thickets Press\n\nFreedom from money, jobs, and education!\nPSL (Party for Socialism and Liberation) and WWP (Workers World Party) and ANSWER Coalition (Act Now to Stop War and End …",
          "link": "https://theanarchistlibrary.org/library/nim-thorn-traveler-s-guide-to-the-acronym-wasteland?v=1721109436",
          "publishedOn": "2024-07-16T05:57:16.000Z",
          "wordCount": 17494,
          "title": "Nim Thorn - Traveler’s Guide to the Acronym Wasteland",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "63081",
            "url": "https://theanarchistlibrary.org/library/nim-thorn-traveler-s-guide-to-the-acronym-wasteland.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/zoe-baker-what-is-the-proletariat?v=1721098268",
          "author": null,
          "description": "Author: Zoe Baker\nTitle: What is the Proletariat?\nDate: 2024/05/10\nSource: Retrieved on 2024-07-16 from <anarchopac.com/2024/05/10/what-is-the-proletariat>\n\n In 1848 Karl Marx and Friedrich Engels published the Manifesto of the Communist Party. It famously ends by declaring, “let the ruling classes tremble at a communist revolution. Proletarians have nothing to lose in it but their chains. They have a world to win. Proletarians of all countries unite!” (Marx and Engels 1996, 30). The word proletariat continues to be used by socialists and communists today. This does not mean that the word is widely understood. Some people use it as a meaningless adjective whereby their ideas, attitudes, and activities are proletarian. Those of people they dislike are bourgeois. Others equate the proletaria…",
          "link": "https://theanarchistlibrary.org/library/zoe-baker-what-is-the-proletariat?v=1721098268",
          "publishedOn": "2024-07-16T02:51:08.000Z",
          "wordCount": 19022,
          "title": "Zoe Baker - What is the Proletariat?",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "55612",
            "url": "https://theanarchistlibrary.org/library/zoe-baker-what-is-the-proletariat.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anonymous-train-to-nowhere?v=1721078644",
          "author": null,
          "description": "Author: anonymous\nTitle: Train To Nowhere\nSubtitle: Call for a week of world wide action and solidarity against the North Bothnia Line, August 11th to 17th, 2024!\nDate: 2024\nSource: https://de.indymedia.org/node/377193\n\n1. THE NORTH BOTHNIA LINE\nWhy aiming at this beast?\n This is a call to action against the North Bothnia Line, a railway just beginning to be built along the coast of Swedish-occupied Sápmi. This project is a continuation of several hundred years of brutal colonization of the peoples and lands in Sápmi. Extractive industries are thriving on the increased demand for raw materials following the so-called “green transition”. This makes them continually stress the importance and urgency of the train line. So do the Swedish State and the European Union. \n The track will be used f…",
          "link": "https://theanarchistlibrary.org/library/anonymous-train-to-nowhere?v=1721078644",
          "publishedOn": "2024-07-15T21:24:04.000Z",
          "wordCount": 2597,
          "title": "anonymous - Train To Nowhere",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "2015744",
            "url": "https://theanarchistlibrary.org/library/anonymous-train-to-nowhere.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/operation-scripta-manent-in-italy-2016-2019?v=1721055788",
          "author": null,
          "description": "Author: Anonymous\nTitle: “Operation Scripta Manent” in Italy 2016-2019\nSubtitle: A collection of news, updates letters, texts and communiques\nDate: 2019\nNotes: This pamphlet has been put together by Act for freedom now. Check actforfree.nostate.net for updates in English.\nSource: <actforfree.nostate.net/wp-content/uploads/2019/06/SCRIPTA-pdf-2019.pdf>. Retrieved on 03/07/2024 from lib.anarhija.net.\n\n Operation ‘Scripta Manent’ is one repressive operation among the many that have already occurred, and continue to occur, against comrades who dare to oppose the Italian State. The pretext here was of trying to find those who have taken part in Informal Anarchist Federation attacks since 2005, but it is also an attempt to destroy all insurrectional conflict in Italy and to cut off any solidarit…",
          "link": "https://theanarchistlibrary.org/library/operation-scripta-manent-in-italy-2016-2019?v=1721055788",
          "publishedOn": "2024-07-15T15:03:08.000Z",
          "wordCount": 16728,
          "title": "Anonymous - “Operation Scripta Manent” in Italy 2016-2019",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "72118",
            "url": "https://theanarchistlibrary.org/library/operation-scripta-manent-in-italy-2016-2019.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/putting-into-practice?v=1721051669",
          "author": null,
          "description": "Author: Anonymous\nTitle: Putting into practice\nSubtitle: Adding to the conversation on anarchist activity in Montreal\nDate: March 21, 2017\nSource: <actforfree.nostate.net/?p=26705>. Retrieved on 03/07/2024 from lib.anarhija.net.\n\n We’d like to respond with our thoughts to a text “Mise en Commun” (Putting in Common) that has been circulated critiquing insurrectionary projects and perspectives in Montreal. We appreciate that the authors of Mise en Common want to elaborate similarities and clarify differences, and move past bad faith. We’re taking this as an occasion to respond and to clarify ideas that we’ve been reflecting on for a few years now. We’ll try to use points of difference with Mise en Commun as an opportunity to delve further into ideas and how they inform practices, rather than…",
          "link": "https://theanarchistlibrary.org/library/putting-into-practice?v=1721051669",
          "publishedOn": "2024-07-15T13:54:29.000Z",
          "wordCount": 12111,
          "title": "Anonymous - Putting into practice",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "43360",
            "url": "https://theanarchistlibrary.org/library/putting-into-practice.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/rain-fire?v=1721051421",
          "author": null,
          "description": "Author: Anonymous\nTitle: Rain & Fire\nSubtitle: Statement from a UK FAI sector\nDate: September 13, 2011\nSource: <actforfree.nostate.net/?p=6304>. Retrieved on 03/07/2024 from lib.anarhija.net.\n\n This text was written during the course of the growing European social war, and our attempts to situate ourselves in the context of that, whilst in the midst of rising fascism, complicity from most of the society and a fractured and divisive anti-capitalist ‘movement’. These scant few pages cannot express the complexity of the various situations being described in any great depth, but we write so that other rebels at the edges can know how it is for us here. As we were putting the final touches to the text, cities in the UK exploded and remain volatile. However this is not an analysis of the riots –…",
          "link": "https://theanarchistlibrary.org/library/rain-fire?v=1721051421",
          "publishedOn": "2024-07-15T13:50:21.000Z",
          "wordCount": 3870,
          "title": "Anonymous - Rain & Fire",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "13294",
            "url": "https://theanarchistlibrary.org/library/rain-fire.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/dan-fischer-an-essay-on-total-liberation?v=1721050642",
          "author": null,
          "description": "Author: Dan Fischer\nTitle: An Essay on Total Liberation\nSubtitle: Marcusean Insights for Catalyzing Transformation\nDate: 2024\nSource: Building Multispecies Resistance Against Exploitation: Stories from the Frontlines of Labor and Animal Rights, edited by Zane McNeill (New York: Peter Lang, 2024)\n\n A 2021 study found that 56% of young people across ten countries believed “humanity is doomed.” The researchers rightly warned against narratives of “individualizing ‘the problem’ of climate anxiety, with suggestions that the best response is for the individual to ‘take action.’” However, they followed with the equally misguided suggestion that “such action needs to be particularly taken by those in power.”[1] Those of us influenced by Frankfurt School theorist Herbert Marcuse’s analysis consider…",
          "link": "https://theanarchistlibrary.org/library/dan-fischer-an-essay-on-total-liberation?v=1721050642",
          "publishedOn": "2024-07-15T13:37:22.000Z",
          "wordCount": 6387,
          "title": "Dan Fischer - An Essay on Total Liberation",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "30253",
            "url": "https://theanarchistlibrary.org/library/dan-fischer-an-essay-on-total-liberation.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/antonis-pastellopoulos-the-beginnings-and-early-ideology-of-cypriot-anarchism?v=1721050234",
          "author": null,
          "description": "Author: Antonis Pastellopoulos\nTitle: The Beginnings and Early Ideology of Cypriot Anarchism\nSubtitle: 'Federation or Death'\nDate: 2022\nNotes: Anarchist Studies 30.1\nSource: https://archive.org/details/05-anarchist-studies-30.1-pastellopoulos\n\nAbstract:\n The article presents a first overview of the emergence and early development of anarchism in the Republic of Cyprus, utilising archival material. It contextualises Cypriot anarchism within the broader wave of political ideas making their appearance after the island’s de-facto partition in 1974, tracing the formation of the first anarchist groups and the circulation of early Cypriot anarchist publications. It moves on to briefly discuss three key historical moments of anarchist political expression, followed by an examination of early Cypri…",
          "link": "https://theanarchistlibrary.org/library/antonis-pastellopoulos-the-beginnings-and-early-ideology-of-cypriot-anarchism?v=1721050234",
          "publishedOn": "2024-07-15T13:30:34.000Z",
          "wordCount": 10416,
          "title": "Antonis Pastellopoulos - The Beginnings and Early Ideology of Cypriot Anarchism",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "38207",
            "url": "https://theanarchistlibrary.org/library/antonis-pastellopoulos-the-beginnings-and-early-ideology-of-cypriot-anarchism.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/antonis-pastellopoulos-cypriot-anarchist-ideology-in-the-post-partitioned-republic-of-cyprus-19?v=1721049994",
          "author": null,
          "description": "Author: Antonis Pastellopoulos\nTitle: Cypriot Anarchist Ideology in the Post-Partitioned Republic of Cyprus (1985 to 1994)\nSubtitle: “Cyprus Belongs to its Mouflons”\nDate: 2017\nSource: Retrieved on 23rd March 2022 from www.grin.com\n\nAbstract\n This dissertation examines the structure of Cypriot anarchist ideology and the way it challenges Greek Cypriot ethnic nationalism, as it developed in the first decade following the partition of the island of Cyprus. It aims to contribute to the understanding of grass root political activity in Cyprus, by examining the early expressions of anarchism in the island. Ideology has been argued to function around the use of key discursive signifiers, through which the mediation of a fixed meaning is structured and social reality is experienced. This research…",
          "link": "https://theanarchistlibrary.org/library/antonis-pastellopoulos-cypriot-anarchist-ideology-in-the-post-partitioned-republic-of-cyprus-19?v=1721049994",
          "publishedOn": "2024-07-15T13:26:34.000Z",
          "wordCount": 14339,
          "title": "Antonis Pastellopoulos - Cypriot Anarchist Ideology in the Post-Partitioned Republic of Cyprus (1985 to 1994)",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "49262",
            "url": "https://theanarchistlibrary.org/library/antonis-pastellopoulos-cypriot-anarchist-ideology-in-the-post-partitioned-republic-of-cyprus-19.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/the-only-possible-administration?v=1720991591",
          "author": null,
          "description": "Author: Anonymous\nTitle: The only possible administration\nSubtitle: The question of cities\nDate: October 4, 2018\nNotes: “L’unica amministrazione possibile. La questione delle città”, “Vetriolo” #1, 2017\nSource: <actforfree.nostate.net/?p=31586>. Retrieved on 03/07/2024 from lib.anarhija.net.\n\n These are times when it seems there are big discussions about the issue of cities, urban areas, about the possibilities of revolt inside them (even of living), of their reformability. Big discussions frequently focused on various topics relating to struggles carried out by many opponents, antagonists, often reformists, sometimes even by enemies of every order and authority; among these issues there is gentrification, a word not so unusual anymore, a word we now want to express some thoughts about. \n …",
          "link": "https://theanarchistlibrary.org/library/the-only-possible-administration?v=1720991591",
          "publishedOn": "2024-07-14T21:13:11.000Z",
          "wordCount": 1722,
          "title": "Anonymous - The only possible administration",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "8106",
            "url": "https://theanarchistlibrary.org/library/the-only-possible-administration.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/long-live-ilya-romanov-cell-explosive-incendiary-device-against-the-premises-of-an-electoral-co?v=1720988282",
          "author": null,
          "description": "Author: ‘Long live Ilya Romanov’ Cell\nTitle: Explosive/incendiary device against the premises of an electoral committee\nSubtitle: In solidarity with Monica Caballero and Francisco Solar\nDate: November 20, 2013\nSource: <actforfree.nostate.net/?p=15603>. Retrieved on 03/07/2024 from lib.anarhija.net.\n\nWe Are not Spectators but Enemies of all Forms of Dominion\n Today we wanted to give vent to a small anarchist impulse by brandishing the weapons of life and the ideas of rebellion. \n As we are convinced that the status quo is being maintained not only by those who hold power but also by the servile attitude of those who tacitly support it, toady we decided to attack polling station 98a in the town of La Reina with an explosive/incendiary device. \n The electoral committee is a piece of the democ…",
          "link": "https://theanarchistlibrary.org/library/long-live-ilya-romanov-cell-explosive-incendiary-device-against-the-premises-of-an-electoral-co?v=1720988282",
          "publishedOn": "2024-07-14T20:18:02.000Z",
          "wordCount": 1932,
          "title": "‘Long live Ilya Romanov’ Cell - Explosive/incendiary device against the premises of an electoral committee",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "10987",
            "url": "https://theanarchistlibrary.org/library/long-live-ilya-romanov-cell-explosive-incendiary-device-against-the-premises-of-an-electoral-co.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/margaret-killjoy-on-socialism-communism-and-anarchism?v=1720973639",
          "author": null,
          "description": "Author: Margaret Killjoy\nTitle: On Socialism, Communism, and Anarchism\nSubtitle: or: an imprecise definition of terms\nDate: July 3, 2024\nSource: Retrieved on 4th July 2024 from margaretkilljoy.substack.com\n\n One time, maybe ten years back, I was on the DC metro with my family. My brother and I were happily talking about the feminist implications of GI Joe, because my brother is cool as hell, when a stranger looked over at my father (not knowing we were related) to complain about how I spoke. \n “They really don’t teach people how to speak English anymore,” the stranger complained. \n I’m not the world’s fighty-est person, but I’ve also never been the world’s least fighty person, so I confronted him immediately. “Oh?!” I asked. “What’s wrong with the way we’re talking?!” \n He went on a tirade…",
          "link": "https://theanarchistlibrary.org/library/margaret-killjoy-on-socialism-communism-and-anarchism?v=1720973639",
          "publishedOn": "2024-07-14T16:13:59.000Z",
          "wordCount": 3113,
          "title": "Margaret Killjoy - On Socialism, Communism, and Anarchism",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "14537",
            "url": "https://theanarchistlibrary.org/library/margaret-killjoy-on-socialism-communism-and-anarchism.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anna-beniamino-right-you-are-if-you-think-you-are?v=1720972888",
          "author": null,
          "description": "Author: Anna Beniamino\nTitle: Right you are… if you think you are\nSubtitle: Reflections and updates on a trial\nDate: March 20, 2018\nSource: actforfree.nostate.net>. Retrieved on 03/07/2024 from lib.anarhija.net.\n\n There’s not much to be said about an episode of repression, after all it’s the simple cyclical occurrence of action and reaction – or even on how repression plays dirty – another well-known fact. At most these are just a few notes on the development of techniques and strategies. \n This I’ll try to do. More than a year after the arrests, with the trial already underway, a crack has opened in the censuring bell jar and the court papers been disclosed in all their misery after the short report on the last issue of Croce Nera and the latest developments on the closure of investigatio…",
          "link": "https://theanarchistlibrary.org/library/anna-beniamino-right-you-are-if-you-think-you-are?v=1720972888",
          "publishedOn": "2024-07-14T16:01:28.000Z",
          "wordCount": 3645,
          "title": "Anna Beniamino - Right you are… if you think you are",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "16133",
            "url": "https://theanarchistlibrary.org/library/anna-beniamino-right-you-are-if-you-think-you-are.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/ccf-consciousness-gangs-sole-baleno-cell-responsibility-claim-for-explosive-attack-on-vehicle?v=1720971716",
          "author": null,
          "description": "Author: CCF — Consciousness Gangs — Sole–Baleno Cell\nTitle: Responsibility claim for explosive attack on vehicle of the Koridallos prisons director (Athens)\nDate: June 10, 2013\nSource: <actforfree.nostate.net/?paged=174>. Retrieved on 03/07/2024 from lib.anarhija.net.\n\nPHOENIX PROJECT\nFreedom for anarchists of praxis incarcerated in Italy\nI ‘Return of the Conspiracy of Cells of Fire from the ashes’\n Only in those moments when our tension for freedom is rejoined with practice do we truly manage to live anarchy, here and now. Unfortunately the dream we carry in our hearts is too great to avoid the risk of finding ourselves up against the monstrous wall of authority raised in defense of the State and Capital. When we really put our life in play, inevitably we end up confronting the hardness t…",
          "link": "https://theanarchistlibrary.org/library/ccf-consciousness-gangs-sole-baleno-cell-responsibility-claim-for-explosive-attack-on-vehicle?v=1720971716",
          "publishedOn": "2024-07-14T15:41:56.000Z",
          "wordCount": 2782,
          "title": "CCF — Consciousness Gangs — Sole–Baleno Cell - Responsibility claim for explosive attack on vehicle of the Koridallos prisons director (Athens)",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "14548",
            "url": "https://theanarchistlibrary.org/library/ccf-consciousness-gangs-sole-baleno-cell-responsibility-claim-for-explosive-attack-on-vehicle.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/cell-of-revolutionary-solidarity-communique-for-the-12-13-january-arson-barrage?v=1720971539",
          "author": null,
          "description": "Author: Cell of Revolutionary Solidarity\nTitle: Communique for the 12–13 January arson barrage\nDate: January 27, 2011\nSource: <actforfree.nostate.net/?p=3553>. Retrieved on 03/07/2024 from lib.anarhija.net.\n\nThe War Is on\n Today more than ever, the fortification of Power and it’s attack against the internal enemy becomes an urgent necessity. Under the fear of the oncoming rebellions and the dynamics that have been developed , mainly in the latest years, the Dominance has to protect it’s interests and will do it. \n So, we ‘r leaving in an unprecedented upsurge of repression and control. Their mechanisms of chasing the enemy are being enforced and enriched in both human and technical level, while their legal arsenal expands and becomes more flexible. The new ‘anti-terror’ law that states thi…",
          "link": "https://theanarchistlibrary.org/library/cell-of-revolutionary-solidarity-communique-for-the-12-13-january-arson-barrage?v=1720971539",
          "publishedOn": "2024-07-14T15:38:59.000Z",
          "wordCount": 2206,
          "title": "Cell of Revolutionary Solidarity - Communique for the 12–13 January arson barrage",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "12773",
            "url": "https://theanarchistlibrary.org/library/cell-of-revolutionary-solidarity-communique-for-the-12-13-january-arson-barrage.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/christos-tsakalos-c-c-f-declaration-on-the-sixth-day-of-the-first-ccf-trial?v=1720971262",
          "author": null,
          "description": "Author: Christos Tsakalos (C.C.F.)\nTitle: Declaration on the Sixth Day of the First CCF Trial\nDate: 2012\nSource: <interarma.info/2012/02/02/dilwsi_xristou_tsakalou_synedriasi6/?lang=en>. Retrieved on 03/07/2024 from lib.anarhija.net.\n\n According to your court indictment, Conspiracy of Cells of Fire is a terrorist organization. But words were never, nor are or will ever be neutral. Words acquire the meaning given by the person who uses them. We do not speak the language of the judges and prosecutors. We speak the language of the hunted who have refused the victimʼs role, the wanted who have not handed themselves in to the authorities, the prisoners who have not caged their will for freedom, the anarchists who have never kneeled in front of Power. Solidarity, Dignity, Urban Guerrilla, Anarch…",
          "link": "https://theanarchistlibrary.org/library/christos-tsakalos-c-c-f-declaration-on-the-sixth-day-of-the-first-ccf-trial?v=1720971262",
          "publishedOn": "2024-07-14T15:34:22.000Z",
          "wordCount": 1157,
          "title": "Christos Tsakalos (C.C.F.) - Declaration on the Sixth Day of the First CCF Trial",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6481",
            "url": "https://theanarchistlibrary.org/library/christos-tsakalos-c-c-f-declaration-on-the-sixth-day-of-the-first-ccf-trial.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/christos-tsakalos-c-c-f-letter-about-persecutory-procedures?v=1720971085",
          "author": null,
          "description": "Author: Christos Tsakalos (C.C.F.)\nTitle: Letter about persecutory procedures\nDate: May 10, 2011\nSource: <actforfree.nostate.net/?p=4537>. Retrieved on 03/07/2024 from lib.anarhija.net.\n\nOn the 27th of April, Christos Tsakalos, for the case of C.C.F. with the upgraded charge of the managerial executive, was transported to the prisons of Koridallos, after a call for appearance at the juridical council, where he denies to appear.\n Today therefore, Wednesday the 27th of April, I announce officially to the juridical authorities, to not “bother me again” with their repeated calls for my presence in the interrogative process, because they will receive my total refusal and my factual contempt. \n There is not even a millimeter of dialogue to be shared with my judges. \n As I have declared repeatedl…",
          "link": "https://theanarchistlibrary.org/library/christos-tsakalos-c-c-f-letter-about-persecutory-procedures?v=1720971085",
          "publishedOn": "2024-07-14T15:31:25.000Z",
          "wordCount": 2417,
          "title": "Christos Tsakalos (C.C.F.) - Letter about persecutory procedures",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "9900",
            "url": "https://theanarchistlibrary.org/library/christos-tsakalos-c-c-f-letter-about-persecutory-procedures.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/safe-boulder-preventing-and-treating-heat-related-illness-while-living-outside?v=1720970438",
          "author": null,
          "description": "Author: SAFE Boulder\nTitle: Preventing and Treating Heat-Related Illness While Living Outside\nDate: July 12th, 2024\nNotes: We created this zine to hand out alongside ice packs and gatorade as a deadly heatwave swept accross our region. At time of posting, that heatwave is continuing east across North America, and more will certainly follow in the coming months and years as the climate crisis worsens. While this zine contains a couple sentences specific to so-called Boulder Colorado, it should still be broadly applicable, and we encourage people to print and distribute it anywhere that’s affected by extreme heat. We note that the advice contained within is not particularly useful without the supplies needed to follow it, and we recommend accompanying this zine with water, electrolyte powder…",
          "link": "https://theanarchistlibrary.org/library/safe-boulder-preventing-and-treating-heat-related-illness-while-living-outside?v=1720970438",
          "publishedOn": "2024-07-14T15:20:38.000Z",
          "wordCount": 1741,
          "title": "SAFE Boulder - Preventing and Treating Heat-Related Illness While Living Outside",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "16679",
            "url": "https://theanarchistlibrary.org/library/safe-boulder-preventing-and-treating-heat-related-illness-while-living-outside.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/crimethinc-against-the-logic-of-the-guillotine?v=1720969174",
          "author": null,
          "description": "Author: CrimethInc\nTitle: Against the Logic of the Guillotine\nSubtitle: Why the Paris Commune Burned the Guillotine—and We Should Too\nDate: April 8, 2019\nSource: Retrieved on June 11, 2019 from https://crimethinc.com/2019/04/08/against-the-logic-of-the-guillotine-why-the-paris-commune-burned-the-guillotine-and-we-should-too\n\n 148 years ago this week, on April 6, 1871, armed participants in the revolutionary Paris Commune seized the guillotine that was stored near the prison in Paris. They brought it to the foot of the statue of Voltaire, where they smashed it into pieces and burned it in a bonfire, to the applause of an immense crowd.[1] This was a popular action arising from the grassroots, not a spectacle coordinated by politicians. At the time, the Commune controlled Paris, which was st…",
          "link": "https://theanarchistlibrary.org/library/crimethinc-against-the-logic-of-the-guillotine?v=1720969174",
          "publishedOn": "2024-07-14T14:59:34.000Z",
          "wordCount": 6084,
          "title": "CrimethInc - Against the Logic of the Guillotine",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "3437612",
            "url": "https://theanarchistlibrary.org/library/crimethinc-against-the-logic-of-the-guillotine.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anonymous-dining-with-vultures?v=1720968254",
          "author": null,
          "description": "Author: Anonymous\nTitle: Dining with Vultures\nSubtitle: Bristol Anarchists & the UK Media\nDate: 2015, February\nSource: Retrieved on July 13, 2024 from https://darknights.noblogs.org/post/2024/07/13/dining-with-vultures-bristol-anarchists-the-uk-media/\n\n The purpose of this piece is to better understanding of mass media’s relationship to rebels (including anarchists of all stripes), in general as well as in the context of a repressive atmosphere in Bristol. As well as raising local specifics, it hopes to encourage stronger awareness around wider issues of representation and counter-insurgency. \n It will speak critically, even harshly when deemed necessary, of some self-professed radicals’ interactions with the establishment – but not out of an impulse for character-assassination. Contrary t…",
          "link": "https://theanarchistlibrary.org/library/anonymous-dining-with-vultures?v=1720968254",
          "publishedOn": "2024-07-14T14:44:14.000Z",
          "wordCount": 5967,
          "title": "Anonymous - Dining with Vultures",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "18661",
            "url": "https://theanarchistlibrary.org/library/anonymous-dining-with-vultures.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/v-s-lozovyi-far-left-agrarianist-peasant-centric-discourse?v=1720782433",
          "author": null,
          "description": "Author: V. S. Lozovyi\nTitle: Far-left agrarianist peasant-centric discourse\nSubtitle: Makhnovist movement\nDate: 2021\nNotes: Excerpted from Party-Political Peasant-Central Discourse in the Day of the Ukrainian Revolution 1917–1921: Ideological Types and Mobilization Possibilites. doi:10.36059/978-966-397-236-7/53-72.\nSource: Retrieved on 12th July 2024 from eprints.cdu.edu.ua\n\n Left and far-left forces dominated the Ukrainian political space. After the February Revolution of 1917, N. Makhno expanded his activities in the south of Ukraine, which turned into a powerful peasant movement. At first, N. Makhno and his movement did not have their own political program. He was strongly influenced by anarchist ideas, but during the revolution an independent ideological search developed in N. Makhno …",
          "link": "https://theanarchistlibrary.org/library/v-s-lozovyi-far-left-agrarianist-peasant-centric-discourse?v=1720782433",
          "publishedOn": "2024-07-12T11:07:13.000Z",
          "wordCount": 2264,
          "title": "V. S. Lozovyi - Far-left agrarianist peasant-centric discourse",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "10081",
            "url": "https://theanarchistlibrary.org/library/v-s-lozovyi-far-left-agrarianist-peasant-centric-discourse.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}