{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "3acab191e810ab04e856c629a911bcd01c319944",
          "author": "Donnie Prakoso",
          "description": "AWS launches Asia Pacific (Thailand) Region with 3 Availability Zones, accelerating cloud adoption. Strategically located to meet data residency needs, it drives innovation across industries. Early AWS adopters in Thailand share transformative success stories. Get started now!",
          "link": "https://aws.amazon.com/blogs/aws/announcing-the-new-aws-asia-pacific-thailand-region/",
          "publishedOn": "2025-01-08T02:30:36.000Z",
          "wordCount": 2083,
          "title": "Announcing the new AWS Asia Pacific (Thailand) Region",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/12/11/RL_Mango__Blog_Thumbnail_800x400.png"
        },
        {
          "id": "4fa89b3af496404ca2ee8f7c6b9813035cee90e6",
          "author": "Prasad Rao",
          "description": "Happy New Year! We are witnessing technology augment human ingenuity in inspiring ways. In the coming years, using technology for positive impact will redefine the way we think about success. Amazon CTO, Dr. Werner Vogels, offers five forward-looking tech predictions for 2025, and beyond: The workforce of tomorrow is mission-driven A new era of energy […]",
          "link": "https://aws.amazon.com/blogs/aws/happy-new-year-aws-weekly-roundup-2025-tech-predictions-llama-3-3-70b-stable-diffusion-3-5-large-custom-billing-view-and-more-january-6-2025/",
          "publishedOn": "2025-01-06T18:12:56.000Z",
          "wordCount": 1664,
          "title": "Happy New Year! AWS Weekly Roundup: 2025 Tech Predictions, Llama 3.3 70B, Stable Diffusion 3.5 Large, custom billing view, and more (January 6, 2025)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/08/13/AWS-WIR-default.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": []
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps & Developer Productivity Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": [
        {
          "id": "1e9253b5106cc05b2207ede3364004b821c94b8d",
          "author": "Marco Frattallone",
          "description": "Introduction Developers, IT Operators, and in some cases, Site Reliability Engineers (SREs) are responsible for deploying and operating infrastructure and applications, as well as responding to and resolving incidents effectively and in a timely manner. Effective incident management requires quick diagnosis, root cause analysis, and implementation of corrective actions. Diagnosing the root cause can be […]",
          "link": "https://aws.amazon.com/blogs/devops/unlocking-aws-console-diagnosing-errors-with-amazon-q-developer/",
          "publishedOn": "2025-01-10T13:58:57.000Z",
          "wordCount": 2980,
          "title": "Unlocking AWS Console: Diagnosing Errors with Amazon Q Developer",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2025/01/10/Slide1.png"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/19ea916be1ed",
          "author": "Netflix Technology Blog",
          "description": "Part 2: Navigating Ambiguity",
          "link": "https://netflixtechblog.com/title-launch-observability-at-netflix-scale-19ea916be1ed?source=rss----2615bd06b42e---4",
          "publishedOn": "2025-01-07T01:25:58.000Z",
          "wordCount": 3246,
          "title": "Title Launch Observability at Netflix Scale",
          "imageUrl": "https://miro.medium.com/v2/da:true/resize:fit:1200/0*YyCLwVKiGE_L6fWb"
        },
        {
          "id": "https://medium.com/p/e67f0aa82183",
          "author": "Netflix Technology Blog",
          "description": "This article is the last in a multi-part series sharing a breadth of Analytics Engineering work at Netflix, recently presented as part of…",
          "link": "https://netflixtechblog.com/part-3-a-survey-of-analytics-engineering-work-at-netflix-e67f0aa82183?source=rss----2615bd06b42e---4",
          "publishedOn": "2025-01-06T19:27:38.000Z",
          "wordCount": 4460,
          "title": "Part 3: A Survey of Analytics Engineering Work at Netflix",
          "imageUrl": "https://miro.medium.com/v2/da:true/resize:fit:1200/0*ar0t2-zF5YVuXnUe"
        }
      ]
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "7d5701991d02108aba8dd83e32c2ee4765f604d5",
          "author": "pmm",
          "description": "This blog was authored by Karthik Rajendran, Senior Solutions Architect (AWS) and Isha Dua, Senior Solutions Architect (AWS).  The software architect’s job is mostly one of trade-offs, weighing the considerations of different approaches and then choosing the one that strikes the best balance. Some architects are surprised to find that, in the AWS Cloud at least, architecting […]",
          "link": "https://aws.amazon.com/blogs/containers/optimize-your-container-workloads-for-sustainability/",
          "publishedOn": "2025-01-06T18:03:30.000Z",
          "wordCount": 3099,
          "title": "Optimize your container workloads for sustainability",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/12/31/Featured-images-for-Containers-Blog-2-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=349843",
          "author": "Josh Frank",
          "description": "On this episode of CounterPunch Radio, Joshua Frank and Erik Wallenberg talk with Kim Kelly and Hamilton Nolan about what to expect in the next four years of Trump and how to build labor power in a world dominated by billionaires.\nKim Kelly is a writer and labor activist based in Philadelphia. She is the author of Fight Like Hell: The Untold History of American Labor.\nHamilton Nolan is a labor journalist who writes regularly for In These Times magazine and The Guardian. His new book is The Hammer: Power, Inequality, and the Struggle for the Soul of Labor. More\nThe post Kim Kelly and Hamilton Nolan: Labor in the Age of Trump appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/kim-kelly-and-hamilton-nolan-labor-in-the-age-of-trump/",
          "publishedOn": "2025-01-10T17:44:10.000Z",
          "wordCount": null,
          "title": "Kim Kelly and Hamilton Nolan: Labor in the Age of Trump",
          "itunes": {
            "duration": "51:44"
          },
          "enclosure": {
            "url": "https://media.blubrry.com/counterpunch_radio/content.blubrry.com/counterpunch_radio/KimandHam.mp3",
            "length": "99326248",
            "type": "audio/mpeg"
          },
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349765",
          "author": "Joshua Frank",
          "description": "As I sit at my desk to write, the light shining through my office window is a distinct orange, and the sky outside is a murky, polluted shade of brown. The air quality is horrendous, and my eyes are dry and itchy. My throat is sore. Two major fires are still raging out of control in Los Angeles, the city I love, with little to no containment. Another has just erupted in Woodland Hills. Fortunately, we're in a safe zone away from the infernos. Many more are not so lucky.\nScrolling through the latest fire updates on social media, I quickly read commenters who are cheering on the flames as if they’ve been ignited to smoke out the wealthy elites from their mansions. They seem gleeful. A few conspiracists I come across believe this is all a planned land grab (by whom I'm unsure), while others spread lies that the shadowy Deep State, the ones behind weather-altering chemtrails, is somehow responsible.  More\nThe post Burn, Hollywood, Burn? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/burn-hollywood-burn/",
          "publishedOn": "2025-01-10T07:01:34.000Z",
          "wordCount": null,
          "title": "Burn, Hollywood, Burn?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349665",
          "author": "Jeffrey St. Clair",
          "description": "There’s nothing so terrifying as a nightmare come to life. The Santa Ana winds have haunted the dreams of southern Angelinos for decades. Like the Chinooks of the Rockies and the Mistrals of the Rhone Valley, these winds play on the mind. They tell you they’re coming for you. They whisper the dangers they bring with them. Van Gogh believed the mistral inflamed his madness. Another kind of madness seems to be inflicting LA, the madness of boundless consumption. More\nThe post Roaming Charges: Hurricane of Fire appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/roaming-charges-hurricane-of-fire/",
          "publishedOn": "2025-01-10T07:00:55.000Z",
          "wordCount": null,
          "title": "Roaming Charges: Hurricane of Fire",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349642",
          "author": "Vijay Prashad",
          "description": "From early December 2024 to early January 2025, the body temperature of eight babies fell below any acceptable amount and they froze to death. This condition is known as hypothermia. The most recent of these children to die, Yousef, was sleeping beside his mother because, as she told Al Jazeera, of the very cold weather. Temperatures in Gaza have fallen to just above freezing, which in the context of a lack of housing, blankets, and warm bedclothes is deadly. Body heat is the only protection, which is minimal for an infant. Yousef’s mother said, “He slept next to me and in the morning I found him frozen and dead. I don’t know what to say. No one can feel my misery. No one in the world can understand our catastrophic situation.” More\nThe post The Children of Gaza Are Freezing to Death appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/the-children-of-gaza-are-freezing-to-death/",
          "publishedOn": "2025-01-10T07:00:54.000Z",
          "wordCount": null,
          "title": "The Children of Gaza Are Freezing to Death",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349822",
          "author": "David Yearsley",
          "description": "On the last Sunday of this past October, a Timothée Chalamet look-alike contest broke out in Washington Square Park in New York City. Dozens of participants and thousands of onlookers thronged to the event and when, in the midst of the proceedings, the famed actor himself appeared the throng went into paroxysms of ecstasy. Seemingly equipped with endless stores of good humor, good looks, and God-given talent, Chalamet made his way through the roiling sea of admirers and impersonators and let himself be photographed with the winner, Miles Mitchell, who had come costumed as Chalamet as Willy Wonka, the title role assumed by the actor in the latest movie remake devoted to the campy chocolatier. More\nThe post Hands, Fingers, Nose and Throat: Re-Doing Dylan appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/hands-fingers-nose-and-throat-re-doing-dylan/",
          "publishedOn": "2025-01-10T06:59:48.000Z",
          "wordCount": null,
          "title": "Hands, Fingers, Nose and Throat: Re-Doing Dylan",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349520",
          "author": "Charles Pierson",
          "description": "Towards the end of Sinclair Lewis’ 1935 novel, It Can’t Happen Here, the fascist dictatorship which has come to power in the US has launched a war of aggression against Mexico. I thought of this as I read that President-Elect Donald Trump has been talking about using US special operations units against Mexican drug cartels.  More\nThe post The Yanquis Are Coming: Trump Threatens a “Soft Invasion” of Mexico appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/the-yanquis-are-coming-trump-threatens-a-soft-invasion-of-mexico/",
          "publishedOn": "2025-01-10T06:57:52.000Z",
          "wordCount": null,
          "title": "The Yanquis Are Coming: Trump Threatens a “Soft Invasion” of Mexico",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349714",
          "author": "Robert Hunziker",
          "description": "Net Zero/2050 Fantasy or Reality may be the most significant issue of the 21st century. Net Zero refers to the balance between the amount of greenhouse gas (GHG), such as CO2, that’s produced and the amount that’s removed from the atmosphere. It can be achieved through a combination of emission reduction and emission removal. The  More\nThe post Net Zero/2050 Fantasy or Reality? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/net-zero-2050-fantasy-or-reality/",
          "publishedOn": "2025-01-10T06:57:38.000Z",
          "wordCount": null,
          "title": "Net Zero/2050 Fantasy or Reality?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349719",
          "author": "Henry Giroux",
          "description": "Before even taking office, Trump has conjured grotesque visions of what he once called the dreams of a “unified Reich.” His delusions of grandeur, disdain for reason and truth, sycophantic worship of billionaires and despots, militarism, and embrace of white supremacy signal the rebirth of authoritarianism on a scale that recalls the horrors of the Third Reich, Pinochet’s Chile, and Putin’s Russia. More\nThe post Beyond the Illusion: The Dark Dream of a Totalitarian Empire appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/beyond-the-illusion-the-dark-dream-of-a-totatitarian-empire/",
          "publishedOn": "2025-01-10T06:57:38.000Z",
          "wordCount": null,
          "title": "Beyond the Illusion: The Dark Dream of a Totalitarian Empire",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349709",
          "author": "Joseph Natoli",
          "description": "“The wind blows to the south and goes around to the north; Around and around goes the wind, and on its circuits the wind returns.” – Ecclesiastes I won’t bury the lead: There are two existential bullet points Americans face along with the entire planet: Human driven global warming rendering the Earth unlivable for species,  More\nThe post What Can He Do? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/what-can-he-do/",
          "publishedOn": "2025-01-10T06:56:57.000Z",
          "wordCount": null,
          "title": "What Can He Do?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349521",
          "author": "Jerry Long",
          "description": "As an older man, I’ve learned to fully embrace joy in whatever form it chooses to reveal itself. To caress the fleeting happiness of existential pleasures. To cherish sensation, be it the foam of an ocean breaker or the feel of a productive bowel movement. And although I’ve spent a lifetime refusing to suffer fools,  More\nThe post Searching for Joy in the Democratic Party appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/searching-for-joy-in-the-democratic-party/",
          "publishedOn": "2025-01-10T06:56:51.000Z",
          "wordCount": null,
          "title": "Searching for Joy in the Democratic Party",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349718",
          "author": "Ramzy Baroud",
          "description": "Suddenly, Yoav Gallant, Israel’s notorious Minister of Defense, disappeared into obscurity. The man who served in his country’s military for about 35 years, in politics for nearly 10, and oversaw major wars, including the ongoing genocide in Gaza, quickly retreated from headlines and political significance. In his resignation letter, Gallant accused Israeli Prime Minister Benjamin  More\nThe post The War Criminal ‘Victim’: Netanyahu’s Inevitable Fate appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/the-war-criminal-victim-netanyahus-inevitable-fate/",
          "publishedOn": "2025-01-10T06:56:00.000Z",
          "wordCount": null,
          "title": "The War Criminal ‘Victim’: Netanyahu’s Inevitable Fate",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349660",
          "author": "Stephen F. Eisenman",
          "description": "Gwen avocado (attribution), photographer unknown, n.d. “Is this truth I’m delivering up, or is it just plain kvetching? Or is kvetching for people like me a form of truth?” – Philip Roth, Portnoy’s Complaint,1969 Form and content of the expat’s kvetch Harriet knew it would happen eventually but was surprised it was so soon. Barely  More\nThe post Kvetching, the Highest Stage of Capitalism appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/kvetching-the-highest-stage-of-capitalism/",
          "publishedOn": "2025-01-10T06:55:47.000Z",
          "wordCount": null,
          "title": "Kvetching, the Highest Stage of Capitalism",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349511",
          "author": "Eve Ottenberg",
          "description": "While the west subsidizes carnage in Gaza and Ukraine, the east does the opposite. For instance, one potential far east flashpoint has long been the India/China border, but that’s changing – for the better, due to high-level meetings in December between political bigwigs from both countries. It was the first such confab since 2019, RT  More\nThe post The West Makes War; the East, Peace appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/the-west-makes-war-the-east-peace/",
          "publishedOn": "2025-01-10T06:55:25.000Z",
          "wordCount": null,
          "title": "The West Makes War; the East, Peace",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349848",
          "author": "Lee Hall",
          "description": "Rosa Parks took a seat to take a stand. These days, prejudice pushes people into bus seats, not out of them. The descendants of Europeans wouldn’t even think of letting go of their cars, for car commuting “rules the roads outside the city.” They say it’s just not possible to take the bus out here.  More\nThe post To Desegregate, Ride the Bus appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/to-desegregate-ride-the-bus/",
          "publishedOn": "2025-01-10T06:54:38.000Z",
          "wordCount": null,
          "title": "To Desegregate, Ride the Bus",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349762",
          "author": "Michael Albert",
          "description": "Perhaps you are aware there is a new movie out titled A Complete Unknown. It addresses the first five years, or thereabouts, in Bob Dylan’s public musical life. I have not yet seen it. I have read some interviews with cast, director, etc., and have seen some excerpts, as well as heard from some friends  More\nThe post Meet Mr. Dylan appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/meet-mr-dylan/",
          "publishedOn": "2025-01-10T06:54:34.000Z",
          "wordCount": null,
          "title": "Meet Mr. Dylan",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349792",
          "author": "Dave Lindorff",
          "description": "Much is being made of Donald Trump’s threats to use US power — its military, or its mighty import demand and trade deficit — to take over the Panama Canal, the entire country of Canada, and the world’s largest island, Greenland, as well as renaming the Gulf of Mexico the Gulf of America. But why  More\nThe post Trump is Far Too Timid in His Imperial Aspirations appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/trump-is-far-too-timid-in-his-imperial-aspirations/",
          "publishedOn": "2025-01-10T06:54:18.000Z",
          "wordCount": null,
          "title": "Trump is Far Too Timid in His Imperial Aspirations",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349793",
          "author": "John W. Whitehead – Nisha Whitehead",
          "description": "“There is no greater tyranny than that which is perpetrated under the shield of the law and in the name of justice.” —Montesquieu, Enlightenment philosopher Wondering what to expect from the government in 2025? So far, it looks like it will be more of the same ill-advised, costly, greedy, taxpayer-funded, dunderheaded power grabs, saber-rattling, graft,  More\nThe post Welcome to 2025: Where Your Freedoms Go to Die appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/welcome-to-2025-where-your-freedoms-go-to-die/",
          "publishedOn": "2025-01-10T06:54:06.000Z",
          "wordCount": null,
          "title": "Welcome to 2025: Where Your Freedoms Go to Die",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349602",
          "author": "Matthew Stevenson",
          "description": "This is the eighth part in a series about riding night trains across Europe and the Near East to Armenia — to spend some time in worlds beyond the pathological obsessions of President-elect Donald Trump. (This week the president-elect is thrashing around in New York courtrooms, trying to stay his sentencing on 34 felonies owing  More\nThe post Transylvania by Bicycle appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/transylvania-by-bicycle/",
          "publishedOn": "2025-01-10T06:53:46.000Z",
          "wordCount": null,
          "title": "Transylvania by Bicycle",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349760",
          "author": "Kim C. Domenico",
          "description": "…domination is the one thing the soul will flee from.  It will stand up to almost any other trial, but it will depart rather than be dominated.  It will leave the body rather than sacrifice itself to light. –       Clark Strand, Waking Up to the Dark: The Black Madonna’s Gospel for an Age of Extinction and Collapse I find  More\nThe post Lessons from Van Gogh: The Center Is Wherever I Make My Art appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/lessons-from-van-gogh-the-center-is-wherever-i-make-my-art/",
          "publishedOn": "2025-01-10T06:53:18.000Z",
          "wordCount": null,
          "title": "Lessons from Van Gogh: The Center Is Wherever I Make My Art",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349643",
          "author": "Harvey Wasserman",
          "description": "Terrifying reports from the Ukraine-Russia front underscore an inescapable new nuclear reality:  in the age of drone warfare, the alleged safety of atomic reactors has leapt to a whole new level of myth. No matter how thick the containment domes, or how vehement the industry denials, a quantum leap in the killing power of weaponized  More\nThe post Drones, Nukes and the Myth of Reactor Safety appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/drones-nukes-and-the-myth-of-reactor-safety/",
          "publishedOn": "2025-01-10T06:53:05.000Z",
          "wordCount": null,
          "title": "Drones, Nukes and the Myth of Reactor Safety",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349583",
          "author": "Dean Baker",
          "description": "Catherine Rampell gave a rather gloomy assessment of Biden’s economic legacy in a Washington Post column this week. Unfortunately, I am inclined to agree with much of it, but I think she missed the biggest story: the commitment to full employment. Let’s start with the topics where she is largely right. First, Biden was able  More\nThe post Biden’s Economic Legacy appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/bidens-economic-legacy/",
          "publishedOn": "2025-01-10T06:52:18.000Z",
          "wordCount": null,
          "title": "Biden’s Economic Legacy",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349790",
          "author": "Jonah Raskin",
          "description": "Almost all novels, from Cervantes’ Don Quixote and Jane Austen’s Sense and Sensibility to One Hundred Years of Solitude and today’s mass market best sellers, are political whether the author intends them to be political or not.  Some, like Gore Vidal’s Burr and Lincoln, are more overtly political than others. As literary critics have long noted, novels tend to evade the conscious control of writers,  More\nThe post Only a Pawn in Their Game: Notes on Rachel Kushner’s Creation Lake appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/wanna-be-revolutionaries-and-their-foes-notes-on-rachel-kushners-creation-lake/",
          "publishedOn": "2025-01-10T06:52:07.000Z",
          "wordCount": null,
          "title": "Only a Pawn in Their Game: Notes on Rachel Kushner’s Creation Lake",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349705",
          "author": "Nick Mottren",
          "description": "On January 15, 2025, five days before the inauguration of a U.S. president who threatens to rain down hell on the Palestinian people, and more war to the world, the Merchants of Death War Crimes Tribunal will release its final report on how Lockheed Martin, Boeing, RTX/Raytheon and drone-maker General Atomics have delivered hell to  More\nThe post Judgement Day for the Merchants Of Death appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/judgement-day-for-the-merchants-of-death/",
          "publishedOn": "2025-01-10T06:46:12.000Z",
          "wordCount": null,
          "title": "Judgement Day for the Merchants Of Death",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349831",
          "author": "Ron Jacobs",
          "description": "The COVID pandemic messed with a lot of people.  Their jobs gone, their friends under lockdown, and so many people with so much free time and no real clue on how to occupy it.  Its effects continue to ripple through politics, the economy, relationships and the lack thereof.  One assumes the use of medicines designed  More\nThe post Patriarchy, COVID-19 and a Novel About a Dickhead appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/patriarchy-covid-19-and-a-novel-about-a-dickhead/",
          "publishedOn": "2025-01-10T06:44:45.000Z",
          "wordCount": null,
          "title": "Patriarchy, COVID-19 and a Novel About a Dickhead",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349806",
          "author": "Nathaniel St. Clair",
          "description": "Sizzling summer. Arid winter. Supercharged Santa Ana winds. L.A. burns in January. Homes destroyed. Insurance claims denied. Politicians bury their heads deeper in the sand. How hot does a fire have to burn for people in power to feel it? The flames flame out. The smoke drifts and drifts. Scarred land. Lives lost. Ash. Oil  More\nThe post How Hot Does A Fire Have To Burn? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/how-hot-does-a-have-to-fire-burn/",
          "publishedOn": "2025-01-10T06:41:20.000Z",
          "wordCount": null,
          "title": "How Hot Does A Fire Have To Burn?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349840",
          "author": "Yves Engler",
          "description": "As Donald Trump threatens to take over Canada he demands Ottawa increase military spending. The apparent contradiction is never mentioned in the mainstream media. Why? Because the seemingly contradictory position says a lot about Canadian “defence” forces ties to the US empire. Over the past month the president elect has repeatedly described Canada as the  More\nThe post Canada’s Military Spending appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/canadas-military-spending/",
          "publishedOn": "2025-01-10T06:40:45.000Z",
          "wordCount": null,
          "title": "Canada’s Military Spending",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349757",
          "author": "Martha Rosenberg",
          "description": "Karen has become code for an angry, entitled, racist white woman. Karen is “the kind of woman who asks to speak to the manager,” and polices others’ behavior said a piece in the Atlantic. But Karens have not always been privileged busy bodies. In 1974, labor union activist and radiation whistleblower Karen Silkwood was killed  More\nThe post Remembering When Karen Wasn’t an Insult appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/remembering-when-karen-wasnt-an-insult/",
          "publishedOn": "2025-01-10T06:40:44.000Z",
          "wordCount": null,
          "title": "Remembering When Karen Wasn’t an Insult",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349786",
          "author": "Paul Street",
          "description": "Who needs dystopian political science fiction in Amerika today? Real time nonfiction feels dystopian enough. The other morning I was awakened by the sound of Interstate 80, two miles north. The constant dull shrieks of the trucks merges into one never-ending scream of engines and tires. This death roar can be heard in every corner  More\nThe post Dystopia Nears appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/dystopia-nears/",
          "publishedOn": "2025-01-10T06:40:29.000Z",
          "wordCount": null,
          "title": "Dystopia Nears",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349834",
          "author": "John Laforge",
          "description": "I.F. Stone famously said, “All governments are run by liars and nothing they say should be believed.” The aphorism applies well to nuclear reactor operators, including Minneapolis-based Xcel Energy. The U.S. Nuclear Regulatory Commission (NRC) has granted Xcel a second license extension for operating its 54-year-old Monticello reactor on the Mississippi River in Minnesota. The  More\nThe post The Lies Have It: Xcel Energy Wins Operating Extension for Nation’s 5th Oldest Nuclear Reactor appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/the-lies-have-it-xcel-energy-wins-operating-extension-for-nations-5th-oldest-nuclear-reactor/",
          "publishedOn": "2025-01-10T06:40:20.000Z",
          "wordCount": null,
          "title": "The Lies Have It: Xcel Energy Wins Operating Extension for Nation’s 5th Oldest Nuclear Reactor",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349703",
          "author": "Mike Garrity",
          "description": "If anyone wonders why we’re taking the Forest Service to court over the Round Star logging project, there is one primary reason: lynx critical habitat is the worst place for clearcuts. The surest way to drive lynx to extinction is allowing the Forest Service to continue their massive deforestation of the West. This ill-conceived project  More\nThe post Conservation Advocates Sue Flathead Forest Service to Stop Massive Clearcutting West of Whitefish, Montana appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/10/conservation-advocates-sue-flathead-forest-service-to-stop-massive-clearcutting-west-of-whitefish-montana/",
          "publishedOn": "2025-01-10T06:37:22.000Z",
          "wordCount": null,
          "title": "Conservation Advocates Sue Flathead Forest Service to Stop Massive Clearcutting West of Whitefish, Montana",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=285297",
          "author": "Yves Smith",
          "description": "Our apocalytipic daily links: improperly rewilded lynx, lasting weight loss principles, Trump v. Netanyahu on hostages, Scholz blocked Ukraine €3B, moar spying apps, Trump land grabs? Obamacare subsidy fight, LAPD fire chief blasts mayor, \"uninsurable\" crisis coming? Supremes for Tik-Tok ban?",
          "link": "https://www.nakedcapitalism.com/2025/01/links-1-11-2025-2.html",
          "publishedOn": "2025-01-11T11:55:14.000Z",
          "wordCount": 15562,
          "title": "Links 1/11/2025",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/Screen-Shot-2025-01-11-at-4.54.46-PM.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=285340",
          "author": "Yves Smith",
          "description": "Michael Hudson refines and extends recent discussions on the future of the dollar, particularly under Trump, and finance-dominated capitalism",
          "link": "https://www.nakedcapitalism.com/2025/01/weaponizing-the-us-dollar-can-it-work.html",
          "publishedOn": "2025-01-11T11:54:50.000Z",
          "wordCount": 7942,
          "title": "Weaponizing the US Dollar. Can It Work?",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=285342",
          "author": "Yves Smith",
          "description": "Even cats in a prison setting find human servants!",
          "link": "https://www.nakedcapitalism.com/2025/01/meet-the-cats-who-roam-rikers-island.html",
          "publishedOn": "2025-01-11T11:02:58.000Z",
          "wordCount": 5148,
          "title": "Meet the Cats Who Roam Rikers Island",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/00-cats.webp"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=285302",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, Syndemics; New Covid data, Covid and mortality; LA Fires: misinformation; SEIU joins AFL-CIO ~",
          "link": "https://www.nakedcapitalism.com/2025/01/200pm-water-cooler-1-10-2025.html",
          "publishedOn": "2025-01-10T19:00:37.000Z",
          "wordCount": 15942,
          "title": "2:00PM Water Cooler 1/10/2025",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/covid-cdc-ww-natl.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=285292",
          "author": "Yves Smith",
          "description": "State-level activists have been building coalitions to implement higher and more extensive taxes on the wealthy. What are their prospects?",
          "link": "https://www.nakedcapitalism.com/2025/01/in-2025-states-will-flip-the-script-on-taxes-to-make-the-wealthy-pay-their-fair-share.html",
          "publishedOn": "2025-01-10T14:55:06.000Z",
          "wordCount": 7827,
          "title": "“In 2025, States Will Flip the Script on Taxes to Make the Wealthy Pay Their Fair Share”",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=285275",
          "author": "Lambert Strether",
          "description": "",
          "link": "https://www.nakedcapitalism.com/2025/01/links-1-10-2025.html",
          "publishedOn": "2025-01-10T11:58:00.000Z",
          "wordCount": 16806,
          "title": "Links 1/10/2025",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/lion_and_cub.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=285256",
          "author": "Nick Corbishley",
          "description": "While the old Guaidó lives it up in Florida, at somebody's apparent expense, the new Guaidó, Edmundo González Urritia, appears to be going nowhere.",
          "link": "https://www.nakedcapitalism.com/2025/01/where-is-the-new-juan-guaido.html",
          "publishedOn": "2025-01-10T11:45:22.000Z",
          "wordCount": 6590,
          "title": "Where is Guaidó 2.0?",
          "imageUrl": "https://pbs.twimg.com/media/Gg0fHMhW4AAND7E?format=jpg&name=large"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=285268",
          "author": "Yves Smith",
          "description": "Will Musk's taste for a US favorite, regime change, include 2025 Polish elections? If so, will the answer be Romania-style extreme measures?",
          "link": "https://www.nakedcapitalism.com/2025/01/polish-foreign-minister-worries-that-musk-will-successfully-undermine-ruling-liberal-party-in-upcoming-elections-is-another-romania-style-election-nullification-possible.html",
          "publishedOn": "2025-01-10T10:58:56.000Z",
          "wordCount": 5679,
          "title": "Polish Foreign Minister Worries that Musk Will Successfully Undermine Ruling Liberal Party in Upcoming Elections; Is Another Romania-Style Election Nullification Possible?",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/00-Polish.jpeg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=285282",
          "author": "Yves Smith",
          "description": "Sustained neoliberalism is exacting a toll on the UK via currency wobbles and reluctance to raise rates in the face of budget pressures.",
          "link": "https://www.nakedcapitalism.com/2025/01/uk-economy-falters-as-pound-sterling-continues-to-slide.html",
          "publishedOn": "2025-01-10T10:56:14.000Z",
          "wordCount": 10884,
          "title": "UK Economy Falters as Pound Sterling Continues to Slide",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/Screen-Shot-2025-01-10-at-5.39.55-PM.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=285240",
          "author": "Lambert Strether",
          "description": "By Lambert Strether of Corrente. Patient readers, I am now going to take a nap. Enjoy! Bird Song of the Day Brown Thrasher, Theodore Roosevelt National Park – Upper Talkington Trail, Billings, North Dakota, United States. * * * In Case You Might Miss… Trump’s pivotto the Northern Hemisphere. LA Palisades Fire: This is fine. […]",
          "link": "https://www.nakedcapitalism.com/2025/01/200pm-water-cooler-1-9-2025.html",
          "publishedOn": "2025-01-09T19:00:26.000Z",
          "wordCount": 11699,
          "title": "2:00PM Water Cooler 1/9/2025",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/covid-cdc-ww-natl.png"
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "6HAo0CAvmODAhYHnIF5Hbr",
          "author": "Kim Jeske",
          "description": "At Cloudflare, we treat developer content like an open source product. This collaborative approach enables global contributions to enhance quality and relevance for a wide range of users. This year,",
          "link": "https://blog.cloudflare.com/open-source-all-the-way-down-upgrading-our-developer-documentation/",
          "publishedOn": "2025-01-08T14:00:00.000Z",
          "wordCount": 2062,
          "title": "Open source all the way down: Upgrading our developer documentation",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/unu6xNHqGPZdNnccHPWhz/b45b02ee55cd04ae92bb01324207cfce/BLOG-2600_OG.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": [
        {
          "id": "https://medium.com/p/3f1d83cd0e8b",
          "author": "Capital One Tech",
          "description": "Maximizing data management efficiency through TTL implementation.",
          "link": "https://medium.com/capital-one-tech/introducing-database-time-to-live-ttl-for-data-management-3f1d83cd0e8b?source=rss----3db3a67cb648---4",
          "publishedOn": "2025-01-09T18:11:24.000Z",
          "wordCount": 6671,
          "title": "Introducing database time-to-live (TTL) for data management",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Engineering at Slack",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": [
        {
          "id": "https://slack.engineering/?p=17358",
          "author": "nstormann",
          "description": "At Slack, customer love is our first priority and accessibility is a core tenet of customer trust. We have our own Slack Accessibility Standards that product teams follow to guarantee their features are compliant with Web Content Accessibility Guidelines (WCAG). Our dedicated accessibility team supports developers in following these guidelines throughout the development process. We…\nThe post Automated Accessibility Testing at Slack appeared first on Engineering at Slack.",
          "link": "https://slack.engineering/automated-accessibility-testing-at-slack/",
          "publishedOn": "2025-01-07T20:46:20.000Z",
          "wordCount": 4030,
          "title": "Automated Accessibility Testing at Slack",
          "imageUrl": "https://slack.engineering/wp-content/uploads/sites/7/2024/12/joachim-schnurle-4j732BLw0BI-unsplash.jpg?w=640"
        }
      ]
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=22128",
          "author": null,
          "description": "Today’s rapidly evolving landscape of use cases that demand highly performant and efficient network infrastructure is placing new emphasis on how in-line amplifiers (ILAs) are designed and deployed. Meta’s ILA Evo effort seeks to reimagine how an ILA site could be deployed to improve speed and cost while making a step function improvement in power [...]\nRead More...\nThe post ILA Evo: Meta’s journey to reimagine fiber optic in-line amplifier sites appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2025/01/10/production-engineering/ila-evo-in-line-amplifier-sites-meta/",
          "publishedOn": "2025-01-10T17:00:20.000Z",
          "wordCount": 3341,
          "title": "ILA Evo: Meta’s journey to reimagine fiber optic in-line amplifier sites",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2025/01/Meta-ILA-Evo-HERO-Render-SMALL.jpg"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=42660571",
          "author": "lolinder",
          "description": "Yes. What too few people realized was that the rollout of DEI was driven by what was trending at the time, designed to win political points with the groups that were politically ascendant. These programs were never a victory for the principles or the people, they were marketing.\nSo it should come as no shock whatsoever that now that another political group is politically ascendant the marketing that is valuable has changed, so there go the marketing programs that were designed for the old power structure.\nChange that occurs through fear of your power can only last as long as your power. Lasting change is only possible by actually changing hearts and minds. Progressives have forgotten in the last 10-15 years that the progress which we've won took generations not because our predecessors were weak and slow but because it inherently takes generations to effect lasting change. It's a slow, painful process, and if you think you accomplished it in a decade you're almost certainly wrong.",
          "link": "https://news.ycombinator.com/item?id=42660571",
          "publishedOn": "2025-01-10T21:39:13.000Z",
          "wordCount": 29114,
          "title": "New comment by lolinder in \"Meta's memo to employees rolling back DEI programs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42660165",
          "author": "antics",
          "description": "I am Wasq'u (a tribe in the PNW), I am connected to my tribe, and I am one of a handful of remaining speakers of the language. I am really tired of being caught in the maw of people fighting about my identity, what I am owed, and to some extent what place my identity has in society.\nTo the pro-DEI crowd: I have some hard truths for you. Actual change requires commitment and focus over an extremely long period of time. That means you have to choose probably 1 cause among the many worthy causes, and then invest in it instead of the others. You can't do everything. The problems that afflict my community are running water, drug addiction, lack of educational resources, and secular trends have have made our traditional industries obsolete. I am not saying that land acknowledgements and sports t…",
          "link": "https://news.ycombinator.com/item?id=42660165",
          "publishedOn": "2025-01-10T21:01:27.000Z",
          "wordCount": 3128,
          "title": "New comment by antics in \"Meta's memo to employees rolling back DEI programs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42658998",
          "author": "firefoxd",
          "description": "I wrote about my experience working as a software developer and being black in the industry and I was lucky to have it published on BBC [1].\nWhat immediately followed, every large company reached out to have me work as a consultant for their diversity program. I found it fascinating that they had a team of DEI experts in place already. Like what makes one an expert?\nIn addition to my job, I spent nights developing programs trying to help these companies. Some folks right here on HN shared their successful experiences and I presented it to several companies. I was met with resistance every step of the way.\nOver the course of a year and hundreds of candidates I presented, I've managed to place just one developer in a company.\nHowever, most these companies were happy to change their social media profile to a solid black image or black lives matters. They sent memos, they organized lunches, even sold merch and donated. But hiring, that was too much to ask. A lot of graduates told me they never even got to do a technical interview.\nThose DEI programs like to produce a show. Something visible that gives the impression that important work is being done. Like Microsoft reading who owned the land where the campus was built [2] in the beginning of every program. It eerily reminds me of \"the loyalty oath crusade\" in Catch-22.\n[1]: https://news.ycombinator.com/item?id=23669188\n[2]: https://youtu.be/87JXB0t6de4?si=wtnQtBOE-fs4V7gR",
          "link": "https://news.ycombinator.com/item?id=42658998",
          "publishedOn": "2025-01-10T19:17:20.000Z",
          "wordCount": 45056,
          "title": "New comment by firefoxd in \"Meta's memo to employees rolling back DEI programs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42658015",
          "author": "JohnMakin",
          "description": "I'm a PoC, and stuff like this reads extremely bizarre to me. On the one hand, you're acknowledging rolling back DEI initiatives in part because of the \"political landscape,\" and that you were already committed to diversity on your teams. That's all well and good, but then, why the initiative in the first place? It seems to me you're doing at least 1 thing here, and acknowledging that such DEI program was performative in the first place. This kind of announcement seems extremely self defeating and unlikely to please anyone and piss off just about anyone that cares about this in any way shape or form, on either side.",
          "link": "https://news.ycombinator.com/item?id=42658015",
          "publishedOn": "2025-01-10T17:57:26.000Z",
          "wordCount": 21529,
          "title": "New comment by JohnMakin in \"Meta's memo to employees rolling back DEI programs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42656869",
          "author": "Workaccount2",
          "description": "At a local bar they had a game machine, and if you got a high score on any of the games, your tab for the evening was free.\nOne of the games was a \"spot the differences\" between two pictures with an ever decreasing timer for each round. Using this trick I was able to easily surpass the high score, and garner a crowd watching me perform this mind numbing feat.\nProbably my peak fame right there.",
          "link": "https://news.ycombinator.com/item?id=42656869",
          "publishedOn": "2025-01-10T16:08:05.000Z",
          "wordCount": 8260,
          "title": "New comment by Workaccount2 in \"I've acquired a new superpower\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42647926",
          "author": "hiAndrewQuinn",
          "description": "SQL NULLs aren't weird, they're just based off of Kleene's TRUE-FALSE-UNKNOWN logic!\nIf you want you can read NULL as UNKNOWN and suddenly a whole bunch of operations involving them become a lot more intuitive:\n1. TRUE OR UNKNOWN = TRUE, because you know you have at least one TRUE already.\n2. TRUE AND UNKNOWN = UNKNOWN, because you don't know whether you have two TRUEs or not. It's just out there.\n3. UNKNOWN XOR UNKNOWN = UNKNOWN, because it could darn near be anything: TRUE XOR TRUE, TRUE XOR FALSE, FALSE XOR FALSE, FALSE XOR TRUE... Internalizing this is where SQL's use of NULL / UNKNOWN really becomes intuitive.\n4. (TRUE AND FALSE) XOR (TRUE OR UNKNOWN) = (FALSE) XOR (TRUE) per #1 = TRUE. See, it's consistent, you just need to keep in mind that if you have a lot of known UNKNOWNs they're quite parasitic and your final outcome is likely to be, itself, an UNKNOWN. Just like in real life!",
          "link": "https://news.ycombinator.com/item?id=42647926",
          "publishedOn": "2025-01-09T17:37:12.000Z",
          "wordCount": null,
          "title": "New comment by hiAndrewQuinn in \"SQL nulls are weird\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42640931",
          "author": "tokinonagare",
          "description": "Upvoting too.\n> Unless, that is, I agree to work on a comparable solution for the university focused on solving the underlying problem I was building HuskySwap for. They would presumably own the IP and were clear that I wouldn’t be compensated. But it was implied that they would then remove the hold, allowing me to graduate.\nWow. Literally blackmailing a student to do illegal work (at least would be categorized like that in my country). A student that already paid money for class and potentially a degree the univ is trying to block, mind blowing. OP, 1000% lawyer up.",
          "link": "https://news.ycombinator.com/item?id=42640931",
          "publishedOn": "2025-01-09T02:22:29.000Z",
          "wordCount": null,
          "title": "New comment by tokinonagare in \"I had to take down my course-swapping site or be expelled\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42640222",
          "author": "eykanal",
          "description": "Just piling on here because upvotes are not visible. The one thing you can guarantee is that your good faith is not reciprocated by the university. Get a lawyer.\nTo make it easier: it sounds like you're still registered. University of Washington offers Student Legal Services ( https://depts.washington.edu/slsuw/ ). Set up a referral with one of them and talk to them. Even if they're employees of the university and don't want to work with you to sue the university itself they may be able to give you good advice about how to proceed.",
          "link": "https://news.ycombinator.com/item?id=42640222",
          "publishedOn": "2025-01-09T00:31:37.000Z",
          "wordCount": null,
          "title": "New comment by eykanal in \"I had to take down my course-swapping site or be expelled\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42639886",
          "author": "GrantMoyer",
          "description": "> I am not planning to get a lawyer involved as I have faith that UW leadership will make it right in the end.\nAll evidence so far indicates they will not make it right, but instead they may make it even worse. Your faith is wildly misplaced. Seriously, talk to a lawyer.\nKeep in mind, just because you seek advice from a lawyer doesn't mean you need to take legal action against the school. Talking to a lawyer is not an escalation; the school doesn't even need to know you consulted one. A lawyer will advise whether you should take legal action and any more amicable alternatives available before they do anything on your behalf.",
          "link": "https://news.ycombinator.com/item?id=42639886",
          "publishedOn": "2025-01-08T23:47:03.000Z",
          "wordCount": 8059,
          "title": "New comment by GrantMoyer in \"I had to take down my course-swapping site or be expelled\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42639834",
          "author": "didgeoridoo",
          "description": "I was at Salesforce for 4 years, and during those years the company made a massive deal about:\n2020: the first AI craze, introducing “Einstein” as their name for their analytics platform, and officially changing the corporate vision to being the “No. 1 AI CRM company”.\n2021: Now it’s all about “Customer 360”, i.e. account-based marketing, i.e. what basically everyone else does without such a memeable name. You wouldn’t believe the number of slide decks I had to sit through with all our little product logos orbiting this stock art character straight out of Women Laughing While Eating Salad.\n2022: Never mind, now we’re betting the company on a real-time unified database called Genie, which was neither real-time nor unified (and eventually not called Genie either). Got sued for that one.\n2024: AGENTS. AGENTS EVERYWHERE. WE ARE AN AGENT COMPANY NOW.\nSo, let’s see how this holds up in the face of the next hot thing.",
          "link": "https://news.ycombinator.com/item?id=42639834",
          "publishedOn": "2025-01-08T23:42:34.000Z",
          "wordCount": null,
          "title": "New comment by didgeoridoo in \"Salesforce will hire no more software engineers in 2025, says Marc Benioff\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42639811",
          "author": "bloudermilk",
          "description": "We lost our house to the Eaton fire this morning. It’s difficult to describe the vastness of the destruction in our community. Everything within a couple square miles of us burned.",
          "link": "https://news.ycombinator.com/item?id=42639811",
          "publishedOn": "2025-01-08T23:40:31.000Z",
          "wordCount": null,
          "title": "New comment by bloudermilk in \"LA wildfires force thousands to evacuate, NASA JPL closed\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42639791",
          "author": "bb611",
          "description": "Current SFDC software engineer - this is just cover for a widespread engineering hiring freeze since the layoffs in January 2023. There's a ton of pressure to control costs after the near shareholder revolt that caused the layoffs.\nThe public nature of the announcement is certainly marketing for our AI offerings as well, but at this point I think most engineers are just worried there will be additional layoffs, in the event management cannibalizes product for short term stock gains again.",
          "link": "https://news.ycombinator.com/item?id=42639791",
          "publishedOn": "2025-01-08T23:39:03.000Z",
          "wordCount": null,
          "title": "New comment by bb611 in \"Salesforce will hire no more software engineers in 2025, says Marc Benioff\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42639347",
          "author": "NBJack",
          "description": "You may want to consult with a lawyer. This is starting to sound like extortion.",
          "link": "https://news.ycombinator.com/item?id=42639347",
          "publishedOn": "2025-01-08T22:49:02.000Z",
          "wordCount": null,
          "title": "New comment by NBJack in \"I had to take down my course-swapping site or be expelled\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42639331",
          "author": "jdkaim",
          "description": "Update: I immediately took down my class project site after receiving yesterday’s ultimatum. I still don’t think the simple demo site violated the letter or spirit of the registration rules, but I took it down because I always want to operate in good faith.\nThey followed up today to thank me for doing it, but also indicated that they were putting a hold on my account anyway. As a result, I am not going to be able to register for my final quarter and have been de facto expelled at the end of this quarter.\nUnless, that is, I agree to work on a comparable solution for the university focused on solving the underlying problem I was building HuskySwap for. They would presumably own the IP and were clear that I wouldn’t be compensated. But it was implied that they would then remove the hold, allowing me to graduate.\nI really love UW and have had a wonderful time here. But this is so demoralizing.\nUpdate #2:\nI appreciate you guys for all of your advice.\nThis platform was never intended to be monetized, and I am not planning to get a lawyer involved as I have faith that UW leadership will make it right in the end.\nI'm not planning to pursue this project at this point. If they came up to me at first with the offer to work with them it might be different, but the way they handled it makes me just want to walk away.",
          "link": "https://news.ycombinator.com/item?id=42639331",
          "publishedOn": "2025-01-08T22:46:52.000Z",
          "wordCount": null,
          "title": "New comment by jdkaim in \"I had to take down my course-swapping site or be expelled\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42633965",
          "author": "jgrahamc",
          "description": "Me writing over 14 years ago: https://blog.jgc.org/2010/06/facebooks-dkim-rsa-key-should-b... This was doable 14 years ago for 512-bit keys.",
          "link": "https://news.ycombinator.com/item?id=42633965",
          "publishedOn": "2025-01-08T13:28:53.000Z",
          "wordCount": null,
          "title": "New comment by jgrahamc in \"Cracking a 512-bit DKIM key for less than $8 in the cloud\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42628594",
          "author": "peterldowns",
          "description": "I agree that consistency is important — but what about when the existing codebase is already inconsistent? Even worse, what if the existing codebase is both inconsistent and the \"right way to do things\" is undocumented? That's much closer to what I've experienced when joining companies with lots of existing code.\nIn this scenario, I've found that the only productive way forward is to do the best job you can, in your own isolated code, and share loudly and frequently why you're doing things your new different way. Write your code to be re-used and shared. Write docs for it. Explain why it's the correct approach. Ask for feedback from the wider engineering org (although don't block on it if they're not directly involved with your work.) You'll quickly find out if other engineers agree that your approach is better. If it's actually better, others will start following your lead. If it's not, you'll be able to adjust.\nOf course, when working in the existing code, try to be as locally consistent as possible with the surrounding code, even if it's terrible. I like to think of this as \"getting in and out\" as quickly as possible.\nIf you encounter particularly sticky/unhelpful/reticent team members, it can help to remind them that (a) the existing code is worse than what you're writing, (b) there is no documented pattern that you're breaking, (c) your work is an experiment and you will later revise it. Often asking them to simply document the convention that you are supposedly breaking is enough to get them to go away, since they won't bother to spend the effort.",
          "link": "https://news.ycombinator.com/item?id=42628594",
          "publishedOn": "2025-01-07T22:44:50.000Z",
          "wordCount": null,
          "title": "New comment by peterldowns in \"Mistakes engineers make in large established codebases\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42625676",
          "author": "davidw",
          "description": "The ideological bits are:\n* Dana White added to the board.\n* \"Move our trust and safety and content moderation teams out of California, and our US content review to Texas. This will help remove the concern that biased employees are overly censoring content.\" - like people being in Texas makes them more objective?!\nThe actual mechanisms of running a social media network at scale are tricky and I think most of us would be fine with some experimentation. But it looks pretty political in the broader context, so maybe it's just a way of saying that certain kinds of 'content' like attacking trans people is going to be ok now.\nI can't quite FB entirely, but Threads looks like a much less interesting option with Blue Sky being available and gaining in popularity.",
          "link": "https://news.ycombinator.com/item?id=42625676",
          "publishedOn": "2025-01-07T18:31:53.000Z",
          "wordCount": null,
          "title": "New comment by davidw in \"Ending our third party fact-checking program and moving to Community Notes model\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42625568",
          "author": "tptacek",
          "description": "I'd like to hear an informed take from anybody who thinks that Facebook's fact-checkers were a better product feature than Community Notes.\nAll of the articles I'm seeing about this online are ideological, but this feels like the kind of decision that should have been in the works for multiple quarters now, given how effective Notes have been, and how comically ineffective and off-putting fact-checkers have been. The user experience of fact-checkers (forget about people pushing bogus facts, I just mean for ordinary people who primarily consume content rather than producing it) is roughly that of a PSA ad spot series saying \"this platform is full of junk, be on your guard\".",
          "link": "https://news.ycombinator.com/item?id=42625568",
          "publishedOn": "2025-01-07T18:23:46.000Z",
          "wordCount": 41726,
          "title": "New comment by tptacek in \"Ending our third party fact-checking program and moving to Community Notes model\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42623030",
          "author": "Abishek_Muthian",
          "description": "I'm looking at my Jetson Nano in the corner which is fulfilling its post-retirement role as a paper weight because Nvidia abandoned it in 4 years.\nNvidia Jetson Nano, A SBC for \"AI\" debuted with already aging custom Ubuntu 18.04 and when 18.04 went EOL, Nvidia abandoned it completely without any further updates to its proprietary  jet-pack or drivers and without them all of Machine Learning stack like CUDA, Pytorch etc. became useless.\nI'll never buy a SBC from Nvidia unless all the SW support is up-streamed  to Linux kernel.",
          "link": "https://news.ycombinator.com/item?id=42623030",
          "publishedOn": "2025-01-07T14:59:40.000Z",
          "wordCount": null,
          "title": "New comment by Abishek_Muthian in \"Nvidia's Project Digits is a 'personal AI supercomputer'\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42619022",
          "author": "dewitt",
          "description": "One interesting bit of context is that the author of this post is a legit world-class software engineer already (though probably too modest to admit it). Former staff engineer at Google and co-founder / CTO of Tailscale. He doesn't need LLMs. That he says LLMs make him more productive at all as a hands-on developer, especially around first drafts on a new idea, means a lot to me personally.\nHis post reminds me of an old idea I had of a language where all you wrote was function signatures and high-level control flow, and maybe some conformance tests around them. The language was designed around filling in the implementations for you. 20 years ago that would have been from a live online database, with implementations vying for popularity on the basis of speed or correctness. Nowadays LLMs would generate most of it on the fly, presumably.\nMost ideas are unoriginal, so I wouldn't be surprised if this has been tried already.",
          "link": "https://news.ycombinator.com/item?id=42619022",
          "publishedOn": "2025-01-07T03:55:42.000Z",
          "wordCount": 10047,
          "title": "New comment by dewitt in \"How I program with LLMs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42617292",
          "author": "btown",
          "description": "The real hidden gem here is the hilarious 40 minute mermaid-themed true crime podcast parody that you'll only hear a portion of if you progress quickly. As far as I can tell, it's fully custom-made for this game? Can't find any references to the characters online.\nhttps://stimulation-clicker.neal.fun/ sounds/true-crime.mp3 - it's hosted on Cloudflare, but even so I don't want to cost OP significant bandwidth, so join the two strings above for the direct link.\n\"Aww, he was all cat 'n tonic when he first saw her.\" An absolute classic. I would do anything to know more about how this came to exist.",
          "link": "https://news.ycombinator.com/item?id=42617292",
          "publishedOn": "2025-01-06T23:23:12.000Z",
          "wordCount": null,
          "title": "New comment by btown in \"Stimulation Clicker\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42614385",
          "author": "eigenvalue",
          "description": "Wow, that was amazing. This is honestly a better piece of contemporary art (in terms of making you think about modern life and what is happening to our environment, the impact on ourselves, our kids, etc.) than most of what you might see at a fancy art gallery or a contemporary art museum in NYC.",
          "link": "https://news.ycombinator.com/item?id=42614385",
          "publishedOn": "2025-01-06T19:22:49.000Z",
          "wordCount": 863,
          "title": "New comment by eigenvalue in \"Stimulation Clicker\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42614326",
          "author": "zdc1",
          "description": "I finished the game without cheating. I felt like a frog being slowly boiled (and it really does feel like you're boiling at the end). It's quite the journey...\nI love how everything here isn't even farfetched. It's just standard YouTube and TikTok content. The red notification bubbles were also a nice touch, I felt myself really drawn to those, and if I think back, I guess that's the earliest example I can recall of where these patterns all started: Facebook's little red notification bubble",
          "link": "https://news.ycombinator.com/item?id=42614326",
          "publishedOn": "2025-01-06T19:19:40.000Z",
          "wordCount": null,
          "title": "New comment by zdc1 in \"Stimulation Clicker\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42612966",
          "author": "hamandcheese",
          "description": "This seems like a huge abuse of the copyright system to me. It sounds to me like ChainPatrol doesn't actually have any IP to protect, but they are instead deputizing YouTube's copyright system to fight what they deem to be crypto scams. Absolutely wild if true.",
          "link": "https://news.ycombinator.com/item?id=42612966",
          "publishedOn": "2025-01-06T17:49:30.000Z",
          "wordCount": null,
          "title": "New comment by hamandcheese in \"3blue1brown YouTube Bitcoin video taken down as copyright violation\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42612650",
          "author": "wil421",
          "description": "The year is 2030. After the AI bot wars, FaceBook and Google have been crippled. They let AI automation control their content and it was deleted after OpenAI GPT10 discovered vulnerabilities in automated copyright strikes.\nTaco Bell won the franchise war and is the only restaurant remaining.",
          "link": "https://news.ycombinator.com/item?id=42612650",
          "publishedOn": "2025-01-06T17:23:30.000Z",
          "wordCount": null,
          "title": "New comment by wil421 in \"3blue1brown YouTube Bitcoin video taken down as copyright violation\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42612168",
          "author": "catgary",
          "description": "I think it’s worth noting that the weekend before this, local residents of Ottawa had basically “stormed” one of the trucker convoy camps to unblock a road. There were genuine concerns that the residents of Ottawa were ready to take matters into their own hands, and it would be a bloodbath. Not to mention the blockade in Alberta where they were found with guns and a pipe bomb, with their communications indicating they were planning to murder the RCMP officers on site!\nDeclaring the Emergency acts was overwhelmingly popular in Canada and remains one of the most popular things Trudeau ever did. The moves to restrict access to banking affected less than 20 people (and I think they were generally funnelling money from international propaganda groups or committing similar financial crimes).",
          "link": "https://news.ycombinator.com/item?id=42612168",
          "publishedOn": "2025-01-06T16:45:07.000Z",
          "wordCount": 15350,
          "title": "New comment by catgary in \"Justin Trudeau promises to resign as PM\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42611968",
          "author": "csense",
          "description": "Patio11 has some good coverage of Trudeau's handling of the trucker protest against the government's handling of COVID-19 [1].\nWhatever you think of the truckers' position or protest tactics, any punishment for their actions ought to go through the laws and court system.  Trudeau instead essentially told the banking system \"You can't do business with those people, they're terrorists.\"  Patio11's words of what happened next:\n\"The assistant deputy finance minister...said...'The intent was not to get at the families', and when a democratic government starts a sentence that way something deeply #*&$#ed up has happened.\"\nI'm not on the pulse of Canadian politics, so I don't really know what sins or political circumstances have led Trudeau to this point, or if he has any redeeming qualities.  Personally, I'm glad to see him gone.\n[1] https://www.bitsaboutmoney.com/archive/debanking-and-debunki...\n(You'll have to Ctrl+F trucker as this blog doesn't seem to have  for headings, as is customary on e.g. Wikipedia.)",
          "link": "https://news.ycombinator.com/item?id=42611968",
          "publishedOn": "2025-01-06T16:30:28.000Z",
          "wordCount": null,
          "title": "New comment by csense in \"Justin Trudeau promises to resign as PM\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42610957",
          "author": "armada651",
          "description": "> Word processors like MacWrite absolutely transformed the ways that everyone used computers.\nMacWrite was released 5 years after WordPerfect, which itself is predated by WordStar. I don't get why Apple fans have this obsession with pretending Apple invents these things.\nApple refines what others have attempted before, that's what they're good at. Part of the reason people are disappointed with Apple these days is because of this fantasy image of Apple as an inventor.",
          "link": "https://news.ycombinator.com/item?id=42610957",
          "publishedOn": "2025-01-06T14:45:25.000Z",
          "wordCount": 11403,
          "title": "New comment by armada651 in \"Apple squandered the Holy Grail\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42608823",
          "author": "padolsey",
          "description": "Now having worked in a few smaller teams since my time at FB, I realize how marvellous it is to not have to worry about OKRs, performance reviews and all that malarkey. It was so draining to run yourself as a mini PR/brand within one's team (/one's department) and market oneself (one's team) to your manager (/your company).\nSo much mental bandwidth was spent.\nI also, from a systems-thinking POV, just fundamentally reject the value in OKRs as a meaningful proxy for the value you (/your team) are producing unless you are an entirely mechanistic function. By mechanistic I mean you have a clear discrete InputOutput expectation. Every single time an element of human activity is reduced to a metric, you lose something, and if you do it enough times, you've effectively produced a metric that is completely distinct from the thing you intended on measuring in the first place. For example: let's say you're in the suicide prevention team at FB, and your OKR is 'number of suicides averted'. Well, that sounds good, but unbeknownst to you, perverse incentives have kicked in and invisibly imbued your metric-chasing experiments a dark undertone. A new risk model might start flagging more content as potentially suicidal to boost numbers, leading to over-intervention that could traumatize users or waste resources. Or perhaps the surface we use to measure success, a UX or user activity metric, might actually be uncorrelated with crisis aversion or... and this is where it hits: the thing that's instrumental in crises is social media itself. The metric becomes a game, and it games _you_. Your team thinks you're doing X, but you're really doing Y. Because you're disattached from the real problem and comforted by incredibly lossy proxies.",
          "link": "https://news.ycombinator.com/item?id=42608823",
          "publishedOn": "2025-01-06T08:36:23.000Z",
          "wordCount": null,
          "title": "New comment by padolsey in \"Hitting OKRs vs. Doing Your Job\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42606745",
          "author": "bee_rider",
          "description": "> I know a good salesman when I see one. I was, briefly, the No. 1 telemarketer in the United States.\nOh neat, how?\n> Unlike many of my less successful colleagues, I quickly learned to take yes for an answer; though we were legally required to read a long list of mandatory disclosures to all our sales, I noticed that this often broke the spell and gave people an opening to back out or “wait and ask the wife about it.” As soon as I heard a yes, I said, “Great choice!” and transferred them to confirmation. My manager occasionally came by and reminded me that it was technically illegal to skip my disclosures, but he made commission off my commission, and his tone made it clear that I could do as I pleased as long as I kept putting up numbers.\n[…]\n> I was one of the first to go, technically for not making my required disclosures—about cancellation fees, international rates, all that fine print nobody ever bothered to recite—on a sale.\nSo, he and his boss did crime together for a while and then eventually their scam stopped working and he got fired.",
          "link": "https://news.ycombinator.com/item?id=42606745",
          "publishedOn": "2025-01-06T01:52:18.000Z",
          "wordCount": 5368,
          "title": "New comment by bee_rider in \"In my life, I've witnessed three elite salespeople at work\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=9067",
          "author": "disassociated.com",
          "description": "Tim Carmody, writing for Wired: Because HTML looks easy and lacks features like formal conditional logic and Turing-completeness, it’s often dismissed as not a programming language. “That’s not real code; it’s just markup” is a common refrain. Now, I’m no stranger to the austere beauty of the command line, from automating scripts to training machine-learning […]",
          "link": "https://disassociated.com/html-programming-language-not-markup/",
          "publishedOn": "2025-01-08T20:00:22.000Z",
          "wordCount": 251,
          "title": "HTML: a programming language, not mere markup",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9064",
          "author": "disassociated.com",
          "description": "Justine Calma, writing for The Verge: Meta is essentially shifting responsibility to users to weed out lies on Facebook, Instagram, Threads, and WhatsApp, raising fears that it’ll be easier to spread misleading information about climate change, clean energy, public health risks, and communities often targeted with violence. The policy revision seemed surprising initially, but less […]",
          "link": "https://disassociated.com/meta-major-changes-content-moderation/",
          "publishedOn": "2025-01-08T19:30:37.000Z",
          "wordCount": 236,
          "title": "Meta announces major changes to content moderation polices",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9060",
          "author": "disassociated.com",
          "description": "Tom Saunders writing for ABC News: Your average La Niña forms in winter, peaks in late spring, then gradually weakens through summer. However, the current edition has not played by the rule book — for only the second time in 75 years, its onset has arrived in the middle of summer. This is something I’ve […]",
          "link": "https://disassociated.com/summer-time-forming-la-nina-possible/",
          "publishedOn": "2025-01-07T20:00:06.000Z",
          "wordCount": 458,
          "title": "Summer time forming La Nina possibly coming to Australia",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9054",
          "author": "disassociated.com",
          "description": "Rambles.NET is an online magazine founded by Tom Knapp in 1999, and still going strong over twenty-five later. Knapp himself continues to contribute. Rambles is another example of Indie Web in its original inception; I think a Facebook page is the only hint of social media present. I had a crack at publishing a webzine […]",
          "link": "https://disassociated.com/rambles-net-webzine-founded-tom-knapp-1999/",
          "publishedOn": "2025-01-05T20:00:56.000Z",
          "wordCount": 291,
          "title": "Rambles.NET, a webzine founded by Tom Knapp in 1999",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9051",
          "author": "disassociated.com",
          "description": "American engineer and product manager Den Delimarsky offers another way of looking at the core Indie Web tenets of owning your own website domain, and owning your own content. See yourself as a property owner, rather than a renter. If any of your online presence is on social media channels, you’re leasing the space, you […]",
          "link": "https://disassociated.com/indie-web-property-owners-online/",
          "publishedOn": "2025-01-05T19:30:15.000Z",
          "wordCount": 177,
          "title": "Indie Web makes all of us property owners online",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9049",
          "author": "disassociated.com",
          "description": "Josh Ellis writes about buying a plate of cookies he had no intention of eating, from an entrepreneurial twelve-year old neighbour going door to door, who was selling them. Why would anyone pay out good money for something they’re not going to consume? Ellis describes the gesture as cookie insurance: Lastly, I bought cookies I […]",
          "link": "https://disassociated.com/inauguration-insurance-cookie-insurance/",
          "publishedOn": "2025-01-05T19:00:43.000Z",
          "wordCount": 289,
          "title": "Inauguration insurance, another form of cookie insurance?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2025/20250109",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2025/20250109",
          "publishedOn": "2025-01-09T06:20:00.000Z",
          "wordCount": 428,
          "title": "Week Ending January 5, 2025",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/the-franc-zone",
          "author": null,
          "description": "Twilight of Françafrique?",
          "link": "https://newleftreview.org/sidecar/posts/the-franc-zone",
          "publishedOn": "2025-01-10T17:58:22.000Z",
          "wordCount": 3491,
          "title": "Martin Barnay: &ldquo;The Franc Zone&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2025/01/barnay.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/artist-as-filmmaker",
          "author": null,
          "description": "Malcolm Le Grice (1940-2024).",
          "link": "https://newleftreview.org/sidecar/posts/artist-as-filmmaker",
          "publishedOn": "2025-01-10T11:18:30.000Z",
          "wordCount": 2520,
          "title": "Maria Palacios Cruz: &ldquo;Artist as Filmmaker&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2025/01/le-grice-horror-film-1-0.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/broken-voices",
          "author": null,
          "description": "On Anna Gréki.",
          "link": "https://newleftreview.org/sidecar/posts/broken-voices",
          "publishedOn": "2025-01-09T13:35:45.000Z",
          "wordCount": 2224,
          "title": "Luke Roberts: &ldquo;Broken Voices&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2025/01/image-for-roberts.jpg"
        }
      ]
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    },
    {
      "title": "News Minimalist",
      "feedUrl": "https://rss.beehiiv.com/feeds/4aF2pGVAEN.xml",
      "siteUrl": "https://newsletter.newsminimalist.com/",
      "articles": [
        {
          "id": "https://newsletter.newsminimalist.com/p/global-temperatures-surpassed-1-5c-2-more-stories",
          "author": null,
          "description": "Global temperatures surpassed 1.5C this year; the World Economic Forum forecasts 170 million new jobs by 2030; Russia halts gas supplies to Europe.",
          "link": "https://newsletter.newsminimalist.com/p/global-temperatures-surpassed-1-5c-2-more-stories",
          "publishedOn": "2025-01-11T16:42:01.000Z",
          "wordCount": 6647,
          "title": "Global temperatures surpassed 1.5C + 2 more stories",
          "imageUrl": "https://beehiiv-images-production.s3.amazonaws.com/uploads/publication/thumbnail/d0318cb6-0493-4e34-b055-76456e6c0f76/landscape_template__3_.png"
        },
        {
          "id": "https://newsletter.newsminimalist.com/p/scientists-extract-1-2-million-year-old-ice-core-from-antarctica-3-more-stories",
          "author": null,
          "description": "James Webb Telescope finds 44 stars in the Dragon Arc galaxy; Greenland's importance escalates due to climate change; scientists drill 1.2 million-year-old ice core; Trump considers national economic emergency for tariffs.",
          "link": "https://newsletter.newsminimalist.com/p/scientists-extract-1-2-million-year-old-ice-core-from-antarctica-3-more-stories",
          "publishedOn": "2025-01-09T17:52:38.000Z",
          "wordCount": 7508,
          "title": "Scientists extract 1.2 million-year-old ice core from Antarctica + 3 more stories",
          "imageUrl": "https://beehiiv-images-production.s3.amazonaws.com/uploads/publication/thumbnail/d0318cb6-0493-4e34-b055-76456e6c0f76/landscape_template__3_.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}