{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "f2b2f1eca783c03eca935bbe7a8b88226b14d5e3",
          "author": "Esra Kayabali",
          "description": "AWS Summit New York is 10 days away, and I am very excited about the new announcements and more than 170 sessions. There will be A Night Out with AWS event after the summit for professionals from the media and entertainment, gaming, and sports industries who are existing Amazon Web Services (AWS) customers or have […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-ai21-labs-jamba-instruct-in-amazon-bedrock-amazon-workspaces-pools-and-more-july-1-2024/",
          "publishedOn": "2024-07-01T16:18:19.000Z",
          "wordCount": 2578,
          "title": "AWS Weekly Roundup: AI21 Labs’ Jamba-Instruct in Amazon Bedrock, Amazon WorkSpaces Pools, and more (July 1, 2024)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/06/10/AWS-WIR-default-1.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": []
    },
    {
      "title": "The GitHub Blog: Engineering News and Updates",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/category/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": [
        {
          "id": "0b8bd15cb28746b280e7ed11144ffd013485b5aa",
          "author": "Sindhu Pillai",
          "description": "Refactor serverless apps by swapping application code with cloud automation: reduce costs, decouple logic from architecture, and leverage managed services' native capabilities.",
          "link": "https://aws.amazon.com/blogs/devops/refactoring-to-serverless-from-application-to-automation/",
          "publishedOn": "2024-07-03T20:41:32.000Z",
          "wordCount": 2664,
          "title": "Refactoring to Serverless: From Application to Automation",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/06/19/Refactoring-to-Serverless-1145x630.png"
        },
        {
          "id": "405bbc736a74a4576b2623243a568f24e835610b",
          "author": "Chetan Makvana",
          "description": "Many organizations have critical legacy Java applications that are increasingly difficult to maintain. Modernizing these applications is a necessary, daunting, and risky task that takes the focus off of creating new value or features. This includes undocumented code, outdated frameworks and libraries, security vulnerabilities, a lack of logging and error handling, and a lack of […]",
          "link": "https://aws.amazon.com/blogs/devops/modernize-your-java-application-with-amazon-q-developer/",
          "publishedOn": "2024-07-03T00:58:01.000Z",
          "wordCount": 2665,
          "title": "Modernize your Java application with Amazon Q Developer",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/06/30/Modernize-your-Java-application-with-Amazon-Q-Developer-1120x630.png"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "d710f7ae96ae535d56b495119bc31892821121ef",
          "author": "Tsahi Duek",
          "description": "Although provisioning load balancers directly from clusters has been the Kubernetes native method for exposing services, in some cases this creates a provisioning process that doesn’t align with the architecture of the applications. Therefore, there’s a need to have another mechanism for it. For those use-cases, which we describe in this post, provides the functionality […]",
          "link": "https://aws.amazon.com/blogs/containers/patterns-for-targetgroupbinding-with-aws-load-balancer-controller/",
          "publishedOn": "2024-06-29T16:52:46.000Z",
          "wordCount": 1968,
          "title": "Patterns for TargetGroupBinding with AWS Load Balancer Controller",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/05/25/Featured-images-for-Containers-Blog-10-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=327205",
          "author": "Melvin Goodman",
          "description": "Last week’s Biden-Trump debate harmed U.S. foreign policy, and the international community was left to debate what was said and what was left unsaid.  In view of the harmful potential for wider wars in East Europe and the Middle East in addition to the potential for China’s increased military pressure on Taiwan, it is shocking that only ten minutes of the 90-minute debate was devoted to national security policy.  The inept CNN moderators—Jake Tapper and Dana Bash—were partly responsible because of the dearth of questions on foreign policy.  Nevertheless, the answers provided by President Joe Biden and former president Donald Trump were shocking for their misinformation and their polemics.   More\nThe post How the Presidential Debate Harmed US Foreign Policy appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/how-the-presidential-debate-harmed-us-foreign-policy/",
          "publishedOn": "2024-07-05T06:00:58.000Z",
          "wordCount": null,
          "title": "How the Presidential Debate Harmed US Foreign Policy",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327256",
          "author": "Jeffrey St. Clair",
          "description": "I grew up south of Indianapolis on the glacier-smoothed plains of central Indiana. My grandparents owned a small farm, whittled down over the years to about 40 acres of bottomland, in some of the most productive agricultural land in America. Like many of their neighbors they mostly grew field corn (and later soybeans), raised a few cows and bred a few horses.\nMore\nThe post Animal Factories: On the Killing Floor appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/animal-factories-on-the-killing-floor/",
          "publishedOn": "2024-07-05T06:00:46.000Z",
          "wordCount": null,
          "title": "Animal Factories: On the Killing Floor",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327179",
          "author": "Matthew Stevenson",
          "description": "On screen, Biden looked and sounded like a somnambulist whose only connection to politics was a haphazard, recited laundry list of federal programs that have saved everyone from unwed mothers to homeless veterans, but at least the president came to the debate with malice toward none (Gazans might have been the exception), while from the other lectern Trump was little more than a fountain of bile. More\nThe post Say It Ain’t So, Joe appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/say-it-aint-so-joe/",
          "publishedOn": "2024-07-05T05:59:42.000Z",
          "wordCount": null,
          "title": "Say It Ain’t So, Joe",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327322",
          "author": "Ramzy Baroud",
          "description": "Israel never learns from its mistakes. What Israeli Prime Minister Benjamin Netanyahu is trying to implement in Gaza is but a poor copy of previous strategies that were used in the past by other Israeli leaders. If these strategies had succeeded, Israel would not be in this position in the first place. The main reason  More\nThe post Sharon Revisited: Netanyahu’s Ultimate Aim in Gaza and Why It Will Fail  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/sharon-revisited-netanyahus-ultimate-aim-in-gaza-and-why-it-will-fail/",
          "publishedOn": "2024-07-05T05:58:56.000Z",
          "wordCount": null,
          "title": "Sharon Revisited: Netanyahu’s Ultimate Aim in Gaza and Why It Will Fail",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327105",
          "author": "Julie Wark",
          "description": "As in Palestine, much of the displacement in West Papua is caused by settlers, but this time funded by the World Bank. Respectably called “transmigration” and officially lasting until 2015, this policy affects Kalimantan, Sumatra, Sulawesi, and Maluku but, above all, West Papua because the transmigrants aren’t Melanesian, so the possibility of ethnic and religious strife is high. More\nThe post Paniai, West Papua: Politics of Displacement appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/paniai-west-papua-politics-of-displacement/",
          "publishedOn": "2024-07-05T05:58:21.000Z",
          "wordCount": null,
          "title": "Paniai, West Papua: Politics of Displacement",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327333",
          "author": "Vijay Prashad",
          "description": "The story should not be real. It was the morning of January 29, 2024. The Israeli military had already bombed substantial parts of the affluent Tel al-Hawa neighborhood in Gaza City, including—in October 2023—the totality of the Gaza City campus of the Islamic University of Gaza. Following a warning from the Israeli military, seven members  More\nThe post The Unbelievable Stories About the Children of Gaza appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/the-unbelievable-stories-about-the-children-of-gaza/",
          "publishedOn": "2024-07-05T05:58:04.000Z",
          "wordCount": null,
          "title": "The Unbelievable Stories About the Children of Gaza",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327317",
          "author": "Michael T. Klare",
          "description": "Wherever he travels globally, President Biden has sought to project the United States as the rejuvenated leader of a broad coalition of democratic nations seeking to defend the “rules-based international order” against encroachments by hostile autocratic powers, especially China, Russia, and North Korea. “We established NATO, the greatest military alliance in the history of the  More\nThe post Trusting the “Five Eyes” Only appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/trusting-the-five-eyes-only/",
          "publishedOn": "2024-07-05T05:57:40.000Z",
          "wordCount": null,
          "title": "Trusting the “Five Eyes” Only",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327135",
          "author": "Eve Ottenberg",
          "description": "A record number of Congress members will leave government come November, so many that the New York Times published an article May 30 bemoaning the phenomenon. But maybe it’s not so terrible. Maybe we’ll be better off without the people who gave us the Select Committee on (bashing) China, the (anti) Patriot Act, the trillion-dollar  More\nThe post Lawmakers Abandon Congress – Maybe That is a Good Thing appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/lawmakers-abandon-congress-maybe-that-is-a-good-thing/",
          "publishedOn": "2024-07-05T05:57:39.000Z",
          "wordCount": null,
          "title": "Lawmakers Abandon Congress – Maybe That is a Good Thing",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327182",
          "author": "Joseph Natoli",
          "description": "“The linkages between phases are not “right” or “wrong,” but rather suitable or unsuitable, useful or superfluous, meaningful or senseless.” – Jean-Francois Lyotard, The Differend: Phrases in Dispute If Biden runs and wins, we go along with an order of things established in his first term, an order of things structured and carried out by  More\nThe post Phrases for Thought: July 4, 2024 appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/phrases-for-thought-july-4-2024/",
          "publishedOn": "2024-07-05T05:56:14.000Z",
          "wordCount": null,
          "title": "Phrases for Thought: July 4, 2024",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327236",
          "author": "Henry Giroux",
          "description": "The guardrails of democracy have been blasted into dust. The Supreme Court’s ruling on presidential immunity grants presidents carte blanche to commit crimes as long as they act within their “constitutional authority.” Welcome to gangster capitalism. Trump, the convicted felon, white nationalist, white supremacist, and aspiring dictator, can rest assured that his dream of unaccountable  More\nThe post The Dismantling of Democracy: A Grim Projection of American Fascism Under Trump appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/the-dismantling-of-democracy-a-grim-projection-of-american-fascism-under-trump/",
          "publishedOn": "2024-07-05T05:56:09.000Z",
          "wordCount": null,
          "title": "The Dismantling of Democracy: A Grim Projection of American Fascism Under Trump",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327270",
          "author": "John P. Ruehl",
          "description": "Within a day of the June 2, 2024, release of a video documenting the abuse of prisoners of war by a Russian soldier in Ukraine, open-source intelligence (OSINT) researchers had identified the Russian citizen and his involvement in Ukraine going back a decade. Ukrainian officials subsequently sent letters to the International Committee of the Red Cross and the  More\nThe post The Growing Weaponization of Open-Source Information appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/the-growing-weaponization-of-open-source-information/",
          "publishedOn": "2024-07-05T05:55:59.000Z",
          "wordCount": null,
          "title": "The Growing Weaponization of Open-Source Information",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327040",
          "author": "Evan Jones",
          "description": "The Background The background should be uncontroversial. Israel was created by terrorism, facilitated by prior settler colonialism under a British umbrella, and not by the UN General Assembly ‘partition’ Resolution 181 (II) of 29 November 1947 (Suárez 2017a; Suárez 2017b). The majority vote was obtained by great powers realpolitik, by threats (including letter bombs) and  More\nThe post Zionism and the Academy Revisited appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/zionism-and-the-academy-revisited/",
          "publishedOn": "2024-07-05T05:55:31.000Z",
          "wordCount": null,
          "title": "Zionism and the Academy Revisited",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327264",
          "author": "Mitchell Zimmerman",
          "description": "If you hadn’t read the news in four years — or just arrived from another galaxy — the Supreme Court’s de facto grant of immunity to Donald Trump for his alleged federal crimes might sound almost reasonable. There are “unique risks,” six right-wing justices warned, that if a president were required to answer criminal charges, his energies would be  More\nThe post Supreme Court’s Immunity Ruling Gives President’s George III-like Power appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/supreme-courts-immunity-ruling-gives-presidents-george-iii-like-power/",
          "publishedOn": "2024-07-05T05:55:03.000Z",
          "wordCount": null,
          "title": "Supreme Court’s Immunity Ruling Gives President’s George III-like Power",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327269",
          "author": "Peter Certo",
          "description": "I was a student in the late 2000s when I had my first brush with “cancel culture.” A campus group had invited Nick Griffin — a racist Holocaust denier and leader of a fascist British political party, among other charming things — to speak. Many shocked students, including me, called Griffin’s views vile and warned  More\nThe post Extreme Inequality is a Threat to Free Speech appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/extreme-inequality-is-a-threat-to-free-speech/",
          "publishedOn": "2024-07-05T05:55:00.000Z",
          "wordCount": null,
          "title": "Extreme Inequality is a Threat to Free Speech",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327196",
          "author": "M. Reza Behnam",
          "description": "Israeli Zionists have always lusted after Palestine, but loathed its people.  Today is no exception. Ever since the birth of organized Zionism in 1897, its adherents have been bent on establishing a Jewish majority on a land not theirs and populated with a Palestinian Arab majority. Following the prison break of the Islamic Resistance Movement,  More\nThe post Stolen Land, Stolen Lives: Israel’s War on Palestine appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/stolen-land-stolen-lives-israels-war-on-palestine/",
          "publishedOn": "2024-07-05T05:54:12.000Z",
          "wordCount": null,
          "title": "Stolen Land, Stolen Lives: Israel’s War on Palestine",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327197",
          "author": "Omar Zahzah",
          "description": "It’s an increasingly familiar contradiction: digital platforms that position themselves as an accessible alternative to corporate media emerge as new censors in their own right. Social media and the internet make it possible to disseminate material that would otherwise have been suppressed, thereby helping to bring alternative conversations to the fore of mainstream awareness. And  More\nThe post Refusing the Language of Silence: Palestinian Resistance Goes Digital appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/refusing-the-language-of-silence-palestinian-resistance-goes-digital/",
          "publishedOn": "2024-07-05T05:53:33.000Z",
          "wordCount": null,
          "title": "Refusing the Language of Silence: Palestinian Resistance Goes Digital",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327189",
          "author": "Daniel Warner",
          "description": "Impressive far-right anti-immigration electoral gains caused French President Emmanuel Macron to dissolve the French National Assembly and call for snap legislative elections. But on the soccer pitch, all right-wing talk of “invading hordes” disappeared as French fans cheered on their national team led by players of foreign origin in the quadrennial European soccer tournament. Successful  More\nThe post French European Soccer Nationalism Transcends Xenophobia, at Least for the Moment appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/french-european-soccer-nationalism-transcends-xenophobia-at-least-for-the-moment/",
          "publishedOn": "2024-07-05T05:53:18.000Z",
          "wordCount": null,
          "title": "French European Soccer Nationalism Transcends Xenophobia, at Least for the Moment",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327202",
          "author": "Kathleen Wallace",
          "description": "You may have heard about the rumblings that happened during the FDR New Deal era that came from the business oligarchs. They were not pleased with the notion of any federal relief to mitigate the ongoing depression misery in the United States during the 1930’s. Some things certainly never change. Anyway, the banker-friendly oligarch types  More\nThe post The 1930s Business Plot Redux: This Time Success! appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/the-1930s-business-plot-redux-this-time-success/",
          "publishedOn": "2024-07-05T05:52:47.000Z",
          "wordCount": null,
          "title": "The 1930s Business Plot Redux: This Time Success!",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327267",
          "author": "Stewart Lawrence",
          "description": "Like it or not, if Joe Biden does decide to step down, or is somehow forced out of office, there’s only one person who can possibly replace him:  VP Kamala Haris.  Thanks to the Democrats’ abject refusal to pressure Biden to step aside last year, and to Biden’s own Mexican-style kibosh on the idea of  More\nThe post Can the Democrats “Rehabilitate” Kamala Harris? They May Have No Choice appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/can-the-democrats-rehabilitate-kamala-harris-they-may-have-no-choice/",
          "publishedOn": "2024-07-05T05:51:22.000Z",
          "wordCount": null,
          "title": "Can the Democrats “Rehabilitate” Kamala Harris? They May Have No Choice",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327329",
          "author": "John Laforge",
          "description": "Earthquakes routinely threaten reactor site The dumping of radioactive wastewater from the rubbished Fukushima nuclear reactor site in Japan was suspended for a day last March, after a 5.98-magnitude earthquake struck off the coast of the site, the Malaysia Star and Arab News Japan report. Tokyo Electric Power Co. (Tepco) said through a spokesperson that  More\nThe post Fukushima’s Forever Quagmire of Radiation Hazards appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/fukushimas-forever-quagmire-of-radiation-hazards/",
          "publishedOn": "2024-07-05T05:50:49.000Z",
          "wordCount": null,
          "title": "Fukushima’s Forever Quagmire of Radiation Hazards",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327327",
          "author": "Ron Jacobs",
          "description": "I’ve been on the road most of the last three weeks. Right now, River Shook’s new disc Revelations with their band Sarah Shook and the Disarmers is playing in the car. The Disarmers replaced a couple of members since their last disc, providing a more rounded sound. Likewise, the lyrics are perhaps a bit more  More\nThe post Scab of a Nation-4th of July 2024 Edition appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/scab-of-a-nation-4th-of-july-2024-edition/",
          "publishedOn": "2024-07-05T05:50:09.000Z",
          "wordCount": null,
          "title": "Scab of a Nation-4th of July 2024 Edition",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327216",
          "author": "Jack Rasmus",
          "description": "In the days immediately following the first US presidential debate between Joe Biden and Donald Trump, countless analyses have appeared. Nearly all have focused on the candidates’ delivery, less on what they said, and almost nothing about what should have been but was not said. Trump was obviously coached by his team to tone down  More\nThe post The Presidential Debate That Wasn’t appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/the-presidential-debate-that-wasnt/",
          "publishedOn": "2024-07-05T05:49:27.000Z",
          "wordCount": null,
          "title": "The Presidential Debate That Wasn’t",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327261",
          "author": "Katherine Dolan",
          "description": "Climate change is, by far, the biggest story of our era, an existential threat that has already profoundly affected life on Earth and promises to change it even more radically over the next few centuries. As our most pressing problem, it has inspired numerous non-fiction texts—news articles, science journalism, documentaries, academic monographs, and pop-science books  More\nThe post How Science Fiction Can Inspire Climate Activism appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/how-science-fiction-can-inspire-climate-activism/",
          "publishedOn": "2024-07-05T05:45:00.000Z",
          "wordCount": null,
          "title": "How Science Fiction Can Inspire Climate Activism",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327331",
          "author": "Evaggelos Vallianatos",
          "description": "If you are a millionaire or billionaire, the United States in 2024 is a dream nation. Super rich Americans have converted the country from a permanent war “middle class” society to a permanent war oligarchy with monarchical greed and ambition. The Supreme Court favors the metamorphosis of the more or less democratic United States to  More\nThe post Supreme Court Madness appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/supreme-court-madness/",
          "publishedOn": "2024-07-05T05:44:38.000Z",
          "wordCount": null,
          "title": "Supreme Court Madness",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327266",
          "author": "Rev. Lennox Yearwood Jr.",
          "description": "In Louisiana’s “Cancer Alley,” where the air is thick with pollutants and asthma rates are alarmingly high, a troublesome irony is unfolding. This region is home to sprawling petrochemical plants and toxic fossil fuels that disproportionately affect the respiratory health of the area’s majority-Black residents. Here, inhalers — one of the key tools for managing  More\nThe post The Paradox of Public Health Situations That Worsen With Climate Change appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/the-paradox-of-public-health-situations-that-worsen-with-climate-change/",
          "publishedOn": "2024-07-05T05:43:13.000Z",
          "wordCount": null,
          "title": "The Paradox of Public Health Situations That Worsen With Climate Change",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327382",
          "author": "David Yearsley",
          "description": "From last Sunday evening through yesterday afternoon, some 2,000 organists have been shuttling around the San Francisco Bay Area for a program of lectures, workshops, and concerts. This installment of the bi-annual convention of the American Guild of Organists (A. G. O.) concluded with a Fourth of July solo recital by the American organist and  More\nThe post Gilded Age Organ Riches from long A. G. O. and Last Week appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/gilded-age-organ-riches-from-long-a-g-o-and-last-week/",
          "publishedOn": "2024-07-05T05:40:58.000Z",
          "wordCount": null,
          "title": "Gilded Age Organ Riches from long A. G. O. and Last Week",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327106",
          "author": "Ngũgĩ wa Thiong’o",
          "description": "I feel greatly honored  with this honorary doctorate from Queen’s University in Kingston, Canada. But I have a little confession to make. When I first read your letter of invitation, the first words  that jumped in my mind were Kingston, Queens, and Canada. I thought there was a mistake. I used to love the song,  More\nThe post Let Canada Live Up to Its Name of Kanata appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/let-canada-live-upt-to-its-name-of-kanata/",
          "publishedOn": "2024-07-05T05:40:06.000Z",
          "wordCount": null,
          "title": "Let Canada Live Up to Its Name of Kanata",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327312",
          "author": "Richard Schulman",
          "description": "Based on a True Story. Sometimes you don’t know where you are until you stand alone, there. The Baltic Sea I stood with: I thought about all of the nations that rest ashore: I dreamed about the serenity and volatile currents that travel from shore to shore: I remembered where I had landed before and  More\nThe post Architecture of Cities: the Irony of Bears appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/architecture-of-cities-the-irony-of-bears/",
          "publishedOn": "2024-07-05T05:35:37.000Z",
          "wordCount": null,
          "title": "Architecture of Cities: the Irony of Bears",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327309",
          "author": "Kim C. Domenico",
          "description": "What racism did to people like myself was that it opened the door that there is something fundamentally wrong in the world in which we live.  What Malcolm X did was give us a key to understand there is something far far bigger, beyond that door.  Beyond the darkness.  We can negate the world in  More\nThe post  Can White People ‘Negate the World’ That’s Our Oyster? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/can-white-people-negate-the-world-thats-our-oyster/",
          "publishedOn": "2024-07-05T05:32:05.000Z",
          "wordCount": null,
          "title": "Can White People ‘Negate the World’ That’s Our Oyster?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327325",
          "author": "Nicky Reid",
          "description": "If there is just one thing left that quite literally everyone in this country can agree on this Independence Day, it is the indisputable fact that there is something profoundly wrong with America and it’s not hard to see why. America is a country where the economy can be a booming success while the middle  More\nThe post Smash the Fourth appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/smash-the-fourth/",
          "publishedOn": "2024-07-05T05:15:23.000Z",
          "wordCount": null,
          "title": "Smash the Fourth",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": [
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=30686",
          "author": "Marco Del Negro, Keshav Dogra, Pranay Gundam, Donggyu Lee, and Brian Pacula",
          "description": "This post discusses the distributional consequences of an aggressive policy response to inflation using a Heterogeneous Agent New Keynesian (HANK) model. We find that, when facing demand shocks, stabilizing inflation and real activity go hand in hand, with very large benefits for households at the bottom of the wealth distribution. The converse is true however when facing supply shocks: stabilizing inflation makes real outcomes more volatile, especially for poorer households. We conclude that distributional considerations make it much more important for policy to take into account the tradeoffs between stabilizing inflation and economic activity. This is because the optimal policy response depends very strongly on whether these tradeoffs are present (that is, when the economy is facing supply shocks) or absent (when the economy is facing demand shocks).",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/07/on-the-distributional-consequences-of-responding-aggressively-to-inflation/",
          "publishedOn": "2024-07-03T11:00:00.000Z",
          "wordCount": 4595,
          "title": "On the Distributional Consequences of Responding Aggressively to Inflation",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/07/LSE_2024_HANK-aggressive-inflation_delnegro_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=30644",
          "author": "Marco Del Negro, Keshav Dogra, Pranay Gundam, Donggyu Lee, and Brian Pacula",
          "description": "This post and the next discuss the distributional effects of inflation and inflation stabilization through the lenses of a theoretical model—a Heterogeneous Agent New Keynesian (HANK) model. This model combines the features of New Keynesian models that have been the workhorse for monetary policy analysis since the work of Woodford (2003) with inequality in wealth and income at the household level following the seminal contribution of Kaplan, Moll, and Violante (2018). We find that while inflation hurts everyone, it hurts the poor in particular. When the source of inflation is a supply shock, fighting inflation aggressively hurts the poor even more, however, while the opposite is true for demand shocks, as discussed in the companion post.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/07/on-the-distributional-effects-of-inflation-and-inflation-stabilization/",
          "publishedOn": "2024-07-02T11:00:00.000Z",
          "wordCount": 4772,
          "title": "On the Distributional Effects of Inflation and Inflation Stabilization",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/07/LSE_2024_HANK-IRFs_delnegro_460_18bb85.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=30548",
          "author": "Guillaume Roussellet",
          "description": "Since the late 1990s, the U.S. Treasury has issued debt in two main forms: nominal bonds, which provide fixed-cash scheduled payments, and Treasury Inflation Protected Securities—or TIPS—which provide the holder with inflation-protected payments that rise with U.S. inflation. At the heart of their relative valuation lie market participants’ expectations of future inflation, an object of interest for academics, policymakers, and investors alike. After briefly reviewing the theoretical and empirical links between TIPS and Treasury yields, this post, based on a recent research paper, explores whether market perceptions of U.S. sovereign credit risk can help explain the relative valuation of these financial instruments.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/07/exploring-the-tips-treasury-valuation-puzzle/",
          "publishedOn": "2024-07-01T11:00:00.000Z",
          "wordCount": 4337,
          "title": "Exploring the TIPS‑Treasury Valuation Puzzle",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/06/LSE_2024_TIPS-treasury_roussellet_460.jpg"
        }
      ]
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45462",
          "author": "Editor",
          "description": "from Lars Syll So, certainly, both non-theorists and some theorists have little patience for research that displays mathematical ingenuity but has no value as social science. But defining this work exactly is impossible. This sort of work is like pornography quite simple to recognize when one sees it. Jeffrey Ely As researchers, we (mostly) want […]",
          "link": "https://rwer.wordpress.com/2024/07/04/weekend-read-theory-and-reality-in-economics/",
          "publishedOn": "2024-07-04T11:06:52.000Z",
          "wordCount": 7552,
          "title": "Weekend read: Theory and reality in economics",
          "imageUrl": "https://larspsyll.wordpress.com/wp-content/uploads/2013/12/math15.gif"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=274503",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics: First post-debate RCP polling averages; forthcoming Biden interview; our famously free press; CDC flipflops on vax only (over the Fourth of July weekend); consciousness: we know nothing. ~",
          "link": "https://www.nakedcapitalism.com/2024/07/200pm-water-cooler-july-5-2004.html",
          "publishedOn": "2024-07-05T18:00:39.000Z",
          "wordCount": 9666,
          "title": "2:00PM Water Cooler July 5, 2004",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/rcp_2024-07-05.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274496",
          "author": "Yves Smith",
          "description": "How long has the cover-up about Biden's deterioration been going on?",
          "link": "https://www.nakedcapitalism.com/2024/07/how-many-people-knew-about-biden-turns-out-a-lot.html",
          "publishedOn": "2024-07-05T13:48:30.000Z",
          "wordCount": 14665,
          "title": "How Many People Knew About Biden? Turns Out, A Lot",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/00-Biden.webp"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274479",
          "author": "Lambert Strether",
          "description": "Our relaxed daily links.",
          "link": "https://www.nakedcapitalism.com/2024/07/links-7-5-2024.html",
          "publishedOn": "2024-07-05T10:58:31.000Z",
          "wordCount": 17360,
          "title": "Links 7/5/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/kowloon-1.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274453",
          "author": "Nick Corbishley",
          "description": "Big tech and fintech companies would certainly like to think so, as too does the City of London Corporation and Starmer's mentor, Tony Blair",
          "link": "https://www.nakedcapitalism.com/2024/07/will-a-keir-starmer-government-make-digital-identity-a-reality-in-uk.html",
          "publishedOn": "2024-07-05T10:45:12.000Z",
          "wordCount": 5787,
          "title": "Will a Keir Starmer Government Make Digital Identity a Reality in the UK?",
          "imageUrl": "https://sociable.co/wp-content/uploads/2022/02/Digital-Identity-Chart.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274454",
          "author": "Yves Smith",
          "description": "An updated look at the classic resource curse.",
          "link": "https://www.nakedcapitalism.com/2024/07/the-new-curse-of-critical-minerals.html",
          "publishedOn": "2024-07-05T04:22:01.000Z",
          "wordCount": 4671,
          "title": "The New Curse of Critical Minerals",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274461",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Open Thread ~",
          "link": "https://www.nakedcapitalism.com/2024/07/200pm-water-cooler-july-4-2004.html",
          "publishedOn": "2024-07-04T18:00:40.000Z",
          "wordCount": 10291,
          "title": "2:00PM Water Cooler July 4, 2004",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/irises.jpeg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274438",
          "author": "Lambert Strether",
          "description": "Our flag-waving daily links",
          "link": "https://www.nakedcapitalism.com/2024/07/links-7-4-2024.html",
          "publishedOn": "2024-07-04T10:58:28.000Z",
          "wordCount": 19056,
          "title": "Links 7/4/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/walled-world-2.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274432",
          "author": "Yves Smith",
          "description": "Why Germany's claimed  green transition progress is less impressive than it appears when you decompose the data.",
          "link": "https://www.nakedcapitalism.com/2024/07/germanys-grid-is-getting-greener-as-its-industry-is-weakening.html",
          "publishedOn": "2024-07-04T06:14:47.000Z",
          "wordCount": 6715,
          "title": "Germany’s Grid Is Getting Greener as Its Industry Is Weakening",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274428",
          "author": "Yves Smith",
          "description": "The \"second American Revolution\" underway will \"remain bloodless,\" said the head of Project 2025 \"if the left allows it to be.\"",
          "link": "https://www.nakedcapitalism.com/2024/07/project-2025-architect-signals-bloodshed-if-left-opposes-trump-led-revolution.html",
          "publishedOn": "2024-07-04T04:56:06.000Z",
          "wordCount": 15502,
          "title": "Project 2025 Architect Signals Bloodshed If Left Opposes Trump-Led ‘Revolution’",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274388",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemis; Jill Biden, Vogue cover girl; Stevie Nicks and Taylor Swift; Great Barrington grifters.~",
          "link": "https://www.nakedcapitalism.com/2024/07/200pm-water-cooler-7-3-2024.html",
          "publishedOn": "2024-07-03T18:00:17.000Z",
          "wordCount": 18411,
          "title": "2:00PM Water Cooler 7/3/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/rcp_2024-07-02.png"
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "6687ef98a4598c000bd710d0",
          "author": "João Tomé",
          "description": "Here, we explore the dynamics of Internet traffic and cybersecurity during the UK’s 2024 general election, highlighting late-day traffic changes and a post-vote attack on a political party",
          "link": "https://blog.cloudflare.com/uk-election-day-2024-traffic-trends-and-attacks-on-political-parties",
          "publishedOn": "2024-07-05T13:24:49.000Z",
          "wordCount": 1584,
          "title": "UK election day 2024: traffic trends and attacks on political parties",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/UK-election-day-2024--traffic-trends-and-attacks-on-political-parties-OG-1.png"
        },
        {
          "id": "668519cda4598c000bd709a9",
          "author": "Bryton Herdes",
          "description": "On June 27, 2024, a small number of users globally may have noticed that 1.1.1.1 was unreachable or degraded. The root cause was a mix of BGP (Border Gateway Protocol) hijacking and a route leak",
          "link": "https://blog.cloudflare.com/cloudflare-1111-incident-on-june-27-2024",
          "publishedOn": "2024-07-04T13:00:50.000Z",
          "wordCount": 3912,
          "title": "Cloudflare 1.1.1.1 incident on June 27, 2024",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/Cloudflare-1.1.1.1-incident-on-June-27--2024-OG-1.png"
        },
        {
          "id": "66853348a4598c000bd709b9",
          "author": "João Tomé",
          "description": "How Cloudflare mitigated DDoS attacks targeting French political parties during the 2024 legislative elections, as detailed in our ongoing election coverage",
          "link": "https://blog.cloudflare.com/first-round-of-french-election-2024-party-attacks-and-a-modest-traffic-dip",
          "publishedOn": "2024-07-03T13:00:34.000Z",
          "wordCount": 1004,
          "title": "First round of French election: party attacks and a modest traffic dip",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/First-round-of-French-election--party-attacks-and-a-modest-traffic-dip-OG-1.png"
        },
        {
          "id": "668274eea4598c000bd707cf",
          "author": "Alex Bocharov",
          "description": "To help preserve a safe Internet for content creators, we’ve just launched a brand new “easy button” to block all AI bots. It’s available for all customers, including those on our free tier",
          "link": "https://blog.cloudflare.com/declaring-your-aindependence-block-ai-bots-scrapers-and-crawlers-with-a-single-click",
          "publishedOn": "2024-07-03T13:00:26.000Z",
          "wordCount": 1939,
          "title": "Declare your AIndependence: block AI bots, scrapers and crawlers with a single click",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/Declareyour-AIndependence--block-AI-bots--scrapers-and-crawlers-with-a-single-click-OG-1.jpg"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": [
        {
          "id": "https://slack.engineering/?p=16763",
          "author": "Nilanjana Mukherjee",
          "description": "Slack Data Engineering recently underwent data workload migration from AWS EMR 5 (Spark 2/Hive 2 processing engine) to EMR 6 (Spark 3 processing engine). In this blog, we will share our migration journey, challenges, and the performance gains we observed in the process. This blog aims to assist Data Engineers, Data Infrastructure Engineers, and Product […]\nThe post Unlocking Efficiency and Performance: Navigating the Spark 3 and EMR 6 Upgrade Journey at Slack appeared first on Slack Engineering.",
          "link": "https://slack.engineering/unlocking-efficiency-and-performance-navigating-the-spark-3-and-emr-6-upgrade-journey-at-slack/",
          "publishedOn": "2024-07-02T09:00:00.000Z",
          "wordCount": 2733,
          "title": "Unlocking Efficiency and Performance: Navigating the Spark 3 and EMR 6 Upgrade Journey at Slack",
          "imageUrl": "https://slack.engineering/wp-content/uploads/sites/7/2024/07/entering_a_room_for_migration_left_door_says_apache_spark_right_door_says_aws_emr_science_fiction-1.jpeg?w=640"
        }
      ]
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": []
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": [
        {
          "id": "https://code.visualstudio.com/updates/v1_91",
          "author": null,
          "description": "Learn what is new in the Visual Studio Code June 2024 Release (1.91)\nRead the full article",
          "link": "https://code.visualstudio.com/updates/v1_91",
          "publishedOn": "2024-07-03T17:00:00.000Z",
          "wordCount": 3652,
          "title": "Visual Studio Code June 2024",
          "imageUrl": "https://code.visualstudio.com/assets/updates/1_91/release-highlights.png"
        }
      ]
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": []
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=40882247",
          "author": "wavemode",
          "description": "Always obligatory https://mikelui.io/img/c++_init_forest.gif",
          "link": "https://news.ycombinator.com/item?id=40882247",
          "publishedOn": "2024-07-05T12:47:36.000Z",
          "wordCount": 297,
          "title": "New comment by wavemode in \"I have no constructor, and I must initialize\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40881928",
          "author": "marton78",
          "description": "After almost 20 years of experience with C++, there are still some gnarly details I wouldn't have imagined. What a God awful language!\nKudos to that author for the great, eye catching title and the in depth detail!",
          "link": "https://news.ycombinator.com/item?id=40881928",
          "publishedOn": "2024-07-05T11:54:12.000Z",
          "wordCount": 6210,
          "title": "New comment by marton78 in \"I have no constructor, and I must initialize\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40877710",
          "author": "duffpkg",
          "description": "Lifepo4 (lithium iron phosphate) batteries for the home are pretty cheap as of today. Power storage for residential use in a 48v metal rackable linkable system with battery management system (BMS) is $89/kwh shipped/duty paid from reputable chinese suppliers CATL/Seplos etc. You have to wait for sea shipping, add $30/kwh if you want to buy it in the US today.\nFrom the same suppliers sodium batteries are currently $130/kwh and about 26% less efficient in the same form factor. I look forward to this changing.\nDue to rising power costs I moved one of my homes completely to solar and battery (lifepo4) and haven't had any problems. I can't imagine ever going back to the power company. Panels have gotten to the point of being ridiculously cheap. I have a lot of space. I purchased pallets of used panels for more or less the cost of transportation ($34 per panel 270w). They produce about 85% of their nominal rating.\nI mention this because other comments mention costs that are much much higher.",
          "link": "https://news.ycombinator.com/item?id=40877710",
          "publishedOn": "2024-07-04T20:15:06.000Z",
          "wordCount": 9956,
          "title": "New comment by duffpkg in \"Batteries: How cheap can they get?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40877288",
          "author": "Schiphol",
          "description": "The paper [here](https://bhi.co.uk/wp-content/uploads/2024/06/07-HJJuly24-AOT...) makes it clear that these researchers (whose main topic is gravitational waves) have used Bayesian analyses to estimate how likely different counts for holes present in the full calendar ring are. This is cool, but the bit about \"techniques developed to analyse the ripples in spacetime\" is, well, making reference to Bayesian analysis.",
          "link": "https://news.ycombinator.com/item?id=40877288",
          "publishedOn": "2024-07-04T19:12:43.000Z",
          "wordCount": null,
          "title": "New comment by Schiphol in \"Gravitational wave researchers cast new light on Antikythera mechanism mystery\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40876410",
          "author": "pembrook",
          "description": "While this sucks, my phone is in so many data breaches at this point it doesn’t matter.\nThe spam-to-ham ratio on my phone number is now far worse than any other channel for me. The traditional phone network is at risk of going the way of the fax machine if we don’t do something about the spam problem like we did with email.\nIf I’m on a call, even with family, it’s now almost exclusively on FaceTime/zoom/meet/etc. I can’t remember the last time I talked on the traditional phone network or received a legitimate call. Which isn’t great because those aforementioned platforms are all proprietary walled gardens with terrible incentives — once they capture the market fully they will eventually dump ads all over your calls. Don’t believe me? Just look at what Gmail did to monetize the lock-in on your inbox.",
          "link": "https://news.ycombinator.com/item?id=40876410",
          "publishedOn": "2024-07-04T17:02:28.000Z",
          "wordCount": 8728,
          "title": "New comment by pembrook in \"Twilio confirms data breach after hackers leak 33M Authy user phone numbers\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40874156",
          "author": "adamgordonbell",
          "description": "Host here, thanks for sharing.\nPowerShell faced extreme opposition at Microsoft, and its creator Jeffrey Snover was demoted for pursuing it.\nJeffrey was originally brought into Microsoft to help MS learn how to compete in the data center, but culturally they were so tied to the personal computer model of the world, that they fought him every step of the way.\nEdit: Another interesting thing, is how Powershell exists because Windows isn't file based. Jeffrey's goal was server administration, but on Windows you can't just edit files to administer things, you need to call various APIs and get structured data back forth. The rich object model fell out of that. It was the only way.\n( Also, apologies if the transcript has errors. I've gone from professional transcriptions to Descript and then a pass of GPT4 trying to find the right punctation breaks and then me doing a quick read through. I don't think its coming out as high quality as I'd like. )",
          "link": "https://news.ycombinator.com/item?id=40874156",
          "publishedOn": "2024-07-04T11:55:08.000Z",
          "wordCount": 5943,
          "title": "New comment by adamgordonbell in \"Jeffrey Snover and the Making of PowerShell\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40873472",
          "author": "febeling",
          "description": "I had similar thoughts. But let's not overlook the information asymmetry, which contributed to the dissatisfaction. I don't want to live in a world which is controlled unilaterally, and intransparently by a group of people who assume they have a full picture of the situation and assume they understand moral completely, and also don't think it necessary to explain how they think so highly of themselves.",
          "link": "https://news.ycombinator.com/item?id=40873472",
          "publishedOn": "2024-07-04T09:09:18.000Z",
          "wordCount": 1535,
          "title": "New comment by febeling in \"Shipt’s algorithm squeezed gig workers, who fought back\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40872836",
          "author": "vouwfietsman",
          "description": "> It's worth repeating: Unless you have a stake in the company, it is NOT your job to make sure the company is the most profitable it can be. Your job is to create great software\nThis is a terrible take, and one I generally see as a signal of lack of seniority in a software dev. It is absolutely everybody's job in the company to make sure it is profitable, unless you work for a non-profit.\nThe thing is though, that profitable is not the same as \"just ship it\". If you're in a company where those things are conflated frequently, that's a sign of lack of seniority in management.\n> Your job is to create great software\nIt really isn't, your job is to make a great product. Making a great product often, but not always, requires great software. Many great products have terrible software behind them. The tension between product, sales and development should result in a compromise that creates the most value short, middle and long term. It is 100% your job as a developer to understand what can and cannot be hacked, what priorities the company has beside delivering great software, and finally: when great software must be made, because compromise is unwise.\nJust like the boy who cried wolf, the developer who can never compromise on software quality is powerless when there is an actual reason to not compromise on software quality, and rightfully so.",
          "link": "https://news.ycombinator.com/item?id=40872836",
          "publishedOn": "2024-07-04T06:38:52.000Z",
          "wordCount": null,
          "title": "New comment by vouwfietsman in \"The saddest \"Just Ship It\" story ever (2020)\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40872802",
          "author": "or_am_i",
          "description": "I am not defending Shipt and there is no doubt gig workers are in a very vulnerable position. However, the data analysis results as presented in the article do not support the article's main point. \"40% are getting paid at least 10% less\" is not unnatural to expect whenever pay is redistributed, especially since some 30+% are getting at least 10% more. Imagine a _hypothetical_ situation where Shipt is 100% on point and driving a fairer version of the algorithm patch removing a way for workers to \"optimize\" for short, well paid trips, resulting in pay cuts to those who had learnt how to do it, while not changing/increasing pay for everyone else. We would see the same kind of result: some portion of workers would get paid 10% less, some 10% more. This does show that workers are paid differently for the same work they have been doing, but does not prove the change is unfair.",
          "link": "https://news.ycombinator.com/item?id=40872802",
          "publishedOn": "2024-07-04T06:29:50.000Z",
          "wordCount": null,
          "title": "New comment by or_am_i in \"Shipt’s algorithm squeezed gig workers, who fought back\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40872077",
          "author": "sfink",
          "description": "This reminds me of something that I heard once from a Chinese teacher. I can't vouch for the accuracy of it, but he was definitely on to something: In the West, it is assumed that it is the speaker's job to make himself understood to his listeners. In the East, it is the other way around.\nIn recent times, it seems like we've gotten even more extreme. The speaker or writer must not only spoon-feed the understanding, they also have to provide the motivation and the entertainment. Which I find sad, because some things you can't get unless you go to the effort of extracting them yourself. (See many reproducible psychology findings about retention being highly correlated with depth of processing, for example.) It's like the information equivalent of highly processed food.\nI find myself falling into this trap on sites like this. An interesting but difficult article will be posted, I won't immediately know what to think or where I stand on the topic, and I'll flip to the comments so that I can get some part of the collective to tell me what to think and how to feel about it. Which is also sad.\nIn paintings, it is known that the viewer can get out more than the painter put in. It used to be the same with writing, but it feels like that is becoming more rare and less acceptable. If a reader can't follow the argument, it's automatically the author's fault and a waste of the reader's time. Heaven forbid the reader might need to exert some effort and grow in the gleaning.",
          "link": "https://news.ycombinator.com/item?id=40872077",
          "publishedOn": "2024-07-04T03:21:34.000Z",
          "wordCount": null,
          "title": "New comment by sfink in \"The joy of reading books you don't understand\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40869863",
          "author": "LarsDu88",
          "description": "According to Jensen it takes about 8000 H100s running for 90 days to train a 1.8 Trillion param MoE GPT-4 scale model.\nMeta has about 350,000 of these GPUs and a whole bunch of A100s. This means the ability to train 50 GPT-4 scale models every 90 days or 200 such models per year.\nThis level of overkill suggests to me that the core models will be commoditized to oblivion, making the actual profit margins from AI-centric companies close to 0, especially if Microsoft and Meta keep giving away these models for free.\nThis is actually terrible for investors, but amazing for builders (ironically).\nThe real value methinks is actually over the control of proprietary data used for training which is the single most important factor for model output quality. And this is actually as much an issue for copyright lawyers rather than software engineers once the big regulatory hammers start dropping to protect American workers.",
          "link": "https://news.ycombinator.com/item?id=40869863",
          "publishedOn": "2024-07-03T20:51:30.000Z",
          "wordCount": 8081,
          "title": "New comment by LarsDu88 in \"AI's $600B Question\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40868717",
          "author": "philshem",
          "description": "> \"The food I make is all transparent,\" says (chef) Blandy. \"There are no rich sauces, it's all plain, simple cooking with a light amount of seasoning, light amount of oil, fresh herbs and citrus.\nThat’s some top-notch nominative determinism.\nhttps://en.wikipedia.org/wiki/Nominative_determinism",
          "link": "https://news.ycombinator.com/item?id=40868717",
          "publishedOn": "2024-07-03T18:28:03.000Z",
          "wordCount": null,
          "title": "New comment by philshem in \"Tour de France: How professional cycling teams eat and cook on the road\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40868676",
          "author": "iforgotpassword",
          "description": "My secret protip: old Fujitsu desktop/nuc PCs. At least in Germany (Europe?) they are cheap on ebay since a lot of businesses use them and upgrade on a regular schedule.\nIf you care about power consumption like I do, you can Google \"$model energy consumption white paper\" which contains very accurate data about idle usage, for example https://sp.ts.fujitsu.com/dmsp/Publications/public/wp-energy...\nIn one case I had a nuc where on Linux after enabling power saving features for the sata controller, idle usage even fell to 5W when the pdf claimed 9.\nHaving an actual pc instead of a random sbc ensures best connectivity, expandability, and software support forever. With almost all sbcs you're stuck with a random-ass kernel from when the damn thing was released, and you basically have to frankenstein together your own up-to-date distro with the old kernel because the vendor certainly doesn't care about updating the random armbian fork they created for that thing.",
          "link": "https://news.ycombinator.com/item?id=40868676",
          "publishedOn": "2024-07-03T18:23:56.000Z",
          "wordCount": null,
          "title": "New comment by iforgotpassword in \"The Cheapest NAS\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40864609",
          "author": "thrance",
          "description": "I remember seeing a talk from Jonathan Blow where he made a comparison: in the 1960s top engineers worked for NASA and put a man on the moon in a decade, basically doing computations by hand. \nToday, we have super advanced computers and tech companies enjoy 100× times more of the top engineers than NASA ever had, and they are all working toward making you click on ads more.",
          "link": "https://news.ycombinator.com/item?id=40864609",
          "publishedOn": "2024-07-03T10:28:44.000Z",
          "wordCount": null,
          "title": "New comment by thrance in \"I Received an AI Email\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40863919",
          "author": "ossyrial",
          "description": "The author links to the somewhat dystopian blog where the email sender is quite proud of their work. Their words (or perhaps that of an LLM):\n> Could an AI agent craft compelling emails that would capture people's attention and drive engagement, all while maintaining a level of personalization that feels human? I decided to find out.\n> The real hurdle was ensuring the emails seemed genuinely personalized and not spammy. I knew that if recipients detected even a whiff of a generic, mass-produced message, they'd tune out immediately.\n> Incredibly, not a single recipient seemed to detect that the emails were AI-generated.\nhttps://www.wisp.blog/blog/how-i-use-ai-agents-to-send-1000-...\nThe technical part surprised me: they string together multiple LLMs which do all the work. It's a shame the author's passions are directed towards AI slop-email spam, all for capturing attention and driving engagement.\nHow much of our societal progress and collective thought and innovation has gone to capturing attention and driving up engagement, I wonder.",
          "link": "https://news.ycombinator.com/item?id=40863919",
          "publishedOn": "2024-07-03T08:28:02.000Z",
          "wordCount": null,
          "title": "New comment by ossyrial in \"I Received an AI Email\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40863586",
          "author": "taylorius",
          "description": "The future - megawatts of electricity being used, 24/7 as armies of LLMs email and debate each other, and try to sell each other programs at a great discount.\nAs for the humans, we went fishing instead.",
          "link": "https://news.ycombinator.com/item?id=40863586",
          "publishedOn": "2024-07-03T07:26:50.000Z",
          "wordCount": null,
          "title": "New comment by taylorius in \"I Received an AI Email\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40856990",
          "author": "erva",
          "description": "Qualifier: Former US special operations operator that served in multiple wars.\nMy anecdotal take is there are many ways that shock and trauma can accumulate through training and war that are far beyond the minimal effects of an M4.\nFirearms: While the primary weapons systems are the M4 and side arm (pistol), there are many weapons systems utilized by special operations such as sniper rifles, crew serve weapons, and niche small arms.\nThe M82 sniper rifle shoots a 50 BMG round. In either the bolt action or semi-auto versions they feel like you are getting punched in the face when you shoot them.\nCrew serve weapons like the MK19 and M2 do pack a punch.  The MK19 is a machine gun that shoots 40mm grenades.  The M2 is a .50 cal machine gun.  These weapons systems are mounted, but the percussion of them is still far greater than an M4.\nMore niche arms like the M249 SAW, M16 HBAR, full-auto AKs, M240 Golf, MP9, etc are not as mild as the standard M4/M16.\nBlasts: There are many types of blasts encountered such as Mortars (inbound and outbound), Flash Bangs, Entry charges, IEDs, Landmines, etc.  These do make your head ring if you are close enough to them.\nIn my own personal experience there are many other daily jarring events that aren't nearly as sexy to talk about.  Riding in the back of a 5 ton will almost shake your brain out of your head.  Riding in an LCAC (hovercraft) is like riding in a 5 ton.  Doing boat work in Zodiacs will bounce you all over the place, especially when doing surf passages.  Doing hydrographic surveys right where the surf breaks will pound you for hours and make you a little sick afterwards. When your chute opens on a jump, if jumping round chutes, will make you see stars...the landing is not a soft pretty one like rectangle chutes...you hit the ground hard.\nThere are many more ways your body gets pounded on a daily basis far in excess of the weapons you use.",
          "link": "https://news.ycombinator.com/item?id=40856990",
          "publishedOn": "2024-07-02T14:21:23.000Z",
          "wordCount": null,
          "title": "New comment by erva in \"Pattern of brain damage is pervasive in Navy SEALs who died by suicide\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40855435",
          "author": "awesomekling",
          "description": "Yes, we are aware of how permissive licenses work.\nIf someone forks our code and does a better job with it than we do, fair game. :)",
          "link": "https://news.ycombinator.com/item?id=40855435",
          "publishedOn": "2024-07-02T11:06:57.000Z",
          "wordCount": null,
          "title": "New comment by awesomekling in \"Ladybird Web Browser becomes a non-profit with $1M from GitHub Founder\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40854904",
          "author": "awesomekling",
          "description": "Hello friends, Ladybird founder here!\nHere's a short video from Chris Wanstrath announcing our non-profit yesterday, and kicking things off with a $1M donation: https://www.youtube.com/watch?v=k9edTqPMX_k\nHappy to answer questions :)",
          "link": "https://news.ycombinator.com/item?id=40854904",
          "publishedOn": "2024-07-02T09:32:30.000Z",
          "wordCount": null,
          "title": "New comment by awesomekling in \"Ladybird Web Browser becomes a non-profit with $1M from GitHub Founder\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40852271",
          "author": "willio58",
          "description": "Agreed. I mainly manage and review code at this point in my career. I find many bugs, every once in a while finding something that would have caused an outage or notable problem for users.\nWhat I find more though is code that isn't thought through. Tech debt and code smell are real, and they affect the performance of a team. Nipping that in the bud takes quality PR reviews and time to meet with submitters around issues you find.\nKnock on wood but working at the company I do now where I, along with my team, have made quality PR reviews normal.. our codebase is now enjoyable and fun to work on. I highly recommend it!\nOne key aspect is being “kind, not nice”. Be helpful when leaving comments in PRs, but don’t be nice for the sake of avoiding conflict.\nAlso if you find code reviews to be a waste of time I can reccomend one thing I do often - give warnings. I approve and give comments around things I’d like to be fixed in the future for similar PRs. I don’t hold up the merge for little things, but at the same time I won’t let the little things slide forever",
          "link": "https://news.ycombinator.com/item?id=40852271",
          "publishedOn": "2024-07-02T00:16:16.000Z",
          "wordCount": null,
          "title": "New comment by willio58 in \"Code reviews do find bugs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40850459",
          "author": "JumpCrisscross",
          "description": "Article III of the U.S. Constitution is incredibly brief [1].\nI propose the Supreme Court be reconstituted such that for each case a panel of judges from the appellate courts is chosen by lot. They hear that case, write their opinion, and then go back to that work. New case, new lot.\nHaving a permanent bench of judicial oligarchs made sense before telecommunication. It doesn’t anymore. Every ancient democracy used randomness to control corruption. I think it’s time we took a lesson from them.\n(Note: this could be done by statute. How the supreme Court is constituted is entirely left to Congress.)\n[1] https://constitution.congress.gov/constitution/article-3/",
          "link": "https://news.ycombinator.com/item?id=40850459",
          "publishedOn": "2024-07-01T20:46:31.000Z",
          "wordCount": null,
          "title": "New comment by JumpCrisscross in \"Supreme Court rules ex-presidents have immunity for official acts\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40849850",
          "author": "jmward01",
          "description": "The reality with this ruling is it will embolden future presidents to do things that are to their advantage even if they think those actions may be illegal. Presidents don't need more protection from people. We the people need more protection from them.",
          "link": "https://news.ycombinator.com/item?id=40849850",
          "publishedOn": "2024-07-01T19:49:19.000Z",
          "wordCount": null,
          "title": "New comment by jmward01 in \"Supreme Court rules ex-presidents have immunity for official acts\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40848976",
          "author": "saucetenuto",
          "description": "Guess again!  Roberts explicitly calls out orders to the military as covered by absolute immunity.  EDIT: and motive is explicitly barred from review too.",
          "link": "https://news.ycombinator.com/item?id=40848976",
          "publishedOn": "2024-07-01T18:44:21.000Z",
          "wordCount": null,
          "title": "New comment by saucetenuto in \"Supreme Court rules ex-presidents have immunity for official acts\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40848647",
          "author": "leotravis10",
          "description": "Folks, the blueprint for a American dictatorship has been created and you'll be a fool and a idiot to think otherwise.",
          "link": "https://news.ycombinator.com/item?id=40848647",
          "publishedOn": "2024-07-01T18:17:50.000Z",
          "wordCount": null,
          "title": "New comment by leotravis10 in \"Supreme Court rules ex-presidents have immunity for official acts\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40848542",
          "author": "treeFall",
          "description": ">The President of the United States is the most powerful person in the country, and possibly the world. When he uses his official powers in any way, under the majority's reasoning, he now will be insulated from criminal prosecution. Orders the Navy's Seal Team 6 to assassinate a political rival? Immune.\nI would consider this an extreme knee jerk take, but it's Sotomayor saying it.\nhttps://x.com/mikedebonis/status/1807787300375445993",
          "link": "https://news.ycombinator.com/item?id=40848542",
          "publishedOn": "2024-07-01T18:09:54.000Z",
          "wordCount": null,
          "title": "New comment by treeFall in \"Supreme Court rules ex-presidents have immunity for official acts\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40848414",
          "author": "lapcat",
          "description": "> Could Obama be prosecuted for ordering drone strikes that unintentionally killed two Americans? It seems like that world would hamstring the president far too much.\nThe President shouldn't have the legal authority to conduct any drone strikes without a declaration of war from Congress. We've been ignoring the Constitution for a very long time.",
          "link": "https://news.ycombinator.com/item?id=40848414",
          "publishedOn": "2024-07-01T17:59:39.000Z",
          "wordCount": null,
          "title": "New comment by lapcat in \"Supreme Court rules ex-presidents have immunity for official acts\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40846822",
          "author": "doctorpangloss",
          "description": "This is from my point of view as an experienced developer and VFX artist, including in-depth knowledge of AE.\n    A 30fps limit is surprising\n    23.976 as an fps does not seem to be dealt with gracefully\n    Clicking report bug should take me to a bug report form with info\n    Interacting with \"rectangle\" is surprising because the corners aren't draggable. Probably should default to full size\n    I should be able to wind input fields by clicking and dragging on them, such as for rotation\n    When I drag keys around in the dope sheet, and let go with momentum, they appear to keep moving and \"settle\" in a sort of random place. They should not do that\n    I see that this momentum behavior is also in the play head in the timeline. It really should not do that.\n    Putting in a value in the dope sheet should be enabled, and it should automatically set a key\n    I liked the visualizations of the easing, but it should probably be communicated with the keyframe's icon shape in the dope sheet like it does in AE.\n    It is difficult to move a key to the beginning of the timeline.\n    Architecturally, the preview rendering probably has to work the way it does in After Effects. Guaranteeing a real time visualization is pretty important.\n\nI kind of stopped there because it's a bunch of goal-less fiddling. This is really great, there is a tremendous amount of product development. Hopefully you will think deeply about your audience and objectives, and the amount of product development that goes into After Effects.",
          "link": "https://news.ycombinator.com/item?id=40846822",
          "publishedOn": "2024-07-01T15:35:38.000Z",
          "wordCount": null,
          "title": "New comment by doctorpangloss in \"Show HN: I created an After Effects alternative\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40845811",
          "author": "kcorbitt",
          "description": "(Disclaimer: I'm the founder of OpenPipe, one of the fine-tuning services OP tried and ultimately the one that produced the highest performing model, it appears.)\nData extraction is a use case that fine-tuned models are fantastic at, so I'm not surprised that OP got good results. That said, I've also found it's pretty easy to beat GPT-4 across many task types if you have a way of getting strong training data. We published some research[1] a week ago where we found that across 4 example tasks spanning creative summarization, question answering, data extraction and classification a fine-tuned Llama 3 8B was able to outperform GPT-4 on 3 of them. The key was to create a repeatable way of generating high-quality training data, which is also addressed in the post.\n[1]: https://openpipe.ai/blog/mixture-of-agents",
          "link": "https://news.ycombinator.com/item?id=40845811",
          "publishedOn": "2024-07-01T13:44:29.000Z",
          "wordCount": null,
          "title": "New comment by kcorbitt in \"My finetuned models beat OpenAI's GPT-4\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40844337",
          "author": "FiloSottile",
          "description": "The ones you link are the \"minimal patches for those can't/don't want to upgrade\". The commit I am linking to is taken straight from the advisory.\n    On June 6, 2024, this signal handler race condition was fixed by commit\n    81c1099 (\"Add a facility to sshd(8) to penalise particular problematic\n    client behaviours\"), which moved the async-signal-unsafe code from\n    sshd's SIGALRM handler to sshd's listener process, where it can be\n    handled synchronously:\n\n      https://github.com/openssh/openssh-portable/commit/81c1099d22b81ebfd20a334ce986c4f753b0db29\n\n    Because this fix is part of a large commit (81c1099), on top of an even\n    larger defense-in-depth commit (03e3de4, \"Start the process of splitting\n    sshd into separate binaries\"), it might prove difficult to backport. In\n    that case, the signal handler race condition itself can be fixed by\n    removing or commenting out the async-signal-unsafe code from the\n    sshsigdie() function\n\nboth \"a previously-announced feature for dealing with junk connections\", and a mitigation for the exploit class against similar but unknown vulnerabilities, and a patch for the specific vulnerability because it \"moved the async-signal-unsafe code from sshd's SIGALRM handler to sshd's listener process, where it can be handled synchronously\".\nThe cleverness is that it fixes the vulnerability as part of doing something that makes sense on its own, so you wouldn't know it's the patch even looking at it.",
          "link": "https://news.ycombinator.com/item?id=40844337",
          "publishedOn": "2024-07-01T10:20:04.000Z",
          "wordCount": null,
          "title": "New comment by FiloSottile in \"RegreSSHion: RCE in OpenSSH's server, on glibc-based Linux systems\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40844134",
          "author": "FiloSottile",
          "description": "Interestingly, the RCE fix was \"smuggled\" in public almost a month ago.\n    When PerSourcePenalties are enabled, sshd(8) will monitor the exit\n    status of its child pre-auth session processes. Through the exit\n    status, it can observe situations where the session did not\n    authenticate as expected. These conditions include when the client\n    repeatedly attempted authentication unsucessfully (possibly indicating\n    an attack against one or more accounts, e.g. password guessing), or\n    when client behaviour caused sshd to crash (possibly indicating\n    attempts to exploit sshd).\n\n    When such a condition is observed, sshd will record a penalty of some\n    duration (e.g. 30 seconds) against the client's address.\n\nhttps://github.com/openssh/openssh-portable/commit/81c1099d2...\nIt's not really a reversable patch that gives anything away to attackers: it changes the binary architecture in a way that has the side-effect of removing the specific vulnerability and also mitigates the whole exploit class, if I understand it correctly. Very clever.",
          "link": "https://news.ycombinator.com/item?id=40844134",
          "publishedOn": "2024-07-01T09:45:43.000Z",
          "wordCount": null,
          "title": "New comment by FiloSottile in \"RegreSSHion: RCE in OpenSSH's server, on glibc-based Linux systems\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=52851",
          "author": "Chris Armstrong",
          "description": "In the UK, we’re all waking up to the prospect of a new government. The election was an oddity: Labour has converted a modest 35% vote share into a whopping Parliamentary majority; the Tories did somewhat better than suggested, on around 24%, but have lost more than two-thirds of their MPs. (The final figures were […]",
          "link": "https://crookedtimber.org/2024/07/05/bye-bye-tories-hello-what/",
          "publishedOn": "2024-07-05T09:53:40.000Z",
          "wordCount": 3739,
          "title": "Bye bye, Tories, hello what?",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52847",
          "author": "Kevin Munger",
          "description": "In the 18 months since I quit Twitter, I can feel the atrophy of my vibe detector. I’m reading more than ever, on Substack and the FT, Discord and group chats — much of the same “content” I would’ve encountered on Twitter, in fact, but without the ever-present spiderweb of the social graph, the network […]",
          "link": "https://crookedtimber.org/2024/07/03/does-social-media-cause-anything/",
          "publishedOn": "2024-07-03T17:34:39.000Z",
          "wordCount": 6451,
          "title": "Does Social Media Cause Anything?",
          "imageUrl": "https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F400487e4-3d8d-4e00-b637-462496a892f1_493x302.png"
        },
        {
          "id": "https://crookedtimber.org/?p=52835",
          "author": "Liz Anderson",
          "description": "If the current Supreme Court had held comparable office in Weimar Germany, that is, its opinion in Trump v. United States would have rendered the judgment in this post’s headline. Never mind that the Weimar Constitution was different from the U.S. Constitution (importantly, in granting emergency powers to the President to rule by decree under […]",
          "link": "https://crookedtimber.org/2024/07/02/supreme-court-rules-hitler-immune-from-prosecution-for-burning-down-reichstag-seizing-absolute-power/",
          "publishedOn": "2024-07-02T11:01:54.000Z",
          "wordCount": 14459,
          "title": "Supreme Court Rules Hitler Immune from Prosecution for Burning Down Reichstag, Seizing Absolute Power",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52810",
          "author": "Eszter Hargittai",
          "description": "I’m hosting a couple of professionalization discussions for our PhD candidates and postdocs this summer, informal conversations to help them navigate the crazy academic job market. A few weeks ago we discussed job talks as the department had just had a bunch of candidates visit (very different schedule here in Europe than the US) and […]",
          "link": "https://crookedtimber.org/2024/07/02/advice-on-faculty-job-application-letters/",
          "publishedOn": "2024-07-02T07:10:08.000Z",
          "wordCount": 4628,
          "title": "Advice on faculty job application letters",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52804",
          "author": "Chris Bertram",
          "description": "Sometimes you have to go looking for photos, but this is what greeted me when I got up to make the coffee the other morning.",
          "link": "https://crookedtimber.org/2024/06/30/sunday-photoblogging-good-morning/",
          "publishedOn": "2024-06-30T05:57:35.000Z",
          "wordCount": 1864,
          "title": "Sunday photoblogging: good morning!",
          "imageUrl": "https://live.staticflickr.com/65535/53814739639_f7fd9c76b0.jpg"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/Broken-Britain",
          "author": "Michael Roberts",
          "description": "UK citizens vote in a general election on 4 July. The opinion polls currently forecast that the incumbent Conservative party will be heavily defeated after 14 years in government. The opposition Labour party is expected to gain a majority of over 250 seats, a record landslide, with the Conservatives getting less than 100 seats. \nEnglish\n\n/ \nUnited Kingdom, \nCapitalism, \nInequality, \nInflation",
          "link": "https://www.cadtm.org/Broken-Britain",
          "publishedOn": "2024-07-04T11:02:43.000Z",
          "wordCount": 4256,
          "title": "Broken Britain",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1061xH558/6d7e96c9a2bd611e28a7418b709dd2-22c23.jpg"
        },
        {
          "id": "https://www.cadtm.org/Structural-Adjustment-and-the-Washington-Consensus-Are-Not-Abandoned-in-2000",
          "author": "Eric Toussaint",
          "description": "In July 2024, the World Bank and the IMF will be 80 years old. 80 years of financial neo-colonialism and the imposition of austerity policies in the name of debt repayment. 80 years is enough! The Bretton Woods institutions must be abolished and replaced by democratic institutions serving an ecological, feminist and anti-racist bifurcation. To mark these 80 years, we are republishing a series of articles every Wednesday until July, looking in detail at the history and damage caused by these (...)\nEnglish\n\n/ \nAusterity/Structural Adjustment, \nIMF, \nWorld Bank, \nFinance against people, \n80 ans BM FMI EN",
          "link": "https://www.cadtm.org/Structural-Adjustment-and-the-Washington-Consensus-Are-Not-Abandoned-in-2000",
          "publishedOn": "2024-07-03T09:36:55.000Z",
          "wordCount": 5807,
          "title": "Structural Adjustment and the Washington Consensus Are Not Abandoned in 2000",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/71d4d4e0c2ffc7444e2bf3a93e276f-a4794.jpg"
        },
        {
          "id": "https://www.cadtm.org/In-Finland-the-Left-Alliance-Just-Trounced-the-Far-Right",
          "author": "Chris Dite, Li Andersson",
          "description": "Europe's elections saw gains for anti-immigration parties — but the breakthrough act in Finland was the Left Alliance, with 17% support. Its leader, Li Andersson, told Jacobin about why it did so well and how it defeated the far right. \nEnglish\n\n/ \nAntifascism, \nNorth, \nFinland",
          "link": "https://www.cadtm.org/In-Finland-the-Left-Alliance-Just-Trounced-the-Far-Right",
          "publishedOn": "2024-07-02T08:35:14.000Z",
          "wordCount": 2583,
          "title": "In Finland, the Left Alliance Just Trounced the Far Right",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/604388d80634de4cffc29186d2806b-86871.jpg"
        },
        {
          "id": "https://www.cadtm.org/France-Macron-s-gamble",
          "author": "Michael Roberts",
          "description": "France votes over two rounds on June 30 and July 7 in a snap [parliamentary election->https://www.reuters.com/world/europe/frances-snap-election-how-does-it-work-whats-next-2024-06-18 called by President Macron after his party suffered a heavy defeat in the June EU Assembly elections. France has two rounds of voting: if a candidate gets 50% of more in the first round, he or she is elected. If not, then in the second round, the top two candidates fight it out. A survey released by pollster (...)\nEnglish\n\n/ \nFrance, \nCrisis, \nRecession",
          "link": "https://www.cadtm.org/France-Macron-s-gamble",
          "publishedOn": "2024-06-30T05:23:36.000Z",
          "wordCount": 3499,
          "title": "France: Macron's gamble",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1024xH538/ebfc2a8a4d36a0c63f6d5c56452a7d-a0a37.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=7958",
          "author": "disassociated.com",
          "description": "Break out the coffee and the cake: a celebration is on the cards. Tomorrow, Threads, Meta’s answer — and much needed foil — to X/Twitter, notches up its first birthday. I was there as the platform began rolling out, and managed to score (just) a relatively low (five-figure) badge number. 98,522 for the record. These […]",
          "link": "https://disassociated.com/threads-first-birthday-gift-users-advertising/",
          "publishedOn": "2024-07-04T21:00:29.000Z",
          "wordCount": 669,
          "title": "Threads first birthday gift to users: advertising?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7951",
          "author": "disassociated.com",
          "description": "That’s the good news. Tory Shepherd, writing for The Guardian, says the recently discovered exoplanet, dubbed Gliese 12b, might be able to host liquid water. We all know what that means. If there’s water, there may be life. Gliese 12b is so named because it orbits a star called Gliese. Now for the bad news. […]",
          "link": "https://disassociated.com/potentially-habitable-earth-size-planet-forty-light-years-away/",
          "publishedOn": "2024-07-03T21:00:53.000Z",
          "wordCount": 441,
          "title": "Potentially habitable Earth size planet forty light years away",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7947",
          "author": "disassociated.com",
          "description": "This is sad and concerning news. The Melbourne based bookseller had become well ensconced in the Australian literary realm, since being founded about twenty-years ago. The company, which is also listed on the ASX (though trading of shares has been suspended), had been struggling financially in recent years though.",
          "link": "https://disassociated.com/australian-bookseller-booktopia-voluntary-administration/",
          "publishedOn": "2024-07-03T03:57:38.000Z",
          "wordCount": 132,
          "title": "Australian bookseller Booktopia in voluntary administration",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7938",
          "author": "disassociated.com",
          "description": "I might say that of U2, whose music I once really liked, especially the stuff they did in the nineties. Achtung Baby. Zooropa. Pop. Even 2000’s All That You Can’t Leave Behind. These albums mostly represented their electronic music phase. I’d have them on loop for days at a time. I drew the ire of […]",
          "link": "https://disassociated.com/like-old-music-better-than-new-music/",
          "publishedOn": "2024-07-02T21:00:29.000Z",
          "wordCount": 608,
          "title": "I like your old music better than your new music",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7935",
          "author": "disassociated.com",
          "description": "The shortlist for the 2024 Miles Franklin literary award for works of Australian fiction, was announced earlier today. Of the ten novels named on the longlist in May, the following six titles have been included today: Only Sound Remains, by Hossein Asgari Wall, by Jen Craig Anam, by André Dao The Bell of the World, […]",
          "link": "https://disassociated.com/2024-miles-franklin-shortlist-australian-fiction/",
          "publishedOn": "2024-07-02T07:13:09.000Z",
          "wordCount": 248,
          "title": "The 2024 Miles Franklin shortlist for Australian fiction",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7933",
          "author": "disassociated.com",
          "description": "Given the choice, a regular person, like you or me, who decides they’d like to become a superhero, will choose teleportation as their superhero superpower. In preference to three other choices they could have made: mind-control, flight, or supernatural physical strength. This is the long-story-short conclusion of some recent research into the subject, by Julian […]",
          "link": "https://disassociated.com/teleportation-superpower-choice-superheroes/",
          "publishedOn": "2024-07-01T21:00:56.000Z",
          "wordCount": 192,
          "title": "Teleportation: the superpower of choice of superheroes",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7927",
          "author": "disassociated.com",
          "description": "The Honeyeater is the second novel by Sydney based Australian writer Jessie Tu, and will be in bookshops on Tuesday 2 July 2024. That’s tomorrow. I read Tu’s 2020 debut A Lonely Girl is a Dangerous Thing almost four years ago. It was the story of a once child prodigy musician, who wasn’t always successfully […]",
          "link": "https://disassociated.com/the-honeyeater-new-novel-australian-author-jessie-tu/",
          "publishedOn": "2024-06-30T21:00:57.000Z",
          "wordCount": 419,
          "title": "The Honeyeater, the new novel by Australian author Jessie Tu",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20240704",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20240704",
          "publishedOn": "2024-07-04T15:20:00.000Z",
          "wordCount": 533,
          "title": "Week Ending June 30, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/gaucho-lepenism",
          "author": null,
          "description": "On France’s far-right vote.",
          "link": "https://newleftreview.org/sidecar/posts/gaucho-lepenism",
          "publishedOn": "2024-07-05T18:02:45.000Z",
          "wordCount": 2867,
          "title": "Martin Barnay: &ldquo;Gaucho-Lepénisme?&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/4bddt-n08024-425.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/majority-without-a-mandate",
          "author": null,
          "description": "Elections in the UK.",
          "link": "https://newleftreview.org/sidecar/posts/majority-without-a-mandate",
          "publishedOn": "2024-07-05T16:24:18.000Z",
          "wordCount": 1710,
          "title": "Richard Seymour: &ldquo;Majority Without a Mandate&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/9549ca10-3ad9-11ef-9d6c-7960f16c54d6.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/familiar-faces",
          "author": null,
          "description": "The photography of Johny Pitts.",
          "link": "https://newleftreview.org/sidecar/posts/familiar-faces",
          "publishedOn": "2024-07-05T13:16:23.000Z",
          "wordCount": 2140,
          "title": "Owen Hatherley: &ldquo;Familiar Faces&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/junglist-massive.jpg"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://birming.com/false-identities/",
          "author": null,
          "description": "I heard an interview with Rachel \"Yoga Girl\" Bråthén. She talked about how certain things in her past, like being vegan, became a kind of identity. It was all or nothing. \"This is me. This is who I am. End of story!\"\nIt's easy to get too attached to that kind of self-image, whether it's advocating for healthy eating or reviewing cell phones.\nLooking back, I can relate to this myself. Yoga, meditation, mindfulness, weight training, blogging, and more have all served as a “false” sense identity for me at some point — at least to some extent.\nOf course, it's not what we do that's the problem; it's how we see ourselves in relation to what we do. You can have a million followers and still be the most grounded person in the world.\nNo matter how \"important\" or \"unimportant\" our roles in life are, it's good to remind ourselves of this truth from time to time. Status and possessions come and go, but who we are on a deeper level remains.",
          "link": "https://birming.com/false-identities/",
          "publishedOn": "2024-07-04T07:30:00.000Z",
          "wordCount": 631,
          "title": "False identities",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1717834500-0.jpeg"
        },
        {
          "id": "https://lili.bearblog.dev/becoming-obsessed-with-a-sailing-lifestyle/",
          "author": null,
          "description": "[I have been away from the blog for a while. In the meantime, the ideas I want to write about have grown terrifyingly large. Rather than squeezing each in a large post, I wanted to try writing a series of smaller self-contained posts. Thus, I am starting a series on my journey in sailing.]\nMy obsession with sailing started about a year ago. At that time, I came across post on \"Weathering Software Winter\". In this post, Hundred Rabbits detail their journey on moving towards resilient and sustainable software: software that could be used at sea for decades to come. I really liked the idea of being intentional about using less from being constrained by the environment you're placed in.\nTo some extent, I have already adjusted my digital life to rely on less products generally. I use Linux as m…",
          "link": "https://lili.bearblog.dev/becoming-obsessed-with-a-sailing-lifestyle/",
          "publishedOn": "2024-07-04T06:59:00.000Z",
          "wordCount": 930,
          "title": "becoming obsessed with a sailing lifestyle",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://grubz.blog/the-indie-web-is-saving-my-sanity/",
          "author": null,
          "description": "A lot of my posts have covered stuff I don't ever have the time of day to talk about. I work too much and almost all of my coworkers are conservative boomers. I don't talk to most of them  much but every once in a while I'll have to share a store with some of them. Sometimes they give me random phone calls. Luckily I have the option of just not picking up the phone.\nI just don't relate with the people I have to interact with on the regular. I mean we aren't having heavy political conversations 24/7 but it just doesn't feel comfortable being around people who you know are the polar opposite of who you are.\nI feel like being able to write about the stuff I never get to talk about is a healthy counterweight to that. I'm not a great writer, I know a lot of the stuff I write won't be read for weeks, or possibly ever. Some of it might be boring or come across cheesy. Sometimes I cover really broad, uninteresting things.\nBut it has had the unexpected effect of making me feel more valid as a person. It feels odd saying that, but it's true.\nMaybe it's because I haven't had a hobby I can get lost in for too long. Making the rounds in different indie web neighborhoods, learning little bits of CSS and bringing my vision to life one piece at a time does a pretty good job at keeping me from getting bored and letting my mind wander to stress. Then when I'm done with that for a while I can write some more. Sometimes I'm proud of it, sometimes I delete it after a couple hours.\nIt feels... healthier than doomscrolling. I prefer this over traditional social media because of the ownership and freedom, and the fact that I sort of get to whisper what I'm saying rather than blasting it over a megaphone and putting myself on stage in front of an audience riding algorithmic dopamine waves.",
          "link": "https://grubz.blog/the-indie-web-is-saving-my-sanity/",
          "publishedOn": "2024-07-04T04:13:14.001Z",
          "wordCount": 999,
          "title": "The indie web is saving my sanity",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://tiramisu.bearblog.dev/absolute-immunity/",
          "author": null,
          "description": "It's still not hit me that we get tomorrow off. Having a random Wednesday off for Juneteenth was jarring enough. Getting Thursday off for Independence Day only to go back to work for one day will ruin my internal rhythm for good.\nIt doesn't help that this Independence Day comes at a time I feel worse about this country in a long time. Maybe ever. I can't think of anything that even comes close. I normally only vaguely follow political murmurs, and I already have a pretty jaded view of the country I live in, so it takes some story for me to feel sick to the stomach.\nThe highest court in the land ruling 6-3 in favor of a certain former President that he has \"absolute immunity\" from criminal prosecution for all \"official acts\" (read: crimes) he took while in office? That'll do the trick. Six.…",
          "link": "https://tiramisu.bearblog.dev/absolute-immunity/",
          "publishedOn": "2024-07-04T02:26:00.000Z",
          "wordCount": 985,
          "title": "we the people, or something",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://thementaltraveller.bearblog.dev/fuck-your-openai-integration/",
          "author": null,
          "description": "You have to suck the soul out of this beautiful technology too, right?\n(You can admit it didn't have a soul in the first place, it's alright.)\nNonetheless.\nFuck your \"AI-powered\" bullshit.",
          "link": "https://thementaltraveller.bearblog.dev/fuck-your-openai-integration/",
          "publishedOn": "2024-07-03T18:06:00.000Z",
          "wordCount": 643,
          "title": "Fuck your OpenAI integration",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://kylevallans.bearblog.dev/market-to-me/",
          "author": null,
          "description": "*** Add your email below if you’d like to get access to our overnight momentum trading chat! Free for a month, then $6/month.\nIn it, you’ll find both retail and proprietary traders. Guys who work(ed) for SMB, KTG, Avatar, Chimera & Seven Points that you can network and trade alongside with.\nSubscribe to my blog\nOver the last 7 years, I have exclusively focused on trading. Well, to be fair, it's more so the last 5 years. The first 2 years as a retail trader, I had one of those so called \"well-rounded lives\". I traded, went out often, hung out after the close with friends & fam, enjoyed snowboarding, camping, and mountain biking more than most.\nBut, over the last 5 years as a professional trader living in NY and ATX and working out of both offices, I gave up everything, one by one to focus e…",
          "link": "https://kylevallans.bearblog.dev/market-to-me/",
          "publishedOn": "2024-07-03T17:20:00.000Z",
          "wordCount": 1508,
          "title": "Finding Myself Beyond the Trading Floor",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://birming.com/bear-blog-tips/",
          "author": null,
          "description": "If you've been here before, you may have visited the Blog Inspiration page. It contains a lot of good and useful resources when it comes to blogging: writing, design, blog challenges, webrings, shortcuts...\nNow there's one more: Bear Blog.\nIt's the blogging platform I use and love. It's also used by many of my favorite bloggers and some of my readers. In other words, it deserves its own Bear section.\nThese are currently on the list (those marked with * requires an upgraded account):\nConvert bear blog CSV exports to markdown files\nRandom link (external)\nRandom link (internal) *\nAdd external link markers\nAdd a search feature *\nEstimated reading time *\nCustomizing the upvote button\nCount your posts\nAdding a \"reply via email\" button\nAdding a private feedback box\nDo you have suggestions for things to include? Or maybe you have an idea for a \"hack\" you would like someone to put together?\nContact me and I will add it to this post.\nHappy Bear blogging! 🐻\nPS. For official changes and feature suggestions, see the changelog and roadmap.",
          "link": "https://birming.com/bear-blog-tips/",
          "publishedOn": "2024-07-03T17:19:00.000Z",
          "wordCount": 654,
          "title": "Bear Blog Tips & Tricks Collection",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1717834500-0.jpeg"
        },
        {
          "id": "https://yordi.me/step-by-step-guide-estimated-reading-time-in-bear-blog/",
          "author": null,
          "description": "I'll be very short for those who just clicked this title and want results.\nTo show the estimated number of minutes it takes to read a blog post, add the following script to the footer directive of your Bear blog:\n<script src=\"https://cdn.jsdelivr.net/gh/froodooo/bear-plugins@0.0.26/bear/reading-time.js\"></script>\n\nThis shows the estimated reading time just below the post date, using 255 words per minute as an average reading speed. The placement and reading speed can be changed by adding the following data attributes to the script:\ndata-before-child: [number] (defaults to 4)\ndata-wpm: [number] (defaults to 255)\nFor example, to put the estimated reading time above the post date and set an average reading speed of 200 words per minute, use the following script:\n<script src=\"https://cdn.jsdel…",
          "link": "https://yordi.me/step-by-step-guide-estimated-reading-time-in-bear-blog/",
          "publishedOn": "2024-07-03T13:30:00.000Z",
          "wordCount": 1443,
          "title": "Step-by-Step Guide: Estimated Reading Time in Bear Blog",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/yordi-1720013282.webp"
        },
        {
          "id": "https://notes.jeddacp.com/to-blogroll-or-to-not/",
          "author": null,
          "description": "I really love the idea of having a Blogroll. When checking out a new blog, after reading and perusing said blog, I typically check to see if it has one. I think it’s one of the best ways to find new people to subscribe to, new content to read, and/or new perspectives to be exposed to. However, I don’t have one on my blog. Hypocritical? Maybe. Or maybe it’s just really personal preference.\nI grew up in the days of MySpace, and this irrational want to be included in everyone’s Top 8. Then when you’re in their Top 8, you watch that list like a hawk in case you drop from Top 2 to Top 5, or even worse, drop off altogether. Granted, blogrolls are a bit different since there’s no hard limit on how many can be included (or specified order), but the idea is similar.\nYou see, I’m fine and OK with no…",
          "link": "https://notes.jeddacp.com/to-blogroll-or-to-not/",
          "publishedOn": "2024-07-02T20:11:00.000Z",
          "wordCount": 1261,
          "title": "To Blogroll, or to not?",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1719950732.png"
        },
        {
          "id": "https://veronique.ink/a-polaroid-summer-project/",
          "author": null,
          "description": "I spent the long weekend clearing the cobwebs from my apartment.\nThe main purge was throwing out YEARS of old diaries and journals—all of them. Not one survived.\nI've been thinking about doing this for a long time. Reading them made me feel horrible, and they all seemed to circle the same themes. Lugging those boxes full of journals to each new apartment felt tiresome. It was time to let them go.\nI feel good about it. I'm free: to untangle myself from past narratives; from reinforcing and remembering things I don't wish to remember; to change; to reinvent the person I want to be.\nNext on the to-get-rid-of list: books, clothes, paper ephemera, apps, expired kitchen things, tucked-away closet articles, + bathroom items.\nSketchbook things: \n\nPolaroid-inspired pencil and marker drawing\n&nbsp\n\n…",
          "link": "https://veronique.ink/a-polaroid-summer-project/",
          "publishedOn": "2024-07-02T16:42:00.000Z",
          "wordCount": 885,
          "title": "a Polaroid summer project",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://mgx.me/micro-tool-to-convert-bear-blog-csv-exports-to-markdown-files/",
          "author": null,
          "description": "#b2md{border:2px dotted var(--border-color);padding:20px}.b2mdcontainer{display:flex;justify-content:space-between;align-items:center}.b2mdcontainer input{order:1}.b2mdcontainer button{order:2}#InfoText{color:#8a2be2;font-size:90%;margin-bottom:0}.image-container{position:relative;display:inline-block}.modal,.toggle-input{display:none}.b2md-img{transition:transform .3s}@media (min-width:700px){.b2md-img:hover{transform:scale(1.05)}}.modal{position:fixed;z-index:1000;left:0;top:0;width:100%;height:100%;overflow:auto;background-color:rgba(0,0,0,.8)}.modal-content{background-color:#fefefe;margin:2% auto;padding:20px;border:1px solid #888;width:80%;max-width:700px;box-shadow:0 4px 8px rgba(0,0,0,.2);color:var(--text-color)}@media (prefers-color-scheme:dark){.modal-content{background-color:#012…",
          "link": "https://mgx.me/micro-tool-to-convert-bear-blog-csv-exports-to-markdown-files/",
          "publishedOn": "2024-07-02T13:46:00.000Z",
          "wordCount": 1241,
          "title": "micro tool to convert bear blog csv exports to markdown files",
          "imageUrl": "https://static.mgx.me/images/2024/micro-tool-to-convert-bear-blog-csv-exports-to-markdown-files.png"
        },
        {
          "id": "https://nikhil.bearblog.dev/get-bored/",
          "author": null,
          "description": "Productivity gurus and hacks have killed the essence of getting bored. Do you think Da Vinci was obsessed with utilising every minute of the day? Do you think Tolstoy wrote with discipline? I am not suggesting you go ahead and waste your time, but if you are a creative person, productivity will only get you so far.\nBut what do I mean by getting bored? Getting bored implies your brain is free of pressing thoughts. There’s no sense of urgency in your mind. It could be for any reason. When there’s no sense of urgency in your mind, there’s calmness. People suffering from anxiety do not get bored; their thoughts and fears keep them occupied.\nWhen your mind is free from pressing tasks, fear, and worries, it tends to get lost. It wanders. In these wanderings, you dwell upon the thoughts buried deep in the subconscious. Every writer would swear by the benefits of walking. When you go out to walk, your mind is tranquil. It is in sync with nature. That’s when your body digs deeper into the subconscious and helps you find the pearl.\nProductivity hacks are excellent when you are focused on a singular task. They are excellent in improving your efficiency by inculcating discipline, like writing a book or a bunch of essays. That’s when you need productivity hacks to stay motivated and meet the deadline. The Pomodoro technique is good for helping you finish tasks. It does not invoke creativity, though.\nWhen you want to create something, you need to get bored. You need to let your thoughts mingle with each other and discover a new perspective on the problem. Creation requires empty space and time. The more successful you are in creating this, the better your overall output will be. So, get bored.",
          "link": "https://nikhil.bearblog.dev/get-bored/",
          "publishedOn": "2024-07-02T05:21:57.176Z",
          "wordCount": 728,
          "title": "Get Bored!",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://herman.bearblog.dev/cities-need-more-trees/",
          "author": null,
          "description": "I grew up just outside of Johannesburg, which is touted to be \"the greenest city in the world\". During the summer, when seen from above, it's a verdant, green landscape, with the tops of buildings popping through the canopy.\n\nYes, there's a full city beneath those trees.\nHowever, this is not what the land originally looked like.\nTo cut a long story short, Johannesburg was established following the discovery of gold in 1886. It's known colloquially as eGoli, or \"The City of Gold\". Gold extraction here is vastly different to other parts of the world. We don't have gold veins running through the rock like in old Western movies. Instead it's mineralised into the rock itself which requires significant processing to extract.\nThis form of extraction leads to the crushing of millions of tons of ro…",
          "link": "https://herman.bearblog.dev/cities-need-more-trees/",
          "publishedOn": "2024-07-01T07:53:00.000Z",
          "wordCount": 1207,
          "title": "Cities need more trees",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://corneliuswastaken.bearblog.dev/i-am-asking-yall-for-help-write-me-emails/",
          "author": null,
          "description": "So, here goes.\nBeing in a long distance relationship is hard. It is especially hard when I live alone, well, sort of. I don’t talk much with my mom. Maybe I should, but I don’t intend to talk to her for the moment. That means, despite living with her under the same roof, I feel very lonely. And my mental health starts to deteriorate when I am alone and bored.\nThoughts could drive someone crazy when that is all they have being the single person in the room.\nI am turning to y’all for support, so please write me emails at corneliuswastaken@proton.me. I would love anything. Book /music/video games recommendations, memes, photos of your pet, tell me about yourself. Heck, send me a string of random letters and numbers if you want. It is just nice to know that there is someone out there listening to my rambling, and that I am not alone. Expect the reply to happen in a while though. Replying to messages becomes a chore when self-care is in dire need.\nThank you.",
          "link": "https://corneliuswastaken.bearblog.dev/i-am-asking-yall-for-help-write-me-emails/",
          "publishedOn": "2024-06-30T15:51:00.000Z",
          "wordCount": 652,
          "title": "I am asking y'all for help: write me emails.",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://notes.jeddacp.com/to-all-the-cameras-ive-loved-before/",
          "author": null,
          "description": "Today is apparently National Camera Day. I have no idea who comes up with these seemingly random National holidays, but I’m here for it.\nAnd so today got me thinking of some of the digital cameras I’ve owned in the past. I’ve owned quite a few that I regrettably no longer own, or have forgotten so we’ll start the with the ones I do remember.\nA handful of Canon Coolpix: loved these things, and I feel like they’re making a comeback. I think I owned 2-3 of these in the early days. At one point, my university gave me one to document my “life as a student” as a part of their marketing campaign.\nNikon D40: my very first DSLR. I remember working endless amounts of hours at Staples over the summer to save up enough money to buy this on my own. This was around when it first came out, and was roughl…",
          "link": "https://notes.jeddacp.com/to-all-the-cameras-ive-loved-before/",
          "publishedOn": "2024-06-30T02:49:00.000Z",
          "wordCount": 1428,
          "title": "To All the Cameras I've Loved Before",
          "imageUrl": "https://live.staticflickr.com/65535/53342416427_e37d8620b2_h.jpg"
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/william-gillis-what-s-in-a-slogan-kylr-and-militant-anarcha-feminism?v=1720111778",
          "author": null,
          "description": "Author: William Gillis\nTitle: What’s In A Slogan? “KYLR” and Militant Anarcha-feminism\nDate: June 25, 2024\nNotes: William Gillis: https://twitter.com/rechelon\nSource: Retrieved on July 4, 2024 from https://c4ss.org/content/59691\n\n An anarchist walks out of a punk show to smoke. On her vest are anarchist patches with various standard slogans, “No Gods No Masters,” “Death To Transphobes,” “Kill Your Local Rapist,” “All Cops Are Bastards,” “Punch Nazis,” “From The River To The Sea Palestine Will Be Free,” “Make Total Destroy,” “The Only Good Cop Is A Dead Cop,” “Eat The Rich,” “Death Before Detransition” and… “Fire To The Prisons.” \n A suddenly red-faced bystander trots up to her to argue. \n“Oh so you’re saying you support a blanket social policy of allowing anyone to burn anything they accus…",
          "link": "https://theanarchistlibrary.org/library/william-gillis-what-s-in-a-slogan-kylr-and-militant-anarcha-feminism?v=1720111778",
          "publishedOn": "2024-07-04T16:49:38.000Z",
          "wordCount": 18894,
          "title": "William Gillis - What’s In A Slogan? “KYLR” and Militant Anarcha-feminism",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "59309",
            "url": "https://theanarchistlibrary.org/library/william-gillis-what-s-in-a-slogan-kylr-and-militant-anarcha-feminism.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/mb-sundjata-how-and-why-the-us-left-betrayed-tigray?v=1720081541",
          "author": null,
          "description": "Author: MB Sundjata\nTitle: How and Why the US Left Betrayed Tigray\nSubtitle: US organizations like PSL and Black Alliance for Peace cannot be trusted to advocate for Palestine’s liberation after they condemned nearly a million Tigrayans to genocide.\nDate: June 18, 2024\nSource: Retrieved from <redvoice.news/how-and-why-the-us-left-betrayed-tigray> on July 3, 2024\n\n I thought further and said: “Why do men lie over problems of such great importance, even to the point of destroying themselves?” and they seemed to do so because although they pretend to know all, they know nothing. Convinced they know all, they do not attempt to investigate the truth. — Zara Yacob of Aksum (Tigray), 17th-century philosopher, in The Hatata Inquiries\n (Content Warning: this article describes acts of genocide and w…",
          "link": "https://theanarchistlibrary.org/library/mb-sundjata-how-and-why-the-us-left-betrayed-tigray?v=1720081541",
          "publishedOn": "2024-07-04T08:25:41.000Z",
          "wordCount": 8853,
          "title": "MB Sundjata - How and Why the US Left Betrayed Tigray",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "636010",
            "url": "https://theanarchistlibrary.org/library/mb-sundjata-how-and-why-the-us-left-betrayed-tigray.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/the-di-fraye-arbeter-shtime-editorial-board-an-anonymous-group-of-polish-anarchists-yiddish-ana?v=1720078025",
          "author": null,
          "description": "Author: The Di fraye arbeter shtime Editorial Board, An Anonymous Group of Polish Anarchists, Eyshe Beirich\nTitle: Yiddish Anarchists’ Break Over Palestine\nDate: 1929\nNotes: An exchange in the anarchist newspaper Di fraye arbeter shtime after the 1929 Hebron massacre offers a case study in Jewish discourse and political reaction after immense violence. \n Introduced and translated from the Yiddish by Eyshe Beirich\nSource: Retrieved on 04/07/2024 from https://jewishcurrents.org/yiddish-anarchists-break-over-palestine-1929\n\nOn Friday, August 23rd, 1929, exaggerated rumors about the extent of Jewish violence against Palestinians and the desecration of holy sites in Jerusalem reached the Palestinian community of Hebron (Al-Khalil, in Arabic). What started as incensed Palestinians throwing stone…",
          "link": "https://theanarchistlibrary.org/library/the-di-fraye-arbeter-shtime-editorial-board-an-anonymous-group-of-polish-anarchists-yiddish-ana?v=1720078025",
          "publishedOn": "2024-07-04T07:27:05.000Z",
          "wordCount": 3547,
          "title": "The Di fraye arbeter shtime Editorial Board, An Anonymous Group of Polish Anarchists, Eyshe Beirich - Yiddish Anarchists’ Break Over Palestine",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "14982",
            "url": "https://theanarchistlibrary.org/library/the-di-fraye-arbeter-shtime-editorial-board-an-anonymous-group-of-polish-anarchists-yiddish-ana.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anarhija-info-horror-vacui?v=1720049426",
          "author": null,
          "description": "Author: anarhija.info\nTitle: Horror Vacui\nDate: February 10, 2018\nSource: <actforfree.nostate.net/?p=29728>. Retrieved on 03/07/2024 from lib.anarhija.net.\n\n There are anarchists who run after uprisings on other continents wherever the spotlights of the media fall. There are anarchists who talk about “fortress Europe” and they don’t even know which States are part of the EU. There are anarchists who struggle against the borders and they don’t even know where the Schengen frontier runs. There are anarchists who, like “good white men”, see in the “dark-skinned” non-EU people potential comrades, and they don’t even notice that there are European non-EU people. \n There are anarchists who talk about internationalism and they don’t even know (or don’t give a fuck) what happens on their own conti…",
          "link": "https://theanarchistlibrary.org/library/anarhija-info-horror-vacui?v=1720049426",
          "publishedOn": "2024-07-03T23:30:26.000Z",
          "wordCount": 1105,
          "title": "anarhija.info - Horror Vacui",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6291",
            "url": "https://theanarchistlibrary.org/library/anarhija-info-horror-vacui.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anarhija-info-aut-aut?v=1720049269",
          "author": null,
          "description": "Author: anarhija.info\nTitle: Aut Aut\nDate: 2016\nSource: <anarhija.info/library/anarhija-info-aut-aut-en>. Retrieved on 03/07/2024 from lib.anarhija.net.\n\n When I translated and published the pamphlet \"Individuality and the anarchist group\", signed by one of the CCF cells, Guerilla Urbana Cell, I added in a note that I didn’t do it because I agree with the content, but to make public how much this project, in my opinion, has turned away from its original form of tension to propose (or re-propose) an anarchist individualism which, in some ways, can be found in the pages of a different insurrectionist theory, but in this case approaching or even in some points leading to formal ideas, that is the formal organization. \n Similar proposals (informal platform, structured and specific organization…",
          "link": "https://theanarchistlibrary.org/library/anarhija-info-aut-aut?v=1720049269",
          "publishedOn": "2024-07-03T23:27:49.000Z",
          "wordCount": 2980,
          "title": "anarhija.info - Aut Aut",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "10764",
            "url": "https://theanarchistlibrary.org/library/anarhija-info-aut-aut.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/adriano-communique-from-prison?v=1720049064",
          "author": null,
          "description": "Author: Adriano\nTitle: Communiqué from prison\nDate: April 9, 2014\nSource: <actforfree.nostate.net/?p=16535>. Retrieved on 03/07/2024 from lib.anarhija.net.\n\n Violence generates violence. Regardless of what is right or wrong, no matter how abstruse is the boundary between opposites and how easily they can converge. The word violence and the concept it expresses present deep mystifications to those who have the monopoly on it. All expressions of dissent are being disproportionately repressed… no surprise… ‘go and tell them that it’s springtime’ [rough translation of ‘vagli a spiegare che è primavera’, a verse by the late anarchist singer and song-writer Fabrizio De Andrè]. \n The modus operandi of cops and politicians is infamous enough, with their artistic architecture made of inexistent cas…",
          "link": "https://theanarchistlibrary.org/library/adriano-communique-from-prison?v=1720049064",
          "publishedOn": "2024-07-03T23:24:24.000Z",
          "wordCount": 1777,
          "title": "Adriano - Communiqué from prison",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "8602",
            "url": "https://theanarchistlibrary.org/library/adriano-communique-from-prison.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/han-ryner-ethical-individualism?v=1719971059",
          "author": null,
          "description": "Author: Han Ryner\nTitle: Ethical Individualism\nSubtitle: Selected Texts\nDate: 2019\nNotes: Translated from French to English by Kirk Watson.\n\nTranslator’s Introduction\n At the dawn of the 20th century, Europe hosted a brief blossoming of individualistic thought. Inspired by the great thinkers of the preceding century such as Stirner, Ibsen, Nietzsche, and Spencer, they offered a free-thinking, non-dogmatic alternative to the increasingly powerful Marxists and syndicalists of the left, and the economists and theologians of the right. Importantly, this generation of thinkers developed the critique of the State into a critique of society as a whole, which immunized them from recruitment by the anarchist movement. As Ryner says in the Handbook, the anarchists are naive: victory by the anarchist…",
          "link": "https://theanarchistlibrary.org/library/han-ryner-ethical-individualism?v=1719971059",
          "publishedOn": "2024-07-03T01:44:19.000Z",
          "wordCount": 33627,
          "title": "Han Ryner - Ethical Individualism",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "227459",
            "url": "https://theanarchistlibrary.org/library/han-ryner-ethical-individualism.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/uploads/en/thumbnails/h-r-han-ryner-ethical-individualism-1.jpg.large.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/lee-shevek-leave-or-else-giving-ultimatums-to-abuse-victims?v=1719968190",
          "author": null,
          "description": "Author: Lee Shevek\nTitle: Leave, Or Else\nSubtitle: Giving Ultimatums to Abuse Victims\nDate: April 10, 2024\nSource: Retrieved on 2 July 2024 from butchanarchy.medium.com/leave-or-else-a60b0dbac2a6\n\n Abuse is ubiquitous in our society, and as a result there are very few among us, if any, who have not been abused themselves or in proximity to someone else being abused. Myths about why and how abuse occurs run rampant and the ones that dominate are ones that ultimately serve in the maintenance of the status quo that keeps victims disempowered and silent. As a result, even those few who do actually believe victims of abuse and see the danger such abuse poses to them still often respond to the conditions the victim is entrapped within in ways that ultimately affirm the abuser’s narrative and fur…",
          "link": "https://theanarchistlibrary.org/library/lee-shevek-leave-or-else-giving-ultimatums-to-abuse-victims?v=1719968190",
          "publishedOn": "2024-07-03T00:56:30.000Z",
          "wordCount": 2099,
          "title": "Lee Shevek - Leave, Or Else",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "8602",
            "url": "https://theanarchistlibrary.org/library/lee-shevek-leave-or-else-giving-ultimatums-to-abuse-victims.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/aryanam-funeral-theocracy-religious-capital?v=1719921893",
          "author": null,
          "description": "Author: Aryanam\nTitle: Funeral, Theocracy, & Religious Capital\nSubtitle: Observations & Thoughts After a Comrade’s Death\nDate: March 10th, 2024\nSource: asranarshism.com/1402/12/20/funeral-theocracy-religious-capital-en\n\n An accident. An accident tore a family apart. An accident took a brave and kind comrade from us. We will remember the date. It was December 2023. \n Death will come for us all. But, for now, we must put our shattered hearts back together. We need to organize. We need to fight. We need to grieve. Yet, we are not free to grieve, the same way we are not free to be. Not free to love. Not free to live. Countless surviving families and friends were vultured in one of their most vulnerable times. Countless victims of patriarchal honor killings were buried by their murderers. Count…",
          "link": "https://theanarchistlibrary.org/library/aryanam-funeral-theocracy-religious-capital?v=1719921893",
          "publishedOn": "2024-07-02T12:04:53.000Z",
          "wordCount": 3741,
          "title": "Aryanam - Funeral, Theocracy, & Religious Capital",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "13726",
            "url": "https://theanarchistlibrary.org/library/aryanam-funeral-theocracy-religious-capital.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/sheffield-action-group-what-is-school?v=1719921860",
          "author": null,
          "description": "Author: Sheffield Action Group\nTitle: What is School?\nDate: February 2024\nNotes: From Sheffield Action Group’s Troublemakers zine, this important piece stands on its own\n\n As students at university, we have a lot more to say about the global and national role of our institutions — this will come at another point. For now we will focus on primary and secondary school. Many reading this will have left 13 years of schooling, likely hating most of it, and may not have thought a lot about the scale of its impact on our lives and how things could have been so, so different. \n School is a class stratifier along eugenic lines. Those deemed more intelligent by their ability to absorb and spit out information in tests are seen as more suited for higher paying jobs and therefore, by this society’s lo…",
          "link": "https://theanarchistlibrary.org/library/sheffield-action-group-what-is-school?v=1719921860",
          "publishedOn": "2024-07-02T12:04:20.000Z",
          "wordCount": 1442,
          "title": "Sheffield Action Group - What is School?",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6999",
            "url": "https://theanarchistlibrary.org/library/sheffield-action-group-what-is-school.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/znore-hermetic-anarchism?v=1719921672",
          "author": null,
          "description": "Author: Znore\nTitle: Hermetic Anarchism\nSubtitle: Othering the Other, Uttering the Otter and Uddering the Author\nDate: 2014\nSource: groupnameforgrapejuice.blogspot.com\n\nI. Hermetic Anarchism and Othering the Other\n Imagination is a magic carpet \n Upon which we may soar \n To distant lands and climes \n And even go beyond the moon \n To any planet in the sky \n If we came from nowhere here \n Why can’t we go somewhere there? \n Sun Ra – Imagination \n I end up spending a lot of time in Jimbocho, the old bookseller’s district in Tokyo. Hours and hours I rifle through piles and stacks of dusty pulp hunting for gems. Usually my luck is good, and occasionally I find just the book that I need. There are two shops in particular, both specializing in used English books, where uncanny things can happen. A…",
          "link": "https://theanarchistlibrary.org/library/znore-hermetic-anarchism?v=1719921672",
          "publishedOn": "2024-07-02T12:01:12.000Z",
          "wordCount": 12450,
          "title": "Znore - Hermetic Anarchism",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "119671",
            "url": "https://theanarchistlibrary.org/library/znore-hermetic-anarchism.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/uploads/en/thumbnails/z-h-znore-hermetic-anarchism-1.jpg.large.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/ersilia-cavedagni-the-woman?v=1719921475",
          "author": null,
          "description": "Author: Ersilia Cavedagni\nTitle: The Woman\nDate: 28 October 1899\nNotes: Published in The Unstoppable Anarchist Ersilia Cavedagni & Her Selected Writings (pp. 32-34) at <thetransmetropolitanreview.files.wordpress.com> (PDF).\nSource: Retrieved on 18 March 2024 from thetransmetropolitanreview.wordpress.com.\n\n Generally men, rightly or wrongly, claim to have an intellectual and moral superiority over women, in addition to physical superiority. So be it! I want to grant it. \n Strangely enough, in the vast majority of cases the man who considers himself superior to the woman takes little or no effort to reduce her inferiority and to raise the woman to his level. \n This happens more especially among men who have a wife or partner. It would be logical that, if only out of a feeling of pride, the h…",
          "link": "https://theanarchistlibrary.org/library/ersilia-cavedagni-the-woman?v=1719921475",
          "publishedOn": "2024-07-02T11:57:55.000Z",
          "wordCount": 1469,
          "title": "Ersilia Cavedagni - The Woman",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7124",
            "url": "https://theanarchistlibrary.org/library/ersilia-cavedagni-the-woman.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/mark-barnsley-if-it-was-easy-they-wouldn-t-call-it-struggle?v=1719921397",
          "author": null,
          "description": "Author: Mark Barnsley\nTitle: If it Was Easy They Wouldn’t Call it ‘Struggle’\nSubtitle: Mark Barnsley Talks About Repression and Resistance in British Prisons\nDate: 2005\nSource: <zinelibrary.files.wordpress.com/2016/01/barnsley.pdf>\n\n Mark Barnsley has been involved in the Anarchist movement all his adult life, spending time fighting in Lebanon, editing The Sheffield Anarchist, supporting striking miners, confronting fascists, and spending 10 years in prison. Held in 20 different maximum or high security prisons, and 18 different segregation units, he has always taken the fight to the Enemy in jail. Released from prison in 2002, Mark continues to be as active as ever, speaking all over Europe, and being involved in the Campaign Against Prison Slavery, the Anarchist Black Cross, and many oth…",
          "link": "https://theanarchistlibrary.org/library/mark-barnsley-if-it-was-easy-they-wouldn-t-call-it-struggle?v=1719921397",
          "publishedOn": "2024-07-02T11:56:37.000Z",
          "wordCount": 12353,
          "title": "Mark Barnsley - If it Was Easy They Wouldn’t Call it ‘Struggle’",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "1969387",
            "url": "https://theanarchistlibrary.org/library/mark-barnsley-if-it-was-easy-they-wouldn-t-call-it-struggle.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/uploads/en/thumbnails/m-b-mark-barnsley-if-it-was-easy-they-wouldn-t-cal-1.png.large.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/palestinian-resistance-veteran-mark-barnsley-on-why-he-joined-up?v=1719921176",
          "author": null,
          "description": "Author: Mark Barnsley\nTitle: Palestinian Resistance veteran Mark Barnsley on why he joined up\nDate: 2009\nSource: <duncanpickstock.co.uk/index.php/videos/testament>\n\n And they said, oh, are you the the lads that have come to fight in Lebanon? And we said yeah, that’s us. And we sat in the back of this Peugeot car and I remember Lero nudging me, and there was a handgun underneat the dashboard and there was a butt of what was a Kalashnikov underneath one of the seats. So I was like, well, this is the real deal isn’t it? \nMark Barnsley fought with The Palestinian Resistance between 1978 and 1980\n Well, before I started school, me and my sister, who’s 18 months younger than me, used to on a Friday, we would go to town with my mum, to meet her mother, our grandma and we’d get dragged around the …",
          "link": "https://theanarchistlibrary.org/library/palestinian-resistance-veteran-mark-barnsley-on-why-he-joined-up?v=1719921176",
          "publishedOn": "2024-07-02T11:52:56.000Z",
          "wordCount": 2037,
          "title": "Mark Barnsley - Palestinian Resistance veteran Mark Barnsley on why he joined up",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "10319",
            "url": "https://theanarchistlibrary.org/library/palestinian-resistance-veteran-mark-barnsley-on-why-he-joined-up.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/antithesi-the-ecological-crisis-and-the-rise-of-post-fascism?v=1719921075",
          "author": null,
          "description": "Author: Antithesi\nTitle: The Ecological Crisis and the Rise of Post-Fascism\nDate: January 28, 2024\nNotes: Translated into English and posted by Illwill on February 17th, 2024\nSource: Retrieved on March 19th, 2024 from https://illwill.com/antithesi.\n\n The ecological crisis profoundly impacts the material conditions of social reproduction, extending beyond “natural disasters” to encompass a deepening of the contradictions inherent in capitalism. This crisis does not only manifest itself in events like floods, droughts, and pandemics, it also plays a direct role in fueling conflicts, social unrest, and mass displacement. In what follows, we attempt to lay out a comprehensive argument for the connection between the ecological crisis and the rise of what we call the post-fascist current, a poli…",
          "link": "https://theanarchistlibrary.org/library/antithesi-the-ecological-crisis-and-the-rise-of-post-fascism?v=1719921075",
          "publishedOn": "2024-07-02T11:51:15.000Z",
          "wordCount": 5142,
          "title": "Antithesi - The Ecological Crisis and the Rise of Post-Fascism",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "22240",
            "url": "https://theanarchistlibrary.org/library/antithesi-the-ecological-crisis-and-the-rise-of-post-fascism.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/pranay-somayajula-nationhood-beyond-nationalism?v=1719920998",
          "author": null,
          "description": "Author: Pranay Somayajula\nTitle: nationhood beyond nationalism\nSubtitle: towards an anarchist politics of anticolonial liberation\nDate: December 29th, 2023\nSource: Retrieved on March 25th, 2024 from https://www.culture-shock.xyz/p/nationhood-beyond-nationalism.\n\n In its Spring 2001 issue, the Oregon-based magazine Green Anarchy ran an anonymous article with the title: “The EZLN is NOT Anarchist: Or Struggles at the Margins and Revolutionary Solidarity.” Writing from an anarchist perspective, the author advanced a fierce critique of the Zapatista National Liberation Army—the militant anticolonial, anticapitalist Indigenous movement which had led an uprising and established autonomous zones in southern Mexico several years before, and which is often cited by anarchists as an example of a suc…",
          "link": "https://theanarchistlibrary.org/library/pranay-somayajula-nationhood-beyond-nationalism?v=1719920998",
          "publishedOn": "2024-07-02T11:49:58.000Z",
          "wordCount": 2924,
          "title": "Pranay Somayajula - nationhood beyond nationalism",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "10857",
            "url": "https://theanarchistlibrary.org/library/pranay-somayajula-nationhood-beyond-nationalism.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/imanol-blind-spot?v=1719920664",
          "author": null,
          "description": "Author: Imanol\nTitle: Blind Spot\nSubtitle: Manuel Huet and the libertarian underground in France\nDate: 2023\nNotes: Translated by Paul Sharkey from El Angulo Muerto : Manuel Huet y la clandestinidad libertaria en Francia.\nSource: English translation published by the Kate Sharpley Library www.katesharpleylibrary.net\n\n \n \n The Kate Sharpley Library aims to preserve the history of the anarchist movement and record and commemorate the lives of the people who made up the movement. It’s always good to see other people plugging away at the same task. The first translation of a piece by Imanol that we put up was ‘The Massana Gang’ which went in KSL: Bulletin of the Kate Sharpley Library No. 97–98, February 2019. Since then we’ve been glad to host translations of his studies from El Salto which are …",
          "link": "https://theanarchistlibrary.org/library/imanol-blind-spot?v=1719920664",
          "publishedOn": "2024-07-02T11:44:24.000Z",
          "wordCount": 106546,
          "title": "Imanol - Blind Spot",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "316619",
            "url": "https://theanarchistlibrary.org/library/imanol-blind-spot.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/harsha-walia-what-is-border-imperialism?v=1719919583",
          "author": null,
          "description": "Author: Harsha Walia\nTitle: What Is Border Imperialism?\nSubtitle: Excerpt from Undoing Border Imperialism\nDate: 2013\nSource: Undoing Border Imperialism. AK Press / Institute for Anarchist Studies, 2013. Pages 35 to 74.\n\nWhat Is Border Imperialism?\n The world was born yearning to be a home for everyone. \n —Eduardo Galeano, “Through the Looking Glass: Q & A with Eduardo Galeano” \n For the past several years, Indigenous organizations in Australia have been issuing “Original Passports” to asylum seekers who have been detained or denied legal status by the Australian government. Most recently, in May 2012, passports were issued to two detained Tamil asylum seekers. During the ceremony, Ray Jackson of the Indigenous Social Justice Association said, “The Australian Government must stop imprisonin…",
          "link": "https://theanarchistlibrary.org/library/harsha-walia-what-is-border-imperialism?v=1719919583",
          "publishedOn": "2024-07-02T11:26:23.000Z",
          "wordCount": 12162,
          "title": "Harsha Walia - What Is Border Imperialism?",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "45034",
            "url": "https://theanarchistlibrary.org/library/harsha-walia-what-is-border-imperialism.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/frott-bulldoze-sci-rockview?v=1719918854",
          "author": null,
          "description": "Author: Frott\nTitle: Bulldoze SCI Rockview\nSubtitle: Abolition, Prisoner Support, and Resistance to Genocide in PA-DOC\nDate: 4/7/24\nNotes: 4/7/24 The Final Straw Radio — Episode Transcription\nSource: https://ia600308.us.archive.org/5/items/tfsr-202404072024-SCIRockview/Bulldoze-sci-rockview.pdf\n\n Intro SCI Rockview is a prison in central Pennsylvania where incarcerated comrades have been facing repression for demanding justice in the face of impunity by racist COs and following a year of prisoner deaths due to institutional toxicity and guard violence. We speak to an outside supporter about the situation at Rockview, the reactions of administration, inside / outside relationships and solidarity that have flared up. We hope that this conversation contributes to increased and thickened ties …",
          "link": "https://theanarchistlibrary.org/library/frott-bulldoze-sci-rockview?v=1719918854",
          "publishedOn": "2024-07-02T11:14:14.000Z",
          "wordCount": 12105,
          "title": "Frott - Bulldoze SCI Rockview",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "29631",
            "url": "https://theanarchistlibrary.org/library/frott-bulldoze-sci-rockview.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/peter-gelderloos-israel-is-pioneering-new-methods-of-genocide?v=1719918743",
          "author": null,
          "description": "Author: Peter Gelderloos\nTitle: Israel is pioneering new methods of genocide\nSubtitle: Killing by algorithm\nDate: April 16th, 2024\nSource: Retrieved on April 18th, 2024 from https://petergelderloos.substack.com/p/israel-is-pioneering-new-methods.\n\n Israel is making sure it will be remembered in history as a pioneer of genocide. Multiple Israeli military sources have testified that the Israeli military is using AI to guide missile and bomb strikes against Palestinians[1]. If the Israeli military’s Artificial Intelligence determines that a person is a military member of Hamas, the Israeli military will systematically approve of a missile or bomb strike to murder that person and any civilians in the immediate vicinity. \n The AI program used by the IDF, called ‘Lavender,’ can also determine th…",
          "link": "https://theanarchistlibrary.org/library/peter-gelderloos-israel-is-pioneering-new-methods-of-genocide?v=1719918743",
          "publishedOn": "2024-07-02T11:12:23.000Z",
          "wordCount": 1933,
          "title": "Peter Gelderloos - Israel is pioneering new methods of genocide",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "8763",
            "url": "https://theanarchistlibrary.org/library/peter-gelderloos-israel-is-pioneering-new-methods-of-genocide.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/loren-goldner-the-spanish-revolution-past-and-future-grandeur-and-poverty-of-anarchism?v=1719918699",
          "author": null,
          "description": "Author: Loren Goldner\nTitle: The Spanish Revolution, Past and Future: Grandeur and Poverty of Anarchism\nSubtitle: How the Working Class Takes Over (or Doesn’t), Then and Now\nDate: 2013\nSource: Retrieved on April 19th, 2024 from <breaktheirhaughtypower.org/the-spanish-revolution-past-and-future-grandeur-and-poverty-of-anarchism-how-the-working-class-takes-over-or-doesnt-then-and-now>.\n\nIntroduction: Why the Spanish Revolution Today?\n “…anarchism and revolutionary syndicalism in general lacked a vision of the problems of political orientation, without which the most powerful and most heroic revolutionary surge is condemned to failure.” — Helmut Rüdiger, AIT, Ensayo critico sobre la revolucion española (1940)[1]\n For many years, I had held the classical left anti-Stalinist view that after the…",
          "link": "https://theanarchistlibrary.org/library/loren-goldner-the-spanish-revolution-past-and-future-grandeur-and-poverty-of-anarchism?v=1719918699",
          "publishedOn": "2024-07-02T11:11:39.000Z",
          "wordCount": 15608,
          "title": "Loren Goldner - The Spanish Revolution, Past and Future: Grandeur and Poverty of Anarchism",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "51587",
            "url": "https://theanarchistlibrary.org/library/loren-goldner-the-spanish-revolution-past-and-future-grandeur-and-poverty-of-anarchism.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/red-mutualism-series-at-mutualism-co-op?v=1719918555",
          "author": null,
          "description": "Author: Eric Fleischmann\nTitle: “Red Mutualism” Series at Mutualism Co-Op\nDate: April 23rd, 2024\nSource: Retrieved 4/25/2024 from https://c4ss.org/content/59582.\n\n If there are two contemporary anarchist theorists whose work occupies and influences my thought the most, they are Kevin Carson and Wayne Price. Carson has spent a huge segment of his career not just reconstructing a mutualist political economy as an alternative to the anarchist default to the economics of Karl Marx but also making incredibly original contributions to the fields of decentralized technology/production and spontaneous organization theory. Wayne Price in turn has dedicated his mind to a task that at first seems wholly opposite to Carson’s: working to adapt Marxist economics and political strategy to an anarchist co…",
          "link": "https://theanarchistlibrary.org/library/red-mutualism-series-at-mutualism-co-op?v=1719918555",
          "publishedOn": "2024-07-02T11:09:15.000Z",
          "wordCount": 1091,
          "title": "Eric Fleischmann - “Red Mutualism” Series at Mutualism Co-Op",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6607",
            "url": "https://theanarchistlibrary.org/library/red-mutualism-series-at-mutualism-co-op.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anonymous-crimethinc-campus-building-occupations-2008-2010-and-today?v=1719918476",
          "author": null,
          "description": "Author: Anonymous, CrimethInc.\nTitle: Campus Building Occupations, 2008–2010 and Today\nDate: April 22 2024\nSource: Retrieved on April 25th 2024 from <crimethinc.com/2024/04/22/campus-building-occupations-from-2008-2010-to-today>\n\n A wave of campus building occupations took place in response to austerity measures following the recession of 2008. As today’s Gaza solidarity movement begins to experiment with encampments and building occupations, it could be instructive to learn from the previous generation of student activists. \n On April 22, 2024, inspired by the resilience of the Gaza solidarity encampment at Columbia University and other demonstrators around the country, students at Cal Poly Humboldt in Arcata, California occupied Siemens Hall. This represented the first confrontational bu…",
          "link": "https://theanarchistlibrary.org/library/anonymous-crimethinc-campus-building-occupations-2008-2010-and-today?v=1719918476",
          "publishedOn": "2024-07-02T11:07:56.000Z",
          "wordCount": 6052,
          "title": "Anonymous, CrimethInc. - Campus Building Occupations, 2008–2010 and Today",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "24793",
            "url": "https://theanarchistlibrary.org/library/anonymous-crimethinc-campus-building-occupations-2008-2010-and-today.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anonymous-crimethinc-it-is-an-honor-to-be-suspended-for-palestine?v=1719918373",
          "author": null,
          "description": "Author: Anonymous, CrimethInc.\nTitle: “It Is an Honor to Be Suspended for Palestine”\nSubtitle: Dispatches from the Solidarity Encampment at Columbia University\nDate: April 21 2024\nSource: Retrieved on April 25th 2024 from https://crimethinc.com/2024/04/21/it-is-an-honor-to-be-suspended-for-palestine-dispatches-from-the-solidarity-encampment-at-columbia-university\n\n On April 17, students at Columbia University and Barnard College set up an encampment in solidarity with Palestinians facing genocide at the hands of the Israeli military. On April 18, the university administration brought in massive numbers of police to arrest the demonstrators and crush the encampment; yet in response, students established a new encampment, bigger than the first, inspiring copycat actions from Yale to St. Loui…",
          "link": "https://theanarchistlibrary.org/library/anonymous-crimethinc-it-is-an-honor-to-be-suspended-for-palestine?v=1719918373",
          "publishedOn": "2024-07-02T11:06:13.000Z",
          "wordCount": 9099,
          "title": "Anonymous, CrimethInc. - “It Is an Honor to Be Suspended for Palestine”",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "33589",
            "url": "https://theanarchistlibrary.org/library/anonymous-crimethinc-it-is-an-honor-to-be-suspended-for-palestine.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/marginal-ontologies?v=1719917880",
          "author": null,
          "description": "Author: Angie Barbosa\nTitle: Marginal Ontologies\nSubtitle: Challenges of a Transfeminist Anarchism\nDate: 08.03.2023\nNotes: Translation by Cello Latini Pfeil [mltpfeil@gmail.com]\nSource: Original translation of “Ontologias Marginais: Desafios de um Anarquismo Transfeminista”. Retrieved on 04.28.2024 from https://revistatapuia.com.br/ojs/index.php/revista/article/view/29/19\n\nAbstract\n In this text, written as a speech for the 1st Anarchist Fair in Rio de Janeiro, contradictions of the historically predatory relationship of brazilian democracy with brazilian travestis and transsexuals are presented, paying attention to the ontological marginality of the travesti body under the capitalist patriarchy of white supremacy. Based on this reflection, transfeminist challenges to radical and anarchist…",
          "link": "https://theanarchistlibrary.org/library/marginal-ontologies?v=1719917880",
          "publishedOn": "2024-07-02T10:58:00.000Z",
          "wordCount": 7097,
          "title": "Angie Barbosa - Marginal Ontologies",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "25713",
            "url": "https://theanarchistlibrary.org/library/marginal-ontologies.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/mother-earth-if-we-must-fight-let-it-be-for-the-social-revolution?v=1719917731",
          "author": null,
          "description": "Author: Mother Earth\nTitle: If We Must Fight, Let It Be For The Social Revolution\nDate: 1914\nNotes: From “Mother Earth”, October 1914, New York City, published by Emma Goldman, edited by Alexander Berkman\n\n Society has plunged into a world-wide war, but we Anarchists, we cannot shed tears over its horrors, as do the Socialists and other so-called philanthropists. WE KNOW how industriously those same weepers have been piling up the fuel which made this conflagration certain. \n Governments have made this war. The Austrian government ordered its slaves to sweep Servia with fire and sword. The German government snapped its fingers at the four million and odd Socialist voters, and ordered its slaves to invade Belgium. The American government with hypocritical sobs and sighs, ordered its slaves …",
          "link": "https://theanarchistlibrary.org/library/mother-earth-if-we-must-fight-let-it-be-for-the-social-revolution?v=1719917731",
          "publishedOn": "2024-07-02T10:55:31.000Z",
          "wordCount": 2209,
          "title": "Mother Earth - If We Must Fight, Let It Be For The Social Revolution",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "8778",
            "url": "https://theanarchistlibrary.org/library/mother-earth-if-we-must-fight-let-it-be-for-the-social-revolution.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/warzone-distro-anti-social-anarchy?v=1719855971",
          "author": null,
          "description": "Author: Anonymous\nTitle: Anti-Social Anarchy\nSubtitle: A Short Response to Ausonia Calabrese’s “Against Individualism”\nDate: Mar 20, 2020\nNotes: Warzone Distro\nSource: anarchistnews.org\n\n Marxism shares one thing in common with other authoritarian ideologies: they are against the individual. Even when Marxists claim to be anarchists or “anti-state communists,” they make sure that masses and classes are always more important than actual people. This is as obvious in Tiqqun or Theory of Bloom as it is in Stalin’s “Anarchism” or “Socialism”, and now, in Ausonia Calabrese’s Against Individualism. The fact that someone identifying themselves as an anarchist or a Stirnite could ever claim to be against individualism is beyond me, but I digress. \n The main gist of the essay is that individuals ar…",
          "link": "https://theanarchistlibrary.org/library/warzone-distro-anti-social-anarchy?v=1719855971",
          "publishedOn": "2024-07-01T17:46:11.000Z",
          "wordCount": 1098,
          "title": "Anonymous - Anti-Social Anarchy",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6303",
            "url": "https://theanarchistlibrary.org/library/warzone-distro-anti-social-anarchy.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/alejandro-ruizesparza-freddy-martinez-up-against-the-firewall?v=1719807284",
          "author": null,
          "description": "Author: Alejandro Ruizesparza, Freddy Martinez\nTitle: Up Against the Firewall\nDate: June 2024\nSource: XRDS: Crossroads, The ACM Magazine for Students, Volume 30, Issue 4 Pages 26–30, DOI: 10.1145/3665595\n\nIn a revolt against techno-optimism and the real-world violence it upholds, members of radical research collective Lucy Parsons Labs (LPL) call for an empiricism rooted in technopolitical critique. Drawing from their own years of labor in the struggles against racial and surveillance capitalism, current work in HCI, and radical theorists like Alfredo M. Bonanano and Modibo Kadalie, LPL invites us to incorporate an ethics of rebellion and progress our tech practices into principled, anti-authoritarian praxis.\n Our organization, Lucy Parsons Labs (LPL), is a collective of researchers, journ…",
          "link": "https://theanarchistlibrary.org/library/alejandro-ruizesparza-freddy-martinez-up-against-the-firewall?v=1719807284",
          "publishedOn": "2024-07-01T04:14:44.000Z",
          "wordCount": 3677,
          "title": "Alejandro Ruizesparza, Freddy Martinez - Up Against the Firewall",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "19193",
            "url": "https://theanarchistlibrary.org/library/alejandro-ruizesparza-freddy-martinez-up-against-the-firewall.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/ignatius-no-such-thing-as-neutral?v=1719787300",
          "author": null,
          "description": "Author: Ignatius\nTitle: No Such Thing as Neutral\nSubtitle: On the Tools We Use\nDate: June 2023\nSource: Retrieved on 30 June 2024 from ia800301.us.archive.org/4/items/zines-anarchism/Fist_Full_of_Concrete-screen.pdf\n\nWhile I had already conceptualized and begun writing this piece prior to the publication of “An Anarchist Anti-Gun Manifesto,” the final form of “No Such Thing as Neutral” has been largely influenced by the response to the former. In particular, I was inspired by the common response of guns being “a tool” and “therefore neutral,” of the assumption that my critique of guns, and their world of relations, was of a moral character, and as such the concept of “neutrality” would hold some rhetorical weight. This piece is an attempt to break out of the confinement of moral frameworks …",
          "link": "https://theanarchistlibrary.org/library/ignatius-no-such-thing-as-neutral?v=1719787300",
          "publishedOn": "2024-06-30T22:41:40.000Z",
          "wordCount": 1570,
          "title": "Ignatius - No Such Thing as Neutral",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7181",
            "url": "https://theanarchistlibrary.org/library/ignatius-no-such-thing-as-neutral.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/indymedia-interview-with-pedro-bautista-rojas-of-cipo-rfm?v=1719773220",
          "author": null,
          "description": "Author: Indymedia\nTitle: Interview with Pedro Bautista Rojas of CIPO-RFM\nSubtitle: Cipo-RFM activist Pedro Bautista-Rojas explains the history of the indigenous struggle in Oaxaca and also the implications of the forest dispute for both the people of San Isidro Aloapam and their children.\nDate: December 4th, 2008\nNotes: Translated by Bea Lopez.\nSource: Retrieved on June 30 2024 from https://www.indymedia.org.uk/en/2008/04/396318.html\n\n\nPedro Bautista Rojas of CIPO-RFM.\n\nHe explains the consequences of deforestation for the village of San Isidro.\n\nFor its people...\n\n...and their children.\n Q.- What’s your name and position? \n A.- My name’s Pedro Bautista Rojas, member of the organising committee of the Popular Indigenous Council of Oaxaca. \n Q.- First, what’s thehistory of this struggle and…",
          "link": "https://theanarchistlibrary.org/library/indymedia-interview-with-pedro-bautista-rojas-of-cipo-rfm?v=1719773220",
          "publishedOn": "2024-06-30T18:47:00.000Z",
          "wordCount": 1540,
          "title": "Indymedia - Interview with Pedro Bautista Rojas of CIPO-RFM",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "96819",
            "url": "https://theanarchistlibrary.org/library/indymedia-interview-with-pedro-bautista-rojas-of-cipo-rfm.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anonymous-a-letter-of-resistance-from-the-magonista-women-s-commission-of-the-popular-indigenou?v=1719772685",
          "author": null,
          "description": "Author: Anonymous\nTitle: A Letter of Resistance from the Magónista Women’s Commission of the Popular Indigenous Council of Oaxaca\nSubtitle: A report from Magónistas on the impact of COVID-19 in Mexico.\nDate: May 13 2020\nSource: Retrieved on June 30th 2024 from https://itsgoingdown.org/a-letter-of-resistance-ricardo-flores-magon-cipo-rfm/\n\n We must bear in mind that no government, honest as it is, can decree the abolition of misery. It is the people themselves, the hungry, the disinherited, who have to abolish misery. – Ricardo Flores Magón (Regeneration, Nov. 19, 1910) \n Once again, the indigenous peoples are forgotten in the oblivion; There is not a single security measure by governments to protect us, and the indigenous women are triple violated. \n Both before COVID-19 and now, our battl…",
          "link": "https://theanarchistlibrary.org/library/anonymous-a-letter-of-resistance-from-the-magonista-women-s-commission-of-the-popular-indigenou?v=1719772685",
          "publishedOn": "2024-06-30T18:38:05.000Z",
          "wordCount": 1680,
          "title": "Anonymous - A Letter of Resistance from the Magónista Women’s Commission of the Popular Indigenous Council of Oaxaca",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "540119",
            "url": "https://theanarchistlibrary.org/library/anonymous-a-letter-of-resistance-from-the-magonista-women-s-commission-of-the-popular-indigenou.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/mark-becker-cipo-oaxaca-and-chiapas?v=1719771759",
          "author": null,
          "description": "Author: Mark Becker\nTitle: CIPO: Oaxaca and Chiapas\nDate: July 9, 2007\nSource: Retrieved on June 30 2024 from https://www.yachana.org/reports/mex07/2007/07/cipo-rfm.html\n\n This afternoon we met with Dolores Villalobo from the Consejo Indígena Popular de Oaxaca “Ricardo Flores Magón” (CIPO-RFM). She began the discussion with an explanation of who was Ricardo Flores Magón–an Indigenous person from Oaxaca who rose up against Porfirio Diáz in the Mexican Revolution. He was persecuted so fled into exile into the United States, but was imprisoned at Levenworth where he was executed. Franciso Madero offered him the vice presidency, but Flores Magón said he preferred jail to his government that was not of the people and who did not represent the change for which they had fought. Dolores said that …",
          "link": "https://theanarchistlibrary.org/library/mark-becker-cipo-oaxaca-and-chiapas?v=1719771759",
          "publishedOn": "2024-06-30T18:22:39.000Z",
          "wordCount": 843,
          "title": "Mark Becker - CIPO: Oaxaca and Chiapas",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "5565",
            "url": "https://theanarchistlibrary.org/library/mark-becker-cipo-oaxaca-and-chiapas.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/elias-manzanera-the-iron-column?v=1719756506",
          "author": null,
          "description": "Author: Elias Manzanera\nTitle: The Iron Column\nSubtitle: Testament of A Revolutionary\nDate: 2006\nSource: Booklet from the Kate Sharpley Library - https://www.katesharpleylibrary.net/w6mb2w\n\nWhat is Anarchism?\n Anarchism is a political theory which opposes the State and capitalism. It says that people with economic power (capitalists) and those with political power (politicians of all stripes left, right or centre) use that power for their own benefit, and not (like they claim) for the benefit of society. Anarchism says that neither exploitation nor government is natural or necessary, and that a society based on freedom, mutual aid and equal shares of the good things in life would work better than this one. \n Anarchism is also a political movement. Anarchists take part in day-to-day struggl…",
          "link": "https://theanarchistlibrary.org/library/elias-manzanera-the-iron-column?v=1719756506",
          "publishedOn": "2024-06-30T14:08:26.000Z",
          "wordCount": 13496,
          "title": "Elias Manzanera - The Iron Column",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "56854",
            "url": "https://theanarchistlibrary.org/library/elias-manzanera-the-iron-column.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/the-fbi-can-go-fuck-itself?v=1719751091",
          "author": null,
          "description": "Author: Sean Swain\nTitle: The FBI Can Go Fuck Itself\nSubtitle: A History of the State Terror Organization and An Analysis of Its Political Repression of Me, Based on Its Own Declassified Documents\nDate: 11/09/2022\nNotes: Prepared For: The Labadie Collection, University of Michigan To Accompany the 223 Disclosed Pages of My FBI File For Posting, Dissemination, and Publication\nSource: Retrieved on 5/30/2024 from: <seanswain.noblogs.org/2022/11/the-fbi-can-go-fk-itself>\n\nINTRODUCTION.\n I have been through a lot. For more than a decade now, the Federal Bureau of Investigation has waged a state terror program designed to drive down me to suicide in order to permanently silence me and, in the process, amassed over four thousand pages of files on me, less than three hundred pages of which they ar…",
          "link": "https://theanarchistlibrary.org/library/the-fbi-can-go-fuck-itself?v=1719751091",
          "publishedOn": "2024-06-30T12:38:11.000Z",
          "wordCount": 14913,
          "title": "Sean Swain - The FBI Can Go Fuck Itself",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "48975",
            "url": "https://theanarchistlibrary.org/library/the-fbi-can-go-fuck-itself.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/steve-bloom-and-russell-maroon-shoatz-dragon-and-hydra-revisited?v=1719750440",
          "author": null,
          "description": "Author: Steve Bloom and Russell Maroon Shoatz\nTitle: Dragon and Hydra Revisited\nSubtitle: A Dialogue\nDate: 2016\nSource: <www.oldandnewproject.net/Essays/Maroon_D%20and%20H%20Revisited.html>\n\nSpecial introductory note by the editors\n In the “Policies of this Website” we explain that we are seeking to promote discussions “where participants are engaged in active listening and a search for commonalities or convergences—giving at least as much emphasis to this as we do to ‘clarifying differences.’ The overall goal of our project is not just to recapitulate well-established views but to transcend them if/when we can in order to create a stronger collective synthesis of revolutionary thought.” \n We believe that the exchange below is an excellent case study in this process and how it can work eff…",
          "link": "https://theanarchistlibrary.org/library/steve-bloom-and-russell-maroon-shoatz-dragon-and-hydra-revisited?v=1719750440",
          "publishedOn": "2024-06-30T12:27:20.000Z",
          "wordCount": 5871,
          "title": "Steve Bloom and Russell Maroon Shoatz - Dragon and Hydra Revisited",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "18964",
            "url": "https://theanarchistlibrary.org/library/steve-bloom-and-russell-maroon-shoatz-dragon-and-hydra-revisited.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/andrewism-how-anarchy-works?v=1719739207",
          "author": null,
          "description": "Author: Andrewism\nTitle: How Anarchy Works\nSubtitle: A Guide To Organising Anarchy\nDate: 1 May 2024\nSource: Retrieved on 2 May 2024 from https://youtu.be/lrTzjaXskUU\n\nIntroduction\n What if we didn’t need bosses, politicians, borders, landlords, police, or prisons? \n There was a time when each of these things did not exist, and whatever you may believe now about their absolute necessity, have you considered that there can be a time again when we can do much better without them? \n Anarchists dare to desire a world without rule. \n Neither the rule of the minority nor the rule of the majority. Neither the rule of the capitalists nor the rule of the bureaucrats. Neither the rule of men nor the rule of royalty nor the rule of the elderly nor the rule of warlords. An-archy. Without rule. \n The wo…",
          "link": "https://theanarchistlibrary.org/library/andrewism-how-anarchy-works?v=1719739207",
          "publishedOn": "2024-06-30T09:20:07.000Z",
          "wordCount": 9493,
          "title": "Andrewism - How Anarchy Works",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "34661",
            "url": "https://theanarchistlibrary.org/library/andrewism-how-anarchy-works.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/pikante-opposing-the-massacre-in-gaza-an-anarchist-perspective?v=1719738560",
          "author": null,
          "description": "Author: Pikante\nTitle: Opposing the massacre in Gaza!\nSubtitle: An anarchist perspective\nDate: April 2024\nNotes: This is a translation of a text that had been published in the paper “Pikante”, in Toulouse (fRance), in the beginning of April 2024. Contact : pikante(a)riseup.net\nSource: Original in French: <mars-infos.org/s-opposer-au-massacre-a-gaza-un-7502>\n\n To write from here an article about this situation is something that will inevitably be limited, but the silence appears worst to us. We feel the need to write about what is going on, in order to take the emotions out. Also, to try to take ourself out of the media and state propaganda. Even if words won’t ever be enough against this incredibly unfair violence that is falling on an entire population. More than 2 millions of people, gui…",
          "link": "https://theanarchistlibrary.org/library/pikante-opposing-the-massacre-in-gaza-an-anarchist-perspective?v=1719738560",
          "publishedOn": "2024-06-30T09:09:20.000Z",
          "wordCount": 1653,
          "title": "Pikante - Opposing the massacre in Gaza!",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7735",
            "url": "https://theanarchistlibrary.org/library/pikante-opposing-the-massacre-in-gaza-an-anarchist-perspective.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/the-budapest-trial-how-hungary-exploits-a-dubious-eu-mechanism-to-chase-anti-fascis?v=1719738079",
          "author": null,
          "description": "Author: Henri Sulku\nTitle: The Budapest Trial\nSubtitle: How Hungary Exploits a Dubious EU Mechanism to Chase Anti-Fascists Across the Continent\nDate: 22.05.2024\nSource: Retrieved on 28.5.2024 from https://turningpointmag.org/2024/05/22/the-budapest-trial-how-hungary-exploits-a-dubious-eu-mechanism-to-chase-anti-fascists-across-the-continent/\n\n On March 28, 2024, the streets surrounding Milan’s main courthouse, the Palace of Justice, are swarmed with different branches of Italian law enforcement. The municipal police have brought one patrol car, casually parked next to a newspaper kiosk. State police and military police (the Carabinieri) can be seen on the side streets, sporting riot gear in their trademark armored vans, light and dark blue respectively. The scenery does not yet make a stri…",
          "link": "https://theanarchistlibrary.org/library/the-budapest-trial-how-hungary-exploits-a-dubious-eu-mechanism-to-chase-anti-fascis?v=1719738079",
          "publishedOn": "2024-06-30T09:01:19.000Z",
          "wordCount": 5536,
          "title": "Henri Sulku - The Budapest Trial",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "24398",
            "url": "https://theanarchistlibrary.org/library/the-budapest-trial-how-hungary-exploits-a-dubious-eu-mechanism-to-chase-anti-fascis.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/metrius-the-simian-redemption?v=1719737957",
          "author": null,
          "description": "Author: Metrius\nTitle: The Simian Redemption\nSubtitle: Bridging the divide between humanity and nature\nDate: April 2, 2014\n\nThe simian redemption\n “You don’t know nothing, but you don’t need to know. The wisdom’s in the trees, not the glass windows”. – Jack Johnson[1]\n A lot of theories have surfaced in the relatively new millennium concerning the human species’ relationship to the planet it calls home. Historically, the mechanized view on nature advocated in the 17th century Scientific Revolution is criticized by ecological movements as alienating humanity from its origins. With the advent of the clock for example, man started measuring time according to its own inventions, exempting the sun of this function. Likewise, the clock became a metaphor for the machinery of nature, and “God” bec…",
          "link": "https://theanarchistlibrary.org/library/metrius-the-simian-redemption?v=1719737957",
          "publishedOn": "2024-06-30T08:59:17.000Z",
          "wordCount": 4387,
          "title": "Metrius - The Simian Redemption",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "19829",
            "url": "https://theanarchistlibrary.org/library/metrius-the-simian-redemption.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/arthur-and-barbara-gelb-o-neill?v=1719737733",
          "author": null,
          "description": "Author: Arthur and Barbara Gelb\nTitle: O’Neill\nDate: 1960\nNotes: The photo gallery broke up paragraphs in 3 places in the source book, so it has been moved to the back matter here.\nSource: <archive.org/details/oneill0000gelb_u1k6>\n\nAcknowledgments\n A great many persons, libraries, institutions, organizations and publications have given their help and cooperation in the preparation of this book. We will never be able to thank all of them adequately, and can only try to outline the extent of their assistance and indicate the measure of our gratitude. \n We acknowledge, first, our debt to Carlotta Monterey O’Neill. With the understanding that we were to have the freedom of complete objectivity, she graciously allowed herself to be interviewed on many occasions, put documents and photographs at…",
          "link": "https://theanarchistlibrary.org/library/arthur-and-barbara-gelb-o-neill?v=1719737733",
          "publishedOn": "2024-06-30T08:55:33.000Z",
          "wordCount": 419157,
          "title": "Arthur and Barbara Gelb - O’Neill",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "62904483",
            "url": "https://theanarchistlibrary.org/library/arthur-and-barbara-gelb-o-neill.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/uploads/en/thumbnails/a-a-arthur-and-barbara-gelb-o-neill-1.jpg.large.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/mikkel-bolt-rasmussen-from-revolution-to-destitution?v=1719737327",
          "author": null,
          "description": "Author: Mikkel Bolt Rasmussen\nTitle: From Revolution to Destitution\nDate: May 29th, 2024\nSource: https://illwill.com/from-revolution-to-destitution\n\n What happened to the notion of revolution? In his companion piece to “The Movement of Refusal,” Mikkel Bolt Rasmussen retraces the rise and fall of revolutionary theory from its earliest systematic expression during the First International to the first proletarian offensive of 1917–1921, and onwards to the crisis at the hands of a bourgeois “anti-fascism” that instrumentalized the specter of fascism as a means to save capitalism, before ditching it, after 1945, in order to integrate the laboring class into the nation state. Although the post-war welfare state was the great achievement of the workers’ movement, the price paid for it was the ab…",
          "link": "https://theanarchistlibrary.org/library/mikkel-bolt-rasmussen-from-revolution-to-destitution?v=1719737327",
          "publishedOn": "2024-06-30T08:48:47.000Z",
          "wordCount": 14363,
          "title": "Mikkel Bolt Rasmussen - From Revolution to Destitution",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "48732",
            "url": "https://theanarchistlibrary.org/library/mikkel-bolt-rasmussen-from-revolution-to-destitution.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/brynn-emond-scenes-from-the-pro-palestine-encampment-at-ottawau?v=1719737130",
          "author": null,
          "description": "Author: Brynn Emond\nTitle: Scenes from the pro-Palestine encampment at OttawaU\nSource: https://mutualrage.wordpress.com/2024/05/03/what-the-student-pro-palestine-encampments-are-actually-like/\n\n The other day my friend and I decided we wanted to visit the student-led pro-Palestine encampment that has recently sprung up on the lawn of OttawaU. On one of the organizing group’s social media pages, they had recently sent out a message informing people they were accepting donations, specifically of certain types of things (like hot water, garbage bags, blue tarps, yoga mats, etc.). I felt driven by the urge to donate whatever I could – so, during my shift, I furtively searched the back storeroom, digging through years’ worth of defunct paper cups, lids, and out-of-season teas. There was enough …",
          "link": "https://theanarchistlibrary.org/library/brynn-emond-scenes-from-the-pro-palestine-encampment-at-ottawau?v=1719737130",
          "publishedOn": "2024-06-30T08:45:30.000Z",
          "wordCount": 1445,
          "title": "Brynn Emond - Scenes from the pro-Palestine encampment at OttawaU",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7225",
            "url": "https://theanarchistlibrary.org/library/brynn-emond-scenes-from-the-pro-palestine-encampment-at-ottawau.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/bowers-lawler-anarchism-as-a-methodological-foundation-in-mathematics-education?v=1719737002",
          "author": null,
          "description": "Author: Bowers & Lawler\nTitle: Anarchism as a Methodological Foundation in Mathematics Education\nSubtitle: A Portrait of Resistance\nDate: 2021/2022\nSource: https://www.exeter.ac.uk/research/groups/education/pmej/pome39/index.html\n\n \n \nA large swath of research in mathematics education claims to serve an equity agenda. However, too often this research is conducted atheoretically, failing to disrupt the worldviews that produce injustice and oppression, for both the researcher and the reader. Responding to this commonplace divergence of intent and impact, we propose a methodological approach that anchors research and praxis in a sociopolitical foundation of anarchism. We seek cohesion of theory and practice by consciously demanding that values common to the equity agenda—cooperation, mutual a…",
          "link": "https://theanarchistlibrary.org/library/bowers-lawler-anarchism-as-a-methodological-foundation-in-mathematics-education?v=1719737002",
          "publishedOn": "2024-06-30T08:43:22.000Z",
          "wordCount": 5211,
          "title": "Bowers & Lawler - Anarchism as a Methodological Foundation in Mathematics Education",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "168479",
            "url": "https://theanarchistlibrary.org/library/bowers-lawler-anarchism-as-a-methodological-foundation-in-mathematics-education.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/marginal-ontologies-1?v=1719736373",
          "author": null,
          "description": "Author: Angie Barbosa\nTitle: Marginal Ontologies\nSubtitle: Challenges of a Transfeminist Anarchism\nDate: 08.03.2023\nNotes: Translation: Cello L. Pfeil\nSource: Original translation of “Ontologias Marginais: Desafios de um Anarquismo Transfeminista”. Retrieved on 04.28.2024 from https://revistatapuia.com.br/ojs/index.php/revista/article/view/29/19\n\nAbstract[1] [2]\n In this text, written as a speech for the 1st Anarchist Fair in Rio de Janeiro, contradictions of the historically predatory relationship of brazilian democracy with brazilian travestis and transsexuals are presented, paying attention to the ontological marginality of the travesti body under the capitalist patriarchy of white supremacy. Based on this reflection, transfeminist challenges to radical and anarchist politics are presen…",
          "link": "https://theanarchistlibrary.org/library/marginal-ontologies-1?v=1719736373",
          "publishedOn": "2024-06-30T08:32:53.000Z",
          "wordCount": 7127,
          "title": "Angie Barbosa - Marginal Ontologies",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "24825",
            "url": "https://theanarchistlibrary.org/library/marginal-ontologies-1.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/john-creaghe-no-rent-in-sheffield?v=1719736177",
          "author": null,
          "description": "Author: John Creaghe\nTitle: “No Rent” in Sheffield\nDate: July 1891\nSource: Retrieved on 6 June 2024 from https://www.marxists.org/history/international/social-democracy/commonweal/1891/index.htm\n\nWe refer elsewhere to Comrade Creaghe’s plucky assault upon the landlord robbers. As some of our readers may like to know what he has to say for himself, we quote the following from the first issue of our bright little contemporary, the Sheffield Anarchist, to which we wish all success.\n Comrades, \n As I find we are now boycotted by the Sheffield Telegraph, which, no doubt, while it silences us, will continue, with its usual sense of fair play, to attack us in its columns, I write to you for the satisfaction of the only public we respect, namely, the workers. \n I have been held up to the reprobati…",
          "link": "https://theanarchistlibrary.org/library/john-creaghe-no-rent-in-sheffield?v=1719736177",
          "publishedOn": "2024-06-30T08:29:37.000Z",
          "wordCount": 2868,
          "title": "John Creaghe - “No Rent” in Sheffield",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "10073",
            "url": "https://theanarchistlibrary.org/library/john-creaghe-no-rent-in-sheffield.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/matthew-azoulay-we-need-a-plethora-of-tactics?v=1719735889",
          "author": null,
          "description": "Author: Matthew Azoulay\nTitle: We need a plethora of tactics\nSubtitle: Considering “metacrisis” and the ever greater need to re-embrace Bookchin’s social ecology.\nDate: Mar 10th\nNotes: This article first appeared in the Winter 2023-4 issue of Freedom Anarchist Journal\nSource: Retrieved on 2024-06-30 from <freedomnews.org.uk/2024/03/10/we-need-a-plethora-of-tactics>\n\n ‘Metacrisis’ is my chosen umbrella term for the escalation of multiple global crises of climate, ecology, and political economy, which have reached such a point now that all radical organising is a form of crisis response. And I know for folk on the sacrificial frontlines of capitalism, the terms ‘radical organising’ and ‘crisis response’ belie that they have to fight just to survive. The metacrisis is hidden from many of us a…",
          "link": "https://theanarchistlibrary.org/library/matthew-azoulay-we-need-a-plethora-of-tactics?v=1719735889",
          "publishedOn": "2024-06-30T08:24:49.000Z",
          "wordCount": 1677,
          "title": "Matthew Azoulay - We need a plethora of tactics",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "8099",
            "url": "https://theanarchistlibrary.org/library/matthew-azoulay-we-need-a-plethora-of-tactics.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/george-barrett-the-last-war?v=1719711090",
          "author": null,
          "description": "Author: George Barrett\nTitle: The Last War\nDate: 1915\nSource: Our Masters Are Helpless (ISBN 978-1-904491-32-3) pp. 31-50\n\n The great European war has come. The truth has almost staggered our imagination, we do not know what to do and the one only definite thought is that we must win. To this end all our efforts are bent. We fight, with the men and women of France, of Russia, of Belgium. It is exactly the same, alas! with the men and women of Germany and Austria. We are all prompted by the same strong feelings of patriotism. We and they rejoice to give our lives that our country may be victorious, and more than all do we each rejoice if we may take the life of another. \n Such is war. It is strange, is it not? Almost to a man we, in the countries concerned, have thrown aside what belief we …",
          "link": "https://theanarchistlibrary.org/library/george-barrett-the-last-war?v=1719711090",
          "publishedOn": "2024-06-30T01:31:30.000Z",
          "wordCount": 9545,
          "title": "George Barrett - The Last War",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "41133",
            "url": "https://theanarchistlibrary.org/library/george-barrett-the-last-war.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}