{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "33de3473228bf0a8001c1a2fab34dcc5d6379d50",
          "author": "Sébastien Stormacq",
          "description": "I counted only 21 AWS news since last Monday, most of them being Regional expansions of existing services and capabilities. I hope you enjoyed a relatively quiet week, because this one will be busier. This week, we’re welcoming our customers and partners at the Jacob Javits Convention Center for the AWS Summit New York on […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-s3-access-grants-aws-lambda-european-sovereign-cloud-region-and-more-july-8-2024/",
          "publishedOn": "2024-07-08T16:47:04.000Z",
          "wordCount": 1660,
          "title": "AWS Weekly Roundup: Amazon S3 Access Grants, AWS Lambda, European Sovereign Cloud Region, and more (July 8, 2024).",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/06/10/AWS-WIR-default-1.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": []
    },
    {
      "title": "The GitHub Blog: Engineering News and Updates",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/category/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": [
        {
          "id": "0b8bd15cb28746b280e7ed11144ffd013485b5aa",
          "author": "Sindhu Pillai",
          "description": "Refactor serverless apps by swapping application code with cloud automation: reduce costs, decouple logic from architecture, and leverage managed services' native capabilities.",
          "link": "https://aws.amazon.com/blogs/devops/refactoring-to-serverless-from-application-to-automation/",
          "publishedOn": "2024-07-03T20:41:32.000Z",
          "wordCount": 2664,
          "title": "Refactoring to Serverless: From Application to Automation",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/06/19/Refactoring-to-Serverless-1145x630.png"
        },
        {
          "id": "405bbc736a74a4576b2623243a568f24e835610b",
          "author": "Chetan Makvana",
          "description": "Many organizations have critical legacy Java applications that are increasingly difficult to maintain. Modernizing these applications is a necessary, daunting, and risky task that takes the focus off of creating new value or features. This includes undocumented code, outdated frameworks and libraries, security vulnerabilities, a lack of logging and error handling, and a lack of […]",
          "link": "https://aws.amazon.com/blogs/devops/modernize-your-java-application-with-amazon-q-developer/",
          "publishedOn": "2024-07-03T00:58:01.000Z",
          "wordCount": 2665,
          "title": "Modernize your Java application with Amazon Q Developer",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/06/30/Modernize-your-Java-application-with-Amazon-Q-Developer-1120x630.png"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": []
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=327436",
          "author": "L. Michael Hager",
          "description": "Given the recent pro-Palestinian protests around the world and on many university campuses, it seems strange if not surprising that neither genocide nor the continuing flow of U.S. weapons to Israel were mentioned during the first (and maybe only) 2024 presidential debate. Nor did the New York Times Editorial Board see fit to cite complicity in genocide while calling for Biden to step down after his poor debate performance. Instead, it declared that Biden has been \"an admirable president.\" More\nThe post The Gaza Genocide: Who’s Complicit? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/the-gaza-genocide-whos-complicit/",
          "publishedOn": "2024-07-08T06:00:22.000Z",
          "wordCount": null,
          "title": "The Gaza Genocide: Who’s Complicit?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327479",
          "author": "Binoy Kampmark",
          "description": "The most staggering feature of these elections, leaving aside the ritualistic savaging of the Tories, was the wholly lopsided nature of the share of votes relative to the winning of seats.  “This election,” the Electoral Reform Society solemnly declared, “saw Labour and the Conservatives receive their joint lowest vote share on record, with a combined 57.4%.” That did not prevent the two major parties from snaring the lion’s share.  Labour received 33.7% of the vote yet obtained 63.2% (411 seats) of the 650 on offer, making it the most disproportionate on record.  The Tories, despite the bloodbath, could still count on 121 MPs with 23.7% of votes winning 18.6% of seats in the House of Commons. More\nThe post Massacre at the Ballot: The Punishing of the Tories appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/massacre-at-the-ballot-the-punishing-of-the-tories/",
          "publishedOn": "2024-07-08T05:59:50.000Z",
          "wordCount": null,
          "title": "Massacre at the Ballot: The Punishing of the Tories",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327556",
          "author": "Andrea Mazzarino",
          "description": "Many war stories end with hunger wreaking havoc on significant portions of a population. In Christian theology, the Biblical “four horses of the apocalypse,” believed by many in early modern Europe to presage the end of the world, symbolized invasion, armed conflict, and famine followed by death. They suggest the degree to which people have long recognized  More\nThe post War and Famine appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/war-and-famine/",
          "publishedOn": "2024-07-08T05:58:06.000Z",
          "wordCount": null,
          "title": "War and Famine",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327509",
          "author": "Andrew Moss",
          "description": "This November, voters will choose between two radically different paths of immigration policy. Should Donald Trump be re-elected president, the nation will embark on a path of deportation, or the attempted deportation, of millions of people living in the U.S. Should Joe Biden or another Democrat occupy the White House next year, the country will  More\nThe post Three Paths Forward in Immigration Policy appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/three-paths-forward-in-immigration-policy/",
          "publishedOn": "2024-07-08T05:56:57.000Z",
          "wordCount": null,
          "title": "Three Paths Forward in Immigration Policy",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327548",
          "author": "Jonah Raskin",
          "description": "Yeah, yeah, I know the Tories are out, Labour won big time and Keir Starmer is the new PM and at home at 10 Downing Street. Starmer called for “Change.” That’s what voters clearly wanted after years and years of disastrous Conservative Party rule that saw a widening gap between haves and have nots and  More\nThe post The 2024 British Election: Big Change Ain’t Gonna Come appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/the-2024-british-election-big-change-aint-gonna-come/",
          "publishedOn": "2024-07-08T05:55:55.000Z",
          "wordCount": null,
          "title": "The 2024 British Election: Big Change Ain’t Gonna Come",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327543",
          "author": "Sonali Kolhatkar",
          "description": "The New York Times, long considered the “newspaper of record” in the United States, has in recent weeks made no secret about its chief concern: President Joe Biden’s ability to defeat Donald Trump in November 2024. And, it has done everything it can to promote the idea that the Democratic Party ticket needs a new  More\nThe post Why is the NY Times Calling for Biden’s Ouster? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/why-is-the-ny-times-calling-for-bidens-ouster/",
          "publishedOn": "2024-07-08T05:55:52.000Z",
          "wordCount": null,
          "title": "Why is the NY Times Calling for Biden’s Ouster?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327544",
          "author": "Linda Farthing - Thomas Grisaffi",
          "description": "Remigia Ferrel Vallejos, a Bolivian union executive from Chimoré, in the coca-grower Chapare region, isn’t nostalgic for the old days. “Before there was a lot of fatalism. Many times, in meetings I was told, ‘women don’t count, the man has to come,” she explains. “That’s how it was; we didn’t even have the right to  More\nThe post Breaking Barriers: The Political Empowerment of Bolivia’s Indigenous Women appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/breaking-barriers-the-political-empowerment-of-bolivias-indigenous-women/",
          "publishedOn": "2024-07-08T05:55:05.000Z",
          "wordCount": null,
          "title": "Breaking Barriers: The Political Empowerment of Bolivia’s Indigenous Women",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327537",
          "author": "Michael Hudson",
          "description": "The July 4 landslide defeat of the neoliberal pro-war British Conservatives by the neoliberal pro-war Labour Party poses the question of just what the media mean when they describe the elections and political alignments throughout Europe in terms of center-right and center-left traditional parties challenged by nationalist neo-fascists. Political differences between Europe’s centrist parties are  More\nThe post We Need a New Political Vocabulary appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/we-need-a-new-political-vocabulary/",
          "publishedOn": "2024-07-08T05:53:40.000Z",
          "wordCount": null,
          "title": "We Need a New Political Vocabulary",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327433",
          "author": "Michael Zoosman",
          "description": "Between stimulus and response there is a space. In that space is our power to choose our response. In our response lies our growth and our freedom. – Viktor E. Frankl Content warning: This essay briefly describes a suicide attempt. If you or someone you know are/is struggling with thoughts of suicide or self-harm, please  More\nThe post Why the Spirit of the Law Should Prevail: A Cautionary Tale of Extremism From an Ex-Scrupulous Chaplain appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/why-the-spirit-of-the-law-should-prevail-a-cautionary-tale-of-extremism-from-an-ex-scrupulous-chaplain/",
          "publishedOn": "2024-07-08T05:50:09.000Z",
          "wordCount": null,
          "title": "Why the Spirit of the Law Should Prevail: A Cautionary Tale of Extremism From an Ex-Scrupulous Chaplain",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327437",
          "author": "Jeff Cohen - Norman Solomon",
          "description": "When Joe Biden’s ABC News interview aired on Friday night, it made clear that he should not be running for re-election. Rather than reduce the concerns sparked by his abysmal debate performance eight days earlier, the interview underscored that the president is in denial about his current political standing and unable to offer reassurance that  More\nThe post More Than Ever, Trump’s Most Effective Campaign Ally is Joe Biden appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/more-than-ever-trumps-most-effective-campaign-ally-is-joe-biden/",
          "publishedOn": "2024-07-08T05:45:38.000Z",
          "wordCount": null,
          "title": "More Than Ever, Trump’s Most Effective Campaign Ally is Joe Biden",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327439",
          "author": "Mike Garrity",
          "description": "The great news is the Ashley National Forest has been saved from a “landscape scale” deforestation plan in which the Forest Service planned to bulldoze in skid trails to log and burn up to 147,000 acres (230 square miles!) of Inventoried Roadless Areas. But when faced with the lawsuit brought by the Alliance for the  More\nThe post Environmental Groups Save Ashley National Forest Roadless Areas from Bulldozers and Chainsaws appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/environmental-groups-save-ashley-national-forest-roadless-areas-from-bulldozers-and-chainsaws/",
          "publishedOn": "2024-07-08T05:22:53.000Z",
          "wordCount": null,
          "title": "Environmental Groups Save Ashley National Forest Roadless Areas from Bulldozers and Chainsaws",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327237",
          "author": "Susie Day",
          "description": "The New York Times has been justifiably criticized, as you probably know, for its anti-Palestine bias in covering Israel’s war on Gaza. But you may not know that the Times building is located near Manhattan’s theater district. This is why a lot of show people tend to walk past the Times, and why my friend, […]\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Genocide Then and Now appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/07/genocide-then-and-now/",
          "publishedOn": "2024-07-07T05:57:38.000Z",
          "wordCount": null,
          "title": "Genocide Then and Now",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327186",
          "author": "Michael Slager",
          "description": "Jocelyn Nungaray, a 12-year-old from Texas, was recently found dead in a creek near her home. Video footage from a convenience store and interviews with neighborhood residents led police to two men whom they later arrested. Both suspects are undocumented migrants from Venezuela. Her murder immediately became a narrative about the savagery of illegal aliens […]\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Migration is Not a Crime appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/07/migration-is-not-a-crime/",
          "publishedOn": "2024-07-07T05:50:17.000Z",
          "wordCount": null,
          "title": "Migration is Not a Crime",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327368",
          "author": "Jeffrey St. Clair",
          "description": "+ This week’s Israeli seizure of nearly five square miles of land in the Jordan Valley of the occupied West Bank is the largest land grab in the more than three decades since the signing of the Oslo Accords. First, the lands were declared “closed military zones,” then the Netanyahu government reassigned them as “state […]\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Moving Human Targets appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/06/moving-human-targets/",
          "publishedOn": "2024-07-06T14:37:31.000Z",
          "wordCount": null,
          "title": "Moving Human Targets",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327205",
          "author": "Melvin Goodman",
          "description": "Last week’s Biden-Trump debate harmed U.S. foreign policy, and the international community was left to debate what was said and what was left unsaid.  In view of the harmful potential for wider wars in East Europe and the Middle East in addition to the potential for China’s increased military pressure on Taiwan, it is shocking that only ten minutes of the 90-minute debate was devoted to national security policy.  The inept CNN moderators—Jake Tapper and Dana Bash—were partly responsible because of the dearth of questions on foreign policy.  Nevertheless, the answers provided by President Joe Biden and former president Donald Trump were shocking for their misinformation and their polemics.   More\nThe post How the Presidential Debate Harmed US Foreign Policy appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/how-the-presidential-debate-harmed-us-foreign-policy/",
          "publishedOn": "2024-07-05T06:00:58.000Z",
          "wordCount": null,
          "title": "How the Presidential Debate Harmed US Foreign Policy",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327256",
          "author": "Jeffrey St. Clair",
          "description": "I grew up south of Indianapolis on the glacier-smoothed plains of central Indiana. My grandparents owned a small farm, whittled down over the years to about 40 acres of bottomland, in some of the most productive agricultural land in America. Like many of their neighbors they mostly grew field corn (and later soybeans), raised a few cows and bred a few horses.\nMore\nThe post Animal Factories: On the Killing Floor appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/animal-factories-on-the-killing-floor/",
          "publishedOn": "2024-07-05T06:00:46.000Z",
          "wordCount": null,
          "title": "Animal Factories: On the Killing Floor",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327179",
          "author": "Matthew Stevenson",
          "description": "On screen, Biden looked and sounded like a somnambulist whose only connection to politics was a haphazard, recited laundry list of federal programs that have saved everyone from unwed mothers to homeless veterans, but at least the president came to the debate with malice toward none (Gazans might have been the exception), while from the other lectern Trump was little more than a fountain of bile. More\nThe post Say It Ain’t So, Joe appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/say-it-aint-so-joe/",
          "publishedOn": "2024-07-05T05:59:42.000Z",
          "wordCount": null,
          "title": "Say It Ain’t So, Joe",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327322",
          "author": "Ramzy Baroud",
          "description": "Israel never learns from its mistakes. What Israeli Prime Minister Benjamin Netanyahu is trying to implement in Gaza is but a poor copy of previous strategies that were used in the past by other Israeli leaders. If these strategies had succeeded, Israel would not be in this position in the first place. The main reason  More\nThe post Sharon Revisited: Netanyahu’s Ultimate Aim in Gaza and Why It Will Fail  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/sharon-revisited-netanyahus-ultimate-aim-in-gaza-and-why-it-will-fail/",
          "publishedOn": "2024-07-05T05:58:56.000Z",
          "wordCount": null,
          "title": "Sharon Revisited: Netanyahu’s Ultimate Aim in Gaza and Why It Will Fail",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327105",
          "author": "Julie Wark",
          "description": "As in Palestine, much of the displacement in West Papua is caused by settlers, but this time funded by the World Bank. Respectably called “transmigration” and officially lasting until 2015, this policy affects Kalimantan, Sumatra, Sulawesi, and Maluku but, above all, West Papua because the transmigrants aren’t Melanesian, so the possibility of ethnic and religious strife is high. More\nThe post Paniai, West Papua: Politics of Displacement appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/paniai-west-papua-politics-of-displacement/",
          "publishedOn": "2024-07-05T05:58:21.000Z",
          "wordCount": null,
          "title": "Paniai, West Papua: Politics of Displacement",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327333",
          "author": "Vijay Prashad",
          "description": "The story should not be real. It was the morning of January 29, 2024. The Israeli military had already bombed substantial parts of the affluent Tel al-Hawa neighborhood in Gaza City, including—in October 2023—the totality of the Gaza City campus of the Islamic University of Gaza. Following a warning from the Israeli military, seven members  More\nThe post The Unbelievable Stories About the Children of Gaza appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/the-unbelievable-stories-about-the-children-of-gaza/",
          "publishedOn": "2024-07-05T05:58:04.000Z",
          "wordCount": null,
          "title": "The Unbelievable Stories About the Children of Gaza",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327317",
          "author": "Michael T. Klare",
          "description": "Wherever he travels globally, President Biden has sought to project the United States as the rejuvenated leader of a broad coalition of democratic nations seeking to defend the “rules-based international order” against encroachments by hostile autocratic powers, especially China, Russia, and North Korea. “We established NATO, the greatest military alliance in the history of the  More\nThe post Trusting the “Five Eyes” Only appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/trusting-the-five-eyes-only/",
          "publishedOn": "2024-07-05T05:57:40.000Z",
          "wordCount": null,
          "title": "Trusting the “Five Eyes” Only",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327135",
          "author": "Eve Ottenberg",
          "description": "A record number of Congress members will leave government come November, so many that the New York Times published an article May 30 bemoaning the phenomenon. But maybe it’s not so terrible. Maybe we’ll be better off without the people who gave us the Select Committee on (bashing) China, the (anti) Patriot Act, the trillion-dollar  More\nThe post Lawmakers Abandon Congress – Maybe That is a Good Thing appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/lawmakers-abandon-congress-maybe-that-is-a-good-thing/",
          "publishedOn": "2024-07-05T05:57:39.000Z",
          "wordCount": null,
          "title": "Lawmakers Abandon Congress – Maybe That is a Good Thing",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327182",
          "author": "Joseph Natoli",
          "description": "“The linkages between phases are not “right” or “wrong,” but rather suitable or unsuitable, useful or superfluous, meaningful or senseless.” – Jean-Francois Lyotard, The Differend: Phrases in Dispute If Biden runs and wins, we go along with an order of things established in his first term, an order of things structured and carried out by  More\nThe post Phrases for Thought: July 4, 2024 appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/phrases-for-thought-july-4-2024/",
          "publishedOn": "2024-07-05T05:56:14.000Z",
          "wordCount": null,
          "title": "Phrases for Thought: July 4, 2024",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327236",
          "author": "Henry Giroux",
          "description": "The guardrails of democracy have been blasted into dust. The Supreme Court’s ruling on presidential immunity grants presidents carte blanche to commit crimes as long as they act within their “constitutional authority.” Welcome to gangster capitalism. Trump, the convicted felon, white nationalist, white supremacist, and aspiring dictator, can rest assured that his dream of unaccountable  More\nThe post The Dismantling of Democracy: A Grim Projection of American Fascism Under Trump appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/the-dismantling-of-democracy-a-grim-projection-of-american-fascism-under-trump/",
          "publishedOn": "2024-07-05T05:56:09.000Z",
          "wordCount": null,
          "title": "The Dismantling of Democracy: A Grim Projection of American Fascism Under Trump",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327270",
          "author": "John P. Ruehl",
          "description": "Within a day of the June 2, 2024, release of a video documenting the abuse of prisoners of war by a Russian soldier in Ukraine, open-source intelligence (OSINT) researchers had identified the Russian citizen and his involvement in Ukraine going back a decade. Ukrainian officials subsequently sent letters to the International Committee of the Red Cross and the  More\nThe post The Growing Weaponization of Open-Source Information appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/the-growing-weaponization-of-open-source-information/",
          "publishedOn": "2024-07-05T05:55:59.000Z",
          "wordCount": null,
          "title": "The Growing Weaponization of Open-Source Information",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327040",
          "author": "Evan Jones",
          "description": "The Background The background should be uncontroversial. Israel was created by terrorism, facilitated by prior settler colonialism under a British umbrella, and not by the UN General Assembly ‘partition’ Resolution 181 (II) of 29 November 1947 (Suárez 2017a; Suárez 2017b). The majority vote was obtained by great powers realpolitik, by threats (including letter bombs) and  More\nThe post Zionism and the Academy Revisited appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/zionism-and-the-academy-revisited/",
          "publishedOn": "2024-07-05T05:55:31.000Z",
          "wordCount": null,
          "title": "Zionism and the Academy Revisited",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327264",
          "author": "Mitchell Zimmerman",
          "description": "If you hadn’t read the news in four years — or just arrived from another galaxy — the Supreme Court’s de facto grant of immunity to Donald Trump for his alleged federal crimes might sound almost reasonable. There are “unique risks,” six right-wing justices warned, that if a president were required to answer criminal charges, his energies would be  More\nThe post Supreme Court’s Immunity Ruling Gives President’s George III-like Power appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/supreme-courts-immunity-ruling-gives-presidents-george-iii-like-power/",
          "publishedOn": "2024-07-05T05:55:03.000Z",
          "wordCount": null,
          "title": "Supreme Court’s Immunity Ruling Gives President’s George III-like Power",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327269",
          "author": "Peter Certo",
          "description": "I was a student in the late 2000s when I had my first brush with “cancel culture.” A campus group had invited Nick Griffin — a racist Holocaust denier and leader of a fascist British political party, among other charming things — to speak. Many shocked students, including me, called Griffin’s views vile and warned  More\nThe post Extreme Inequality is a Threat to Free Speech appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/extreme-inequality-is-a-threat-to-free-speech/",
          "publishedOn": "2024-07-05T05:55:00.000Z",
          "wordCount": null,
          "title": "Extreme Inequality is a Threat to Free Speech",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327196",
          "author": "M. Reza Behnam",
          "description": "Israeli Zionists have always lusted after Palestine, but loathed its people.  Today is no exception. Ever since the birth of organized Zionism in 1897, its adherents have been bent on establishing a Jewish majority on a land not theirs and populated with a Palestinian Arab majority. Following the prison break of the Islamic Resistance Movement,  More\nThe post Stolen Land, Stolen Lives: Israel’s War on Palestine appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/stolen-land-stolen-lives-israels-war-on-palestine/",
          "publishedOn": "2024-07-05T05:54:12.000Z",
          "wordCount": null,
          "title": "Stolen Land, Stolen Lives: Israel’s War on Palestine",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327197",
          "author": "Omar Zahzah",
          "description": "It’s an increasingly familiar contradiction: digital platforms that position themselves as an accessible alternative to corporate media emerge as new censors in their own right. Social media and the internet make it possible to disseminate material that would otherwise have been suppressed, thereby helping to bring alternative conversations to the fore of mainstream awareness. And  More\nThe post Refusing the Language of Silence: Palestinian Resistance Goes Digital appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/refusing-the-language-of-silence-palestinian-resistance-goes-digital/",
          "publishedOn": "2024-07-05T05:53:33.000Z",
          "wordCount": null,
          "title": "Refusing the Language of Silence: Palestinian Resistance Goes Digital",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": [
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=30686",
          "author": "Marco Del Negro, Keshav Dogra, Pranay Gundam, Donggyu Lee, and Brian Pacula",
          "description": "This post discusses the distributional consequences of an aggressive policy response to inflation using a Heterogeneous Agent New Keynesian (HANK) model. We find that, when facing demand shocks, stabilizing inflation and real activity go hand in hand, with very large benefits for households at the bottom of the wealth distribution. The converse is true however when facing supply shocks: stabilizing inflation makes real outcomes more volatile, especially for poorer households. We conclude that distributional considerations make it much more important for policy to take into account the tradeoffs between stabilizing inflation and economic activity. This is because the optimal policy response depends very strongly on whether these tradeoffs are present (that is, when the economy is facing supply shocks) or absent (when the economy is facing demand shocks).",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/07/on-the-distributional-consequences-of-responding-aggressively-to-inflation/",
          "publishedOn": "2024-07-03T11:00:00.000Z",
          "wordCount": 4595,
          "title": "On the Distributional Consequences of Responding Aggressively to Inflation",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/07/LSE_2024_HANK-aggressive-inflation_delnegro_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=30644",
          "author": "Marco Del Negro, Keshav Dogra, Pranay Gundam, Donggyu Lee, and Brian Pacula",
          "description": "This post and the next discuss the distributional effects of inflation and inflation stabilization through the lenses of a theoretical model—a Heterogeneous Agent New Keynesian (HANK) model. This model combines the features of New Keynesian models that have been the workhorse for monetary policy analysis since the work of Woodford (2003) with inequality in wealth and income at the household level following the seminal contribution of Kaplan, Moll, and Violante (2018). We find that while inflation hurts everyone, it hurts the poor in particular. When the source of inflation is a supply shock, fighting inflation aggressively hurts the poor even more, however, while the opposite is true for demand shocks, as discussed in the companion post.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/07/on-the-distributional-effects-of-inflation-and-inflation-stabilization/",
          "publishedOn": "2024-07-02T11:00:00.000Z",
          "wordCount": 4772,
          "title": "On the Distributional Effects of Inflation and Inflation Stabilization",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/07/LSE_2024_HANK-IRFs_delnegro_460_18bb85.jpg"
        }
      ]
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45465",
          "author": "peterradford",
          "description": "from Peter Radford “Economics has become irrelevant.” PART ONE Oh my.  Apparently Brad DeLong and I have the same problem.  He, of course, is part of the elite club.  I am decidedly not.  So it is quite a shock to share something. What? He set out to write an 800 word review of Dan Davies’ […]",
          "link": "https://rwer.wordpress.com/2024/07/08/on-janeways-mesoeconomics/",
          "publishedOn": "2024-07-08T17:36:49.000Z",
          "wordCount": 8734,
          "title": "On Janeway’s Mesoeconomics",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45462",
          "author": "Editor",
          "description": "from Lars Syll So, certainly, both non-theorists and some theorists have little patience for research that displays mathematical ingenuity but has no value as social science. But defining this work exactly is impossible. This sort of work is like pornography quite simple to recognize when one sees it. Jeffrey Ely As researchers, we (mostly) want […]",
          "link": "https://rwer.wordpress.com/2024/07/04/weekend-read-theory-and-reality-in-economics/",
          "publishedOn": "2024-07-04T11:06:52.000Z",
          "wordCount": 7618,
          "title": "Weekend read: Theory and reality in economics",
          "imageUrl": "https://larspsyll.wordpress.com/wp-content/uploads/2013/12/math15.gif"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=274587",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Open Thread ~",
          "link": "https://www.nakedcapitalism.com/2024/07/200pm-water-cooler-7-8-2024.html",
          "publishedOn": "2024-07-08T18:00:10.000Z",
          "wordCount": 4512,
          "title": "2:00PM Water Cooler 7/8/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/fritillary.jpeg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274585",
          "author": "Yves Smith",
          "description": "Russia has some thorny and apparently not resolved questions about its end game in Ukraine.",
          "link": "https://www.nakedcapitalism.com/2024/07/what-would-a-russian-victory-in-ukraine-look-like.html",
          "publishedOn": "2024-07-08T13:55:49.000Z",
          "wordCount": 13687,
          "title": "What Would a Russian Victory in Ukraine Look Like?",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/07/00-Ukraine_disputed_regions.svg_.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274612",
          "author": "Conor Gallagher",
          "description": "",
          "link": "https://www.nakedcapitalism.com/2024/07/links-7-8-2024.html",
          "publishedOn": "2024-07-08T10:55:34.000Z",
          "wordCount": 15028,
          "title": "Links 7/8/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/Screenshot-2024-07-08-at-9.08.32 AM-1024x768.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274599",
          "author": "Lambert Strether",
          "description": "Permaculture is a sustainable alternative to conventional agriculture.",
          "link": "https://www.nakedcapitalism.com/2024/07/nature-communications-permaculture-as-a-better-alternative-to-conventional-agriculture.html",
          "publishedOn": "2024-07-08T10:50:23.000Z",
          "wordCount": 8903,
          "title": "Nature Communications: Permaculture as a Better Alternative to Conventional Agriculture?",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/ego_system.jpeg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274621",
          "author": "Conor Gallagher",
          "description": "IDF soldiers were reportedly ordered to \"turn the area around the border fence into a killing zone.\"",
          "link": "https://www.nakedcapitalism.com/2024/07/israeli-newspaper-confirms-idf-employed-hannibal-directive-on-october-7.html",
          "publishedOn": "2024-07-08T10:00:46.000Z",
          "wordCount": 4935,
          "title": "Israeli Newspaper Confirms IDF Employed ‘Hannibal Directive’ on October 7",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274627",
          "author": "Yves Smith",
          "description": "US and Fed bad cooking has led to weak growth the world, and by urging poor countries to borrow at once-low rates, debt distress.",
          "link": "https://www.nakedcapitalism.com/2024/07/us-fed-induced-world-stagnation-deepens-debt-distress.html",
          "publishedOn": "2024-07-08T08:45:01.000Z",
          "wordCount": 4079,
          "title": "US Fed-Induced World Stagnation Deepens Debt Distress",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274533",
          "author": "Conor Gallagher",
          "description": "",
          "link": "https://www.nakedcapitalism.com/2024/07/links-7-7-2024.html",
          "publishedOn": "2024-07-07T10:55:49.000Z",
          "wordCount": 19827,
          "title": "Links 7/7/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/Screenshot-2024-07-01-at-8.23.46 AM-1024x718.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274555",
          "author": "Conor Gallagher",
          "description": "Students lucky enough to be assigned the books will learn that foreign countries resisting US imperialism aren’t the only danger to “democracy,” but the American people are as well.",
          "link": "https://www.nakedcapitalism.com/2024/07/spook-scholarship-a-prominent-former-cia-analyst-and-project-ukraine-backer-moonlights-as-a-collegiate-textbook-coauthor.html",
          "publishedOn": "2024-07-07T10:30:50.000Z",
          "wordCount": 6278,
          "title": "Spook Scholarship: A Prominent Former CIA Analyst and Project Ukraine Backer Moonlights as a Collegiate Textbook Coauthor",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/Screenshot-2024-06-18-at-4.37.18 PM-784x1024.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274539",
          "author": "Conor Gallagher",
          "description": "A shadowy group of Democrat insiders leads the effort to pick the party’s nominee in smoke-filled room.",
          "link": "https://www.nakedcapitalism.com/2024/07/as-new-campaign-implores-him-to-pass-the-torch-biden-rejects-calls-to-drop-out.html",
          "publishedOn": "2024-07-07T09:00:02.000Z",
          "wordCount": 11905,
          "title": "As New Campaign Implores Him to ‘Pass the Torch,’ Biden Rejects Calls to Drop Out",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274415",
          "author": "Yves Smith",
          "description": "Our tetchy daily links: 2000 year old calculator, more Covid damage evidence, coal forever? EU v. China, Starmer's weak landslide, Nigeria starvation, Houthis punching harder, Putin Q&A, Interpol hates digital roaming, NATO wobbles? Biden agonistes, vending machine bullets, shareholder driven crapification, American dream dead",
          "link": "https://www.nakedcapitalism.com/2024/07/links-7-6-2024.html",
          "publishedOn": "2024-07-06T10:55:09.000Z",
          "wordCount": 26187,
          "title": "Links 7/6/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/00-another-tracie-goose.jpg"
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "668c06d24f58a9000ada4845",
          "author": "João Tomé",
          "description": "Check the dynamics of the 2024 French legislative elections, the surprising election results’ impact on Internet traffic changes, and the cyber attacks targeting political parties",
          "link": "https://blog.cloudflare.com/2024-french-elections-political-cyber-attacks-and-internet-traffic-shifts",
          "publishedOn": "2024-07-08T15:52:38.000Z",
          "wordCount": 1730,
          "title": "French elections: political cyber attacks and Internet traffic shifts",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/French-elections--political-cyber-attacks-and-Internet-traffic-shifts-OG-1.png"
        },
        {
          "id": "6687ef98a4598c000bd710d0",
          "author": "João Tomé",
          "description": "Here, we explore the dynamics of Internet traffic and cybersecurity during the UK’s 2024 general election, highlighting late-day traffic changes and a post-vote attack on a political party",
          "link": "https://blog.cloudflare.com/uk-election-day-2024-traffic-trends-and-attacks-on-political-parties",
          "publishedOn": "2024-07-05T13:24:49.000Z",
          "wordCount": 1569,
          "title": "UK election day 2024: traffic trends and attacks on political parties",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/UK-election-day-2024--traffic-trends-and-attacks-on-political-parties-OG-1.png"
        },
        {
          "id": "668519cda4598c000bd709a9",
          "author": "Bryton Herdes",
          "description": "On June 27, 2024, a small number of users globally may have noticed that 1.1.1.1 was unreachable or degraded. The root cause was a mix of BGP (Border Gateway Protocol) hijacking and a route leak",
          "link": "https://blog.cloudflare.com/cloudflare-1111-incident-on-june-27-2024",
          "publishedOn": "2024-07-04T13:00:50.000Z",
          "wordCount": 3907,
          "title": "Cloudflare 1.1.1.1 incident on June 27, 2024",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/Cloudflare-1.1.1.1-incident-on-June-27--2024-OG-1.png"
        },
        {
          "id": "66853348a4598c000bd709b9",
          "author": "João Tomé",
          "description": "How Cloudflare mitigated DDoS attacks targeting French political parties during the 2024 legislative elections, as detailed in our ongoing election coverage",
          "link": "https://blog.cloudflare.com/first-round-of-french-election-2024-party-attacks-and-a-modest-traffic-dip",
          "publishedOn": "2024-07-03T13:00:34.000Z",
          "wordCount": 991,
          "title": "First round of French election: party attacks and a modest traffic dip",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/First-round-of-French-election--party-attacks-and-a-modest-traffic-dip-OG-1.png"
        },
        {
          "id": "668274eea4598c000bd707cf",
          "author": "Alex Bocharov",
          "description": "To help preserve a safe Internet for content creators, we’ve just launched a brand new “easy button” to block all AI bots. It’s available for all customers, including those on our free tier",
          "link": "https://blog.cloudflare.com/declaring-your-aindependence-block-ai-bots-scrapers-and-crawlers-with-a-single-click",
          "publishedOn": "2024-07-03T13:00:26.000Z",
          "wordCount": 1941,
          "title": "Declare your AIndependence: block AI bots, scrapers and crawlers with a single click",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/Declareyour-AIndependence--block-AI-bots--scrapers-and-crawlers-with-a-single-click-OG-1.jpg"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": [
        {
          "id": "https://slack.engineering/?p=16763",
          "author": "Nilanjana Mukherjee",
          "description": "Slack Data Engineering recently underwent data workload migration from AWS EMR 5 (Spark 2/Hive 2 processing engine) to EMR 6 (Spark 3 processing engine). In this blog, we will share our migration journey, challenges, and the performance gains we observed in the process. This blog aims to assist Data Engineers, Data Infrastructure Engineers, and Product […]\nThe post Unlocking Efficiency and Performance: Navigating the Spark 3 and EMR 6 Upgrade Journey at Slack appeared first on Slack Engineering.",
          "link": "https://slack.engineering/unlocking-efficiency-and-performance-navigating-the-spark-3-and-emr-6-upgrade-journey-at-slack/",
          "publishedOn": "2024-07-02T09:00:00.000Z",
          "wordCount": 2738,
          "title": "Unlocking Efficiency and Performance: Navigating the Spark 3 and EMR 6 Upgrade Journey at Slack",
          "imageUrl": "https://slack.engineering/wp-content/uploads/sites/7/2024/07/entering_a_room_for_migration_left_door_says_apache_spark_right_door_says_aws_emr_science_fiction-1.jpeg?w=640"
        }
      ]
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": []
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": [
        {
          "id": "https://code.visualstudio.com/updates/v1_91",
          "author": null,
          "description": "Learn what is new in the Visual Studio Code June 2024 Release (1.91)\nRead the full article",
          "link": "https://code.visualstudio.com/updates/v1_91",
          "publishedOn": "2024-07-03T17:00:00.000Z",
          "wordCount": 3698,
          "title": "Visual Studio Code June 2024",
          "imageUrl": "https://code.visualstudio.com/assets/updates/1_91/release-highlights.png"
        }
      ]
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": []
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=40905437",
          "author": "deeth_starr_v",
          "description": "From the article: Paul Cassell, a lawyer for victims’ family members, said he plans to ask the federal judge on the case to reject the deal and “simply set the matter for a public trial, so that all the facts surrounding the case will be aired in a fair and open forum before a jury.”\nHard to disagree",
          "link": "https://news.ycombinator.com/item?id=40905437",
          "publishedOn": "2024-07-08T13:50:48.000Z",
          "wordCount": null,
          "title": "New comment by deeth_starr_v in \"Boeing to plead guilty to criminal fraud charge stemming from 737 MAX crashes\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40903239",
          "author": "supernova87a",
          "description": "Our governmental methods of punishment for corporations strike me as lacking.  This seems similar to Wells Fargo, where ok, the company was fined, sued, made to pay restitution (somewhat) to victims.  But underlying it all, the culture and incentives at the company that produced the situation didn't get fundamentally changed.   Which often perpetuates across specific leaders, boards, and is a part of what a company is -- and doesn't just get replaced by removing one or two people.\nWhat does it take?   You have to dismantle a company before it changes these kinds of deep-rooted issues?    Or can a government penalty call for that?  That is hard to achieve.  Who's going to change the evaluation procedures that HR has in place to measure what rating or bonus you get this year?  That seems to me as important as who is CEO.\nNone of the penalties courts mete out (short of dissolution/fined into bankruptcy) seem to be able to achieve this level of change needed.",
          "link": "https://news.ycombinator.com/item?id=40903239",
          "publishedOn": "2024-07-08T07:11:04.000Z",
          "wordCount": 15688,
          "title": "New comment by supernova87a in \"Boeing to plead guilty to criminal fraud charge stemming from 737 MAX crashes\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40898727",
          "author": "__turbobrew__",
          "description": "I was on the board of directors for a local Linux Users Group and can echo the difficulties in finding a venue. In a city full of empty office spaces on a weekday night it was virtually impossible to find a stable meeting location. Without a stable meeting location you are much less likely to establish a core group since people do not like to have to learn how to get to different venues.\nMozilla hosted us at one point but the political tides changed there and we got kicked out. I think having strong buy in from someone in the C-suite of a company is the only real way to do it. Otherwise you are beholden to the changing winds of the company.\nIn the end we are now in a stable location in the local library, but only because we had someone on the inside. Previously when we approached the library we were stone walled without someone to grease the wheels.\nI do believe that it should be a mandate for the municipality to provide meeting space for local non-profit and special interest groups. In many locations you can no longer pool some money with your buddies to buy a piece of land to build your clubhouse on. In my city there are many such clubs which were formed 50 years ago — the sailing club, the badminton club, the lawn bowling club, etc — but land is too scarce in many places now and we need the municipalities to pick up the slack.",
          "link": "https://news.ycombinator.com/item?id=40898727",
          "publishedOn": "2024-07-07T16:45:45.000Z",
          "wordCount": 4339,
          "title": "New comment by __turbobrew__ in \"A reawakening of systems programming meetups\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40897715",
          "author": "charrondev",
          "description": "I work on a community forum platform and we detect YouTube embeds and replace them proxied thumbnails that don’t load until clicked.\nJust because one person in a thread shares a YouTube video doesn’t mean everyone else loading that page should have to download 1MB+ of YouTube’s JavaScript bloat and have their IPs tracked by google.",
          "link": "https://news.ycombinator.com/item?id=40897715",
          "publishedOn": "2024-07-07T13:48:45.000Z",
          "wordCount": 692,
          "title": "New comment by charrondev in \"YouTube embeds are heavy and it’s fixable\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40897658",
          "author": "jitl",
          "description": "Hi, I’m the author of the underlying quickjs-emscripten runtime library. I like your ergonomic kind of “standard library” for quickjs-emscripten :)\nDid you try running in the browser or with a bundler? I think accepting the variant name as a string you pass to import(variantName) dynamically may not play well with Webpack et al.\nEDIT: SECURITY WARNING: this library exposes the ability for the guest (untrusted) code to `fetch` with the same cookies as the host `fetch` function. You must not run untrusted code if enabling `fetch`. Library should come with a big blinking warning about what is safe and unsafe to enable when running untrusted code. It’s not a “sandbox” if the sandboxed code can call arbitrary HTTP APIs authenticated as the host context!\nThe reason quickjs-emscripten  is low-level and avoids magic is so I can confidently claim that the APIs it does provide are secure. I generally reject feature requests for magical serialization or easy network/filesystem access because that kind of code is a rich area for security mistakes. When you run untrusted code, you should carefully audit the sandbox itself, but also audit all the code you write to expose APIs to the sandbox.\nIn this case a comment from an other HN user asking about Fetch cookies tipped me off to the potential security issue.\nMore reading:\nFigma blog posts on plugin sandbox security:\n- https://www.figma.com/blog/how-we-built-the-figma-plugin-sys...\n- https://www.figma.com/blog/an-update-on-plugin-security/\nQuickjs-emscripten README: https://github.com/justjake/quickjs-emscripten",
          "link": "https://news.ycombinator.com/item?id=40897658",
          "publishedOn": "2024-07-07T13:40:56.000Z",
          "wordCount": 516,
          "title": "New comment by jitl in \"Show HN: Execute JavaScript in a WebAssembly QuickJS sandbox\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40895904",
          "author": "curl-up",
          "description": "> In 1544, physician and botanist Pietro Andrea Mattioli described the leaves as smelling like bed bugs or stink bugs...\nIncredible that neither this, nor the other linked article, even mention the fact that this stink-bug/soap taste is genetically predetermined for some people [1], so above quote can by no means be taken as an argument that cilantro \"became unfashionable\" so authors started describing it negatively.\nInstead, the real story is probably much more interesting, as the changes in cilantro popularity could probably be connected to waves of migrations and general genetic pool changes in a particular place.\n[1] https://en.wikipedia.org/wiki/OR6A2",
          "link": "https://news.ycombinator.com/item?id=40895904",
          "publishedOn": "2024-07-07T07:44:35.000Z",
          "wordCount": null,
          "title": "New comment by curl-up in \"Why Italy Fell Out of Love with Cilantro\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40894595",
          "author": "LeFantome",
          "description": "[Edit: apologies for the wall of text. A lot of pent up emotion around Creo.]\nBest place I ever worked.\nThis was “the Creo Philosophy”:\nOur priority is to provide unique and sustainable value to our customers.\n1. All decisions must be based on sound economics.\n2. Key decisions are made in consensus, with full team agreement to accept and implement the decision.\n3. We believe that people are most effective when self-managed.\n4. Compensation is based on contribution, gauged largely by an annual peer review.\n5. All employees share the wealth created by their hard work and innovation.\nCreo was extremely proud of how “flat” the organization was but my primary take-away from there as an ex-employee is actually how important management is.\nFirst and foremost, management created a shared vision of…",
          "link": "https://news.ycombinator.com/item?id=40894595",
          "publishedOn": "2024-07-07T01:33:23.000Z",
          "wordCount": 4780,
          "title": "New comment by LeFantome in \"Advantages of incompetent management\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40894363",
          "author": "netcoyote",
          "description": "As a data point, the Blizzard sales team’s projections were that we would sell 4,000 copies of StarCraft in a year in South Korea, so there was no reason to in localize the game.\nFirst year sales were on the order of 100x that amount, quite the surprise for everyone at Blizzard!",
          "link": "https://news.ycombinator.com/item?id=40894363",
          "publishedOn": "2024-07-07T00:34:23.000Z",
          "wordCount": 300,
          "title": "New comment by netcoyote in \"Starcraft (A History in Two Acts)\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40892151",
          "author": "tonyarkles",
          "description": "One of the most interesting discussions I've had around this was at a small company who mass-hired a bunch of people from a big company. We went round and round in circles for a while because of issues similar to what you're describing. I ran a small 4-6 person hardware team (softly blurry on the edges) and the new people wanted significant amounts of design and documentation review as well as financial oversight. We needed $40 worth of solder and connectors and had to wait a week for PO approval as well as demonstrate that we had gotten multiple quotes... even though there was just a store down the block that sold exactly what we needed.\nAnyway, after a month or two of this I started catching significant flak because my team was nowhere near as productive as it used to be. Complaining about slow POs was met with \"maybe you should plan better\". Complaining about design reviews for one-off boards that would go from idea-to-problem solved was met with \"you're engineers, you need to document your work\". It was painful and I came very close to resigning.\nWhat ultimately worked, though, was figuring out a catch phrase that spoke the language of the new people: \"accountability without authority\". This ruffled some feathers but once I repeated \"you are trying to hold me accountable for delivering a $500,000 project on time but are not giving me authority to buy $40 worth of stuff to execute on that\" enough times it finally got through and the system started to change. But man did it suck for a while.",
          "link": "https://news.ycombinator.com/item?id=40892151",
          "publishedOn": "2024-07-06T18:22:18.000Z",
          "wordCount": null,
          "title": "New comment by tonyarkles in \"The magic of small engineering teams\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40891799",
          "author": "throwup238",
          "description": "The difference in their geochemistry is substantial so even if chromium isn't technically that much more abundant, it's significantly easier to mine.\nThe Gibbs free energy of formation for chromium oxides and chromite is much more negative than for lithium-bearing minerals so Cr compounds are thermodynamically favored to precipitate out of melts and solutions, forming minerals with high concentrations that then get pushed up by other processes. Li+, with its lone valence electron, just doesn't form strong bonds or highly stable mineral phases in comparison. On top of that the diffusion coefficients for Cr species in magmas and rocks are generally orders of magnitude lower than for Li. Cr gets locked into crystal structures early and stays put, while Li keeps migrating and diffusing in the form of water soluble minerals. There's also a whole biogeochemical cycle for Cr involving microbes that can concentrate it in sediments.",
          "link": "https://news.ycombinator.com/item?id=40891799",
          "publishedOn": "2024-07-06T17:25:15.000Z",
          "wordCount": null,
          "title": "New comment by throwup238 in \"First anode-free sodium solid-state battery\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40891415",
          "author": "thrtythreeforty",
          "description": "They are refunding for them. But in my opinion, you only get a couple of these un-launches before you get a reputation like Google has.\nAmazon has cancelled lots of consumer stuff in the past (the Alexa buttons or whatever they were) but cancelling business-facing things is new. Businesses are much more cancellation averse than forgetful consumers have proven to be.",
          "link": "https://news.ycombinator.com/item?id=40891415",
          "publishedOn": "2024-07-06T16:23:22.000Z",
          "wordCount": 5965,
          "title": "New comment by thrtythreeforty in \"Amazon is bricking $2,350 Astro robots 10 months after release\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40888774",
          "author": "supermatt",
          "description": "That third party app stores are subject to review by apple is a problem in itself.",
          "link": "https://news.ycombinator.com/item?id=40888774",
          "publishedOn": "2024-07-06T07:31:32.000Z",
          "wordCount": null,
          "title": "New comment by supermatt in \"Apple okays Epic Games marketplace app in Europe\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40886120",
          "author": "kelnos",
          "description": "I guess it's good that there's a new solution to this problem, but I wish it just wasn't a problem in the first place.  It's ridiculous that someone can't just walk around outside, making a video of what they're doing, and post it, without having to worry that some copyrighted music is playing in the background for some portion of it.\nThat sort of situation should be considered fair use, and copyright owners who attempt to make trouble for people caught up in this situation should be slapped down, hard, and fined.",
          "link": "https://news.ycombinator.com/item?id=40886120",
          "publishedOn": "2024-07-05T21:21:34.000Z",
          "wordCount": null,
          "title": "New comment by kelnos in \"YouTube's eraser tool removes copyrighted music without impacting other audio\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40885948",
          "author": "inopinatus",
          "description": "The best advice I can give you is to use bigserial for B-tree friendly primary keys and consider a string-encoded UUID as one of your external record locator options. Consider other simple options like PNR-style (airline booking) locators first, especially if nontechnical users will quote them. It may even be OK if they’re reused every few years. Do not mix PK types within the schema for a service or application, especially a line-of-business application. Use UUIDv7 only as an identifier for data that is inherently timecoded, otherwise it leaks information (even if timeshifted). Do not use hashids - they have no cryptographic qualities and are less friendly to everyday humans than the integers they represent; you may as well just use the sequence ID.  As for the encoding, do not use base64 or other hyphenated alphabets, nor any identifier scheme that can produce a leading ‘0’ (zero) or ‘+’ (plus) when encoded (for the day your stuff is pasted via Excel).\nGenerally, the principles of separation of concerns and mechanical sympathy should be top of mind when designing a lasting and purposeful database schema.\nFinally, since folks often say “I like stripe’s typed random IDs” in these kind of threads: Stripe are lying when they say their IDs are random. They have some random parts but when analyzed in sets, a large chunk of the binary layout is clearly metadata, including embedded timestamps, shard and reference keys, and versioning, in varying combinations depending on the service.  I estimate they typically have 48-64 bits of randomness. That’s still plenty for most systems; you can do the same. Personally I am very fond of base58-encoded AES-encrypted bigserial+HMAC locators with a leading type prefix and a trailing metadata digit, and you can in a pinch even do this inside the database with plv8.",
          "link": "https://news.ycombinator.com/item?id=40885948",
          "publishedOn": "2024-07-05T20:59:05.000Z",
          "wordCount": null,
          "title": "New comment by inopinatus in \"PostgreSQL and UUID as Primary Key\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40884673",
          "author": "gcp123",
          "description": "Author makes a good point. \"1700s\" is both more intuitive and more concise than \"18th century\". \nThe very first episode of Alex Trebeck's Jeopardy in 1984 illustrates how confusing this can be:\nhttps://www.youtube.com/watch?v=KDTxS9_CwZA\nThe \"Final Jeopardy\" question simply asked on what date did the 20th century begin, and all three contestants got it wrong, leading to a 3-way tie.",
          "link": "https://news.ycombinator.com/item?id=40884673",
          "publishedOn": "2024-07-05T17:52:42.000Z",
          "wordCount": null,
          "title": "New comment by gcp123 in \"Let's stop counting centuries\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40882247",
          "author": "wavemode",
          "description": "Always obligatory https://mikelui.io/img/c++_init_forest.gif",
          "link": "https://news.ycombinator.com/item?id=40882247",
          "publishedOn": "2024-07-05T12:47:36.000Z",
          "wordCount": null,
          "title": "New comment by wavemode in \"I have no constructor, and I must initialize\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40881928",
          "author": "marton78",
          "description": "After almost 20 years of experience with C++, there are still some gnarly details I wouldn't have imagined. What a God awful language!\nKudos to that author for the great, eye catching title and the in depth detail!",
          "link": "https://news.ycombinator.com/item?id=40881928",
          "publishedOn": "2024-07-05T11:54:12.000Z",
          "wordCount": null,
          "title": "New comment by marton78 in \"I have no constructor, and I must initialize\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40877710",
          "author": "duffpkg",
          "description": "Lifepo4 (lithium iron phosphate) batteries for the home are pretty cheap as of today. Power storage for residential use in a 48v metal rackable linkable system with battery management system (BMS) is $89/kwh shipped/duty paid from reputable chinese suppliers CATL/Seplos etc. You have to wait for sea shipping, add $30/kwh if you want to buy it in the US today.\nFrom the same suppliers sodium batteries are currently $130/kwh and about 26% less efficient in the same form factor. I look forward to this changing.\nDue to rising power costs I moved one of my homes completely to solar and battery (lifepo4) and haven't had any problems. I can't imagine ever going back to the power company. Panels have gotten to the point of being ridiculously cheap. I have a lot of space. I purchased pallets of used panels for more or less the cost of transportation ($34 per panel 270w). They produce about 85% of their nominal rating.\nI mention this because other comments mention costs that are much much higher.",
          "link": "https://news.ycombinator.com/item?id=40877710",
          "publishedOn": "2024-07-04T20:15:06.000Z",
          "wordCount": null,
          "title": "New comment by duffpkg in \"Batteries: How cheap can they get?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40877288",
          "author": "Schiphol",
          "description": "The paper [here](https://bhi.co.uk/wp-content/uploads/2024/06/07-HJJuly24-AOT...) makes it clear that these researchers (whose main topic is gravitational waves) have used Bayesian analyses to estimate how likely different counts for holes present in the full calendar ring are. This is cool, but the bit about \"techniques developed to analyse the ripples in spacetime\" is, well, making reference to Bayesian analysis.",
          "link": "https://news.ycombinator.com/item?id=40877288",
          "publishedOn": "2024-07-04T19:12:43.000Z",
          "wordCount": null,
          "title": "New comment by Schiphol in \"Gravitational wave researchers cast new light on Antikythera mechanism mystery\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40876410",
          "author": "pembrook",
          "description": "While this sucks, my phone is in so many data breaches at this point it doesn’t matter.\nThe spam-to-ham ratio on my phone number is now far worse than any other channel for me. The traditional phone network is at risk of going the way of the fax machine if we don’t do something about the spam problem like we did with email.\nIf I’m on a call, even with family, it’s now almost exclusively on FaceTime/zoom/meet/etc. I can’t remember the last time I talked on the traditional phone network or received a legitimate call. Which isn’t great because those aforementioned platforms are all proprietary walled gardens with terrible incentives — once they capture the market fully they will eventually dump ads all over your calls. Don’t believe me? Just look at what Gmail did to monetize the lock-in on your inbox.",
          "link": "https://news.ycombinator.com/item?id=40876410",
          "publishedOn": "2024-07-04T17:02:28.000Z",
          "wordCount": null,
          "title": "New comment by pembrook in \"Twilio confirms data breach after hackers leak 33M Authy user phone numbers\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40874156",
          "author": "adamgordonbell",
          "description": "Host here, thanks for sharing.\nPowerShell faced extreme opposition at Microsoft, and its creator Jeffrey Snover was demoted for pursuing it.\nJeffrey was originally brought into Microsoft to help MS learn how to compete in the data center, but culturally they were so tied to the personal computer model of the world, that they fought him every step of the way.\nEdit: Another interesting thing, is how Powershell exists because Windows isn't file based. Jeffrey's goal was server administration, but on Windows you can't just edit files to administer things, you need to call various APIs and get structured data back forth. The rich object model fell out of that. It was the only way.\n( Also, apologies if the transcript has errors. I've gone from professional transcriptions to Descript and then a pass of GPT4 trying to find the right punctation breaks and then me doing a quick read through. I don't think its coming out as high quality as I'd like. )",
          "link": "https://news.ycombinator.com/item?id=40874156",
          "publishedOn": "2024-07-04T11:55:08.000Z",
          "wordCount": null,
          "title": "New comment by adamgordonbell in \"Jeffrey Snover and the Making of PowerShell\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40873472",
          "author": "febeling",
          "description": "I had similar thoughts. But let's not overlook the information asymmetry, which contributed to the dissatisfaction. I don't want to live in a world which is controlled unilaterally, and intransparently by a group of people who assume they have a full picture of the situation and assume they understand moral completely, and also don't think it necessary to explain how they think so highly of themselves.",
          "link": "https://news.ycombinator.com/item?id=40873472",
          "publishedOn": "2024-07-04T09:09:18.000Z",
          "wordCount": null,
          "title": "New comment by febeling in \"Shipt’s algorithm squeezed gig workers, who fought back\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40872836",
          "author": "vouwfietsman",
          "description": "> It's worth repeating: Unless you have a stake in the company, it is NOT your job to make sure the company is the most profitable it can be. Your job is to create great software\nThis is a terrible take, and one I generally see as a signal of lack of seniority in a software dev. It is absolutely everybody's job in the company to make sure it is profitable, unless you work for a non-profit.\nThe thing is though, that profitable is not the same as \"just ship it\". If you're in a company where those things are conflated frequently, that's a sign of lack of seniority in management.\n> Your job is to create great software\nIt really isn't, your job is to make a great product. Making a great product often, but not always, requires great software. Many great products have terrible software behind them. The tension between product, sales and development should result in a compromise that creates the most value short, middle and long term. It is 100% your job as a developer to understand what can and cannot be hacked, what priorities the company has beside delivering great software, and finally: when great software must be made, because compromise is unwise.\nJust like the boy who cried wolf, the developer who can never compromise on software quality is powerless when there is an actual reason to not compromise on software quality, and rightfully so.",
          "link": "https://news.ycombinator.com/item?id=40872836",
          "publishedOn": "2024-07-04T06:38:52.000Z",
          "wordCount": null,
          "title": "New comment by vouwfietsman in \"The saddest \"Just Ship It\" story ever (2020)\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40872802",
          "author": "or_am_i",
          "description": "I am not defending Shipt and there is no doubt gig workers are in a very vulnerable position. However, the data analysis results as presented in the article do not support the article's main point. \"40% are getting paid at least 10% less\" is not unnatural to expect whenever pay is redistributed, especially since some 30+% are getting at least 10% more. Imagine a _hypothetical_ situation where Shipt is 100% on point and driving a fairer version of the algorithm patch removing a way for workers to \"optimize\" for short, well paid trips, resulting in pay cuts to those who had learnt how to do it, while not changing/increasing pay for everyone else. We would see the same kind of result: some portion of workers would get paid 10% less, some 10% more. This does show that workers are paid differently for the same work they have been doing, but does not prove the change is unfair.",
          "link": "https://news.ycombinator.com/item?id=40872802",
          "publishedOn": "2024-07-04T06:29:50.000Z",
          "wordCount": null,
          "title": "New comment by or_am_i in \"Shipt’s algorithm squeezed gig workers, who fought back\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40872077",
          "author": "sfink",
          "description": "This reminds me of something that I heard once from a Chinese teacher. I can't vouch for the accuracy of it, but he was definitely on to something: In the West, it is assumed that it is the speaker's job to make himself understood to his listeners. In the East, it is the other way around.\nIn recent times, it seems like we've gotten even more extreme. The speaker or writer must not only spoon-feed the understanding, they also have to provide the motivation and the entertainment. Which I find sad, because some things you can't get unless you go to the effort of extracting them yourself. (See many reproducible psychology findings about retention being highly correlated with depth of processing, for example.) It's like the information equivalent of highly processed food.\nI find myself falling into this trap on sites like this. An interesting but difficult article will be posted, I won't immediately know what to think or where I stand on the topic, and I'll flip to the comments so that I can get some part of the collective to tell me what to think and how to feel about it. Which is also sad.\nIn paintings, it is known that the viewer can get out more than the painter put in. It used to be the same with writing, but it feels like that is becoming more rare and less acceptable. If a reader can't follow the argument, it's automatically the author's fault and a waste of the reader's time. Heaven forbid the reader might need to exert some effort and grow in the gleaning.",
          "link": "https://news.ycombinator.com/item?id=40872077",
          "publishedOn": "2024-07-04T03:21:34.000Z",
          "wordCount": null,
          "title": "New comment by sfink in \"The joy of reading books you don't understand\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40869863",
          "author": "LarsDu88",
          "description": "According to Jensen it takes about 8000 H100s running for 90 days to train a 1.8 Trillion param MoE GPT-4 scale model.\nMeta has about 350,000 of these GPUs and a whole bunch of A100s. This means the ability to train 50 GPT-4 scale models every 90 days or 200 such models per year.\nThis level of overkill suggests to me that the core models will be commoditized to oblivion, making the actual profit margins from AI-centric companies close to 0, especially if Microsoft and Meta keep giving away these models for free.\nThis is actually terrible for investors, but amazing for builders (ironically).\nThe real value methinks is actually over the control of proprietary data used for training which is the single most important factor for model output quality. And this is actually as much an issue for copyright lawyers rather than software engineers once the big regulatory hammers start dropping to protect American workers.",
          "link": "https://news.ycombinator.com/item?id=40869863",
          "publishedOn": "2024-07-03T20:51:30.000Z",
          "wordCount": null,
          "title": "New comment by LarsDu88 in \"AI's $600B Question\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40868676",
          "author": "iforgotpassword",
          "description": "My secret protip: old Fujitsu desktop/nuc PCs. At least in Germany (Europe?) they are cheap on ebay since a lot of businesses use them and upgrade on a regular schedule.\nIf you care about power consumption like I do, you can Google \"$model energy consumption white paper\" which contains very accurate data about idle usage, for example https://sp.ts.fujitsu.com/dmsp/Publications/public/wp-energy...\nIn one case I had a nuc where on Linux after enabling power saving features for the sata controller, idle usage even fell to 5W when the pdf claimed 9.\nHaving an actual pc instead of a random sbc ensures best connectivity, expandability, and software support forever. With almost all sbcs you're stuck with a random-ass kernel from when the damn thing was released, and you basically have to frankenstein together your own up-to-date distro with the old kernel because the vendor certainly doesn't care about updating the random armbian fork they created for that thing.",
          "link": "https://news.ycombinator.com/item?id=40868676",
          "publishedOn": "2024-07-03T18:23:56.000Z",
          "wordCount": null,
          "title": "New comment by iforgotpassword in \"The Cheapest NAS\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40864609",
          "author": "thrance",
          "description": "I remember seeing a talk from Jonathan Blow where he made a comparison: in the 1960s top engineers worked for NASA and put a man on the moon in a decade, basically doing computations by hand. \nToday, we have super advanced computers and tech companies enjoy 100× times more of the top engineers than NASA ever had, and they are all working toward making you click on ads more.",
          "link": "https://news.ycombinator.com/item?id=40864609",
          "publishedOn": "2024-07-03T10:28:44.000Z",
          "wordCount": null,
          "title": "New comment by thrance in \"I Received an AI Email\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40863919",
          "author": "ossyrial",
          "description": "The author links to the somewhat dystopian blog where the email sender is quite proud of their work. Their words (or perhaps that of an LLM):\n> Could an AI agent craft compelling emails that would capture people's attention and drive engagement, all while maintaining a level of personalization that feels human? I decided to find out.\n> The real hurdle was ensuring the emails seemed genuinely personalized and not spammy. I knew that if recipients detected even a whiff of a generic, mass-produced message, they'd tune out immediately.\n> Incredibly, not a single recipient seemed to detect that the emails were AI-generated.\nhttps://www.wisp.blog/blog/how-i-use-ai-agents-to-send-1000-...\nThe technical part surprised me: they string together multiple LLMs which do all the work. It's a shame the author's passions are directed towards AI slop-email spam, all for capturing attention and driving engagement.\nHow much of our societal progress and collective thought and innovation has gone to capturing attention and driving up engagement, I wonder.",
          "link": "https://news.ycombinator.com/item?id=40863919",
          "publishedOn": "2024-07-03T08:28:02.000Z",
          "wordCount": null,
          "title": "New comment by ossyrial in \"I Received an AI Email\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40863586",
          "author": "taylorius",
          "description": "The future - megawatts of electricity being used, 24/7 as armies of LLMs email and debate each other, and try to sell each other programs at a great discount.\nAs for the humans, we went fishing instead.",
          "link": "https://news.ycombinator.com/item?id=40863586",
          "publishedOn": "2024-07-03T07:26:50.000Z",
          "wordCount": null,
          "title": "New comment by taylorius in \"I Received an AI Email\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=52856",
          "author": "Chris Bertram",
          "description": "I’ve spent many hours trying to take pictures of these over the past three years and have a large collection of indistinct blurs as a result. But I went back to basics, studied the camera setting, watched a bunch of “how to” videos on YouTube and actually managed this one:",
          "link": "https://crookedtimber.org/2024/07/07/sunday-photoblogging-swift-3/",
          "publishedOn": "2024-07-07T07:45:41.000Z",
          "wordCount": 1781,
          "title": "Sunday photoblogging: Swift",
          "imageUrl": "https://live.staticflickr.com/65535/53825059791_9146a056b1.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52851",
          "author": "Chris Armstrong",
          "description": "In the UK, we’re all waking up to the prospect of a new government. The election was an oddity: Labour has converted a modest 35% vote share into a whopping Parliamentary majority; the Tories did somewhat better than suggested, on around 24%, but have lost more than two-thirds of their MPs. (The final figures were […]",
          "link": "https://crookedtimber.org/2024/07/05/bye-bye-tories-hello-what/",
          "publishedOn": "2024-07-05T09:53:40.000Z",
          "wordCount": 10411,
          "title": "Bye bye, Tories, hello what?",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52847",
          "author": "Kevin Munger",
          "description": "In the 18 months since I quit Twitter, I can feel the atrophy of my vibe detector. I’m reading more than ever, on Substack and the FT, Discord and group chats — much of the same “content” I would’ve encountered on Twitter, in fact, but without the ever-present spiderweb of the social graph, the network […]",
          "link": "https://crookedtimber.org/2024/07/03/does-social-media-cause-anything/",
          "publishedOn": "2024-07-03T17:34:39.000Z",
          "wordCount": 7562,
          "title": "Does Social Media Cause Anything?",
          "imageUrl": "https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F400487e4-3d8d-4e00-b637-462496a892f1_493x302.png"
        },
        {
          "id": "https://crookedtimber.org/?p=52835",
          "author": "Liz Anderson",
          "description": "If the current Supreme Court had held comparable office in Weimar Germany, that is, its opinion in Trump v. United States would have rendered the judgment in this post’s headline. Never mind that the Weimar Constitution was different from the U.S. Constitution (importantly, in granting emergency powers to the President to rule by decree under […]",
          "link": "https://crookedtimber.org/2024/07/02/supreme-court-rules-hitler-immune-from-prosecution-for-burning-down-reichstag-seizing-absolute-power/",
          "publishedOn": "2024-07-02T11:01:54.000Z",
          "wordCount": 20446,
          "title": "Supreme Court Rules Hitler Immune from Prosecution for Burning Down Reichstag, Seizing Absolute Power",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52810",
          "author": "Eszter Hargittai",
          "description": "I’m hosting a couple of professionalization discussions for our PhD candidates and postdocs this summer, informal conversations to help them navigate the crazy academic job market. A few weeks ago we discussed job talks as the department had just had a bunch of candidates visit (very different schedule here in Europe than the US) and […]",
          "link": "https://crookedtimber.org/2024/07/02/advice-on-faculty-job-application-letters/",
          "publishedOn": "2024-07-02T07:10:08.000Z",
          "wordCount": 4742,
          "title": "Advice on faculty job application letters",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/End-Austerity-A-Global-Report-on-Budget-Cuts-and-Harmful-Social-Reforms-in-2022",
          "author": "Isabel Ortiz, Matthew Cummins",
          "description": "This report exposes the dangers of a post-pandemic austerity shock, far more premature and severe than the one that followed the global financial crisis. It finds that 85 percent of the world's population is living in the grip of austerity, more than 6.3 billion people. Governments must urgently identify alternative financing options to support their populations that are coping with multiple and compounding crises - from health, energy, finance and climate shocks to unaffordable living (...)\nEnglish\n\n/ \nPoverty, \nAusterity/Structural Adjustment, \nIMF",
          "link": "https://www.cadtm.org/End-Austerity-A-Global-Report-on-Budget-Cuts-and-Harmful-Social-Reforms-in-2022",
          "publishedOn": "2024-07-08T17:14:28.000Z",
          "wordCount": 1904,
          "title": "End Austerity: A Global Report on Budget Cuts and Harmful Social Reforms in 2022-25",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1200xH630/b96f942523c71fab5dd5c2a6b3610f-c3e99.jpg"
        },
        {
          "id": "https://www.cadtm.org/Broken-Britain",
          "author": "Michael Roberts",
          "description": "UK citizens vote in a general election on 4 July. The opinion polls currently forecast that the incumbent Conservative party will be heavily defeated after 14 years in government. The opposition Labour party is expected to gain a majority of over 250 seats, a record landslide, with the Conservatives getting less than 100 seats. \nEnglish\n\n/ \nUnited Kingdom, \nCapitalism, \nInequality, \nInflation",
          "link": "https://www.cadtm.org/Broken-Britain",
          "publishedOn": "2024-07-04T11:02:43.000Z",
          "wordCount": 4259,
          "title": "Broken Britain",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1061xH558/6d7e96c9a2bd611e28a7418b709dd2-22c23.jpg"
        },
        {
          "id": "https://www.cadtm.org/Structural-Adjustment-and-the-Washington-Consensus-Are-Not-Abandoned-in-2000",
          "author": "Eric Toussaint",
          "description": "In July 2024, the World Bank and the IMF will be 80 years old. 80 years of financial neo-colonialism and the imposition of austerity policies in the name of debt repayment. 80 years is enough! The Bretton Woods institutions must be abolished and replaced by democratic institutions serving an ecological, feminist and anti-racist bifurcation. To mark these 80 years, we are republishing a series of articles every Wednesday until July, looking in detail at the history and damage caused by these (...)\nEnglish\n\n/ \nAusterity/Structural Adjustment, \nIMF, \nWorld Bank, \nFinance against people, \n80 ans BM FMI EN",
          "link": "https://www.cadtm.org/Structural-Adjustment-and-the-Washington-Consensus-Are-Not-Abandoned-in-2000",
          "publishedOn": "2024-07-03T09:36:55.000Z",
          "wordCount": 5828,
          "title": "Structural Adjustment and the Washington Consensus Are Not Abandoned in 2000",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/71d4d4e0c2ffc7444e2bf3a93e276f-a4794.jpg"
        },
        {
          "id": "https://www.cadtm.org/In-Finland-the-Left-Alliance-Just-Trounced-the-Far-Right",
          "author": "Chris Dite, Li Andersson",
          "description": "Europe's elections saw gains for anti-immigration parties — but the breakthrough act in Finland was the Left Alliance, with 17% support. Its leader, Li Andersson, told Jacobin about why it did so well and how it defeated the far right. \nEnglish\n\n/ \nAntifascism, \nNorth, \nFinland",
          "link": "https://www.cadtm.org/In-Finland-the-Left-Alliance-Just-Trounced-the-Far-Right",
          "publishedOn": "2024-07-02T08:35:14.000Z",
          "wordCount": 2583,
          "title": "In Finland, the Left Alliance Just Trounced the Far Right",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/604388d80634de4cffc29186d2806b-86871.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=7967",
          "author": "disassociated.com",
          "description": "Rhett Allain, writing for Wired, looks at the physics of this important question. If humanity is ever to establish bases on the Moon, ways of keeping occupants fit in the low lunar gravity need to be worked out. A wall of death sort of gizmo, that’s a little like a stationary hamster-wheel, but turned on […]",
          "link": "https://disassociated.com/physics-running-keeping-fit-moon/",
          "publishedOn": "2024-07-07T21:00:30.000Z",
          "wordCount": 298,
          "title": "The physics of running and keeping fit on the Moon",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7958",
          "author": "disassociated.com",
          "description": "Break out the coffee and the cake: a celebration is on the cards. Tomorrow, Threads, Meta’s answer — and much needed foil — to X/Twitter, notches up its first birthday. I was there as the platform began rolling out, and managed to score (just) a relatively low (five-figure) badge number. 98,522 for the record. These […]",
          "link": "https://disassociated.com/threads-first-birthday-gift-users-advertising/",
          "publishedOn": "2024-07-04T21:00:29.000Z",
          "wordCount": 679,
          "title": "Threads first birthday gift to users: advertising?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7951",
          "author": "disassociated.com",
          "description": "That’s the good news. Tory Shepherd, writing for The Guardian, says the recently discovered exoplanet, dubbed Gliese 12b, might be able to host liquid water. We all know what that means. If there’s water, there may be life. Gliese 12b is so named because it orbits a star called Gliese. Now for the bad news. […]",
          "link": "https://disassociated.com/potentially-habitable-earth-size-planet-forty-light-years-away/",
          "publishedOn": "2024-07-03T21:00:53.000Z",
          "wordCount": 441,
          "title": "Potentially habitable Earth size planet forty light years away",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7947",
          "author": "disassociated.com",
          "description": "This is sad and concerning news. The Melbourne based bookseller had become well ensconced in the Australian literary realm, since being founded about twenty-years ago. The company, which is also listed on the ASX (though trading of shares has been suspended), had been struggling financially in recent years though.",
          "link": "https://disassociated.com/australian-bookseller-booktopia-voluntary-administration/",
          "publishedOn": "2024-07-03T03:57:38.000Z",
          "wordCount": 132,
          "title": "Australian bookseller Booktopia in voluntary administration",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7938",
          "author": "disassociated.com",
          "description": "I might say that of U2, whose music I once really liked, especially the stuff they did in the nineties. Achtung Baby. Zooropa. Pop. Even 2000’s All That You Can’t Leave Behind. These albums mostly represented their electronic music phase. I’d have them on loop for days at a time. I drew the ire of […]",
          "link": "https://disassociated.com/like-old-music-better-than-new-music/",
          "publishedOn": "2024-07-02T21:00:29.000Z",
          "wordCount": 608,
          "title": "I like your old music better than your new music",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7935",
          "author": "disassociated.com",
          "description": "The shortlist for the 2024 Miles Franklin literary award for works of Australian fiction, was announced earlier today. Of the ten novels named on the longlist in May, the following six titles have been included today: Only Sound Remains, by Hossein Asgari Wall, by Jen Craig Anam, by André Dao The Bell of the World, […]",
          "link": "https://disassociated.com/2024-miles-franklin-shortlist-australian-fiction/",
          "publishedOn": "2024-07-02T07:13:09.000Z",
          "wordCount": 248,
          "title": "The 2024 Miles Franklin shortlist for Australian fiction",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20240704",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20240704",
          "publishedOn": "2024-07-04T15:20:00.000Z",
          "wordCount": 533,
          "title": "Week Ending June 30, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/gaucho-lepenism",
          "author": null,
          "description": "On France’s far-right vote.",
          "link": "https://newleftreview.org/sidecar/posts/gaucho-lepenism",
          "publishedOn": "2024-07-05T18:02:45.000Z",
          "wordCount": 2867,
          "title": "Martin Barnay: &ldquo;Gaucho-Lepénisme?&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/4bddt-n08024-425-e1720371743736.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/majority-without-a-mandate",
          "author": null,
          "description": "Elections in the UK.",
          "link": "https://newleftreview.org/sidecar/posts/majority-without-a-mandate",
          "publishedOn": "2024-07-05T16:24:18.000Z",
          "wordCount": 1710,
          "title": "Richard Seymour: &ldquo;Majority Without a Mandate&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/9549ca10-3ad9-11ef-9d6c-7960f16c54d6.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/familiar-faces",
          "author": null,
          "description": "The photography of Johny Pitts.",
          "link": "https://newleftreview.org/sidecar/posts/familiar-faces",
          "publishedOn": "2024-07-05T13:16:23.000Z",
          "wordCount": 2140,
          "title": "Owen Hatherley: &ldquo;Familiar Faces&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/junglist-massive.jpg"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://notes.jeddacp.com/how-i-edit-my-photos/",
          "author": null,
          "description": "During National Camera Day , I wrote about my non-exhaustive list of cameras I’ve owned. A lot of great discussions came out of this, both via Mastodon and email. One of those things is in regard to my post-processing workflow.\n\nAs you can see in my respose to Lou, I currently do very little when it comes to post-processing photos. It wasn’t always like this, but I think that’s a story for another post. This one will focus specifically on what I do now (which isn’t much).\nBoth of my primary cameras (Fujifilm X100V and Ricoh GRIIIx) have some sort of film simulation that I can set up in-camera and I rely on that to do a majority of my edits.\nIn my Fujifilm X100V, I primarily use the Reggie’s Portra film sim\nClassic Chrome\nDynamic Range: DR-Auto\nHighlight: -1\nShadow: -1\nColor: +2\nNoise Reduc…",
          "link": "https://notes.jeddacp.com/how-i-edit-my-photos/",
          "publishedOn": "2024-07-08T15:47:04.262Z",
          "wordCount": 1181,
          "title": "How I Edit My Photos",
          "imageUrl": "https://live.staticflickr.com/65535/53343625084_67cc9a1c96_c.jpg"
        },
        {
          "id": "https://dostoynikov.com/the-emotional-disconnect-with-ai-made-works/",
          "author": null,
          "description": "I'm definitely not against the usage of AI. It's a very helpful and powerful tool for many things. It's being used for web designs, graphical elements, illustrations, articles, videos, stories, etc.\nHowever, I think we might be missing one thing. For me, one of the reasons I love certain content, designs, and articles is because they are human-made. Human made things are not perfect. Imperfection makes the whole story/concept/design better. The beauty and charm lie in the imperfections and the fact that I know it's done by another living being like me. Thanks to this fact, I form connections to the things I consume.\nPersonally, I can not feel emotional connection to AI-made products. It does not matter if it is perfect or not. As soon as I know that it is AI-made, I start to dislike it suddenly. It's definitely not a rational way of thinking and is completely emotional, I know. But that's where AI might have difficulties understanding human behavior. Humans are unpredictable and imperfect. Stories — the whole process of creating something from beginning to end — are really important for humans, and knowing that there is a human in the process makes it more valuable.\nSo I think that, in the future, AI-made things might start to be something that people might try to avoid on purpose, and value non-AI-made/human-made things much more just because they are human-made, imperfect and have a story in it. People might start to demand non-AI works. \\ AI might lose it's popularity just because of being AI.",
          "link": "https://dostoynikov.com/the-emotional-disconnect-with-ai-made-works/",
          "publishedOn": "2024-07-07T18:24:00.000Z",
          "wordCount": 922,
          "title": "The emotional disconnect with AI made works",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://tiramisu.bearblog.dev/slapping-watermelons/",
          "author": null,
          "description": "One of my favorite childhood memories is eating watermelons in the summer. Not just the carnal joy of eating them — crunching the sweetness between my teeth and feeling the wetness run down my chin — but the rest of the process too. Watching my dad slap and thump the melons in the supermarket to pick a good one while my brother and I clowned around and mimicked him. Crowding around the cutting board to seeing if we split open a good one. And of course, the best part: spooning the first bite of dark red flesh from the center and watching the juice pour into the crater left behind.\nA crate of watermelons greeted me at the supermarket last week and I decided I wanted to buy one for the first time, just to try it. After slapping a few cluelessly (are they supposed to talk back to you or something?) I pushed my cart to a corner and looked up how to pick a good watermelon. I ended up coming across this helpful graphic:\n\nI don't know what my dad was listening for when he tapped and slapped all those watermelons. Like with most things, I'm sure I asked him about it and promptly forgot his answer. In hindsight, I don't think he was that good at choosing them, despite growing up on a farm, because he took home a number of watermelons that were pale and watery inside. And I've been thinking about that as I sprinkle tajín on my watermelon slices and drip pink juice on the counter, how he was probably winging it too, along with the rest of adult- and parenthood, the same way I was slapping watermelons at the market last week and feeling like a fool waiting to be found out.",
          "link": "https://tiramisu.bearblog.dev/slapping-watermelons/",
          "publishedOn": "2024-07-07T17:52:00.000Z",
          "wordCount": 730,
          "title": "slapping watermelons",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://birming.com/trash-treasure/",
          "author": null,
          "description": "I had dinner with a close friend yesterday.\nAfterward, I sent a photo I took of her. She wrote back that she thought it looked awful. I replied that I thought it was beautiful, which I honestly did. I wrote that maybe it's like hearing your voice; it always feels a little strange and \"ugly.\"\nThe thought lingered while I sat on the subway home…\nPerhaps it's the same phenomenon that happens when we're dissatisfied with our writing. The observer and the observed are too close to each other to make a fair judgment. It's like looking at a painting up close and thinking it looks terrible. It's like a trial where the judge and the defendant are the same person.\nWe are in a constant state of bias when it comes to judging our work.\nAnyone who's been blogging for a while has experienced this: You post something you almost threw away because you thought it was garbage, and it turns out to be one of your most popular posts.\nBias.\nNext time you find yourself with your index finger resting on the delete button, move it to publish. Your trash might be someone else’s treasure.",
          "link": "https://birming.com/trash-treasure/",
          "publishedOn": "2024-07-07T09:27:00.000Z",
          "wordCount": 756,
          "title": "Your trash might be someone else’s treasure",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1717834500-0.jpeg"
        },
        {
          "id": "https://jbrr.dev/long-awaited-bear-media-center/",
          "author": null,
          "description": "I hope I'm not telling any tales out of school. If I am, bring the lifetime ban hammer down on me hard, Herman.\nA recent update has exposed an experimental media library in your Bear dashboard. It was committed two weeks ago, so this might be old news, but this is a considerable improvement for general ease of use.\nThe URL is https://bearblog.dev/<subdomain>/dashboard/media/ and should look like this.\n\nPro Tip: Use the Customize Dashboard functionality to add a link in your footer for easy access.\nExcellent work, Herman, as always!",
          "link": "https://jbrr.dev/long-awaited-bear-media-center/",
          "publishedOn": "2024-07-07T06:55:00.000Z",
          "wordCount": 1008,
          "title": "Long Awaited Bear Media Center",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jbrr-1719724355.jpg"
        },
        {
          "id": "https://alexandrawolfe.ca/youve-got-mail/",
          "author": null,
          "description": "I was reading Veronique's post this afternoon, Just A Small Town Girl, and smiled at her lovely doodles. But there was one that caught my eye and then, brought a lump to my throat. It featured a stamp and the words, Post Air Mail. And it hit me. I hadn't had any real mail from anyone (not including birthday or Christmas cards) not since my mum passed back in 1999.\nIt sent a shiver down my spine not just because that was over 20 years ago, but because, the last handwritten letter I ever got, was from a dead woman: my mother.\nWhere ever I was in the world, travelling and or working, my mother almost religiously took time out of her day to write an aerogramme to me. Do you remember those? You buy them at any post office, singularly or in packs. I think my mother had a draw full of them—after …",
          "link": "https://alexandrawolfe.ca/youve-got-mail/",
          "publishedOn": "2024-07-06T17:44:04.350Z",
          "wordCount": 1015,
          "title": "You've Got Mail",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/awolfe-1720287818.jpg"
        },
        {
          "id": "https://birming.com/why-so-serious/",
          "author": null,
          "description": "I recently did work in the Swedish archipelago. So beautiful! On days like that, it's hard to believe you're at work.\nThis time, the sky opened up, and the rain poured down for a short while. The sky looked amazingly powerful as I stood on the shore and looked out over the ocean.\nIt's stunning how small you feel at times like this. Not only that, but your worries and problems also feel small. Things that you otherwise attach great importance to suddenly don’t feel all that important there and then. You just stand there with your smallness somewhere in the vastness of the universe and marvel — everything stops.\nA few hours later, I stepped ashore, jumped on my bike, and felt how everyday life was slowly but surely making its way back…\n\"I have to stop at the grocery store on the way home. Oh, I almost forgot; I have to do laundry today. I wonder if I can make it to the gym. On the last day of the month, I have to remember to report my working hours. Oh yeah, I have to log and send in my expenses for the month.”\nThings that need to be done. They don’t get done by standing and staring straight up at the sky in an attempt to make them small enough to disappear.\nBut now and then, we can try to remind ourselves of the emptiness that surrounds all these little musts and problems. Our inner, limitless space can teach us not to take everything so seriously.",
          "link": "https://birming.com/why-so-serious/",
          "publishedOn": "2024-07-05T15:49:00.000Z",
          "wordCount": 798,
          "title": "Why so serious?",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1717834500-0.jpeg"
        },
        {
          "id": "https://birming.com/false-identities/",
          "author": null,
          "description": "I heard an interview with Rachel \"Yoga Girl\" Bråthén. She talked about how certain things in her past, like being vegan, became a kind of identity. It was all or nothing. \"This is me. This is who I am. End of story!\"\nIt's easy to get too attached to that kind of self-image, whether it's advocating for healthy eating or reviewing cell phones.\nLooking back, I can relate to this myself. Yoga, meditation, mindfulness, weight training, blogging, and more have all served as a “false” sense identity for me at some point — at least to some extent.\nOf course, it's not what we do that's the problem; it's how we see ourselves in relation to what we do. You can have a million followers and still be the most grounded person in the world.\nNo matter how \"important\" or \"unimportant\" our roles in life are, it's good to remind ourselves of this truth from time to time. Status and possessions come and go, but who we are on a deeper level remains.",
          "link": "https://birming.com/false-identities/",
          "publishedOn": "2024-07-04T07:30:00.000Z",
          "wordCount": 708,
          "title": "False identities",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1717834500-0.jpeg"
        },
        {
          "id": "https://grubz.blog/the-indie-web-is-saving-my-sanity/",
          "author": null,
          "description": "A lot of my posts have covered stuff I don't ever have the time of day to talk about. I work too much and almost all of my coworkers are conservative boomers. I don't talk to most of them  much but every once in a while I'll have to share a store with some of them. Sometimes they give me random phone calls. Luckily I have the option of just not picking up the phone.\nI just don't relate with the people I have to interact with on the regular. I mean we aren't having heavy political conversations 24/7 but it just doesn't feel comfortable being around people who you know are the polar opposite of who you are.\nI feel like being able to write about the stuff I never get to talk about is a healthy counterweight to that. I'm not a great writer, I know a lot of the stuff I write won't be read for weeks, or possibly ever. Some of it might be boring or come across cheesy. Sometimes I cover really broad, uninteresting things.\nBut it has had the unexpected effect of making me feel more valid as a person. It feels odd saying that, but it's true.\nMaybe it's because I haven't had a hobby I can get lost in for too long. Making the rounds in different indie web neighborhoods, learning little bits of CSS and bringing my vision to life one piece at a time does a pretty good job at keeping me from getting bored and letting my mind wander to stress. Then when I'm done with that for a while I can write some more. Sometimes I'm proud of it, sometimes I delete it after a couple hours.\nIt feels... healthier than doomscrolling. I prefer this over traditional social media because of the ownership and freedom, and the fact that I sort of get to whisper what I'm saying rather than blasting it over a megaphone and putting myself on stage in front of an audience riding algorithmic dopamine waves.",
          "link": "https://grubz.blog/the-indie-web-is-saving-my-sanity/",
          "publishedOn": "2024-07-04T04:13:14.001Z",
          "wordCount": 990,
          "title": "The indie web is saving my sanity",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://kylevallans.bearblog.dev/market-to-me/",
          "author": null,
          "description": "*** Add your email below if you’d like to get access to our overnight momentum trading chat! Free for a month, then $6/month.\nIn it, you’ll find both retail and proprietary traders. Guys who work(ed) for SMB, KTG, Avatar, Chimera & Seven Points that you can network and trade alongside with.\nSubscribe to my blog\nOver the last 7 years, I have exclusively focused on trading. Well, to be fair, it's more so the last 5 years. The first 2 years as a retail trader, I had one of those so called \"well-rounded lives\". I traded, went out often, hung out after the close with friends & fam, enjoyed snowboarding, camping, and mountain biking more than most.\nBut, over the last 5 years as a professional trader living in NY and ATX and working out of both offices, I gave up everything, one by one to focus e…",
          "link": "https://kylevallans.bearblog.dev/market-to-me/",
          "publishedOn": "2024-07-03T17:20:00.000Z",
          "wordCount": 1508,
          "title": "Finding Myself Beyond the Trading Floor",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://birming.com/bear-blog-tips/",
          "author": null,
          "description": "If you've been here before, you may have visited the Blog Inspiration page. It contains a lot of good and useful resources when it comes to blogging: writing, design, blog challenges, webrings, shortcuts...\nNow there's one more: Bear Blog.\nIt's the blogging platform I use and love. It's also used by many of my favorite bloggers and some of my readers. In other words, it deserves its own Bear section.\nThese are currently on the list (those marked with * requires an upgraded account):\nConvert bear blog CSV exports to markdown files\nRandom link (external)\nRandom link (internal) *\nAdd external link markers\nAdd a search feature *\nEstimated reading time *\nCustomizing the upvote button\nCount your posts\nAdding a \"reply via email\" button\nAdding a private feedback box *\nDo you have suggestions for things to include? Or maybe you have an idea for a \"hack\" you would like someone to put together?\nContact me and I will add it to this post.\nHappy Bear blogging! 🐻\nPS. For official changes and feature suggestions, see the changelog and roadmap.",
          "link": "https://birming.com/bear-blog-tips/",
          "publishedOn": "2024-07-03T17:19:00.000Z",
          "wordCount": 732,
          "title": "Bear Blog Tips & Tricks Collection",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1717834500-0.jpeg"
        },
        {
          "id": "https://notes.jeddacp.com/to-blogroll-or-to-not/",
          "author": null,
          "description": "I really love the idea of having a Blogroll. When checking out a new blog, after reading and perusing said blog, I typically check to see if it has one. I think it’s one of the best ways to find new people to subscribe to, new content to read, and/or new perspectives to be exposed to. However, I don’t have one on my blog. Hypocritical? Maybe. Or maybe it’s just really personal preference.\nI grew up in the days of MySpace, and this irrational want to be included in everyone’s Top 8. Then when you’re in their Top 8, you watch that list like a hawk in case you drop from Top 2 to Top 5, or even worse, drop off altogether. Granted, blogrolls are a bit different since there’s no hard limit on how many can be included (or specified order), but the idea is similar.\nYou see, I’m fine and OK with no…",
          "link": "https://notes.jeddacp.com/to-blogroll-or-to-not/",
          "publishedOn": "2024-07-02T20:11:00.000Z",
          "wordCount": 1263,
          "title": "To Blogroll, or to not?",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1719950732.png"
        },
        {
          "id": "https://mgx.me/micro-tool-to-convert-bear-blog-csv-exports-to-markdown-files/",
          "author": null,
          "description": "#b2md{border:2px dotted var(--border-color);padding:20px}.b2mdcontainer{display:flex;justify-content:space-between;align-items:center}.b2mdcontainer input{order:1}.b2mdcontainer button{order:2}#InfoText{color:#8a2be2;font-size:90%;margin-bottom:0}.image-container{position:relative;display:inline-block}.modal,.toggle-input{display:none}.b2md-img{transition:transform .3s}@media (min-width:700px){.b2md-img:hover{transform:scale(1.05)}}.modal{position:fixed;z-index:1000;left:0;top:0;width:100%;height:100%;overflow:auto;background-color:rgba(0,0,0,.8)}.modal-content{background-color:#fefefe;margin:2% auto;padding:20px;border:1px solid #888;width:80%;max-width:700px;box-shadow:0 4px 8px rgba(0,0,0,.2);color:var(--text-color)}@media (prefers-color-scheme:dark){.modal-content{background-color:#012…",
          "link": "https://mgx.me/micro-tool-to-convert-bear-blog-csv-exports-to-markdown-files/",
          "publishedOn": "2024-07-02T13:46:00.000Z",
          "wordCount": 1241,
          "title": "micro tool to convert bear blog csv exports to markdown files",
          "imageUrl": "https://static.mgx.me/images/2024/micro-tool-to-convert-bear-blog-csv-exports-to-markdown-files.png"
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/william-gillis-what-s-in-a-slogan-kylr-and-militant-anarcha-feminism?v=1720111778",
          "author": null,
          "description": "Author: William Gillis\nTitle: What’s In A Slogan? “KYLR” and Militant Anarcha-feminism\nDate: June 25, 2024\nNotes: William Gillis: https://twitter.com/rechelon\nSource: Retrieved on July 4, 2024 from https://c4ss.org/content/59691\n\n An anarchist walks out of a punk show to smoke. On her vest are anarchist patches with various standard slogans, “No Gods No Masters,” “Death To Transphobes,” “Kill Your Local Rapist,” “All Cops Are Bastards,” “Punch Nazis,” “From The River To The Sea Palestine Will Be Free,” “Make Total Destroy,” “The Only Good Cop Is A Dead Cop,” “Eat The Rich,” “Death Before Detransition” and… “Fire To The Prisons.” \n A suddenly red-faced bystander trots up to her to argue. \n“Oh so you’re saying you support a blanket social policy of allowing anyone to burn anything they accus…",
          "link": "https://theanarchistlibrary.org/library/william-gillis-what-s-in-a-slogan-kylr-and-militant-anarcha-feminism?v=1720111778",
          "publishedOn": "2024-07-04T16:49:38.000Z",
          "wordCount": 18894,
          "title": "William Gillis - What’s In A Slogan? “KYLR” and Militant Anarcha-feminism",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "59309",
            "url": "https://theanarchistlibrary.org/library/william-gillis-what-s-in-a-slogan-kylr-and-militant-anarcha-feminism.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/mb-sundjata-how-and-why-the-us-left-betrayed-tigray?v=1720081541",
          "author": null,
          "description": "Author: MB Sundjata\nTitle: How and Why the US Left Betrayed Tigray\nSubtitle: US organizations like PSL and Black Alliance for Peace cannot be trusted to advocate for Palestine’s liberation after they condemned nearly a million Tigrayans to genocide.\nDate: June 18, 2024\nSource: Retrieved from <redvoice.news/how-and-why-the-us-left-betrayed-tigray> on July 3, 2024\n\n I thought further and said: “Why do men lie over problems of such great importance, even to the point of destroying themselves?” and they seemed to do so because although they pretend to know all, they know nothing. Convinced they know all, they do not attempt to investigate the truth. — Zara Yacob of Aksum (Tigray), 17th-century philosopher, in The Hatata Inquiries\n (Content Warning: this article describes acts of genocide and w…",
          "link": "https://theanarchistlibrary.org/library/mb-sundjata-how-and-why-the-us-left-betrayed-tigray?v=1720081541",
          "publishedOn": "2024-07-04T08:25:41.000Z",
          "wordCount": 8853,
          "title": "MB Sundjata - How and Why the US Left Betrayed Tigray",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "636010",
            "url": "https://theanarchistlibrary.org/library/mb-sundjata-how-and-why-the-us-left-betrayed-tigray.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/the-di-fraye-arbeter-shtime-editorial-board-an-anonymous-group-of-polish-anarchists-yiddish-ana?v=1720078025",
          "author": null,
          "description": "Author: The Di fraye arbeter shtime Editorial Board, An Anonymous Group of Polish Anarchists, Eyshe Beirich\nTitle: Yiddish Anarchists’ Break Over Palestine\nDate: 1929\nNotes: An exchange in the anarchist newspaper Di fraye arbeter shtime after the 1929 Hebron massacre offers a case study in Jewish discourse and political reaction after immense violence. \n Introduced and translated from the Yiddish by Eyshe Beirich\nSource: Retrieved on 04/07/2024 from https://jewishcurrents.org/yiddish-anarchists-break-over-palestine-1929\n\nOn Friday, August 23rd, 1929, exaggerated rumors about the extent of Jewish violence against Palestinians and the desecration of holy sites in Jerusalem reached the Palestinian community of Hebron (Al-Khalil, in Arabic). What started as incensed Palestinians throwing stone…",
          "link": "https://theanarchistlibrary.org/library/the-di-fraye-arbeter-shtime-editorial-board-an-anonymous-group-of-polish-anarchists-yiddish-ana?v=1720078025",
          "publishedOn": "2024-07-04T07:27:05.000Z",
          "wordCount": 3547,
          "title": "The Di fraye arbeter shtime Editorial Board, An Anonymous Group of Polish Anarchists, Eyshe Beirich - Yiddish Anarchists’ Break Over Palestine",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "14982",
            "url": "https://theanarchistlibrary.org/library/the-di-fraye-arbeter-shtime-editorial-board-an-anonymous-group-of-polish-anarchists-yiddish-ana.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anarhija-info-horror-vacui?v=1720049426",
          "author": null,
          "description": "Author: anarhija.info\nTitle: Horror Vacui\nDate: February 10, 2018\nSource: <actforfree.nostate.net/?p=29728>. Retrieved on 03/07/2024 from lib.anarhija.net.\n\n There are anarchists who run after uprisings on other continents wherever the spotlights of the media fall. There are anarchists who talk about “fortress Europe” and they don’t even know which States are part of the EU. There are anarchists who struggle against the borders and they don’t even know where the Schengen frontier runs. There are anarchists who, like “good white men”, see in the “dark-skinned” non-EU people potential comrades, and they don’t even notice that there are European non-EU people. \n There are anarchists who talk about internationalism and they don’t even know (or don’t give a fuck) what happens on their own conti…",
          "link": "https://theanarchistlibrary.org/library/anarhija-info-horror-vacui?v=1720049426",
          "publishedOn": "2024-07-03T23:30:26.000Z",
          "wordCount": 1105,
          "title": "anarhija.info - Horror Vacui",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6291",
            "url": "https://theanarchistlibrary.org/library/anarhija-info-horror-vacui.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anarhija-info-aut-aut?v=1720049269",
          "author": null,
          "description": "Author: anarhija.info\nTitle: Aut Aut\nDate: 2016\nSource: <anarhija.info/library/anarhija-info-aut-aut-en>. Retrieved on 03/07/2024 from lib.anarhija.net.\n\n When I translated and published the pamphlet \"Individuality and the anarchist group\", signed by one of the CCF cells, Guerilla Urbana Cell, I added in a note that I didn’t do it because I agree with the content, but to make public how much this project, in my opinion, has turned away from its original form of tension to propose (or re-propose) an anarchist individualism which, in some ways, can be found in the pages of a different insurrectionist theory, but in this case approaching or even in some points leading to formal ideas, that is the formal organization. \n Similar proposals (informal platform, structured and specific organization…",
          "link": "https://theanarchistlibrary.org/library/anarhija-info-aut-aut?v=1720049269",
          "publishedOn": "2024-07-03T23:27:49.000Z",
          "wordCount": 2980,
          "title": "anarhija.info - Aut Aut",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "10764",
            "url": "https://theanarchistlibrary.org/library/anarhija-info-aut-aut.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/adriano-communique-from-prison?v=1720049064",
          "author": null,
          "description": "Author: Adriano\nTitle: Communiqué from prison\nDate: April 9, 2014\nSource: <actforfree.nostate.net/?p=16535>. Retrieved on 03/07/2024 from lib.anarhija.net.\n\n Violence generates violence. Regardless of what is right or wrong, no matter how abstruse is the boundary between opposites and how easily they can converge. The word violence and the concept it expresses present deep mystifications to those who have the monopoly on it. All expressions of dissent are being disproportionately repressed… no surprise… ‘go and tell them that it’s springtime’ [rough translation of ‘vagli a spiegare che è primavera’, a verse by the late anarchist singer and song-writer Fabrizio De Andrè]. \n The modus operandi of cops and politicians is infamous enough, with their artistic architecture made of inexistent cas…",
          "link": "https://theanarchistlibrary.org/library/adriano-communique-from-prison?v=1720049064",
          "publishedOn": "2024-07-03T23:24:24.000Z",
          "wordCount": 1777,
          "title": "Adriano - Communiqué from prison",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "8602",
            "url": "https://theanarchistlibrary.org/library/adriano-communique-from-prison.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/han-ryner-ethical-individualism?v=1719971059",
          "author": null,
          "description": "Author: Han Ryner\nTitle: Ethical Individualism\nSubtitle: Selected Texts\nDate: 2019\nNotes: Translated from French to English by Kirk Watson.\n\nTranslator’s Introduction\n At the dawn of the 20th century, Europe hosted a brief blossoming of individualistic thought. Inspired by the great thinkers of the preceding century such as Stirner, Ibsen, Nietzsche, and Spencer, they offered a free-thinking, non-dogmatic alternative to the increasingly powerful Marxists and syndicalists of the left, and the economists and theologians of the right. Importantly, this generation of thinkers developed the critique of the State into a critique of society as a whole, which immunized them from recruitment by the anarchist movement. As Ryner says in the Handbook, the anarchists are naive: victory by the anarchist…",
          "link": "https://theanarchistlibrary.org/library/han-ryner-ethical-individualism?v=1719971059",
          "publishedOn": "2024-07-03T01:44:19.000Z",
          "wordCount": 33627,
          "title": "Han Ryner - Ethical Individualism",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "227459",
            "url": "https://theanarchistlibrary.org/library/han-ryner-ethical-individualism.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/uploads/en/thumbnails/h-r-han-ryner-ethical-individualism-1.jpg.large.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/lee-shevek-leave-or-else-giving-ultimatums-to-abuse-victims?v=1719968190",
          "author": null,
          "description": "Author: Lee Shevek\nTitle: Leave, Or Else\nSubtitle: Giving Ultimatums to Abuse Victims\nDate: April 10, 2024\nSource: Retrieved on 2 July 2024 from butchanarchy.medium.com/leave-or-else-a60b0dbac2a6\n\n Abuse is ubiquitous in our society, and as a result there are very few among us, if any, who have not been abused themselves or in proximity to someone else being abused. Myths about why and how abuse occurs run rampant and the ones that dominate are ones that ultimately serve in the maintenance of the status quo that keeps victims disempowered and silent. As a result, even those few who do actually believe victims of abuse and see the danger such abuse poses to them still often respond to the conditions the victim is entrapped within in ways that ultimately affirm the abuser’s narrative and fur…",
          "link": "https://theanarchistlibrary.org/library/lee-shevek-leave-or-else-giving-ultimatums-to-abuse-victims?v=1719968190",
          "publishedOn": "2024-07-03T00:56:30.000Z",
          "wordCount": 2099,
          "title": "Lee Shevek - Leave, Or Else",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "8602",
            "url": "https://theanarchistlibrary.org/library/lee-shevek-leave-or-else-giving-ultimatums-to-abuse-victims.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/aryanam-funeral-theocracy-religious-capital?v=1719921893",
          "author": null,
          "description": "Author: Aryanam\nTitle: Funeral, Theocracy, & Religious Capital\nSubtitle: Observations & Thoughts After a Comrade’s Death\nDate: March 10th, 2024\nSource: asranarshism.com/1402/12/20/funeral-theocracy-religious-capital-en\n\n An accident. An accident tore a family apart. An accident took a brave and kind comrade from us. We will remember the date. It was December 2023. \n Death will come for us all. But, for now, we must put our shattered hearts back together. We need to organize. We need to fight. We need to grieve. Yet, we are not free to grieve, the same way we are not free to be. Not free to love. Not free to live. Countless surviving families and friends were vultured in one of their most vulnerable times. Countless victims of patriarchal honor killings were buried by their murderers. Count…",
          "link": "https://theanarchistlibrary.org/library/aryanam-funeral-theocracy-religious-capital?v=1719921893",
          "publishedOn": "2024-07-02T12:04:53.000Z",
          "wordCount": 3741,
          "title": "Aryanam - Funeral, Theocracy, & Religious Capital",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "13726",
            "url": "https://theanarchistlibrary.org/library/aryanam-funeral-theocracy-religious-capital.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/sheffield-action-group-what-is-school?v=1719921860",
          "author": null,
          "description": "Author: Sheffield Action Group\nTitle: What is School?\nDate: February 2024\nNotes: From Sheffield Action Group’s Troublemakers zine, this important piece stands on its own\n\n As students at university, we have a lot more to say about the global and national role of our institutions — this will come at another point. For now we will focus on primary and secondary school. Many reading this will have left 13 years of schooling, likely hating most of it, and may not have thought a lot about the scale of its impact on our lives and how things could have been so, so different. \n School is a class stratifier along eugenic lines. Those deemed more intelligent by their ability to absorb and spit out information in tests are seen as more suited for higher paying jobs and therefore, by this society’s lo…",
          "link": "https://theanarchistlibrary.org/library/sheffield-action-group-what-is-school?v=1719921860",
          "publishedOn": "2024-07-02T12:04:20.000Z",
          "wordCount": 1442,
          "title": "Sheffield Action Group - What is School?",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6999",
            "url": "https://theanarchistlibrary.org/library/sheffield-action-group-what-is-school.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/znore-hermetic-anarchism?v=1719921672",
          "author": null,
          "description": "Author: Znore\nTitle: Hermetic Anarchism\nSubtitle: Othering the Other, Uttering the Otter and Uddering the Author\nDate: 2014\nSource: groupnameforgrapejuice.blogspot.com\n\nI. Hermetic Anarchism and Othering the Other\n Imagination is a magic carpet \n Upon which we may soar \n To distant lands and climes \n And even go beyond the moon \n To any planet in the sky \n If we came from nowhere here \n Why can’t we go somewhere there? \n Sun Ra – Imagination \n I end up spending a lot of time in Jimbocho, the old bookseller’s district in Tokyo. Hours and hours I rifle through piles and stacks of dusty pulp hunting for gems. Usually my luck is good, and occasionally I find just the book that I need. There are two shops in particular, both specializing in used English books, where uncanny things can happen. A…",
          "link": "https://theanarchistlibrary.org/library/znore-hermetic-anarchism?v=1719921672",
          "publishedOn": "2024-07-02T12:01:12.000Z",
          "wordCount": 12450,
          "title": "Znore - Hermetic Anarchism",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "119671",
            "url": "https://theanarchistlibrary.org/library/znore-hermetic-anarchism.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/uploads/en/thumbnails/z-h-znore-hermetic-anarchism-1.jpg.large.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/ersilia-cavedagni-the-woman?v=1719921475",
          "author": null,
          "description": "Author: Ersilia Cavedagni\nTitle: The Woman\nDate: 28 October 1899\nNotes: Published in The Unstoppable Anarchist Ersilia Cavedagni & Her Selected Writings (pp. 32-34) at <thetransmetropolitanreview.files.wordpress.com> (PDF).\nSource: Retrieved on 18 March 2024 from thetransmetropolitanreview.wordpress.com.\n\n Generally men, rightly or wrongly, claim to have an intellectual and moral superiority over women, in addition to physical superiority. So be it! I want to grant it. \n Strangely enough, in the vast majority of cases the man who considers himself superior to the woman takes little or no effort to reduce her inferiority and to raise the woman to his level. \n This happens more especially among men who have a wife or partner. It would be logical that, if only out of a feeling of pride, the h…",
          "link": "https://theanarchistlibrary.org/library/ersilia-cavedagni-the-woman?v=1719921475",
          "publishedOn": "2024-07-02T11:57:55.000Z",
          "wordCount": 1469,
          "title": "Ersilia Cavedagni - The Woman",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7124",
            "url": "https://theanarchistlibrary.org/library/ersilia-cavedagni-the-woman.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/mark-barnsley-if-it-was-easy-they-wouldn-t-call-it-struggle?v=1719921397",
          "author": null,
          "description": "Author: Mark Barnsley\nTitle: If it Was Easy They Wouldn’t Call it ‘Struggle’\nSubtitle: Mark Barnsley Talks About Repression and Resistance in British Prisons\nDate: 2005\nSource: <zinelibrary.files.wordpress.com/2016/01/barnsley.pdf>\n\n Mark Barnsley has been involved in the Anarchist movement all his adult life, spending time fighting in Lebanon, editing The Sheffield Anarchist, supporting striking miners, confronting fascists, and spending 10 years in prison. Held in 20 different maximum or high security prisons, and 18 different segregation units, he has always taken the fight to the Enemy in jail. Released from prison in 2002, Mark continues to be as active as ever, speaking all over Europe, and being involved in the Campaign Against Prison Slavery, the Anarchist Black Cross, and many oth…",
          "link": "https://theanarchistlibrary.org/library/mark-barnsley-if-it-was-easy-they-wouldn-t-call-it-struggle?v=1719921397",
          "publishedOn": "2024-07-02T11:56:37.000Z",
          "wordCount": 12353,
          "title": "Mark Barnsley - If it Was Easy They Wouldn’t Call it ‘Struggle’",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "1969387",
            "url": "https://theanarchistlibrary.org/library/mark-barnsley-if-it-was-easy-they-wouldn-t-call-it-struggle.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/uploads/en/thumbnails/m-b-mark-barnsley-if-it-was-easy-they-wouldn-t-cal-1.png.large.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/palestinian-resistance-veteran-mark-barnsley-on-why-he-joined-up?v=1719921176",
          "author": null,
          "description": "Author: Mark Barnsley\nTitle: Palestinian Resistance veteran Mark Barnsley on why he joined up\nDate: 2009\nSource: <duncanpickstock.co.uk/index.php/videos/testament>\n\n And they said, oh, are you the the lads that have come to fight in Lebanon? And we said yeah, that’s us. And we sat in the back of this Peugeot car and I remember Lero nudging me, and there was a handgun underneat the dashboard and there was a butt of what was a Kalashnikov underneath one of the seats. So I was like, well, this is the real deal isn’t it? \nMark Barnsley fought with The Palestinian Resistance between 1978 and 1980\n Well, before I started school, me and my sister, who’s 18 months younger than me, used to on a Friday, we would go to town with my mum, to meet her mother, our grandma and we’d get dragged around the …",
          "link": "https://theanarchistlibrary.org/library/palestinian-resistance-veteran-mark-barnsley-on-why-he-joined-up?v=1719921176",
          "publishedOn": "2024-07-02T11:52:56.000Z",
          "wordCount": 2037,
          "title": "Mark Barnsley - Palestinian Resistance veteran Mark Barnsley on why he joined up",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "10319",
            "url": "https://theanarchistlibrary.org/library/palestinian-resistance-veteran-mark-barnsley-on-why-he-joined-up.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/antithesi-the-ecological-crisis-and-the-rise-of-post-fascism?v=1719921075",
          "author": null,
          "description": "Author: Antithesi\nTitle: The Ecological Crisis and the Rise of Post-Fascism\nDate: January 28, 2024\nNotes: Translated into English and posted by Illwill on February 17th, 2024\nSource: Retrieved on March 19th, 2024 from https://illwill.com/antithesi.\n\n The ecological crisis profoundly impacts the material conditions of social reproduction, extending beyond “natural disasters” to encompass a deepening of the contradictions inherent in capitalism. This crisis does not only manifest itself in events like floods, droughts, and pandemics, it also plays a direct role in fueling conflicts, social unrest, and mass displacement. In what follows, we attempt to lay out a comprehensive argument for the connection between the ecological crisis and the rise of what we call the post-fascist current, a poli…",
          "link": "https://theanarchistlibrary.org/library/antithesi-the-ecological-crisis-and-the-rise-of-post-fascism?v=1719921075",
          "publishedOn": "2024-07-02T11:51:15.000Z",
          "wordCount": 5142,
          "title": "Antithesi - The Ecological Crisis and the Rise of Post-Fascism",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "22240",
            "url": "https://theanarchistlibrary.org/library/antithesi-the-ecological-crisis-and-the-rise-of-post-fascism.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/pranay-somayajula-nationhood-beyond-nationalism?v=1719920998",
          "author": null,
          "description": "Author: Pranay Somayajula\nTitle: nationhood beyond nationalism\nSubtitle: towards an anarchist politics of anticolonial liberation\nDate: December 29th, 2023\nSource: Retrieved on March 25th, 2024 from https://www.culture-shock.xyz/p/nationhood-beyond-nationalism.\n\n In its Spring 2001 issue, the Oregon-based magazine Green Anarchy ran an anonymous article with the title: “The EZLN is NOT Anarchist: Or Struggles at the Margins and Revolutionary Solidarity.” Writing from an anarchist perspective, the author advanced a fierce critique of the Zapatista National Liberation Army—the militant anticolonial, anticapitalist Indigenous movement which had led an uprising and established autonomous zones in southern Mexico several years before, and which is often cited by anarchists as an example of a suc…",
          "link": "https://theanarchistlibrary.org/library/pranay-somayajula-nationhood-beyond-nationalism?v=1719920998",
          "publishedOn": "2024-07-02T11:49:58.000Z",
          "wordCount": 2924,
          "title": "Pranay Somayajula - nationhood beyond nationalism",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "10857",
            "url": "https://theanarchistlibrary.org/library/pranay-somayajula-nationhood-beyond-nationalism.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/imanol-blind-spot?v=1719920664",
          "author": null,
          "description": "Author: Imanol\nTitle: Blind Spot\nSubtitle: Manuel Huet and the libertarian underground in France\nDate: 2023\nNotes: Translated by Paul Sharkey from El Angulo Muerto : Manuel Huet y la clandestinidad libertaria en Francia.\nSource: English translation published by the Kate Sharpley Library www.katesharpleylibrary.net\n\n \n \n The Kate Sharpley Library aims to preserve the history of the anarchist movement and record and commemorate the lives of the people who made up the movement. It’s always good to see other people plugging away at the same task. The first translation of a piece by Imanol that we put up was ‘The Massana Gang’ which went in KSL: Bulletin of the Kate Sharpley Library No. 97–98, February 2019. Since then we’ve been glad to host translations of his studies from El Salto which are …",
          "link": "https://theanarchistlibrary.org/library/imanol-blind-spot?v=1719920664",
          "publishedOn": "2024-07-02T11:44:24.000Z",
          "wordCount": 106546,
          "title": "Imanol - Blind Spot",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "316619",
            "url": "https://theanarchistlibrary.org/library/imanol-blind-spot.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/harsha-walia-what-is-border-imperialism?v=1719919583",
          "author": null,
          "description": "Author: Harsha Walia\nTitle: What Is Border Imperialism?\nSubtitle: Excerpt from Undoing Border Imperialism\nDate: 2013\nSource: Undoing Border Imperialism. AK Press / Institute for Anarchist Studies, 2013. Pages 35 to 74.\n\nWhat Is Border Imperialism?\n The world was born yearning to be a home for everyone. \n —Eduardo Galeano, “Through the Looking Glass: Q & A with Eduardo Galeano” \n For the past several years, Indigenous organizations in Australia have been issuing “Original Passports” to asylum seekers who have been detained or denied legal status by the Australian government. Most recently, in May 2012, passports were issued to two detained Tamil asylum seekers. During the ceremony, Ray Jackson of the Indigenous Social Justice Association said, “The Australian Government must stop imprisonin…",
          "link": "https://theanarchistlibrary.org/library/harsha-walia-what-is-border-imperialism?v=1719919583",
          "publishedOn": "2024-07-02T11:26:23.000Z",
          "wordCount": 12162,
          "title": "Harsha Walia - What Is Border Imperialism?",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "45034",
            "url": "https://theanarchistlibrary.org/library/harsha-walia-what-is-border-imperialism.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/frott-bulldoze-sci-rockview?v=1719918854",
          "author": null,
          "description": "Author: Frott\nTitle: Bulldoze SCI Rockview\nSubtitle: Abolition, Prisoner Support, and Resistance to Genocide in PA-DOC\nDate: 4/7/24\nNotes: 4/7/24 The Final Straw Radio — Episode Transcription\nSource: https://ia600308.us.archive.org/5/items/tfsr-202404072024-SCIRockview/Bulldoze-sci-rockview.pdf\n\n Intro SCI Rockview is a prison in central Pennsylvania where incarcerated comrades have been facing repression for demanding justice in the face of impunity by racist COs and following a year of prisoner deaths due to institutional toxicity and guard violence. We speak to an outside supporter about the situation at Rockview, the reactions of administration, inside / outside relationships and solidarity that have flared up. We hope that this conversation contributes to increased and thickened ties …",
          "link": "https://theanarchistlibrary.org/library/frott-bulldoze-sci-rockview?v=1719918854",
          "publishedOn": "2024-07-02T11:14:14.000Z",
          "wordCount": 12105,
          "title": "Frott - Bulldoze SCI Rockview",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "29631",
            "url": "https://theanarchistlibrary.org/library/frott-bulldoze-sci-rockview.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/peter-gelderloos-israel-is-pioneering-new-methods-of-genocide?v=1719918743",
          "author": null,
          "description": "Author: Peter Gelderloos\nTitle: Israel is pioneering new methods of genocide\nSubtitle: Killing by algorithm\nDate: April 16th, 2024\nSource: Retrieved on April 18th, 2024 from https://petergelderloos.substack.com/p/israel-is-pioneering-new-methods.\n\n Israel is making sure it will be remembered in history as a pioneer of genocide. Multiple Israeli military sources have testified that the Israeli military is using AI to guide missile and bomb strikes against Palestinians[1]. If the Israeli military’s Artificial Intelligence determines that a person is a military member of Hamas, the Israeli military will systematically approve of a missile or bomb strike to murder that person and any civilians in the immediate vicinity. \n The AI program used by the IDF, called ‘Lavender,’ can also determine th…",
          "link": "https://theanarchistlibrary.org/library/peter-gelderloos-israel-is-pioneering-new-methods-of-genocide?v=1719918743",
          "publishedOn": "2024-07-02T11:12:23.000Z",
          "wordCount": 1933,
          "title": "Peter Gelderloos - Israel is pioneering new methods of genocide",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "8763",
            "url": "https://theanarchistlibrary.org/library/peter-gelderloos-israel-is-pioneering-new-methods-of-genocide.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/loren-goldner-the-spanish-revolution-past-and-future-grandeur-and-poverty-of-anarchism?v=1719918699",
          "author": null,
          "description": "Author: Loren Goldner\nTitle: The Spanish Revolution, Past and Future: Grandeur and Poverty of Anarchism\nSubtitle: How the Working Class Takes Over (or Doesn’t), Then and Now\nDate: 2013\nSource: Retrieved on April 19th, 2024 from <breaktheirhaughtypower.org/the-spanish-revolution-past-and-future-grandeur-and-poverty-of-anarchism-how-the-working-class-takes-over-or-doesnt-then-and-now>.\n\nIntroduction: Why the Spanish Revolution Today?\n “…anarchism and revolutionary syndicalism in general lacked a vision of the problems of political orientation, without which the most powerful and most heroic revolutionary surge is condemned to failure.” — Helmut Rüdiger, AIT, Ensayo critico sobre la revolucion española (1940)[1]\n For many years, I had held the classical left anti-Stalinist view that after the…",
          "link": "https://theanarchistlibrary.org/library/loren-goldner-the-spanish-revolution-past-and-future-grandeur-and-poverty-of-anarchism?v=1719918699",
          "publishedOn": "2024-07-02T11:11:39.000Z",
          "wordCount": 15608,
          "title": "Loren Goldner - The Spanish Revolution, Past and Future: Grandeur and Poverty of Anarchism",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "51587",
            "url": "https://theanarchistlibrary.org/library/loren-goldner-the-spanish-revolution-past-and-future-grandeur-and-poverty-of-anarchism.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/red-mutualism-series-at-mutualism-co-op?v=1719918555",
          "author": null,
          "description": "Author: Eric Fleischmann\nTitle: “Red Mutualism” Series at Mutualism Co-Op\nDate: April 23rd, 2024\nSource: Retrieved 4/25/2024 from https://c4ss.org/content/59582.\n\n If there are two contemporary anarchist theorists whose work occupies and influences my thought the most, they are Kevin Carson and Wayne Price. Carson has spent a huge segment of his career not just reconstructing a mutualist political economy as an alternative to the anarchist default to the economics of Karl Marx but also making incredibly original contributions to the fields of decentralized technology/production and spontaneous organization theory. Wayne Price in turn has dedicated his mind to a task that at first seems wholly opposite to Carson’s: working to adapt Marxist economics and political strategy to an anarchist co…",
          "link": "https://theanarchistlibrary.org/library/red-mutualism-series-at-mutualism-co-op?v=1719918555",
          "publishedOn": "2024-07-02T11:09:15.000Z",
          "wordCount": 1091,
          "title": "Eric Fleischmann - “Red Mutualism” Series at Mutualism Co-Op",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6607",
            "url": "https://theanarchistlibrary.org/library/red-mutualism-series-at-mutualism-co-op.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anonymous-crimethinc-campus-building-occupations-2008-2010-and-today?v=1719918476",
          "author": null,
          "description": "Author: Anonymous, CrimethInc.\nTitle: Campus Building Occupations, 2008–2010 and Today\nDate: April 22 2024\nSource: Retrieved on April 25th 2024 from <crimethinc.com/2024/04/22/campus-building-occupations-from-2008-2010-to-today>\n\n A wave of campus building occupations took place in response to austerity measures following the recession of 2008. As today’s Gaza solidarity movement begins to experiment with encampments and building occupations, it could be instructive to learn from the previous generation of student activists. \n On April 22, 2024, inspired by the resilience of the Gaza solidarity encampment at Columbia University and other demonstrators around the country, students at Cal Poly Humboldt in Arcata, California occupied Siemens Hall. This represented the first confrontational bu…",
          "link": "https://theanarchistlibrary.org/library/anonymous-crimethinc-campus-building-occupations-2008-2010-and-today?v=1719918476",
          "publishedOn": "2024-07-02T11:07:56.000Z",
          "wordCount": 6052,
          "title": "Anonymous, CrimethInc. - Campus Building Occupations, 2008–2010 and Today",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "24793",
            "url": "https://theanarchistlibrary.org/library/anonymous-crimethinc-campus-building-occupations-2008-2010-and-today.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anonymous-crimethinc-it-is-an-honor-to-be-suspended-for-palestine?v=1719918373",
          "author": null,
          "description": "Author: Anonymous, CrimethInc.\nTitle: “It Is an Honor to Be Suspended for Palestine”\nSubtitle: Dispatches from the Solidarity Encampment at Columbia University\nDate: April 21 2024\nSource: Retrieved on April 25th 2024 from https://crimethinc.com/2024/04/21/it-is-an-honor-to-be-suspended-for-palestine-dispatches-from-the-solidarity-encampment-at-columbia-university\n\n On April 17, students at Columbia University and Barnard College set up an encampment in solidarity with Palestinians facing genocide at the hands of the Israeli military. On April 18, the university administration brought in massive numbers of police to arrest the demonstrators and crush the encampment; yet in response, students established a new encampment, bigger than the first, inspiring copycat actions from Yale to St. Loui…",
          "link": "https://theanarchistlibrary.org/library/anonymous-crimethinc-it-is-an-honor-to-be-suspended-for-palestine?v=1719918373",
          "publishedOn": "2024-07-02T11:06:13.000Z",
          "wordCount": 9099,
          "title": "Anonymous, CrimethInc. - “It Is an Honor to Be Suspended for Palestine”",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "33589",
            "url": "https://theanarchistlibrary.org/library/anonymous-crimethinc-it-is-an-honor-to-be-suspended-for-palestine.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/marginal-ontologies?v=1719917880",
          "author": null,
          "description": "Author: Angie Barbosa\nTitle: Marginal Ontologies\nSubtitle: Challenges of a Transfeminist Anarchism\nDate: 08.03.2023\nNotes: Translation by Cello Latini Pfeil [mltpfeil@gmail.com]\nSource: Original translation of “Ontologias Marginais: Desafios de um Anarquismo Transfeminista”. Retrieved on 04.28.2024 from https://revistatapuia.com.br/ojs/index.php/revista/article/view/29/19\n\nAbstract\n In this text, written as a speech for the 1st Anarchist Fair in Rio de Janeiro, contradictions of the historically predatory relationship of brazilian democracy with brazilian travestis and transsexuals are presented, paying attention to the ontological marginality of the travesti body under the capitalist patriarchy of white supremacy. Based on this reflection, transfeminist challenges to radical and anarchist…",
          "link": "https://theanarchistlibrary.org/library/marginal-ontologies?v=1719917880",
          "publishedOn": "2024-07-02T10:58:00.000Z",
          "wordCount": 7097,
          "title": "Angie Barbosa - Marginal Ontologies",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "25713",
            "url": "https://theanarchistlibrary.org/library/marginal-ontologies.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/mother-earth-if-we-must-fight-let-it-be-for-the-social-revolution?v=1719917731",
          "author": null,
          "description": "Author: Mother Earth\nTitle: If We Must Fight, Let It Be For The Social Revolution\nDate: 1914\nNotes: From “Mother Earth”, October 1914, New York City, published by Emma Goldman, edited by Alexander Berkman\n\n Society has plunged into a world-wide war, but we Anarchists, we cannot shed tears over its horrors, as do the Socialists and other so-called philanthropists. WE KNOW how industriously those same weepers have been piling up the fuel which made this conflagration certain. \n Governments have made this war. The Austrian government ordered its slaves to sweep Servia with fire and sword. The German government snapped its fingers at the four million and odd Socialist voters, and ordered its slaves to invade Belgium. The American government with hypocritical sobs and sighs, ordered its slaves …",
          "link": "https://theanarchistlibrary.org/library/mother-earth-if-we-must-fight-let-it-be-for-the-social-revolution?v=1719917731",
          "publishedOn": "2024-07-02T10:55:31.000Z",
          "wordCount": 2209,
          "title": "Mother Earth - If We Must Fight, Let It Be For The Social Revolution",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "8778",
            "url": "https://theanarchistlibrary.org/library/mother-earth-if-we-must-fight-let-it-be-for-the-social-revolution.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}