{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": []
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": []
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps & Developer Productivity Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": []
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "16e90ff8cb5363cf2d70b6dd873e01b284520e09",
          "author": "pmm",
          "description": "Introduction In 2020, AWS announced Bottlerocket, an open source, container-optimized Linux distribution designed for hosting containers. Each Bottlerocket image, known as a variant, is specialized for a specific combination of container orchestrator and cloud environment. Bottlerocket variants are provided to users as a set of Amazon Machine Images (AMI), currently optimized for either Amazon Elastic Container […]",
          "link": "https://aws.amazon.com/blogs/containers/announcing-bottlerocket-fips-variants/",
          "publishedOn": "2024-12-26T16:51:51.000Z",
          "wordCount": 1461,
          "title": "Announcing Bottlerocket FIPS variants",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/12/26/Featured-images-for-Containers-Blog-1-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=348069",
          "author": "Michael Schwalbe",
          "description": "Civil discourse is preferable to the alternatives of coerced silence and violence. Coerced silence means that one side has exercised power to end conversation—to say, in effect, there is no point in further discussion; be quiet and accept that our desires will prevail. Violence means that reason has failed and we are reduced to the condition of resolving disputes by means of fang and claw, rock and club, bullet and bomb. More\nThe post Civil Discourse in a Time of Genocide appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/civil-discourse-in-a-time-of-genocide/",
          "publishedOn": "2024-12-27T07:03:54.000Z",
          "wordCount": null,
          "title": "Civil Discourse in a Time of Genocide",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347882",
          "author": "Jeffrey St. Clair",
          "description": "For nearly two days, the NYPD covered up the fact that one of their officers had fired a gun inside Hind Hall, while they were arresting students. Ultimately, the shooting was only revealed by the New York City DA's office. If you call in the NYPD, you can pretty much guarantee there will be bang-bang...Is there any doubt now that the NYPD raid did more damage to the buildings at Columbia than the students? The people who invited these cops on their campus should never be guardians of students again. More\nThe post The Sound of da Police: the Year Criminal Injustice appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/the-sound-of-da-police-the-year-criminal-injustice/",
          "publishedOn": "2024-12-27T06:59:11.000Z",
          "wordCount": null,
          "title": "The Sound of da Police: the Year Criminal Injustice",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348067",
          "author": "John K. White",
          "description": "One can be excused for worrying over what tomorrow might bring as expanded battle lines are redrawn across the globe, the world’s wealthiest nation ever consumes itself in a cataclysm of partisan hate amid a growing digital reformation, and unchecked carbon emissions continue to cause more environmental disaster by the day. Will nuclear conflict, machine control, or climate breakdown ultimately destroy our pale blue dot of a planet or is it all just more apocalyptic blather that never comes to pass? More\nThe post The End Days? World War, Tech Takeover, and Global Warming appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/the-end-days-world-war-tech-takeover-and-global-warming/",
          "publishedOn": "2024-12-27T06:57:59.000Z",
          "wordCount": null,
          "title": "The End Days? World War, Tech Takeover, and Global Warming",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348095",
          "author": "Joshua Frank",
          "description": "I’m not a big fan of these “best of” lists, but of all the new(ish) arts entertainment (or edutainment, as KRS-One would say) I consumed these past twelve months, here’s what helped me most in surviving (and contemplating) the relentless horrors of 2024. FILMS No Other Land, co-directed by Basel Adra, Hamdan Ballal, Yuval Abraham, and  More\nThe post My Favorites of 2024 appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/my-favorites-of-2024/",
          "publishedOn": "2024-12-27T06:57:33.000Z",
          "wordCount": null,
          "title": "My Favorites of 2024",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348087",
          "author": "Robert Hunziker",
          "description": "Major portions of the Arabian Peninsula are already exceeding 2°C above pre-industrial and likely headed for a staggering temperature rise over coming decades. This disturbing news comes via a major new study by Saudi Arabia’s most prestigious university. The epicenter of world oil & gas production is in direct line of fire of unnerving acceleration  More\nThe post The Leading Edge of Global Heat – Arabian Peninsula appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/the-leading-edge-of-global-heat-arabian-peninsula/",
          "publishedOn": "2024-12-27T06:56:40.000Z",
          "wordCount": null,
          "title": "The Leading Edge of Global Heat – Arabian Peninsula",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348153",
          "author": "Binoy Kampmark",
          "description": "Mining magnates seem to have it all.  Far more significant than royalty, such figures are the unelected captains of industry who know that governments will do whatever they can to accommodate their wishes and whims.  True, the official rhetoric might sometimes be sharp and seemingly at odds, especially when it comes to that great irritation known as  More\nThe post Jesting on the Environment: Australian Mining Gets a Present appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/jesting-on-the-environment-australian-mining-gets-a-present/",
          "publishedOn": "2024-12-27T06:56:05.000Z",
          "wordCount": null,
          "title": "Jesting on the Environment: Australian Mining Gets a Present",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348117",
          "author": "Paul Street",
          "description": "New York Times columnist Bret Stephens recently published a widely read opinion piece claiming that Brian Thompson, the United Health Group insurance CEO that Luigi Mangione assassinated, is the “real working-class hero” in the story of Thompson’s murder. By Stephen’s reckoning, Thompson and not Mangione deserves the label because the murder victim came from a  More\nThe post It’s Not About What Class You’re From: It’s About What Class System You Serve appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/its-not-about-what-class-your-from-its-about-what-class-system-you-serve/",
          "publishedOn": "2024-12-27T06:55:57.000Z",
          "wordCount": null,
          "title": "It’s Not About What Class You’re From: It’s About What Class System You Serve",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348021",
          "author": "Daniel Warner",
          "description": "Donald Trump and the Marlboro Man are case studies of branding success. When Philip Morris introduced the cowboy on its ads in 1955, sales were at $5 billion. Two years later, sales were at $20 billion. Ellen Merlo, the vice president of marketing services at Philip Morris, described the cowboy image as “very rugged, individualistic, heroic.” Rugged and individualistic is exactly the image Trump tries to portray. Why else go to WWE Raw events or a college football game? How else to describe his raised fist cry “Fight, fight, fight,” when struck by a bullet during an assassination attempt. Trump’s mythological image has helped him to be re-elected president despite (because of) twice being impeached and convicted of 34 felony accounts. The Marlboro Man and Trump’s image portrayal are fundamental to the American mythology of the pioneer spirit exploring new frontiers which now includes the popular success of tech start-up heroes like Elon Musk. More\nThe post Trump, the Marlboro Man and the New Frontier appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/trump-the-marlboro-man-and-the-new-frontier/",
          "publishedOn": "2024-12-27T06:55:37.000Z",
          "wordCount": null,
          "title": "Trump, the Marlboro Man and the New Frontier",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348172",
          "author": "Kim C. Domenico",
          "description": "Life is not possible without an opening to the transcendent; in other words, human beings cannot live in chaos.  Once contact with the transcendent is lost, existence in the world ceases to be possible. –Mircea Eliade, quoted in The Cross and the Lynching Tree, by James Cone In Hinduism, the term Kali Yuga refers to the last of four  More\nThe post Arrested Grief: Liberal America’s Moral Problem? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/arrested-grief-liberal-americas-moral-problem/",
          "publishedOn": "2024-12-27T06:55:19.000Z",
          "wordCount": null,
          "title": "Arrested Grief: Liberal America’s Moral Problem?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348151",
          "author": "Stewart Lawrence",
          "description": "What do Tiger Woods, Michael Jordan, Charles Barkley and Floyd Mayweather, Jr. have in common? They’re all sports superstars, of course. But they’re also something else: Hard-core gambling addicts. Mayweather, Jr. regularly gambles as much as $400,000 on college football games. He reportedly once won $3 million on a single Orange Bowl contest. But his biggest bet  More\nThe post America’s Invisible Sports Betting Epidemic appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/americas-invisible-sports-betting-epidemic/",
          "publishedOn": "2024-12-27T06:55:15.000Z",
          "wordCount": null,
          "title": "America’s Invisible Sports Betting Epidemic",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348176",
          "author": "Roger D. Harris - John Perry",
          "description": "The progressive regional current, the “Pink Tide,” could be better called “troubled waters” in 2024. The tide had already slackened by 2023 compared to its rise in 2022, when it was buoyed by big wins in Colombia and Brazil. Then, progressive alternatives had sailed into power replacing failed neoliberal policies. Since, they have had to  More\nThe post What’s Left in Latin American and the Caribbean: Year 2024 in Review  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/whats-left-in-latin-american-and-the-caribbean-year-2024-in-review/",
          "publishedOn": "2024-12-27T06:55:02.000Z",
          "wordCount": null,
          "title": "What’s Left in Latin American and the Caribbean: Year 2024 in Review",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348180",
          "author": "Howard Lisnoff",
          "description": "As a Jew in a Catholic college, one of two Jewish students in my class, I had to take lots of philosophy. My motivation for going to this particular school was the high school teachers I admired who had graduated from there and the academic major I wanted to study. The school also had a  More\nThe post A Little Learning Is Not Such a Dangerous Thing appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/a-little-learning-is-not-such-a-dangerous-thing/",
          "publishedOn": "2024-12-27T06:54:27.000Z",
          "wordCount": null,
          "title": "A Little Learning Is Not Such a Dangerous Thing",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347986",
          "author": "M. Reza Behnam",
          "description": "In these difficult times, the voice of the late Palestinian-American scholar, Edward Said is ever present, “Writing is the final resistance we have against the inhuman practices and injustices that disfigure human history.” For more than fourteen painful months Israel has passed off its inhuman actions against the people of Gaza as “defensive.” We are  More\nThe post Deception and Politics From Washington to Tel Aviv                               appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/deception-and-politics-from-washington-to-tel-aviv/",
          "publishedOn": "2024-12-27T06:54:02.000Z",
          "wordCount": null,
          "title": "Deception and Politics From Washington to Tel Aviv",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348106",
          "author": "Norman Solomon",
          "description": "This week, the New York Times reported that the U.S. government made war in Afghanistan while helping to “recruit, train and pay for lawless bands of militias that pillaged homes and laid waste to entire communities.” Those militias “tortured civilians, kidnapped for ransom, massacred dozens in vendetta killings and razed entire villages, sowing more than  More\nThe post Afghanistan: Now It Can Be Told . . . After All the Harm Has Been Done appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/afghanistan-now-it-can-be-told-after-all-the-harm-has-been-done/",
          "publishedOn": "2024-12-27T06:53:50.000Z",
          "wordCount": null,
          "title": "Afghanistan: Now It Can Be Told . . . After All the Harm Has Been Done",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348147",
          "author": "W. T. Whitney",
          "description": "Cubans numbering hundreds of thousands marched on December 20 along Havana’s emblematic Malecon roadway fronting the Florida Straits. (See photos and video here.)  President Miguel Díaz Canel and former President Raul Castro took the lead in a massive protest against stepped-up U.S. efforts to immiserate Cubans and bring down their socialist government. Earlier that day, President Díaz-Canel addressed this year’s closing session of Cuba’s  More\nThe post Militant Still, Cubans March Against US Blockade and Hybrid War   appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/militant-still-cubans-march-against-us-blockade-and-hybrid-war/",
          "publishedOn": "2024-12-27T06:53:35.000Z",
          "wordCount": null,
          "title": "Militant Still, Cubans March Against US Blockade and Hybrid War",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348079",
          "author": "Diana Block",
          "description": "I can remember clearly the rush of joy I felt when I heard the almost unbelievable news that the last three members of the Cuban 5, Gerardo Hernández, Antonio Guerrero, and Ramón Labañino, had landed in Havana on December 17th, 2014 after sixteen years of unjust incarceration in U.S. prisons. (The other two members of  More\nThe post The Cuban Five Victory: Reflections Ten Years Later appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/the-cuban-five-victory-reflections-ten-years-later/",
          "publishedOn": "2024-12-27T06:53:15.000Z",
          "wordCount": null,
          "title": "The Cuban Five Victory: Reflections Ten Years Later",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348076",
          "author": "Eve Ottenberg",
          "description": "As inflation ravages the West, Europeans are told by NATO chieftain Mark Rutte to sacrifice more for the glorious cause of tyranny in Ukraine. Pensions must be trimmed, inflation accepted and any other social benefits put on the chopping block. What, you may ask, is the logic here? Well, there isn’t any, unless Rutte believes  More\nThe post Sacrificing Living Standards for War appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/sacrificing-living-standards-for-war/",
          "publishedOn": "2024-12-27T06:53:14.000Z",
          "wordCount": null,
          "title": "Sacrificing Living Standards for War",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348098",
          "author": "Matthew Stevenson",
          "description": "This is the sixth part in a series about riding night trains across Europe and the Near East to Armenia — to spend some time in worlds beyond the pathological obsessions of President-elect Donald Trump. (This week Trump devoted himself to Lébensraum: planting the American flag in Canada, Greenland, and Panama.) Perhaps my favorite one-volume  More\nThe post Reading Napoleon in Vienna appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/348098/",
          "publishedOn": "2024-12-27T06:52:48.000Z",
          "wordCount": null,
          "title": "Reading Napoleon in Vienna",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348183",
          "author": "B. Nimri Aziz",
          "description": "Does Uhuru, ‘freedom’ in Swahili, apply in the United States? It depends. It depends on how the First Amendment is interpreted; it depends on how cunningly the term terrorism is applied in these tenuous fearsome times; it depends on how determinedly people fight to protect and restore their democracy. Doubtless, a few institutions committed to  More\nThe post Freedom with a Caveat appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/freedom-with-a-caveat/",
          "publishedOn": "2024-12-27T06:51:13.000Z",
          "wordCount": null,
          "title": "Freedom with a Caveat",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348020",
          "author": "Michael Zoosman",
          "description": "This year, the Jewish and Christian winter holidays are in cosmic synchrony. The evening of Dec. 25 — Christmas Day on the Gregorian calendar — falls on the 25th day of the Hebrew month of Kislev — the first night of Hanukkah on the lunar calendar. These popular festivals in turn align with the very  More\nThe post Will Biden Become Another Pontius Pilate This Holiday Season? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/will-biden-become-another-pontius-pilate-this-holiday-season/",
          "publishedOn": "2024-12-27T06:50:33.000Z",
          "wordCount": null,
          "title": "Will Biden Become Another Pontius Pilate This Holiday Season?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348175",
          "author": "Sarah Hyden",
          "description": "I walk almost daily up into the Santa Fe National Forest along with neighbors and our dogs, and I am always reminded how fortunate we are to have a relatively natural and beautiful forest just outside of Santa Fe. All the forests of the Southwest and across the West are critically important to the planet,  More\nThe post Appreciating Forests appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/appreciating-forests/",
          "publishedOn": "2024-12-27T06:45:05.000Z",
          "wordCount": null,
          "title": "Appreciating Forests",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348149",
          "author": "Jonah Raskin",
          "description": "Born on the West Coast, educated at Cal, and now at the helm at Berkeley’s Heyday Books, Steve Wasserman has crafted a name and a career for himself over the past several decades as a polemical writer, brilliant editor, savvy publisher and as an (aging) enfant terrible who has declared cultural war on Berkeley, on  More\nThe post Steve Wasserman: Berzerkeley Heretic appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/steve-wasserman-berzerkeley-heretic/",
          "publishedOn": "2024-12-27T06:44:09.000Z",
          "wordCount": null,
          "title": "Steve Wasserman: Berzerkeley Heretic",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348090",
          "author": "David Carrier",
          "description": "Visual art is the the artistic medium most directly associated with money. A successful writer or composer may become financially successful. And a famous actor is usually well paid. But the painting that becomes famous goes, in many cases, from being a low priced community when it is made to a well guarded luxury good,  More\nThe post Art and Money appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/art-and-money/",
          "publishedOn": "2024-12-27T06:39:29.000Z",
          "wordCount": null,
          "title": "Art and Money",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348032",
          "author": "Mitchel Cohen",
          "description": "On the Saturday before Christmas, I accompanied my young aide (from Haiti) to the NY Metropolitan Museum of Art — The Met. I used to go every once-in-a-while, especially while Carl Lesnor was still alive since he lived right nearby, but I hadn’t been to the museum for four or five years. Manhattan’s streets were  More\nThe post Diary Entry: Visiting the Met, and Swastika Info appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/diary-entry-visiting-the-met-and-swastika-info/",
          "publishedOn": "2024-12-27T06:38:35.000Z",
          "wordCount": null,
          "title": "Diary Entry: Visiting the Met, and Swastika Info",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348102",
          "author": "Seth Sandronsky",
          "description": "Mental health services are crucial to our well-being. I think that most people will agree with me. As I write, mental health workers employed at Kaiser Permanente in Southern California and represented by the National Union of Healthcare Workers are beginning month three of a strike over work conditions. As these workers see it, their  More\nThe post Reflecting On Kaiser’s Mental Health Services appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/reflecting-on-kaisers-mental-health-services/",
          "publishedOn": "2024-12-27T06:31:50.000Z",
          "wordCount": null,
          "title": "Reflecting On Kaiser’s Mental Health Services",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348092",
          "author": "Ron Jacobs",
          "description": "To most people who read or otherwise consume western media, the fall of the Assad government in Syria was unusually quick and even surprising. For most of this demographic, it seemed that Assad and his rule was fairly stable, albeit somewhat ruthless. Unknown by most, however, was that the relentless attacks by Israeli and US  More\nThe post Syria After Assad appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/syria-after-assad/",
          "publishedOn": "2024-12-27T06:22:13.000Z",
          "wordCount": null,
          "title": "Syria After Assad",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348119",
          "author": "Robert Koehler",
          "description": "Dig, ponder, dig some more. A year ago I wrote a column about some of the early moments of my growing up – not just memories but profound moments of awareness; flickers, you might say, of becoming who I am. I was 77 at the time. Now I’m . . . oh yeah, 78. Can you  More\nThe post Growing Up Means Claiming Your Own Mind appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/growing-up-means-claiming-your-own-mind/",
          "publishedOn": "2024-12-27T06:20:02.000Z",
          "wordCount": null,
          "title": "Growing Up Means Claiming Your Own Mind",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348140",
          "author": "Nicky Reid",
          "description": "I’ve been closely following the labyrinthine chaos in the Levant for most of my adult life now and I honestly didn’t see this latest twist coming, at least not this fast and certainly not this soon. After surviving nearly half a century on Uncle Sam’s shitlist and nearly 14 years in a turbulent proxy war  More\nThe post A Few Lessons that Anti-Imperialists Should Learn from the Collapse of Assad appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/a-few-lessons-that-anti-imperialists-should-learn-from-the-collapse-of-assad/",
          "publishedOn": "2024-12-27T06:16:01.000Z",
          "wordCount": null,
          "title": "A Few Lessons that Anti-Imperialists Should Learn from the Collapse of Assad",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347966",
          "author": "Alfred W. McCoy",
          "description": "Since the Cold War ended in 1990, four legacy empires — those of China, France, Russia, and the United States — have exercised an undue influence over almost every aspect of international affairs. From the soft power of fashion, food, and sports to the hard power of arms, trade, and technology, those four powers have, each in its own way, helped to set the global agenda for the past 35 years. By dominating vast foreign territories, both militarily and economically, they have also enjoyed extraordinary wealth and a standard of living that’s been the envy of the rest of the world. If they now give way in a collective version of collapse, instead of one succeeding another, we may come to know a new world order whose shape is as yet unimaginable. More\nThe post The Rise of Trump, the Fall of Imperial America appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/26/the-rise-of-trump-the-fall-of-imperial-america/",
          "publishedOn": "2024-12-26T06:57:43.000Z",
          "wordCount": null,
          "title": "The Rise of Trump, the Fall of Imperial America",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347952",
          "author": "Mike Ferner",
          "description": "In Ft. Wayne, Indiana, this September, I was arrested with a long-time activist friend, Cliff Kindy, for blocking the entrance to a Raytheon Corp. facility.  We both requested jury trials and the dates were set for mid-December and early January. Prosecutors dropped the charges in each case and the trials did not happen. For my  More\nThe post Bringing Gaza Home appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/26/bringing-gaza-home/",
          "publishedOn": "2024-12-26T06:56:33.000Z",
          "wordCount": null,
          "title": "Bringing Gaza Home",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=284623",
          "author": "Yves Smith",
          "description": "Our agitating daily links: Milan smoking ban, Covid causes autism? China dam in Tibet, Gaza children freeze, moar Azerbaijan crash, Luttwak on Syria, no paper passports? MAGA v. Musk on H-1Bs, CNN loses viewers, bad AI muzak, Mangione's bad lockup, global fertility trade",
          "link": "https://www.nakedcapitalism.com/2024/12/links-12-28-2024.html",
          "publishedOn": "2024-12-28T11:55:09.000Z",
          "wordCount": 4424,
          "title": "Links 12/28/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/00-Squirrel_at_Wollaton.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284707",
          "author": "Yves Smith",
          "description": "Why neoliberalism is a major cause of mental health problems.",
          "link": "https://www.nakedcapitalism.com/2024/12/why-do-we-have-a-mental-health-crisis.html",
          "publishedOn": "2024-12-28T11:54:11.000Z",
          "wordCount": 3612,
          "title": "Why Do We have a Mental Health Crisis?",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284709",
          "author": "Yves Smith",
          "description": "Are nature schools an old answer to new childrearing and education challenges?",
          "link": "https://www.nakedcapitalism.com/2024/12/enrollment-in-nature-schools-soars-as-families-rediscover-the-benefits-of-outdoor-learning.html",
          "publishedOn": "2024-12-28T11:50:33.000Z",
          "wordCount": 3616,
          "title": "Enrollment in Nature Schools Soars as Families Rediscover the Benefits of Outdoor Learning",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284666",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics:  MAGA eviscerates the Tech Bros on immigration; Mangione family investments  in health care (not pretty); New Covid charts  ~",
          "link": "https://www.nakedcapitalism.com/2024/12/200pm-water-cooler-12-27-2024.html",
          "publishedOn": "2024-12-27T19:00:51.000Z",
          "wordCount": 16276,
          "title": "2:00PM Water Cooler 12/27/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/vivek.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284651",
          "author": "Lambert Strether",
          "description": "Our lionized daily links",
          "link": "https://www.nakedcapitalism.com/2024/12/links-12-27-2024.html",
          "publishedOn": "2024-12-27T11:58:23.000Z",
          "wordCount": 15074,
          "title": "Links 12/27/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/lion_serengeti.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284645",
          "author": "Conor Gallagher",
          "description": "The DOJ case against RealPage for orchestrating a rental housing price-fixing cartel will tell us a lot about the economic direction of Trump 2.0.",
          "link": "https://www.nakedcapitalism.com/2024/12/will-trump-take-on-the-housing-cartels.html",
          "publishedOn": "2024-12-27T11:00:21.000Z",
          "wordCount": 8781,
          "title": "Will Trump Take On the Housing Cartels?",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284661",
          "author": "Yves Smith",
          "description": "A look at the information so far and finger-pointing about the Azerbaijan plane crash.",
          "link": "https://www.nakedcapitalism.com/2024/12/ukraines-reckless-drone-attacks-are-responsible-for-the-azerbaijan-airlines-tragedy.html",
          "publishedOn": "2024-12-27T10:45:15.000Z",
          "wordCount": 8308,
          "title": "Ukraine’s Reckless Drone Attacks Are Responsible for the Azerbaijan Airlines Tragedy",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/00-Azerbaijan.webp"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284627",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics; What happens if the House fails to elect a new Speaker quickly? Justice Department is conflicted on Mangione prosecution; A \"silent\" Covid surge? Making your garden safe for robins in the winter ~",
          "link": "https://www.nakedcapitalism.com/2024/12/200pm-water-cooler-12-26-2024.html",
          "publishedOn": "2024-12-26T19:00:06.000Z",
          "wordCount": 12901,
          "title": "2:00PM Water Cooler 12/26/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/kamala_teamsters.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284610",
          "author": "Lambert Strether",
          "description": "Our post-Christmas daily links",
          "link": "https://www.nakedcapitalism.com/2024/12/links-12-26-2024.html",
          "publishedOn": "2024-12-26T11:58:13.000Z",
          "wordCount": 16226,
          "title": "Links 12/26/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/strolling_reindeer.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284608",
          "author": "Yves Smith",
          "description": "Is Trump's hostile takeover of the Republican party part of a political realignment, or just jousting among plutocrats?",
          "link": "https://www.nakedcapitalism.com/2024/12/trump-and-political-realignment-twirling-toward-freedom.html",
          "publishedOn": "2024-12-26T11:54:55.000Z",
          "wordCount": 15473,
          "title": "Trump and Political Realignment: Twirling Toward Freedom?",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "4Xek2BRcXVKNsI4vCa3Zuj",
          "author": "Thibault Meunier",
          "description": "If you want to know what cache revalidation is, how it works, and why it can involve rolling a die, read on. This blog post presents a lock-free probabilistic approach to cache revalidation, along",
          "link": "https://blog.cloudflare.com/sometimes-i-cache/",
          "publishedOn": "2024-12-26T14:00:00.000Z",
          "wordCount": 2952,
          "title": "Sometimes I cache: implementing lock-free probabilistic caching",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3IAq3KKuEXijAkIY8E3rgU/b0aa6e8f62c10cd392fa858fcb849169/BLOG-2639_OGa.png"
        },
        {
          "id": "6OAfYNDjjJBccE1gFIVrnu",
          "author": "Taylor Smith",
          "description": "How I used Workers AI to translate Cloudflare Stream’s auto-generated captions and what I learned along the way.",
          "link": "https://blog.cloudflare.com/un-experimento-rapido-translating-cloudflare-stream-captions-with-workers-ai/",
          "publishedOn": "2024-12-24T14:00:00.000Z",
          "wordCount": 2565,
          "title": "Un experimento rápido: translating Cloudflare Stream captions with Workers AI",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/1jxmEMtgmRjqJZ3yvlLlas/af6f9f70fa96b9594e09d412f79be3e0/Un_experimento_ra_pido-_translating_Cloudflare_Stream_captions_with_Workers_AI-OG.png"
        },
        {
          "id": "5hrEiGd7frxGgAirAdHCM0",
          "author": "João Tomé",
          "description": "From Christmas Eve dinners in Europe to New Year’s Eve countdowns in Asia, Cloudflare data reveals how global festivities have typically shaped Internet usage and cultural rhythms",
          "link": "https://blog.cloudflare.com/when-the-world-logs-off-christmas-new-years-and-the-internets-holiday-rhythm/",
          "publishedOn": "2024-12-24T10:00:00.000Z",
          "wordCount": 2936,
          "title": "When the world logs off: Christmas, New Year’s, and the Internet’s holiday rhythm",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/5AD4eKfR9SW5z1OGQzVTOe/7b13add7b0a6c1143aaf749d4ef68bb7/When_the_world_logs_off-_Christmas__New_Year_s__and_the_Internet_s_holiday_rhythm-OG.png"
        },
        {
          "id": "5yiWFM9NumXY8HARoEP8x6",
          "author": "Avi Jaisinghani",
          "description": "Cloudflare observed a 4x increase in bot-related traffic on Black Friday in 2024. 29% of all traffic on our network on Black Friday was Grinch Bots wreaking holiday havoc.",
          "link": "https://blog.cloudflare.com/grinch-bot-2024/",
          "publishedOn": "2024-12-23T14:01:00.000Z",
          "wordCount": 2036,
          "title": "Grinch Bots strike again: defending your holidays from cyber threats",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/ojlVeSywa5FwEy5uaXWvN/9c04b8e954f32c984a9956c2298fda2b/Grinch_Bots_strike_again-_defending_your_holidays_from_cyber_threats-OG.png"
        },
        {
          "id": "20PQRE3QVidqRIeb9OYby8",
          "author": "João Tomé",
          "description": "In 2024, as elections took place across over 60 countries, the Internet became both a battleground for cyberattacks and a vital platform for democratic engagement.",
          "link": "https://blog.cloudflare.com/elections-2024-internet/",
          "publishedOn": "2024-12-23T14:00:00.000Z",
          "wordCount": 3054,
          "title": "Global elections in 2024: Internet traffic and cyber threat trends",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/7e7RgUK4mC3F5W5nFyQdrC/a9735efab89d42719a621269abbb2dac/Global_elections_in_2024-_Internet_traffic_and_cyber_threat_trends-OG.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Engineering at Slack",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": []
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=42522209",
          "author": "paxys",
          "description": "I don't understand why they are spending so much time and effort trying to put a positive spin on this whole for-profit thing. No one is buying it. We all know what's going on. Just say \"we want to make lots of money\" and move on with your lives.",
          "link": "https://news.ycombinator.com/item?id=42522209",
          "publishedOn": "2024-12-27T14:17:28.000Z",
          "wordCount": null,
          "title": "New comment by paxys in \"Why OpenAI's Structure Must Evolve to Advance Our Mission\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42517852",
          "author": "mitchellh",
          "description": "https://mitchellh.com/writing/ghostty-1-0-reflection",
          "link": "https://news.ycombinator.com/item?id=42517852",
          "publishedOn": "2024-12-26T21:12:10.000Z",
          "wordCount": 6756,
          "title": "New comment by mitchellh in \"Ghostty 1.0\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42511276",
          "author": "K0nserv",
          "description": "I've been thinking about the notion of \"reasoning locally\" recently. Enabling local reasoning is the only way to scale software development past some number of lines or complexity. When reasoning locally, one only needs to understand a small subset, hundreds of lines, to safely make changes in programs comprising millions.\nI find types helps massively with this. A function with well-constrained inputs and outputs is easy to reason about. One does not have to look at other code to do it. However, programs that leverage types effectively are sometimes construed as having high cognitive load, when it in fact they have low load. For example a type like `Option>` carries a lot of information(has low load): we might not have a set of user ids, but if we do they are unique.\nThe discourse around small functions and the clean code guidelines is fascinating. The complaint is usually, as in this post, that having to go read all the small functions adds cognitive load and makes reading the code harder. Proponents of small functions argue that you don't have to read more than the signature and name of a function to understand what it does; it's obvious what a function called last that takes a list and returns an optional value does. If someone feels compelled to read every function either the functions are poor abstractions or the reader has trust issues, which may be warranted. Of course, all abstractions are leaky, but perhaps some initial trust in `last` is warranted.",
          "link": "https://news.ycombinator.com/item?id=42511276",
          "publishedOn": "2024-12-25T21:26:35.000Z",
          "wordCount": 19239,
          "title": "New comment by K0nserv in \"Cognitive load is what matters\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42507005",
          "author": "delibaltas",
          "description": "Christmas of 1981 in Athens, Greece. I was 15. Father had died 3 years ago from heart attack at 42. His last words to my mother: \"Educate the kids\".\nShe did her best, given that my grandfather was old fashioned and had stopped her from going to school after she became twelve, although she was among the smartest in her class.\nThat Christmas she had bought me the brand new then Sinclair ZX81 personal computer. We were visiting the grandparents in a small village near Athens.\nI spend the night by the fireplace with a small portable TV and the machine, typing in games published in the UK PC magazines of that time and occasionally watching the Chrstmas shows. Debugging my typos was the way I learned how programming works.\nNothing really interesting here, but I am remembering that night again and again so when I saw the prompt I felt I should share. Merry Christmas everyone.",
          "link": "https://news.ycombinator.com/item?id=42507005",
          "publishedOn": "2024-12-25T05:14:55.000Z",
          "wordCount": null,
          "title": "New comment by delibaltas in \"Merry Christmas Everyone\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42506783",
          "author": "jedberg",
          "description": "I'm Jewish, so all my Christmas's growing up were kinda the same.  Sleep in, have brunch, wander over to my neighbor's house around noon to see what kind of loot they got and help them play with their new toys.  Sometimes we'd go out for Chinese food and a movie.\nBut my favorite was Christmas 1999.  My girlfriend was out of town with her family and there was no reason to go home to mine, so I was alone (my roommates were with their families too).  I decided to go to the movies in Emeryville.\nI was going to see Galaxy Quest, Bicentennial Man, and Man on the Moon.  The timing lined up perfectly to see all three.  About 50 other people were there to do the same thing.  When it was time to go in for the first movie, a staff member came out and told us that it would start about 30 minutes late.  This would of course cause us to miss all the other movies.\nAbout 30 people stepped forward at the same time and asked to speak to the manager. :). We explained to him that it would throw our whole schedule off.  Since it was Christmas, he was kind enough to adjust the schedule so that we could all see all three movies.\nThat was a great day.",
          "link": "https://news.ycombinator.com/item?id=42506783",
          "publishedOn": "2024-12-25T04:14:14.000Z",
          "wordCount": 6397,
          "title": "New comment by jedberg in \"Merry Christmas Everyone\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42506408",
          "author": "voxelghost",
          "description": "I don't know why, but I imagine a situation where all communication has broken down, and the only working sensor is the one in the piss-tank, and the astronauts have to communicate in morse by modulating the delta in the tank. And some guy  with ADHD, and this menu bar app installed, is going to figure out whats going on what is going on, and  save them all. (Hey, Hollywood - if this turns into a movie - I want my royalties)",
          "link": "https://news.ycombinator.com/item?id=42506408",
          "publishedOn": "2024-12-25T02:22:06.000Z",
          "wordCount": 2369,
          "title": "New comment by voxelghost in \"macOS menu bar app that shows how full the ISS urine tank is in real time\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42506020",
          "author": "jaennaet",
          "description": "Absolutely! Realtime data will require a subscription, which will also include an LLM analysis of the past week's data. I think one of the VCs funding my upcoming disruptive space station piss tank telemetry platform requested that.\nI'm pretty sure I can also shove a blockchain in there somewhere too even though they're a bit passé.",
          "link": "https://news.ycombinator.com/item?id=42506020",
          "publishedOn": "2024-12-25T00:37:06.000Z",
          "wordCount": 647,
          "title": "New comment by jaennaet in \"macOS menu bar app that shows how full the ISS urine tank is in real time\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42505561",
          "author": "btown",
          "description": "> I found out about the data stream from https://iss-mimic.github.io/Mimic/, which has considerably more and more interesting stats than just how full the piss tank is.\n> I will not be adding any of them.\nThis, right here, is how you communicate non-goals of a project. Just perfect open-source communication best practices. We all stand to learn from this project.\n(Though, predictably, some of us sit to interact with it.)",
          "link": "https://news.ycombinator.com/item?id=42505561",
          "publishedOn": "2024-12-24T22:59:18.000Z",
          "wordCount": null,
          "title": "New comment by btown in \"macOS menu bar app that shows how full the ISS urine tank is in real time\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42503099",
          "author": "prhn",
          "description": "I've made more friends more easily in my 40s than any other time in my life, and I'm a relatively quiet and disagreeable person.\nMaking connections with people you're around frequently is easy. The problem is that adult life doesn't throw you into those situations post-college outside of work.\nNow it's on you. Find a group. Sports are the easiest. You will absolutely make strong, long lasting friendships if you play sports. It doesn't matter if you're athletic or talented.\nYou just gotta show up and see the same people every week over and over. If you're a reasonably well adjusted person (and even that sometimes doesn't matter) you will make friends.\nAgain, making connections and friends is easy. Being around the same people regularly is difficult. Solve that problem and the friendships will come with little effort.\nI have found that people generally understand the value of friendship and are welcoming to newcomers. It's been a very refreshing surprise as I've gotten older.\nGet out there!",
          "link": "https://news.ycombinator.com/item?id=42503099",
          "publishedOn": "2024-12-24T16:58:11.000Z",
          "wordCount": null,
          "title": "New comment by prhn in \"Why making friends as an adult is harder\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42500709",
          "author": "chollida1",
          "description": "- No serious hedge funds or other activists involved in this, ie no adults involved, check\n- Fully audited financials not being questioned, check\n- CEO and CFO constantly acknowledging the Foundary unit wasn't profitable in quarterly updates, check.\nThe former CEO was brought in to to try and keep Intel a fully integrated business that designed and manufactured chips.  He was very clear upfront about his plan to not divest the foundry and instead to try and build it back up.\nIt didn't' work, that's not a crime.  He left because his plan didn't work.  That's what happens to CEO's who try and fail to implement a business plan.\nThis is just an ambulance chaser lawsuit that doesn't look like it will go anywhere at all.\nIf there was any merit at all then the board would also be involved in going after the former CEO and CFO.",
          "link": "https://news.ycombinator.com/item?id=42500709",
          "publishedOn": "2024-12-24T09:19:28.000Z",
          "wordCount": null,
          "title": "New comment by chollida1 in \"Intel shareholders file case asking ex CEO, CFO to return 3 years of salary\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42500195",
          "author": "daltonpinto",
          "description": "This question reminds me of the first time I met a blind programmer.\nI asked him how he managed to code, and he replied with something that stayed with me: a good programmer should organize software in such a way that every piece of code has a clear and logical place. The organization should be so intuitive that anyone could build a mental model of the structure and navigate it easily, even without seeing it.\nIt felt like something out of a Yoda or Mr. Miyagi lesson. Skeptical, I asked his colleagues if he was truly able to code or if he was just exaggerating. To my surprise, they told me not only was he capable, but he was the best programmer they had ever worked with. They said no one else came close to writing code as organized as his.\nThat conversation changed my perspective. Ever since, whenever I’m unsure where to place new code, I don’t think about DDD or any specific methodology. Instead, I try to follow the logic and structure of the project in a way that feels natural and easy to follow later.\nLater in life, I met two other blind programmers and heard similar stories about their ability to produce well-organized code.\nTo bring this back to the original question: I view LSP/IDE features the same way those programmers view \"visual aids.\" Code should be organized according to a clear and logical structure that makes it easy to navigate.\nRelying on features like Ctrl+Click to find where things are located worries me. Why? Because it can mask structural flaws in the codebase. If we can't intuitively figure out where something belongs, that’s a sign the codebase lacks structure—and that should motivate us to refactor it.\nNot only do I avoid using LSP features, but I’m also opposed to their use. While they can help with navigation, they may prevent developers from experiencing and addressing the underlying structural issues in their code.",
          "link": "https://news.ycombinator.com/item?id=42500195",
          "publishedOn": "2024-12-24T07:09:19.000Z",
          "wordCount": null,
          "title": "New comment by daltonpinto in \"Ask HN: Programmers who don't use autocomplete/LSP, how do you do it?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42498721",
          "author": "prepend",
          "description": "I’d rather have the pdf than a custom tool. Especially considering the tool will be unique to the practice or emr. And likely expensive to maintain.\nPDFs suck in many ways but are durable and portable. If I work with two oncologists, I use the same pdf.\nThe author means well but his solution will likely be worse because only he will understand it. And there’s a million edge cases.",
          "link": "https://news.ycombinator.com/item?id=42498721",
          "publishedOn": "2024-12-24T00:32:38.000Z",
          "wordCount": null,
          "title": "New comment by prepend in \"Why are cancer guidelines stuck in PDFs?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42491528",
          "author": "SamPatt",
          "description": "I'm sure the debate over the definition of AGI is important and will continue for a while, but... I can't care about it anymore.\nBetween Perplexity searching and summarizing, Claude explaining, and qwen (and other tools) coding, I'm already as happy as can be with whatever you want to call this level of intelligence.\nJust today I used a completely local AI research tool, based on Ollama. It worked great.\nMaybe it won't get much better? Or maybe it'll take decades instead of years? Ok. I remember not having these tools. I never want to go back.",
          "link": "https://news.ycombinator.com/item?id=42491528",
          "publishedOn": "2024-12-23T03:41:14.000Z",
          "wordCount": 20461,
          "title": "New comment by SamPatt in \"GPT-5 is behind schedule\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42488447",
          "author": "jph00",
          "description": "The original answer to \"why does FastMail use their own hardware\" is that when I started the company in 1999 there weren't many options. I actually originally used a single bare metal server at Rackspace, which at that time was a small scrappy startup. IIRC it cost $70/month. There weren't really practical VPS or SaaS alternatives back then for what I needed.\nRob (the author of the linked article) joined a few months later, and when we got too big for our Rackspace server, we looked at the cost of buying something and doing colo instead. The biggest challenge was trying to convince a vendor to let me use my Australian credit card but ship the server to a US address (we decided to use NYI for colo, based in NY). It turned out that IBM were able to do that, so they got our business. Both IBM and NYI were great for handling remote hands and hardware issues, which obviously we couldn't do from Australia.\nA little bit later Bron joined us, and he automated absolutely everything, so that we were able to just have NYI plug in a new machine and it would set itself up from scratch. This all just used regular Linux capabilities and simple open source tools, plus of course a whole lot of Perl.\nAs the fortunes of AWS et al rose and rose and rose, I kept looking at their pricing at features and kept wondering what I was missing. They seemed orders of magnitude more expensive for something that was more complex to manage and would have locked us into a specific vendor's tooling. But everyone seemed to be flocking to them.\nTo this day I still use bare metal servers for pretty much everything, and still love having the ability to use simple universally-applicable tools like plain Linux, Bash, Perl, Python, and SSH, to handle everything cheaply and reliably.\nI've been doing some planning over the last couple of years on teaching a course on how to do all this, although I was worried that folks are too locked in to SaaS stuff -- but perhaps things are changing and there might be interest in that after all?...",
          "link": "https://news.ycombinator.com/item?id=42488447",
          "publishedOn": "2024-12-22T19:26:59.000Z",
          "wordCount": null,
          "title": "New comment by jph00 in \"Why we use our own hardware\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42484037",
          "author": "cwzwarich",
          "description": "This is me! Didn’t expect to see this on here, but I’m looking forward to working with everyone else at the Lean FRO and the wider Lean community to help make Lean even better.\nMy background is in mathematics and I’ve had an interest in interactive theorem provers since before I was ever a professional software engineer, so it’s a bit of a dream come true to be able to pursue this full-time.",
          "link": "https://news.ycombinator.com/item?id=42484037",
          "publishedOn": "2024-12-22T02:41:47.000Z",
          "wordCount": 6369,
          "title": "New comment by cwzwarich in \"Rosetta 2 creator leaves Apple to work on Lean full-time\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/Debt-cancellation-in-the-land-of",
          "author": "Isabelle Ponet",
          "description": "The year 2025 is considered by Christians to be a jubilee year under the banner of debt cancellation. To mark the occasion, the CADTM is republishing a series of articles on debt cancellation, the struggles for debt cancellation and the role of debt in political, social and geostrategic conflicts throughout history. \nEnglish\n\n/ \nAlternatives, \nDebt in History, \nInegalites 2024 EN",
          "link": "https://www.cadtm.org/Debt-cancellation-in-the-land-of",
          "publishedOn": "2024-12-27T02:00:00.000Z",
          "wordCount": 4006,
          "title": "Debt cancellation in the land of Canaan in the first millennium BC",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L342xH180/20a7bfba697a4b2b949e4cdf2201ed-c5572.jpg"
        },
        {
          "id": "https://www.cadtm.org/Long-cycles",
          "author": "Michael Roberts",
          "description": "I have long been sympathetic to the concept of long cycles in capitalist production and accumulation. This is the idea that capitalist production moves in cycles, not just in booms and slumps every 8-10 years or so, but also there are longer periods of generally faster accumulation and output growth ie periods of relative prosperity followed by a periods of relatively slower accumulation and growth, with more recessions. These longer cycles or waves last around 50-60 years including the (...)\nEnglish\n\n/ \nCrisis, \nCapitalism",
          "link": "https://www.cadtm.org/Long-cycles",
          "publishedOn": "2024-12-24T14:13:39.000Z",
          "wordCount": 2235,
          "title": "Long cycles",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L429xH225/8afcebe1508c366ad56b02e46cdd2c-22910.png"
        },
        {
          "id": "https://www.cadtm.org/The-Long-Tradition-of-Debt",
          "author": "Eric Toussaint",
          "description": "The year 2025 is considered by Christians to be a jubilee year under the banner of debt cancellation. To mark the occasion, the CADTM is republishing a series of articles on debt cancellation, the struggles for debt cancellation and the role of debt in political, social and geostrategic conflicts throughout history. \n The Hammurabi Code is in the Louvre Museum, in Paris. The term “code” is inappropriate, because what Hammurabi left us is a (...)\nEnglish\n\n/ \nAlternatives, \nDebt campaign, \nDebt in History, \nHistoire Jubi EN",
          "link": "https://www.cadtm.org/The-Long-Tradition-of-Debt",
          "publishedOn": "2024-12-24T04:30:00.000Z",
          "wordCount": 3320,
          "title": "The Long Tradition of Debt Cancellation in Mesopotamia and Egypt from 3000 to 1000 BC",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L465xH245/21f5f03ebb414d322317569c2e8e6e-90a7f.png"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=8992",
          "author": "disassociated.com",
          "description": "Xavier H.M., writing on his Mastodon page: Your neocities blog is cute but I can’t read the 5pt font and your cursor is the size of a bread crumb. The web page is loading so many gifs my computer sounds like a boeing 747. disassociated once, in a way, looked like a Neocities website. Or, […]",
          "link": "https://disassociated.com/the-web-today-is-not-necessarily-worse-than-the-early-web/",
          "publishedOn": "2024-12-26T20:00:36.000Z",
          "wordCount": 431,
          "title": "The web today is not necessarily worse than the early web",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9004",
          "author": "disassociated.com",
          "description": "Dark energy does not exist, and the universe, while continuing to expand, is not doing so in a uniform fashion. In other words, the cosmos may look more like a potato, rather than a sphere. This according to recent research by astronomers and scientists at the University of Canterbury (UC), based in Christchurch, New Zealand. […]",
          "link": "https://disassociated.com/time-not-dark-energy-causing-universe-expand/",
          "publishedOn": "2024-12-26T19:30:19.000Z",
          "wordCount": 389,
          "title": "Time, not dark energy, may be causing the universe to expand",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9007",
          "author": "disassociated.com",
          "description": "The introverts among us live almost permanently in a sort of internal exile, or a rich inner life, as Waleed Aly referred to it during the COVID-19 lockdowns. But the idea of getting away from it all, without actually going anywhere, is gaining traction more widely, writes Jacqueline Maley, for The Sydney Morning Herald. This […]",
          "link": "https://disassociated.com/pack-books-internal-exile-2025/",
          "publishedOn": "2024-12-26T19:00:16.000Z",
          "wordCount": 247,
          "title": "Pack plenty of books and take yourself into internal exile in 2025",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8983",
          "author": "disassociated.com",
          "description": "Let’s flashback a year. Australian telecommunications company Telstra might have hit the right note with its Christmas theme advertising in 2023, by way of this ninety second commercial. The song excerpted in the ad is Oh Christmas, by Brisbane based duo Zefereli. Listen to the full length version here. It may not happen often, but […]",
          "link": "https://disassociated.com/telstras-2023-christmas-advert/",
          "publishedOn": "2024-12-22T20:00:28.000Z",
          "wordCount": 176,
          "title": "I’ll just be asking for you… Telstra’s 2023 Christmas advert",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8988",
          "author": "disassociated.com",
          "description": "Weather that is fine and not too warm seems to the Christmas Day weather forecast for most of Australia. But the days either side will be a different matter, writes Tom Saunders for the ABC: The tumultuous week of variability will commence with a wintry Monday for the south-east, even cold enough for brief snow […]",
          "link": "https://disassociated.com/snow-heatwaves-christmas-australia/",
          "publishedOn": "2024-12-22T19:30:22.000Z",
          "wordCount": 235,
          "title": "Snow and heatwaves: this is Christmas in Australia",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": []
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    },
    {
      "title": "News Minimalist",
      "feedUrl": "https://rss.beehiiv.com/feeds/4aF2pGVAEN.xml",
      "siteUrl": "https://newsletter.newsminimalist.com/",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}