{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": []
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": [
        {
          "id": "dab37534fc31f5c3a2ba27f017579fdc4f34674c",
          "author": "Syed Masudullah Sadullah",
          "description": "This post explores how Amazon Bedrock can transform property management operations and optimize costs. We examine a practical approach to tackle challenges such as processing high volumes of lease agreements, maintaining compliance with varied regulatory requirements.",
          "link": "https://aws.amazon.com/blogs/architecture/transform-lease-agreement-workflows-with-amazon-bedrock/",
          "publishedOn": "2024-12-31T15:06:09.000Z",
          "wordCount": 4086,
          "title": "Transform lease agreement workflows with Amazon Bedrock",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fc074d501302eb2b93e2554793fcaf50b3bf7291/2024/12/23/Rental-Blog-Solution-architecture-Picture2-1.png"
        }
      ]
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps & Developer Productivity Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": [
        {
          "id": "84ca02a5b48a54f88f390089a009976e87922bea",
          "author": "Brian Beach",
          "description": "As we kick off 2025, I wanted to take a moment to highlight the top posts from 2024. Without further ado, here are the top 10 DevOps and developer productivity blog posts of 2024. Announcing CDK Migrate A single command to migrate to the AWS CDK – This blog post announces the general availability of […]",
          "link": "https://aws.amazon.com/blogs/devops/the-most-visited-devops-and-developer-productivity-blog-posts-in-2024-copy/",
          "publishedOn": "2025-01-02T14:21:08.000Z",
          "wordCount": 1925,
          "title": "The most visited DevOps and Developer Productivity blog posts in 2024",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/12/31/The-most-visited-DevOps-and-developer-productivity-blog-posts-in-2024-1120x630.png"
        },
        {
          "id": "c0274ae9899bf1d6fa6f868d7f7e54714956d4a0",
          "author": "Brian Beach",
          "description": "The dust has settled after another re:Invent. I once again had the privilege of organizing the DevOps and Developer Productivity (DOP) track along with Jessie VanderVeen, Krishna Dalal, Megan Sattler and countless others. For 2024, the DOP track included 60 sessions. If you weren’t able to attend, I have compiled a list of the on-demand […]",
          "link": "https://aws.amazon.com/blogs/devops/reinvent-2024-devops-and-developer-productivity-playlist/",
          "publishedOn": "2025-01-02T14:20:10.000Z",
          "wordCount": 2461,
          "title": "re:Invent 2024 DevOps and Developer Productivity Playlist",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/12/31/re-Invent-2024-DevOps-and-Developer-Productivity-Playlist-1120x630.png"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/4f1f53b4ab0f",
          "author": "Netflix Technology Blog",
          "description": "This article is the second in a multi-part series sharing a breadth of Analytics Engineering work at Netflix, recently presented as part of…",
          "link": "https://netflixtechblog.com/part-2-a-survey-of-analytics-engineering-work-at-netflix-4f1f53b4ab0f?source=rss----2615bd06b42e---4",
          "publishedOn": "2025-01-02T21:07:11.000Z",
          "wordCount": 4732,
          "title": "Part 2: A Survey of Analytics Engineering Work at Netflix",
          "imageUrl": "https://miro.medium.com/v2/da:true/resize:fit:1200/0*j2wKL4S3ywEs9mpf"
        }
      ]
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": []
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=348704",
          "author": "Bruce E. Levine",
          "description": "Clinics offering ketamine infusions and injections for “treatment-resistant depression” are today claiming 24-48 hours remission, and ketamine is also being marketed for post-traumatic stress disorder (PTSD), obsessive-compulsive disorder, bipolar disorder, and anxiety disorder. “Between 500 and 750 ketamine clinics have cropped up across the United States,” NPR reported early in 2024 (“The Ketamine Economy: New Mental Health Clinics are a ‘Wild West’ with Few Rules”). This may be an underestimation, as Psychiatric News reported later in 2024, “More than 1,500 intravenous (IV) infusion clinics have proliferated nationwide.” Ketamine industry revenues of $3.1 billion were reported in 2022, and projected to be $6.9 billion by 2030. More\nThe post Psychiatry’s Latest Insane Magic-Bullet Treatment for Depression: Why Ketamine? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/psychiatrys-latest-insane-magic-bullet-treatment-for-depression-why-ketamine/",
          "publishedOn": "2025-01-03T07:05:59.000Z",
          "wordCount": null,
          "title": "Psychiatry’s Latest Insane Magic-Bullet Treatment for Depression: Why Ketamine?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348238",
          "author": "Jeffrey St. Clair",
          "description": "So why do I reprise the moldering life of John Lilburne now, during the time of a genocide that his country and my own have armed, funded, and run interference for, when the words that describe the horrors we’ve witnessed are being criminalized, and it’s become dangerous to speak or write about what you see happening and how you feel about it and even more perilous to act, in even small ways, to try to stop it. More\nThe post Intolerable Opinions in the Time of Genocide appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/what-would-lilburne-do-intolerable-opinions-in-the-time-of-genocide/",
          "publishedOn": "2025-01-03T07:01:02.000Z",
          "wordCount": null,
          "title": "Intolerable Opinions in the Time of Genocide",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348697",
          "author": "Melvin Goodman",
          "description": "One of the reasons I’m having difficulty “enjoying the holidays” is the editorial writing of Bret Stephens.  His columns defending Israel’s brutal military campaign that targets sanctuary areas and so-called safe zones in Gaza are typically chauvinistic and bellicose.  Stephens supports any Israeli military option that “advances Israel’s national interests on all fronts.”  His lecture at Harvard last year argued that “taking out most, but not all, of Hamas is not enough,” which seems to justify the genocidal campaign that Israel conducts.  Stephens has never mentioned that this campaign targets Gaza’s hospitals and health infrastructure.  As for those who protest Israeli actions, Stephens calls them “Iran’s useful idiots” and anti-semites. More\nThe post NYT’s Apologist For Israel is No Longer a “Never Trumper” appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/nyts-apologist-for-israel-is-no-longer-a-never-trumper/",
          "publishedOn": "2025-01-03T07:00:30.000Z",
          "wordCount": null,
          "title": "NYT’s Apologist For Israel is No Longer a “Never Trumper”",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348700",
          "author": "Stewart Lawrence",
          "description": "Organ trafficking survives, in part, because the demand from affluent consumers in the advanced capitalist West is so high and the legal supply of organs – primarily (about 80%) kidneys, but also lungs, livers and cornea – barely keeps pace.  Many people wait at least two years to qualify to receive an organ transplant legally and thousands die every year - about 25 daily, according to the World Health Organization – because no organ becomes available in time to save them.  More\nThe post Dying for a Kidney:  Can Anyone Stop The Burgeoning Black Market in Human Organs? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/dying-for-a-kidney-can-anyone-stop-the-burgeoning-black-market-in-human-organs/",
          "publishedOn": "2025-01-03T06:59:48.000Z",
          "wordCount": null,
          "title": "Dying for a Kidney:  Can Anyone Stop The Burgeoning Black Market in Human Organs?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348536",
          "author": "Nelson Pereira",
          "description": "Reawakening ghosts from a dark past, Germany once again claims to have the authority to define who is a Jew. Those who say this are Jews living in Germany who find themselves the target of processes of delegitimization from the moment they criticize Israel. Between Israel and Jews, Germany chooses the Zionist state. For the  More\nThe post Today, as in the Past, Germany Claims the Authority to Define who is a Jew appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/today-as-in-the-past-germany-claims-the-authority-to-define-who-is-a-jew/",
          "publishedOn": "2025-01-03T06:58:59.000Z",
          "wordCount": null,
          "title": "Today, as in the Past, Germany Claims the Authority to Define who is a Jew",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348939",
          "author": "CounterPunch Radio",
          "description": "On this episode of CounterPunch Radio, Joshua Frank and Erik Wallenberg talk to Ashley Dawson about his new book, Environmentalism from Below: How Global People’s Movements Are Leading the Fight for Our Planet (Haymarket Books). https://media.blubrry.com/counterpunch_radio/content.blubrry.com/counterpunch_radio/DawsonInterview.mp3   Ashley is a Professor of English at the Graduate Center / City University of New York and the  More\nThe post Ashley Dawson on Environmentalism from Below appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/ashley-dawson-on-environmentalism-from-below/",
          "publishedOn": "2025-01-03T06:58:38.000Z",
          "wordCount": null,
          "title": "Ashley Dawson on Environmentalism from Below",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348698",
          "author": "Eve Ottenberg",
          "description": "The latest American mass psychosis involves drones, a rather mundane twist in a long, gaudy, societal psychopathology leading from communists under the bed, to the lunatic Havana Syndrome, to dastardly Chinese spy balloons. So our current fixation is mystery drones, sighted across the U.S. but most alarmingly, for birdbrains I guess, over U.S. military bases.  More\nThe post Mass Hysteria Strikes Again: The Great Drone Invasion of 2024 appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/mass-hysteria-strikes-again-the-great-drone-invasion-of-2024/",
          "publishedOn": "2025-01-03T06:58:21.000Z",
          "wordCount": null,
          "title": "Mass Hysteria Strikes Again: The Great Drone Invasion of 2024",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348925",
          "author": "Ramzy Baroud",
          "description": "The latest news from the Palestinian Authority’s (PA) so-called “Protecting the Homeland” operation in the Jenin refugee camp paints a grim picture. Nine Palestinian lives have been claimed in this ongoing crackdown which began on December 5, including a young journalist, Shaza Al-Sabbagh. The assault, as reported by the Israeli newspaper Haaretz, has, expectedly, received  More\nThe post Fighting Israel’s War in Jenin: Can the Palestinian Authority Be Saved? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/fighting-israels-war-in-jenin-can-the-palestinian-authority-be-saved/",
          "publishedOn": "2025-01-03T06:58:05.000Z",
          "wordCount": null,
          "title": "Fighting Israel’s War in Jenin: Can the Palestinian Authority Be Saved?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348771",
          "author": "Erik Molvar",
          "description": "While millions around the world tuned in to watch Kevin Costner’s sensationalized depiction of western history in the mini-series ‘Yellowstone,’ the real story of Yellowstone goes way beyond the dramatized miniseries. The story of Yellowstone isn’t about cowboys or ranchers. Yellowstone National Park was founded in 1872 through an act of Congress, signed into law  More\nThe post The Real Story of Yellowstone appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/the-real-story-of-yellowstone/",
          "publishedOn": "2025-01-03T06:57:37.000Z",
          "wordCount": null,
          "title": "The Real Story of Yellowstone",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348913",
          "author": "Robert Hunziker",
          "description": "Since the start of the 21st century, major planetary ecosystems, like the Amazon rainforest and Antarctica have consistently deteriorated, but within only the past two years, these two major ecosystems have deteriorated much faster than ever before. This is happening at geological breakneck speed. Nothing is normal any longer. What’s going on? The Amazon rainforest  More\nThe post Amazon’s Global Warming Counterweight Threatened appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/amazons-global-warming-counterweight-threatened/",
          "publishedOn": "2025-01-03T06:56:23.000Z",
          "wordCount": null,
          "title": "Amazon’s Global Warming Counterweight Threatened",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348885",
          "author": "Gregory Elich",
          "description": "Since South Korean President Yoon Suk Yeol’s failed attempt to impose martial law on December 3, a steady stream of revelations has emerged from reporters and investigators, painting an increasingly disturbing picture of events. Plans drawn up by Yoon’s co-conspirators included a shocking level of brutality and the promise of repression on a mass scale.  More\nThe post How Yoon Planned to Set South Korea on the Path to Military Dictatorship appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/how-yoon-planned-to-set-south-korea-on-the-path-to-military-dictatorship/",
          "publishedOn": "2025-01-03T06:56:03.000Z",
          "wordCount": null,
          "title": "How Yoon Planned to Set South Korea on the Path to Military Dictatorship",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348775",
          "author": "Daniel Warner",
          "description": "In addition to the numerous obituaries of Jimmy Carter, comparisons between Carter and Donald Trump should be made. There are many, but a few of the most obvious are small time Southern farmer vs hereditary New York real estate baron, Naval Academy graduate and military serviceman vs dubious business school graduate and draft dodger, strong  More\nThe post Jimmy Carter and Donald Trump: The Humane Moralist vs the Confirmed Sinner appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/jimmy-carter-and-donald-trump-the-humane-moralist-vs-the-confirmed-sinner/",
          "publishedOn": "2025-01-03T06:55:36.000Z",
          "wordCount": null,
          "title": "Jimmy Carter and Donald Trump: The Humane Moralist vs the Confirmed Sinner",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348797",
          "author": "Desiree Hellegers",
          "description": "I don’t know what’s on your list of resolutions, but not getting my ass blown off in a nuclear war or meltdown is pretty high on my list of personal priorities for the coming year. It’s true there are plenty of other things I could be worrying about right now. In fact, if there were  More\nThe post “Every Seed We Plant”: Notes Toward a Nuclear-Free Future appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/every-seed-we-plant-notes-toward-a-nuclear-free-future-2/",
          "publishedOn": "2025-01-03T06:55:33.000Z",
          "wordCount": null,
          "title": "“Every Seed We Plant”: Notes Toward a Nuclear-Free Future",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348979",
          "author": "Paul Street",
          "description": "Listen for the silences in the imperialist press. Last Saturday’s New York Times included a story it billed online as “What to Know About Gaza’s Humanitarian Crisis.” The Times relayed some of the horrific suffering being inflicted on the people of Gaza. It reported that Israel’s bombs have “turned [Gazan] cities into rubble-filled wastelands” and  More\nThe post Manufacturing Consent 101: The New York Times and “What [NOT] to Know” About the Genocide in Gaza appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/manufacturing-consent-101-the-new-york-times-and-what-not-to-know-about-the-genocide-in-gaza/",
          "publishedOn": "2025-01-03T06:55:33.000Z",
          "wordCount": null,
          "title": "Manufacturing Consent 101: The New York Times and “What [NOT] to Know” About the Genocide in Gaza",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348986",
          "author": "Judith Deutsch",
          "description": "Today’s news, Six Children Freeze to Death in Gaza as Rainfall Worsens Conditions for Displaced At least 52,030 Palestinians have been killed, according to Euro-Med, with 33% of the casualties being children and 21% women. And of 46,410 civilians killed, 190 of the casualties were journalists, and 2,313 were healthcare professionals, including 83 doctors. Out  More\nThe post Banksy’s “Scar of Bethlehem”: A Lament appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/banksys-scar-of-bethlehem-a-lament/",
          "publishedOn": "2025-01-03T06:55:14.000Z",
          "wordCount": null,
          "title": "Banksy’s “Scar of Bethlehem”: A Lament",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=349074",
          "author": "David Yearsley",
          "description": "Sacred Grove Welcome Center, Palmyra, New York, Over my thirty years living in Upstate New York, I’ve raced past the Thruway exit for Palmyra dozens of times while driving the ninety miles from Ithaca to Rochester. Usually, I’ve been rushing to play a concert, or to listen to one, at the Eastman School of Music.  More\nThe post Top of the Mormon appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/top-of-the-mormon/",
          "publishedOn": "2025-01-03T06:55:09.000Z",
          "wordCount": null,
          "title": "Top of the Mormon",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348999",
          "author": "Binoy Kampmark",
          "description": "While international law can, at times, seem an ephemeral creature, vulnerable to manipulation, neglect and outright dismissal, its strictures can surprise.  The evolving body of law stripping back the immunity of heads of state for gross human rights abuses, the potential complicity of third parties and powers in aiding such heads of states and their armies,  More\nThe post Far From Ignorant: The European Union, Arms Exports and Israel appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/far-from-ignorant-the-european-union-arms-exports-and-israel/",
          "publishedOn": "2025-01-03T06:54:54.000Z",
          "wordCount": null,
          "title": "Far From Ignorant: The European Union, Arms Exports and Israel",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348994",
          "author": "Howard Lisnoff",
          "description": "Jimmy Carter may have liked the endless accolades that came his way following his death. Carter was immensely unpopular by the end of his first and only term as president from 1977 to early 1981. His foreign policy success between Israel and Egypt was overshadowed by inflation, an inability to communicate with the people, and  More\nThe post Jimmy Carter: Amnesty and Draft Registration appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/jimmy-carter-amnesty-and-draft-registration/",
          "publishedOn": "2025-01-03T06:54:49.000Z",
          "wordCount": null,
          "title": "Jimmy Carter: Amnesty and Draft Registration",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348982",
          "author": "David S. D’Amato",
          "description": "In 1336, Milan was expanding to become one of the richest and most important cities in all of Europe. From the end of the 13th century, it was ruled by a powerful dynasty that would go on to found the Duchy of Milan, a major state that would remain intact until Napoleon’s armies swept across  More\nThe post The Emergence of Time as a Social Force appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/the-emergence-of-time-as-a-social-force/",
          "publishedOn": "2025-01-03T06:54:26.000Z",
          "wordCount": null,
          "title": "The Emergence of Time as a Social Force",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348998",
          "author": "Norman Solomon",
          "description": "On the last day of 2024, the deputy general counsel for the House of Representatives formally accepted delivery of a civil summons for two congressmembers from Northern California. More than 600 constituents of Jared Huffman and Mike Thompson have signed on as plaintiffs in a class action accusing them of helping to arm the Israeli military in  More\nThe post Why Congress Members Face a Lawsuit for Funding Israel’s War on Gaza appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/why-congress-members-face-a-lawsuit-for-funding-israels-war-on-gaza/",
          "publishedOn": "2025-01-03T06:54:09.000Z",
          "wordCount": null,
          "title": "Why Congress Members Face a Lawsuit for Funding Israel’s War on Gaza",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348990",
          "author": "Syed Salman Mehdi",
          "description": "At the call of midnight on December 31 of the year 2024, Switzerland has put in the practice of a new burqa ban, and in this way the question of freedom and culture freedom along with the authority of the state comes again in the front line. It bans full-face veils, like the niqab, in  More\nThe post Switzerland’s Burqa Ban: A Crossroads of Freedom, Identity, and Social Cohesion appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/switzerlands-burqa-ban-a-crossroads-of-freedom-identity-and-social-cohesion/",
          "publishedOn": "2025-01-03T06:53:44.000Z",
          "wordCount": null,
          "title": "Switzerland’s Burqa Ban: A Crossroads of Freedom, Identity, and Social Cohesion",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348951",
          "author": "Matthew Stevenson",
          "description": "This is the sixth part in a series about riding night trains across Europe and the Near East to Armenia — to spend some time in worlds beyond the pathological obsessions of President-elect Donald Trump. (This week Trump’s MAGA Republicans are arguing about immigrants as if they were corporate chattel.) Only on the ride from  More\nThe post Cluj Night Trains appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/cluj-night-trains/",
          "publishedOn": "2025-01-03T06:52:23.000Z",
          "wordCount": null,
          "title": "Cluj Night Trains",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348922",
          "author": "Dean Baker",
          "description": "One development for 2025 that can be seen clearly in the crystal ball is improving trade ties between China and Europe. The reason this is a virtual certainty is Donald Trump is doing everything he can to convince the world that, under his leadership, the United States is an unreliable trading partner. He already worked  More\nThe post Best Bet for 2025: Stronger Trade Ties Between Europe and China appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/best-bet-for-2025-stronger-trade-ties-between-europe-and-china/",
          "publishedOn": "2025-01-03T06:52:17.000Z",
          "wordCount": null,
          "title": "Best Bet for 2025: Stronger Trade Ties Between Europe and China",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348905",
          "author": "Aaron Kirshenbaum",
          "description": "On December 15th, many people in Syria felt the earthquake. Seismic scales registered above 3.0 on the Richter scale and could be felt up to 500 miles away. Natural disasters usually have the attention of people around the world. When earthquakes happen, humanitarian workers and supplies are sent to help out. After hurricanes, organizations release  More\nThe post The Earthquake Environmental Justice Groups Aren’t Talking About appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/the-earthquake-environmental-justice-groups-arent-talking-about/",
          "publishedOn": "2025-01-03T06:51:25.000Z",
          "wordCount": null,
          "title": "The Earthquake Environmental Justice Groups Aren’t Talking About",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348494",
          "author": "M. Shahid Alam",
          "description": "More than a few times since October 8, 2023, as I witnessed—day after day, month after month—the genocide in Gaza, I have tried to shake off the quaint feeling that I had seen all this many years before on the screen of a theater in suburban United States. Inscrutably, I have been experiencing flashbacks from  More\nThe post Two Genocides: Gaza and Metropolis appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/two-genocides-gaza-and-metropolis/",
          "publishedOn": "2025-01-03T06:50:19.000Z",
          "wordCount": null,
          "title": "Two Genocides: Gaza and Metropolis",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348970",
          "author": "Sara Harmouch",
          "description": "The deadly Jan. 1, 2025, attack in New Orleans serves as a reminder of the persistent threat to the U.S. from individuals inspired by extremist Islamist groups. While the investigation is still ongoing, some details of the suspect have been released. Authorities say Shamsud-Din Jabbar, a U.S. Army veteran, was behind the assault in which  More\nThe post New Orleans Attacker’s Apparent Loyalty to ISIS Highlights Persistent Threat of Lone Wolves Inspired to Terrorism appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/new-orleans-attackers-apparent-loyalty-to-isis-highlights-persistent-threat-of-lone-wolves-inspired-to-terrorism/",
          "publishedOn": "2025-01-03T06:46:43.000Z",
          "wordCount": null,
          "title": "New Orleans Attacker’s Apparent Loyalty to ISIS Highlights Persistent Threat of Lone Wolves Inspired to Terrorism",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348956",
          "author": "Monika Zgustova",
          "description": "In communist Prague, Kafka was banned. Something similar happened in the Soviet Union and other totalitarian countries, so their citizens were not able to read Franz Kafka. The political authorities of those countries were aware that the author’s portrayal of totalitarianism was so accurate and lucid that any reader would recognize it as a hyperbole  More\nThe post Kafka, Our Contemporary appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/kafka-our-contemporary/",
          "publishedOn": "2025-01-03T06:45:06.000Z",
          "wordCount": null,
          "title": "Kafka, Our Contemporary",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348972",
          "author": "Damon Orion",
          "description": "Redlining, exclusionary zoning, and predatory lending schemes have put prospective Black homeowners at a severe disadvantage. As the Ballard Center for Social Impact points out, the gap in homeownership rates between Black and white families was larger in 2019 than in the 1960s. In 2023, the National Association of Realtors reported a nearly 29 percent homeownership divide between these  More\nThe post How a Community Collaborative in Arkansas is Pioneering Solutions to Long-Standing Social Problems appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/how-a-community-collaborative-in-arkansas-is-pioneering-solutions-to-long-standing-social-problems/",
          "publishedOn": "2025-01-03T06:43:47.000Z",
          "wordCount": null,
          "title": "How a Community Collaborative in Arkansas is Pioneering Solutions to Long-Standing Social Problems",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348921",
          "author": "Robert Koehler",
          "description": "I welcome in the new year with a sense of abstract helplessness, as the headlines continue to bring us dead children, bombed hospitals, torture, rape and, of course, ever more “self-defense” (sometimes known as genocide). From my safe, secure office space I absorb the daily news – from Gaza, from all across the planet –  More\nThe post Finding a Cure for Humanity’s Cancer appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/finding-a-cure-for-humanitys-cancer/",
          "publishedOn": "2025-01-03T06:36:02.000Z",
          "wordCount": null,
          "title": "Finding a Cure for Humanity’s Cancer",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348992",
          "author": "Joel Schlosberg",
          "description": "Oren Cass’s “What Economists Could Learn From George Costanza”(The New York Times, December 23) has forgotten what economics Henry George taught. That’s the pundit named Cass who invariably calls for constrictions on consumers, as opposed to Cass Sunstein‘s advocacy of “choice-preserving but psychologically wise interventions” that would make “automatic enrollment in government programs” the default (in the words of  More\nThe post What Oren Cass Sunstein Could Learn From Henry George Costanza appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/03/what-oren-cass-sunstein-could-learn-from-henry-george-costanza/",
          "publishedOn": "2025-01-03T06:34:46.000Z",
          "wordCount": null,
          "title": "What Oren Cass Sunstein Could Learn From Henry George Costanza",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=284933",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics; New Covid charts drop, with Christmas hospitalization up in New York; Mike Benz: X censorship and deplatforming; Mangione: murder and social murder; Teen Vogue on \"salting\" ~",
          "link": "https://www.nakedcapitalism.com/2025/01/200pm-water-cooler-1-3-2025.html",
          "publishedOn": "2025-01-03T19:00:05.000Z",
          "wordCount": 12325,
          "title": "2:00PM Water Cooler 1/3/2025",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/nasal_spray.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284889",
          "author": "Yves Smith",
          "description": "A new story on the financial tsuris at even the most elite universities underplays how they've made poor investment choices for many years.",
          "link": "https://www.nakedcapitalism.com/2025/01/elite-college-money-woes-wall-street-journal-notes-but-underplays-the-level-of-negligence.html",
          "publishedOn": "2025-01-03T14:55:32.000Z",
          "wordCount": 6797,
          "title": "Elite College Money Woes: Wall Street Journal Notes but Underplays the Level of Negligence",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/Screen-Shot-2025-01-03-at-8.49.20-PM.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284913",
          "author": "Lambert Strether",
          "description": "Our oft-lionized daily links",
          "link": "https://www.nakedcapitalism.com/2025/01/links-1-3-2025.html",
          "publishedOn": "2025-01-03T11:58:58.000Z",
          "wordCount": 17039,
          "title": "Links 1/3/2025",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/lion_grooming.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284240",
          "author": "Nick Corbishley",
          "description": "After avoiding the issue for years, the legacy media are now trying to manufacture public complacency and consent for the government’s digital identity — and by extension, CBDC — agenda. On July 5, the day Keir Starmer became UK prime minister, we wagered that a Starmer government would intensify the push to roll out a […]",
          "link": "https://www.nakedcapitalism.com/2025/01/the-propaganda-push-for-digital-identity-in-uk-goes-into-overdrive.html",
          "publishedOn": "2025-01-03T11:45:53.000Z",
          "wordCount": 6022,
          "title": "Just Like Clockwork, the Propaganda Push for Digital ID Kicks Into Gear in the UK",
          "imageUrl": "https://sociable.co/wp-content/uploads/2022/02/Digital-Identity-Chart.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284912",
          "author": "Yves Smith",
          "description": "Looking at why the media seems increasingly to be talking to itself and not ordinary people.",
          "link": "https://www.nakedcapitalism.com/2025/01/why-doesnt-the-news-media-talk-about-the-real-issues-in-life.html",
          "publishedOn": "2025-01-03T10:52:06.000Z",
          "wordCount": 7318,
          "title": "Why Doesn’t the News Media Talk About the Real Issues in Life?",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284907",
          "author": "Yves Smith",
          "description": "Tesla is now just ar mid-size automaker amid EV competition that is eating its lunch. What might realistic valuations mean for Musk's clout?",
          "link": "https://www.nakedcapitalism.com/2025/01/what-should-teslas-stock-be-worth-automaker-stagnating-vehicle-sales-like-gm-ford-getting-overtaken-by-competitors-losing-share-in-the-booming-ev-market.html",
          "publishedOn": "2025-01-03T06:03:02.000Z",
          "wordCount": 7958,
          "title": "What Should Tesla’s Stock Be Worth? Automaker, Stagnating Vehicle Sales like GM & Ford, Getting Overtaken by Competitors, Losing Share in the Booming EV Market?",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/00-Tesla.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284891",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics;  Mangione judge, defense fund; WSWS on managing disease through allowing infection; Populism and the Wizard of Oz ~",
          "link": "https://www.nakedcapitalism.com/2025/01/200pm-water-cooler-1-2-2025.html",
          "publishedOn": "2025-01-02T19:00:20.000Z",
          "wordCount": 12782,
          "title": "2:00PM Water Cooler 1/2/2025",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/covid-cdc-ww-natl-4.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284887",
          "author": "Yves Smith",
          "description": "The unduly respected New York Times columnist Tom Friedman again plays ignorant American, here despite a visit to China.",
          "link": "https://www.nakedcapitalism.com/2025/01/elon-musk-taylor-swift-antony-blinken-china-and-the-idiocy-of-tom-friedman.html",
          "publishedOn": "2025-01-02T14:55:14.000Z",
          "wordCount": 8786,
          "title": "Elon Musk, Taylor Swift, Antony Blinken, China, and the Idiocy of Tom Friedman",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284866",
          "author": "Yves Smith",
          "description": "Our fractious daily links: butterfly collection, Yellowstone caldera, US Covid spike, tequila glut, extra wildfire coverage required? China hacks, Russia advances, Magnomics worries, New Orleans and Vegas attacks, AI and ancient texts, breakfast costs woes",
          "link": "https://www.nakedcapitalism.com/2025/01/links-1-2-2025.html",
          "publishedOn": "2025-01-02T11:55:49.000Z",
          "wordCount": 14013,
          "title": "Links 1/2/2025",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/00-skunk-and-possum.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284873",
          "author": "Yves Smith",
          "description": "A new neocon scheme,  reportedly with backing among incoming Trump officials, to bring Russia to its knees with improved energy sanctions.",
          "link": "https://www.nakedcapitalism.com/2025/01/trumps-push-to-shut-down-the-axis-of-upheaval-starts-with-lng.html",
          "publishedOn": "2025-01-02T10:36:55.000Z",
          "wordCount": 12780,
          "title": "Trump’s Push To Shut Down the Axis of Upheaval Starts With LNG",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "6ZxrGIedGqREgTs02vpt0t",
          "author": "Marek Majkowski",
          "description": "Multi-Path TCP (MPTCP) leverages multiple network interfaces, like Wi-Fi and cellular, to provide seamless mobility for more reliable connectivity. While promising, MPTCP is still in its early stages,",
          "link": "https://blog.cloudflare.com/multi-path-tcp-revolutionizing-connectivity-one-path-at-a-time/",
          "publishedOn": "2025-01-03T14:00:00.000Z",
          "wordCount": 2717,
          "title": "Multi-Path TCP: revolutionizing connectivity, one path at a time",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2YR6jQUMONkr0AAxCB0k1q/110a9298a8bc1e34fe5ca6abb7d4588f/Multi-Path_TCP-_revolutionizing_connectivity__one_path_at_a_time-OG.png"
        },
        {
          "id": "chVlt8JAjFduvvOJ5c1yl",
          "author": "Kyle Boutette",
          "description": "Let’s talk about Stream Live’s design, and how it leverages the distributed nature of Cloudflare’s network, rather than centralized locations as many other live services do.",
          "link": "https://blog.cloudflare.com/behind-the-scenes-with-stream-live-cloudflares-live-streaming-service/",
          "publishedOn": "2025-01-02T14:00:00.000Z",
          "wordCount": 2617,
          "title": "Behind the scenes with Stream Live, Cloudflare’s live streaming service",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/22xpisp6kbEqdM6zRXu3dA/94a28da12c2384c800639e2d25a1b0a3/Behind_the_scenes_with_Stream_Live__Cloudflare_s_live_streaming_service-OG.png"
        },
        {
          "id": "2b03lxutI7PqAfcxswe5aE",
          "author": "Marek Majkowski",
          "description": "Follow along as I build a custom weather display using Cloudflare Workers and a popular e-paper display.",
          "link": "https://blog.cloudflare.com/the-forecast-is-clear-clouds-on-e-paper-powered-by-the-cloud/",
          "publishedOn": "2024-12-31T14:00:00.000Z",
          "wordCount": 2185,
          "title": "The forecast is clear: clouds on e-paper, powered by the cloud",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/5O3BzxuFQsKnohnMZgLXiM/e355a5b79d6ac5de41c7eee530742b03/The_forecast_is_clear-_clouds_on_e-paper__powered_by_the_cloud-OG.png"
        },
        {
          "id": "2yX9ADcaKBprzyI9BaBoqN",
          "author": "Lucas Pardue",
          "description": "h3i is a command line tool and Rust library designed for low-level testing and debugging of HTTP/3, which runs over QUIC.",
          "link": "https://blog.cloudflare.com/h3i/",
          "publishedOn": "2024-12-30T14:00:00.000Z",
          "wordCount": 5021,
          "title": "Open sourcing h3i: a command line tool and library for low-level HTTP/3 testing and debugging",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/49kGUhFhN2iZIdcgGwDL6l/9f70e5deb1d4148f41be228340633c66/Open_sourcing_h3i-_a_command_line_tool_and_library_for_low-level_HTTP_3_testing_and_debugging-OG.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Engineering at Slack",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": []
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=42583575",
          "author": "BJones12",
          "description": "> Europeans could learn from Canada how to allow immigration in a fashion that the population embraces rather than tolerates\nClearly the author is ignorant. Canadians are sick of immigration. Young Canadians doubly so. Racism is becoming more acceptable by the day.",
          "link": "https://news.ycombinator.com/item?id=42583575",
          "publishedOn": "2025-01-03T07:56:21.000Z",
          "wordCount": 16277,
          "title": "New comment by BJones12 in \"Why Canada Should Join the EU\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42583334",
          "author": "antics",
          "description": "You are catching a lot of flak for this, but there is one thing you are right about. If you make tens of millions of dollars, and can't figure out what to do with those resources, you shouldn't be calling your coworkers NPCs. You're the NPC.\nI truly mean this in an entirely non-judgemental way. I wish the author luck in achieving his dream of becoming high agency rather than simply high freedom. I wish it for everyone who wants it.",
          "link": "https://news.ycombinator.com/item?id=42583334",
          "publishedOn": "2025-01-03T07:15:51.000Z",
          "wordCount": 7131,
          "title": "New comment by antics in \"I am rich and have no idea what to do\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42581844",
          "author": "pech0rin",
          "description": "This is the most childish thing I’ve read. And shows a lot about he doesn’t have any people relying on him or community to support. He takes one hike and throws away 60m. Doesn’t try to find anything interesting to do at Atlassian just calls his coworkers NPCs. This is zero-empathy Peter Pan syndrome at its worse.\nSad how he just goes adventure hopping to try and find meaning. The problem is no matter where you are you are also there. Time to look inward and not outward.",
          "link": "https://news.ycombinator.com/item?id=42581844",
          "publishedOn": "2025-01-03T03:01:35.000Z",
          "wordCount": 14487,
          "title": "New comment by pech0rin in \"I am rich and have no idea what to do\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42580494",
          "author": "akamaka",
          "description": "> I should work for Elon and Vivek at DOGE and help America get off its current crash to defaulting on its own debt\nI’ve got an idea: take some good economics courses so that you learn how government spending actually works.",
          "link": "https://news.ycombinator.com/item?id=42580494",
          "publishedOn": "2025-01-03T00:03:45.000Z",
          "wordCount": null,
          "title": "New comment by akamaka in \"I am rich and have no idea what to do\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42580321",
          "author": "madrox",
          "description": "I don't think you have to have Fuck You Money to get to this point. Most people eventually become disillusioned with work enough that they reevaluate what matters to them. Getting a very profitable exit is just one way to trigger that experience.\nIn my experience, a lot of people who get into this state start self-sabotaging hard as a way of rejecting what feels, ironically, like losing control. Sudden freedom can feel foreign and lot like your world got forcibly taken away from you. I'm not surprised the author is turning down opportunities and breaking off with his girlfriend. It's a way of taking back control.\nWhen this happened to me, I pivoted hard from getting satisfaction out of what I built to getting satisfaction out of developing people. Now I take great pride out of the careers I've nurtured...a lot more than what I've built, in most ways. I've heard others express similar ideas in different ways, like \"I now enjoy making other people rich.\"\nNo matter what, I encourage the author to use this time to build connections instead of destroying them (real connections...not work or SF acquaintances). Something I did not read in this essay is how he grew closer to anyone (in fact, I read the opposite). No path out of this valley involves traveling alone.",
          "link": "https://news.ycombinator.com/item?id=42580321",
          "publishedOn": "2025-01-02T23:39:47.000Z",
          "wordCount": 9999,
          "title": "New comment by madrox in \"I am rich and have no idea what to do\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42580224",
          "author": "cj",
          "description": "I don’t think his problem is money.\nI think his problem is his identity (founder of Loom) suddenly disappeared.\nNow he needs to develop a new identity.\nThis is especially difficult for single founders without kids (in the sense that people with spouse/kids already derive much of their identity from those 2 things).\nSelling a company isn’t all that different from going through a divorce (in the sense that your identity needs to be completely rebuilt from scratch)",
          "link": "https://news.ycombinator.com/item?id=42580224",
          "publishedOn": "2025-01-02T23:28:43.000Z",
          "wordCount": null,
          "title": "New comment by cj in \"I am rich and have no idea what to do\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42577887",
          "author": "scop",
          "description": "I reacted to this title the way I react a new menu item at Taco Bell: a strange mixture of desire, shame, and admiration for human ingenuity.",
          "link": "https://news.ycombinator.com/item?id=42577887",
          "publishedOn": "2025-01-02T19:35:17.000Z",
          "wordCount": 2206,
          "title": "New comment by scop in \"Advent of Code 2024 in pure SQL\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42577504",
          "author": "Animats",
          "description": "> The \"unsubscribe\" button in Indeed's job notification emails leads me to an impassable Cloudflare challenge.\nThat's a CAN-SPAM act violation.\nFTC: \"Tell recipients how to opt out of receiving future marketing email from you. Your message must include a clear and conspicuous explanation of how the recipient can opt out of getting marketing email from you in the future. Craft the notice in a way that’s easy for an ordinary person to recognize, read, and understand. Creative use of type size, color, and location can improve clarity. Give a return email address or another easy Internet-based way to allow people to communicate their choice to you. You may create a menu to allow a recipient to opt out of certain types of messages, but you must include the option to stop all marketing messages from you. Make sure your spam filter doesn’t block these opt-out requests.\"[1]\nExperian was recently fined for making it hard to opt out of their marketing emails.\nThe actual regulation text:\n§ 316.5 Prohibition on charging a fee or imposing other requirements on recipients who wish to opt out.\nNeither a sender nor any person acting on behalf of a sender may require that any recipient pay any fee, provide any information other than the recipient's electronic mail address and opt-out preferences, or take any other steps except sending a reply electronic mail message or visiting a single Internet Web page, in order to:\n(a) Use a return electronic mail address or other Internet-based mechanism, required by 15 U.S.C. 7704(a)(3), to submit a request not to receive future commercial electronic mail messages from a sender; or\n(b) Have such a request honored as required by 15 U.S.C. 7704(a)(3)(B) and (a)(4).\nThat seems to cover it. File a CAN-SPAM act complaint (spam@uce.gov). Send a copy to the legal department of the sender.\n[1] https://www.ftc.gov/business-guidance/resources/can-spam-act...",
          "link": "https://news.ycombinator.com/item?id=42577504",
          "publishedOn": "2025-01-02T18:59:23.000Z",
          "wordCount": null,
          "title": "New comment by Animats in \"Tell HN: Impassable Cloudflare challenges are ruining my browsing experience\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42569873",
          "author": "cperciva",
          "description": "In 2005, my paper on breaking RSA by observing a single private-key operation from a different hyperthread sharing the same L1 cache -- literally the first publication of a cryptographic attack exploiting shared caches -- was rejected from the cryptology preprint archive on the grounds that \"it was about CPU architecture, not cryptography\".  Rejection from journals is like rejection from VCs -- it happens all the time and often not for any good reason.\n(That paper has now been cited 971 times according to Google Scholar, despite never appearing in a journal.)",
          "link": "https://news.ycombinator.com/item?id=42569873",
          "publishedOn": "2025-01-01T22:34:02.000Z",
          "wordCount": 569,
          "title": "New comment by cperciva in \"One of my papers got declined today\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42568746",
          "author": "dwaltrip",
          "description": "Hilarious irony:\n> With hindsight, some of my past rejections have become amusing.  With a coauthor, I once almost solved a conjecture, establishing the result with an \"epsilon loss\" in a key parameter.  We submitted to a highly reputable journal, but it was rejected on the grounds that it did not resolve the full conjecture.  So we submitted elsewhere, and the paper was accepted.\n> The following year, we managed to finally prove the full conjecture without the epsilon loss, and decided to try submitting to the highly reputable journal again.  This time, the paper was rejected for only being an epsilon improvement over the previous literature!",
          "link": "https://news.ycombinator.com/item?id=42568746",
          "publishedOn": "2025-01-01T19:54:15.000Z",
          "wordCount": 14996,
          "title": "New comment by dwaltrip in \"One of my papers got declined today\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42563992",
          "author": "Donald",
          "description": "45^2 = 2025\nHappy perfect square year, everyone. The previous one was 1936 and the next one will be 2116.",
          "link": "https://news.ycombinator.com/item?id=42563992",
          "publishedOn": "2025-01-01T04:39:33.000Z",
          "wordCount": null,
          "title": "New comment by Donald in \"Happy New Year 2025\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42553307",
          "author": "davidclark",
          "description": "> Credit card delinquency rates, which are seen as a precursor to write-offs, peaked in July, according to data from Moody’s, but have only fallen slightly and remain nearly a percentage point higher than they were on average in the year before the pandemic.\nThis is a prime example of a style of reporting that really grinds my gears.\nThe citation is clearly to another internet source, so a link should be provided. If it truly cannot be linked because it is private, more context is still needed to understand what this data means.\nI actually can’t find the source myself, but I can find “Delinquency Rate on Credit Card Loans, All Commercial Banks” from the Federal Reserve. [1]\nThe percents from that source somewhat match those referenced in the FT quote. “Peaked in July”\n- 2024Q1 3.15%\n- 2024Q2 3.24%\n- 2024Q3 3.23%\nUsing 2019 as “the year before the pandemic”, the average was 2.5825. Is +0.6475 “nearly a percentage point”? I guess it technically would round up.\nSeemingly important context that the quote doesn’t give is that 3.23% is lower than any time 1991Q3 to 2011Q4. But, maybe the trend matters more for this metric.\n[1] https://fred.stlouisfed.org/series/DRCCLACBS",
          "link": "https://news.ycombinator.com/item?id=42553307",
          "publishedOn": "2024-12-30T20:46:04.000Z",
          "wordCount": 2434,
          "title": "New comment by davidclark in \"US credit card defaults jump to highest level since 2010\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42552719",
          "author": "ghewgill",
          "description": "I worked with John for a few years in the 1990s. This was during the heyday of BBSes, when he joined our small team at Mustang Software after Mustang bought Qmodem. John moved to Bakersfield California (with his family, including OP!) to be with us. John left a few years later due to I think business differences with management.\nJohn was personable and full of joy. He always loved a good joke. I remember the parties (not wild, we were pretty tame back then) we would have around the pool at his place. He was generous with his time.\nThe story of Qmodem itself was a bit different. Qmodem for DOS was a one-man shareware business and was John's pride and joy. It was clear that he poured everything into that program. It was finely tuned and just worked. Times were changing though, and people were calling for a Windows version. Unfortunately, John was not interested in learning Windows programming, so Scott Hunter (now at Microsoft), Dan Horn, and I built Qmodem for Windows. It was good, but it really never had the same level of polish that John's work did. It was \"Qmodem\" in name only.\nAfter John left Mustang he also left Bakersfield and I lost touch with him. I'm sure he continued to make the people around him smile. Thank you for your time and contributions, John.",
          "link": "https://news.ycombinator.com/item?id=42552719",
          "publishedOn": "2024-12-30T19:46:57.000Z",
          "wordCount": null,
          "title": "New comment by ghewgill in \"Tell HN: John Friel my father, internet pioneer and creator of QModem, has died\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42550873",
          "author": "ababaian",
          "description": "Cool :) I'm a co-author on this. AMA.\nThis is now a peer-reviewed paper, published last month in Cell [https://www.cell.com/cell/fulltext/S0092-8674(24)01091-2].\nObelisks are part of a larger research program we're developing at the University of Toronto + collaborators, see also: Virus-Viroid Hybrids paper [https://www.nature.com/articles/s41467-023-38301-2] and the Zeta-Elements [https://www.nature.com/articles/s41586-021-04332-2].\nComputational biology is driving a revolutionary expansion of our understanding of Earth's biodiversity. I believe Zeta-elements, Ambiviruses, and Obelisks are just the beginning. If you're interested, our \"Laboratory for RNA-Based Lifeforms\" (University of Toronto) is hiring passionate developers/post-docs/graduate students [https://www.rnalab.ca].\nEdit: OK going to call it for now. I'll check in later today if there's any outstanding questions.",
          "link": "https://news.ycombinator.com/item?id=42550873",
          "publishedOn": "2024-12-30T16:40:38.000Z",
          "wordCount": 5226,
          "title": "New comment by ababaian in \"'Obelisks': New class of life has been found in human digestive system\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42550846",
          "author": "chrismorgan",
          "description": "> SQLite is not open source in the legal sense, as “open source” has a specific definition and requires licenses approved by the Open Source Initiative (OSI).\nThis is wrong, and harmfully wrong. OSI are not the arbiters of open source. Their Open Source Definition, though generally useful and accepted, is not without legitimate criticism and controversy. As for their approval, that’s a dreadful thing to rely on for any purpose; https://writing.kemitchell.com/2019/05/05/Rely-on-OSI.html> is a good description of most of what’s wrong with it (it doesn’t really get into the broken politics enough; but some of his other articles contain more), and I like its summary: “The list of OSI-approved licenses reflects OSI’s practical and political history, not any useful, consistently functional category of license terms.”\nAs for whether SQLite is open source, well, the only reason a public domain dedication doesn’t meet the OSD is that it’s not a license. It’s more open. In a way that is legally mildly uncertain in some jurisdictions, sure, but to call it “not open source in the legal sense” is just wrong.",
          "link": "https://news.ycombinator.com/item?id=42550846",
          "publishedOn": "2024-12-30T16:38:09.000Z",
          "wordCount": null,
          "title": "New comment by chrismorgan in \"Fun facts about SQLite\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42543338",
          "author": "jmclnx",
          "description": "Looking back, to me he was a much better president then people believed in the 80s.\nI believe if he got re-elected in 1980, the US would be in a much better place.  One thing, it could be argued real work on Climate Change would have begun in 1981 as opposed to where we are now, which is just watching the average probably blowing past 3C in around 70 years from now.\nFor his loss in 1980, I still blame Kennedy.\nRIP, he did a lot to help regular people through his life, far more than our current crop of politicians.",
          "link": "https://news.ycombinator.com/item?id=42543338",
          "publishedOn": "2024-12-29T21:26:37.000Z",
          "wordCount": null,
          "title": "New comment by jmclnx in \"Jimmy Carter has died\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42537165",
          "author": "jchw",
          "description": "What I want is very simple: I want software that doesn't send anything to the Internet without some explicit intent first. All of that work to try to make this feature plausibly private is cool engineering work, and there's absolutely nothing wrong with implementing a feature like this, but it should absolutely be opt-in.\nTrust in software will continue to erode until software stops treating end users and their data and resources (e.g. network connections) as the vendor's own playground. Local on-device data shouldn't be leaking out of radio interfaces unexpectedly, period. There should be a user intent tied to any feature where local data is sent out to the network.\nSo why didn't Apple just simply ask for user permission to enable this feature? My cynical opinion is because Apple knows some portion of users would instantly disallow this if prompted, but they feel they know better than those users. I don't like this attitude, and I suspect it is the same reason why there is an increasing discontent growing towards opt-out telemetry, too.",
          "link": "https://news.ycombinator.com/item?id=42537165",
          "publishedOn": "2024-12-29T03:17:21.000Z",
          "wordCount": 15824,
          "title": "New comment by jchw in \"Apple Photos phones home on iOS 18 and macOS 15\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42534096",
          "author": "scosman",
          "description": "\"I don't understand most of the technical details of Apple's blog post\"\nI do:\n- Client side vectorization: the photo is processed locally, preparing a non-reversible vector representation before sending (think semantic hash).\n- Differential privacy: a decent amount of noise is added the the vector before sending it. Enough to make it impossible to reverse lookup the vector. The noise level here is ε = 0.8, which is quite good privacy.\n- OHTTP relay: it's sent through a 3rd party so Apple never knows your IP address. The contents are encrypted so the 3rd party never doesn't learn anything either (some risk of exposing \"IP X is an apple photos user\", but nothing about the content of the library).\n- Homomorphic encryption: The lookup work is performed on server with encrypted data. Apple can't decrypt the vector contents, or response contents. Only the client can decrypt the result of the lookup.\nThis is what a good privacy story looks like. Multiple levels of privacy security, when any one of the latter 3 should be enough alone to protect privacy.\n\"It ought to be up to the individual user to decide their own tolerance for the risk of privacy violations.\" -> The author themselves looks to be an Apple security researcher, and are saying they can't make an informed choice here.\nI'm not sure what the right call is here. But the conclusion \"Thus, the only way to guarantee computing privacy is to not send data off the device.\" isn't true. There are other tools to provide privacy (DP, homomorphic encryption), while also using services. They are immensely complicated, and user's can't realistically evaluate risk. But if you want features that require larger-than-disk datasets, or frequently changing content, you need tools like this.",
          "link": "https://news.ycombinator.com/item?id=42534096",
          "publishedOn": "2024-12-28T20:03:43.000Z",
          "wordCount": null,
          "title": "New comment by scosman in \"Apple Photos phones home on iOS 18 and macOS 15\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42533327",
          "author": "HarHarVeryFunny",
          "description": "Maybe not your company, but it seems hiring companies brought this upon themselves with immediate AI rejects of qualified candidates, ghost jobs, ghosting candidates after interview, etc, etc.\nIf it takes a qualified candidate 100's of applications to land a single interview, then can you blame someone for automating it? I'd say that having the initiative and ability to automate it well would make this guy a great hire, if he hadn't already found a job!",
          "link": "https://news.ycombinator.com/item?id=42533327",
          "publishedOn": "2024-12-28T18:41:49.000Z",
          "wordCount": 5735,
          "title": "New comment by HarHarVeryFunny in \"I automated my job application process\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/Personal-endebtment-and-debt",
          "author": "Jean Andreau",
          "description": "The year 2025 is considered by Christians to be a jubilee year under the banner of debt cancellation. To mark the occasion, the CADTM is republishing a series of articles on debt cancellation, the struggles for debt cancellation and the role of debt in political, social and geostrategic conflicts throughout history. \nEnglish\n\n/ \nAlternatives, \nDebt in History, \nHistoire Jubi EN",
          "link": "https://www.cadtm.org/Personal-endebtment-and-debt",
          "publishedOn": "2024-12-30T08:00:00.000Z",
          "wordCount": 5975,
          "title": "Personal endebtment and debt forgivness in the Roman empire",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L153xH80/7d67b536955c2d468284cb35bf57de-31f2b.png"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=9041",
          "author": "disassociated.com",
          "description": "From yesterday, 1 January 2025, the price of a ten-year Australian passport rose to four-hundred-and-twelve Australian dollars. That’s the cost of thirty-five pints of Victoria Bitter at the local pub. Happy New Year. As a comparison, the new price converts to a little over two-hundred-and-fifty dollars American, a little under two-hundred-and-fifty Euros, and about two-hundred […]",
          "link": "https://disassociated.com/australian-passport-worlds-most-expensive/",
          "publishedOn": "2025-01-01T20:00:58.000Z",
          "wordCount": 241,
          "title": "Australia, land of the most expensive passport in the world",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9038",
          "author": "disassociated.com",
          "description": "Maxwell Neely-Cohen, writing for Harvard Law School’s Library Innovation Lab: If you, right now, had the goal of digitally storing something for 100 years, how should you even begin to think about making that happen? How should the bits in your stewardship be stored with such a target in mind? How do our methods and […]",
          "link": "https://disassociated.com/storing-digital-data-one-hundred-years/",
          "publishedOn": "2025-01-01T19:30:22.000Z",
          "wordCount": 312,
          "title": "Storing digital data for one hundred years: how is this possible?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9035",
          "author": "disassociated.com",
          "description": "The annual Hottest 100 countdown is part and parcel of the Australian music scene. Hosted by Australian indie radio station Triple J, since 1978, the poll gives listeners the chance to vote for their favourite music of the previous year. The countdown itself takes place on Saturday 25 January 2025. I don’t always listen in […]",
          "link": "https://disassociated.com/voting-open-2024-triple-j-hottest-100-music-poll/",
          "publishedOn": "2025-01-01T19:00:10.000Z",
          "wordCount": 196,
          "title": "Voting open for the 2024 Triple J Hottest 100 music poll",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9030",
          "author": "disassociated.com",
          "description": "The concept of gravastars (or gravitational vacuum stars) is a fascinating alternative to the idea of black holes, although if their presence were ever proved, they would not rule out the existence of black holes. Proposed by Pawel O. Mazur and Emil Mottola some twenty years ago, these objects are consistent with Albert Einstein’s general […]",
          "link": "https://disassociated.com/gravastars-black-holes-weird-cosmic-double-act/",
          "publishedOn": "2025-01-01T18:30:02.000Z",
          "wordCount": 270,
          "title": "Gravastars and black holes, a weird cosmic double act",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9015",
          "author": "disassociated.com",
          "description": "Code is code, what difference does the font you choose in whatever app you use for coding possibly make? As long as the code works as intended, what does appearance have to do with it? But the conversation I found on the topic — which in fact started months ago — actually relates to a […]",
          "link": "https://disassociated.com/favourite-monospaced-font-coding/",
          "publishedOn": "2024-12-30T20:00:32.000Z",
          "wordCount": 326,
          "title": "Favourite monospaced font for coding, do people have such a thing?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9021",
          "author": "disassociated.com",
          "description": "Literary writers at The Sydney Morning Herald canvassed critics, editors, and writers, including Jane Sullivan, David Free, Gyan Yankovich, and Beejay Silcox, to determine the best ten books of this century, or the last twenty-five years. Producing such a small list from a relatively long time frame, will doubtless generate discussion. Anyway, Praiseworthy by Alexis […]",
          "link": "https://disassociated.com/ten-best-novels-twenty-first-century/",
          "publishedOn": "2024-12-30T19:30:21.000Z",
          "wordCount": 214,
          "title": "The ten best novels of the twenty-first century to date",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9027",
          "author": "disassociated.com",
          "description": "I’m talking about the Australian downtempo electronica music act, not the public broadcaster of India. In the hubbub of the silly season, I forgot to mention a new album, Tranquil Motion, was released earlier this month. Track it down on Bandcamp, or your favourite music streamer. I could use some tranquil motion right now…",
          "link": "https://disassociated.com/music-tranquil-motion-new-album-all-india-radio/",
          "publishedOn": "2024-12-30T19:00:16.000Z",
          "wordCount": 166,
          "title": "Tranquil Motion, a new album from All India Radio",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": []
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/a-year-in-german-culture",
          "author": null,
          "description": "Gaza and censorship.",
          "link": "https://newleftreview.org/sidecar/posts/a-year-in-german-culture",
          "publishedOn": "2024-12-31T15:30:46.000Z",
          "wordCount": 2275,
          "title": "Thomas Meaney: &ldquo;A Year in German Culture&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/12/csm-kosmos-klee-nordzimmer-6fbb647a2d.jpg"
        }
      ]
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    },
    {
      "title": "News Minimalist",
      "feedUrl": "https://rss.beehiiv.com/feeds/4aF2pGVAEN.xml",
      "siteUrl": "https://newsletter.newsminimalist.com/",
      "articles": [
        {
          "id": "https://newsletter.newsminimalist.com/p/scientists-to-explore-life-creation-from-basic-chemicals-2-more-stories",
          "author": null,
          "description": "European scientists launch MiniLife project to create lab-made life, companies in Australia start mandatory climate disclosures, and discontent shapes global elections as incumbents lose votes.",
          "link": "https://newsletter.newsminimalist.com/p/scientists-to-explore-life-creation-from-basic-chemicals-2-more-stories",
          "publishedOn": "2025-01-03T16:19:25.000Z",
          "wordCount": 6372,
          "title": "Scientists to explore life creation from basic chemicals + 2 more stories",
          "imageUrl": "https://beehiiv-images-production.s3.amazonaws.com/uploads/publication/thumbnail/d0318cb6-0493-4e34-b055-76456e6c0f76/landscape_template__3_.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}