{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "2d71dc91ba8d25a9634204389216e742e9917a1e",
          "author": "Channy Yun (윤석찬)",
          "description": "Amazon Titan Image Generator v2 provides unprecedented creative capabilities: image conditioning, color control, background removal, and subject preservation via fine-tuning for brand consistency.",
          "link": "https://aws.amazon.com/blogs/aws/amazon-titan-image-generator-v2-is-now-available-in-amazon-bedrock/",
          "publishedOn": "2024-08-06T19:03:08.000Z",
          "wordCount": 2188,
          "title": "Amazon Titan Image Generator v2 is now available in Amazon Bedrock",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/08/05/TIG2c2-feat-img.png"
        },
        {
          "id": "02edb4f291249e0bfbd2cfefedc5df1d39555858",
          "author": "Matheus Guimaraes",
          "description": "Summer is reaching its peak for some of us around the globe, and many are heading out to their favorite holiday destinations to enjoy some time off. I just came back from holidays myself and I couldn’t help thinking about the key role that artificial intelligence (AI) plays in our modern world to help us […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-q-business-aws-cloudformation-amazon-workspaces-update-and-more-aug-5-2024/",
          "publishedOn": "2024-08-05T17:30:02.000Z",
          "wordCount": 1887,
          "title": "AWS Weekly Roundup: Amazon Q Business, AWS CloudFormation, Amazon WorkSpaces update, and more (Aug 5, 2024)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/08/13/AWS-WIR-default.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": [
        {
          "id": "4c0d6017f7c1386a5b4dec794fa1e21422e9c2fe",
          "author": "Aman Lal",
          "description": "In today’s fast-paced software as a service (SaaS) landscape, tenant portability is a critical capability for SaaS providers seeking to stay competitive. By enabling seamless movement between tiers, tenant portability allows businesses to adapt to changing needs. However, manual orchestration of portability requests can be a significant bottleneck, hindering scalability and requiring substantial resources. As […]",
          "link": "https://aws.amazon.com/blogs/architecture/tenant-portability-move-tenants-across-tiers-in-a-saas-application/",
          "publishedOn": "2024-08-07T17:12:13.000Z",
          "wordCount": 2116,
          "title": "Tenant portability: Move tenants across tiers in a SaaS application",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fc074d501302eb2b93e2554793fcaf50b3bf7291/2024/07/30/fig1-tenant-portability-958x630.png"
        }
      ]
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps & Developer Productivity Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": [
        {
          "id": "f383bcb9ec048b73375bec51ac8752a5b1290f19",
          "author": "Jehu Gray",
          "description": "“All code will become legacy”. This saying, widely recognized amongst software developers, highlights the reality of their day-to-day activities. While writing new code is an integral part of a developer’s role, a significant portion of their time is dedicated to refactoring and maintaining existing codebases. Developers typically encounter numerous challenges when attempting to understand and […]",
          "link": "https://aws.amazon.com/blogs/devops/code-clarity-enhancing-code-understanding-and-efficiency-with-amazon-q-developer/",
          "publishedOn": "2024-08-09T13:30:56.000Z",
          "wordCount": 2426,
          "title": "Code Clarity: Enhancing Code Understanding and Efficiency with Amazon Q Developer",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/08/08/CodeC.png"
        },
        {
          "id": "48429d91a938bbf293ffce211846060b22069209",
          "author": "Ryan Yanchuleff",
          "description": "Writing clear and concise Git commit messages is crucial for effective version control and collaboration. However, when working with complex projects or codebases, providing additional context can be challenging. In this blog post, we’ll explore how to leverage Amazon Q Developer to analyze our code changes for us and produce meaningful commit messages for Git. […]",
          "link": "https://aws.amazon.com/blogs/devops/generating-accurate-git-commit-messages-with-amazon-q-developer-cli-context-modifiers/",
          "publishedOn": "2024-08-07T19:00:10.000Z",
          "wordCount": 1823,
          "title": "Generating Accurate Git Commit Messages with Amazon Q Developer CLI Context Modifiers",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/08/06/context-modifier-image.jpg"
        },
        {
          "id": "3c406d6b6643e9f7cd3259f269265514c76240a2",
          "author": "Ryan Yanchuleff",
          "description": "“Be yourself; everyone else is already taken.” -Oscar Wilde In the real world as in the world of technology and authentication, the ability to understand who we are is important on many levels. In this blog post, we’ll look at how the ability to uniquely identify ourselves in the AWS console can lead to a […]",
          "link": "https://aws.amazon.com/blogs/devops/implementing-identity-aware-sessions-with-amazon-q-developer/",
          "publishedOn": "2024-08-07T18:58:43.000Z",
          "wordCount": 2514,
          "title": "Implementing Identity-Aware Sessions with Amazon Q Developer",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/08/06/identity-aware-image.jpg"
        },
        {
          "id": "60c3228f9cecdd1129746426fa63b39e04be4a39",
          "author": "Riya Dani",
          "description": "Did you know that Amazon Q Developer, a new type of Generative AI-powered (GenAI) assistant, can help developers and DevOps engineers accelerate Infrastructure as Code (IaC) development using the AWS Cloud Development Kit (CDK)? IaC is a practice where infrastructure components such as servers, networks, and cloud resources are defined and managed using code. Instead […]",
          "link": "https://aws.amazon.com/blogs/devops/how-to-use-amazon-q-developer-to-deploy-a-serverless-web-application-with-aws-cdk/",
          "publishedOn": "2024-08-07T15:26:11.000Z",
          "wordCount": 2712,
          "title": "How to use Amazon Q Developer to deploy a Serverless web application with AWS CDK",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/08/01/Screenshot-2024-08-01-at-1.16.29 PM-1260x612.png"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/422d6218fdf1",
          "author": "Netflix Technology Blog",
          "description": "Hechao Li, Roger Cruz",
          "link": "https://netflixtechblog.com/investigation-of-a-cross-regional-network-performance-issue-422d6218fdf1?source=rss----2615bd06b42e---4",
          "publishedOn": "2024-08-05T22:18:00.000Z",
          "wordCount": 5317,
          "title": "Investigation of a Cross-regional Network Performance Issue",
          "imageUrl": "https://miro.medium.com/v2/da:true/resize:fit:1022/0*RpHklRseVBeBJG6u"
        }
      ]
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "ac084886fb841ea3e723373170666aa3ce78fc34",
          "author": "Sai Charan Teja Gopaluni",
          "description": "Overview Cordial is a cross-channel marketing platform that offers tools to fully automate marketing strategies. By automating marketing execution, Cordial liberates technology teams to focus on their core strengths: building and creativity. It empowers technology teams to delegate data access and management to marketers, using Cordial’s robust platform to migrate, transform, and deliver complex data […]",
          "link": "https://aws.amazon.com/blogs/containers/cordials-journey-implementing-bottlerocket-and-karpenter-in-amazon-eks/",
          "publishedOn": "2024-08-08T23:30:59.000Z",
          "wordCount": 2442,
          "title": "Cordial’s journey implementing Bottlerocket and Karpenter in Amazon EKS",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/07/30/Featured-images-for-Containers-Blog-5-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=330467",
          "author": "Josh Frank",
          "description": "In this episode of CounterPunch Radio, Rebecca Maria Goldschmidt talks with fellow members of California Jewish Artists for Palestine, Sophia Sobko and Steph Kudisch, about their collective decision to submit and withdraw explicitly anti-Zionist artworks to an open call for Jewish artists at the Contemporary Jewish Museum in San Francisco. They discuss the process of pulling their works out of the exhibition; the importance of the academic and cultural boycott of Israel (PACBI); and what it means to be Jewish artists publicly confronting Jewish arts institutions that receive Zionist funding and are struggling to address the ongoing genocide of the Palestinian people.\nSteph Kudisch is a trans genderfluid artist whose work uses mutated intertidal aesthetics and personal storytelling to dwell in in-betweens. They work as a teaching artist on Lisjan Ohlone land, also known as the San Francisco Bay Area. Kudisch and their collaborator Kate Laster form Clear as Schmutz Press as well as the collective Hevra Kadisha in which they create site-specific works across the mediums of printmaking, sculpture, performance, and sound.\nSophia Sobko (she/they) is an artist, educator & researcher born in Moscow, USSR & based on Lisjan Ohlone Land in Oakland, CA. They are excited about collaborative learning, participatory art, and co-creating a more liberatory world. Sophia is founder/co-steward of two queer post-Soviet Jewish collectives: Kolektiv Goluboy Vagon and Krivoy Kolektiv.\nGet in touch with CJAFP at cajewishartists4palestine[@]proton.me More\nThe post California Jewish Artists for Palestine: Sophia Sobko and Steph Kudisch appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/california-jewish-artists-for-palestine-sophia-sobko-and-steph-kudisch/",
          "publishedOn": "2024-08-09T22:41:22.000Z",
          "wordCount": null,
          "title": "California Jewish Artists for Palestine: Sophia Sobko and Steph Kudisch",
          "itunes": {
            "duration": "1:06:45"
          },
          "enclosure": {
            "url": "https://media.blubrry.com/counterpunch_radio/content.blubrry.com/counterpunch_radio/AUDIOCP_CA4FPPod.mp3",
            "length": "70472393",
            "type": "audio/mpeg"
          },
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330380",
          "author": "Melvin Goodman",
          "description": "The New York Times has always favored Israel in its editorial writings, but no Times’ columnist compares to Bret Stephens, whose writings are chauvinistic and bellicose.,  Stephens, a former editor of the Jerusalem Post and a supporter of all Israeli policies, left the Wall Street Journal to join the Times in 2017 because he believed Israel was not getting a fair hearing in the mainstream media.  In doing so, he joined other Jewish columnists at the Times (Thomas Friedman, David Brooks, Paul Krugman, and Roger Cohen).  However, these men brought some objectivity to America’s Israel problem.  Stephens has no limits in his support of Israel. More\nThe post Mainstream Media’s Leading Warmonger: NYT Columnist Bret Stephens appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/mainstream-medias-leading-warmonger-nyt-columnist-bret-stephens/",
          "publishedOn": "2024-08-09T06:01:34.000Z",
          "wordCount": null,
          "title": "Mainstream Media’s Leading Warmonger: NYT Columnist Bret Stephens",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330270",
          "author": "Richard D. Wolff",
          "description": "As the French economist Thomas Piketty most recently exposed, capitalism, across time and space, has always tended to produce ever-greater economic inequality. Oxfam, a global charity, reported that 2022’s 10 richest men together had six times more wealth than the poorest 3.1 billion people on earth. The lack of democracy inside workplaces or enterprises is both a cause and an effect of capitalism’s unequal distribution of income and wealth. More\nThe post Capitalism’s Unequal Distribution Deprives You of True Freedom appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/capitalisms-unequal-distribution-deprives-you-of-true-freedom/",
          "publishedOn": "2024-08-09T06:01:31.000Z",
          "wordCount": null,
          "title": "Capitalism’s Unequal Distribution Deprives You of True Freedom",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330268",
          "author": "Jeffrey St. Clair",
          "description": "From his locked room, Chester Burnett could hear the trains rattling up the tracks, one every half hour. They reminded him of home, back on Dockery Plantation, when he played on the porches of old shacks with Charley Patton, blowing his harmonica to the rhythm of those big wheels rolling along the rails. Those northbound  More\nThe post Conscience of the Blues: How Howlin’ Wolf Got Caged in Oregon appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/conscience-of-the-blues-how-howlin-wolf-got-caged-in-oregon/",
          "publishedOn": "2024-08-09T06:00:54.000Z",
          "wordCount": null,
          "title": "Conscience of the Blues: How Howlin’ Wolf Got Caged in Oregon",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330245",
          "author": "Michael Schwalbe",
          "description": "Since October 7, 2023, blatantly racist statements by Israeli leaders have been widely reported. Israeli Prime Minister Benjamin Netanyahu likened Palestinians to Amalekites, an ancient tribe in Old Testament lore whom Yahweh told the Israelites to destroy—men, women, children, infants, and cattle. Israeli Defense Minister Yoav Gallant referred to Israel’s assault on Gaza as a fight against “human animals.” Other Israeli officials called for erasing Gaza from the face of the earth, claiming that no Palestinian civilians are innocent. More\nThe post Israeli Racism Shouldn’t Get a Pass in America appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/israeli-racism-shouldnt-get-a-pass-in-america/",
          "publishedOn": "2024-08-09T06:00:48.000Z",
          "wordCount": null,
          "title": "Israeli Racism Shouldn’t Get a Pass in America",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330353",
          "author": "Mandy Medley - Erik Wallenberg",
          "description": "Originally published August 16, 2021 in Rampant When we wrote this article in August 2021, many of us in the movement to stop Line 3 were hopeful that we might make the governor of Minnesota listen to our demands to respect treaty rights and recognize that building Line 3 would mean, in the words of  More\nThe post How Gov. Tim Walz Failed the Indigenous-led Movement to Stop the Line 3 Pipeline appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/how-gov-tim-walz-failed-indigenous-led-movement-to-stop-the-line-3-pipeline/",
          "publishedOn": "2024-08-09T05:59:47.000Z",
          "wordCount": null,
          "title": "How Gov. Tim Walz Failed the Indigenous-led Movement to Stop the Line 3 Pipeline",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330428",
          "author": "Aviva Chomsky",
          "description": "On August 9, 2001, in Colombia, riot police and private security forces from the Cerrejón coal mine — one of the largest open-pit coal mines in the world — surrounded the remote community of Tabaco. They then dragged residents out of their homes and bulldozed what remained of that town’s structures. There was, after all,  More\nThe post Fossil-Fuelized Colonialism appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/fossil-fuelized-colonialism/",
          "publishedOn": "2024-08-09T05:59:22.000Z",
          "wordCount": null,
          "title": "Fossil-Fuelized Colonialism",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330416",
          "author": "Matthew Stevenson",
          "description": "Maybe Donald Trump’s revelations to that colosseum of rapturous Christians were on point? Maybe we don’t need to vote after all? Maybe voting is so 1960s—when senators such as Robert Kennedy (the Camelot father, not the bear-dumping son) or Eugene McCarthy tried to turn out the vote by quoting from Aeschylus or George Bernard Shaw  More\nThe post Harris’s Delayed Coronation Streets appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/harriss-delayed-coronation-streets/",
          "publishedOn": "2024-08-09T05:58:59.000Z",
          "wordCount": null,
          "title": "Harris’s Delayed Coronation Streets",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330336",
          "author": "Ramzy Baroud",
          "description": "The idea that the war on Gaza is essentially waged and sustained by and for Israeli Prime Minister Benjamin Netanyahu has, for long, dominated political analyses on the subject. The notion is often kept alive by public opinion inside Israel. Most polls produced since the start of the Israeli genocide on Gaza suggest that an  More\nThe post Zionism on the Brink: The Gaza War Beyond Netanyahu  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/zionism-on-the-brink-the-gaza-war-beyond-netanyahu/",
          "publishedOn": "2024-08-09T05:58:56.000Z",
          "wordCount": null,
          "title": "Zionism on the Brink: The Gaza War Beyond Netanyahu",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330284",
          "author": "Kathleen Wallace",
          "description": "How’s that for a title? I’m guessing we just lost several men right there. That’s okay, for those of you still here—let’s discuss this incredibly disgusting obsession that men of the reactionary right seem to have in regard to the very normal and what should be mundane, workings and plumbing of the female body. We’ve  More\nThe post Enough of the Creepy Obsession with Fertility, Menstruation, Labia and Boobs appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/enough-of-the-creepy-obsession-with-fertility-menstruation-labia-and-boobs/",
          "publishedOn": "2024-08-09T05:58:52.000Z",
          "wordCount": null,
          "title": "Enough of the Creepy Obsession with Fertility, Menstruation, Labia and Boobs",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330154",
          "author": "Ken Silverstein",
          "description": "The idea that the GOP has been taken over by radical anti-capitalists out to destroy the American Way of Life will surely come as a surprise to Trump backers such as Blackstone Group CEO Stephen Schwarzman, Shaun Maguire and Doug Leone of Sequoia Capital, venture capitalist David Sacks, who spoke at the convention two nights before Vance, and Elon Musk, who recently pledged to donate $45 million a month to a Super PAC that’s working to elect the former president. More\nThe post The New York Times has Identified Wall Street’s Most Dangerous Enemy: Billionaire-Backed Millionaire JD Vance appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/the-new-york-times-has-identified-wall-streets-most-dangerous-enemy-billionaire-backed-millionaire-jd-vance/",
          "publishedOn": "2024-08-09T05:58:32.000Z",
          "wordCount": null,
          "title": "The New York Times has Identified Wall Street’s Most Dangerous Enemy: Billionaire-Backed Millionaire JD Vance",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330247",
          "author": "Vijay Prashad",
          "description": "On Monday, August 5, former Prime Minister Sheikh Hasina boarded a Bangladesh Air Force C-130J military transport in a hurry and fled to Hindon Air Force base, outside Delhi. Her plane was refueled and reports said that she intended to fly on either to the United Kingdom (her niece, Tulip Siddiq is a minister in  More\nThe post The Conundrums of Bangladeshi Politics appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/the-conundrums-of-bangladeshi-politics/",
          "publishedOn": "2024-08-09T05:58:21.000Z",
          "wordCount": null,
          "title": "The Conundrums of Bangladeshi Politics",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330248",
          "author": "Eve Ottenberg",
          "description": "So income from your three jobs won’t cover your rent increase. There are no beds at the shelter and public housing has a waiting list decades long. You buy a tent and sleeping bag and move into a town park. This would have worked until June 28, when the Supreme Court essentially ruled that municipalities  More\nThe post The Supreme Court to the Homeless: Drop Dead! appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/the-supreme-court-to-the-homeless-drop-dead/",
          "publishedOn": "2024-08-09T05:57:55.000Z",
          "wordCount": null,
          "title": "The Supreme Court to the Homeless: Drop Dead!",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330332",
          "author": "Robert Hunziker",
          "description": "Temperatures for the entire month of July in Antarctica were 50°F above average, but it also experienced days when temperatures spiked up to 82°F above average. Yes, Antarctica is the world’s deepfreeze, and it is the dead of winter. What does this portend? For starters, according to Michael Dukes, director of forecasting at MetDesk: “In  More\nThe post Midwinter Antarctica 50°F Above Average appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/midwinter-antarctica-50f-above-average/",
          "publishedOn": "2024-08-09T05:56:58.000Z",
          "wordCount": null,
          "title": "Midwinter Antarctica 50°F Above Average",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330414",
          "author": "Ishmael Reed",
          "description": "To be a Trump Republican is to live in a horror film. Fears abound. The fear of immigrants, the fear of Woke (a euphemism for Black culture), a fear of books, a fear of cat ladies, a fear of being replaced, a fear of George Soros, and now Anthropophagophobia, the fear of being eaten. In  More\nThe post MAGA and the Fear of Being Eaten appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/maga-and-the-fear-of-being-eaten/",
          "publishedOn": "2024-08-09T05:56:50.000Z",
          "wordCount": null,
          "title": "MAGA and the Fear of Being Eaten",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330347",
          "author": "Graham Peebles",
          "description": "The legacy left by the Conservatives after 14 years in government is not just economic stagnation, and the destruction of public services, it is social division, far right extremism and anger. Violence, racism and hate are the common language of far-right groups/individuals the world over, all of which has been writ large on the streets  More\nThe post UK Riots: Racism And Islamophobia Meets Community Unity appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/uk-riots-racism-and-islamophobia-meets-community-unity/",
          "publishedOn": "2024-08-09T05:56:01.000Z",
          "wordCount": null,
          "title": "UK Riots: Racism And Islamophobia Meets Community Unity",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330377",
          "author": "Alliyah Lusuegro",
          "description": "There’s an image that’s stayed with me for weeks: A sea of people holding up “Mass Deportation Now” signs at the Republican National Convention. Since then, I’ve been plagued with nightmares of mass raids by the military and police across the country. I see millions of families being torn apart, including families with citizen children.  More\nThe post Mass Deportations Would be a Nightmare appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/mass-deportations-would-be-a-nightmare/",
          "publishedOn": "2024-08-09T05:55:18.000Z",
          "wordCount": null,
          "title": "Mass Deportations Would be a Nightmare",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330155",
          "author": "M. Shahid Alam",
          "description": "It is increasingly becoming clear–even to some Western observers—that the Zionist project has run its course. It had an extraordinary run, but it has now reached the end of its settler-colonial track. The creation of this exclusionary settler-colonial Jewish state was a historical anomaly, among the greatest blunders of Western civilization in the twentieth century.  More\nThe post Zionism: Managing Its Demise appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/zionism-managing-its-demise/",
          "publishedOn": "2024-08-09T05:55:16.000Z",
          "wordCount": null,
          "title": "Zionism: Managing Its Demise",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330261",
          "author": "Megan Russell",
          "description": "In war, there are no winners– and in a war between the US and China, the entire world would lose. That’s not just considering the mass loss of life that would occur, but also the reverberating effects of war that would sink millions into economic devastation, destroy the environment, and lead to widespread displacement and  More\nThe post The US is Preparing for an Unwinnable War Against China appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/the-us-is-preparing-for-an-unwinnable-war-against-china/",
          "publishedOn": "2024-08-09T05:54:30.000Z",
          "wordCount": null,
          "title": "The US is Preparing for an Unwinnable War Against China",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330331",
          "author": "M. Reza Behnam",
          "description": "The future is uncertain for a country birthed in violence and that lives an ethos of violence. The Middle East has known more than its share of tragedy and grief since 14 May 1948.  On that date, Israel proclaimed itself a state in Palestine and within minutes, U.S. President Harry S. Truman recognized its provisional  More\nThe post Born and Dwells in Violence:  Israel’s Mission in the Middle East appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/born-and-dwells-in-violence-israels-mission-in-the-middle-east/",
          "publishedOn": "2024-08-09T05:52:21.000Z",
          "wordCount": null,
          "title": "Born and Dwells in Violence:  Israel’s Mission in the Middle East",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330376",
          "author": "Kathy Kelly",
          "description": "Following World War II, Albert Camus posed a “formidable gamble” to those who had survived a tragedy of immense proportions. “We’re in history up to our necks,” he observed, yet we must wager that “words are more powerful than munitions.” “Leave or die” are the horrid words threatening largely unprotected Palestinian civilians in Gaza as dismayed populations  More\nThe post We Must Oppose Israel’s Dangerous Gamble Before It’s Too Late appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/we-must-oppose-israels-dangerous-gamble-before-its-too-late/",
          "publishedOn": "2024-08-09T05:51:48.000Z",
          "wordCount": null,
          "title": "We Must Oppose Israel’s Dangerous Gamble Before It’s Too Late",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330392",
          "author": "Daniel Warner",
          "description": "“The deal that secured their freedom was a feat of diplomacy,” President Biden said in announcing the release of 16 people from Russia—including five Germans and seven Russian citizens. U.S. National Security Advisor Jake Sullivan also reiterated that the prisoner exchange was “a feat of diplomacy.” Vice-President Kamala Harris said the release was “an extraordinary  More\nThe post The Prisoner Swap was Multinational But Not Multilateral Diplomacy appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/the-prisoner-swap-was-multinational-but-not-multilateral-diplomacy/",
          "publishedOn": "2024-08-09T05:50:12.000Z",
          "wordCount": null,
          "title": "The Prisoner Swap was Multinational But Not Multilateral Diplomacy",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330371",
          "author": "Alfred de Zayas",
          "description": "When one says appeasement, one would normally think of dialogue, compromise, moderation, civilization. Personally, I think of détente, rapprochement, truce, reconciliation.  I think of the necessity of listening to the other side, trying to understand the origin of grievances, exercising patience and perseverance in the spirit of the legendary Swiss mediator Nicolas de Flue[1].  I also think  More\nThe post Appeasement Reconsidered appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/appeasement-reconsidered/",
          "publishedOn": "2024-08-09T05:49:44.000Z",
          "wordCount": null,
          "title": "Appeasement Reconsidered",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330370",
          "author": "Binoy Kampmark",
          "description": "Bureaucrats tasked with protecting national security are often inclined to encourage insecurity.  It’s all part of the job prescription.  The imperative is understandable if chillingly amoral: increased budgets are demanded to counter threats, however spectral; justifications for existing budgets needlessly bloated are always sought.  In the Cold War, an old favourite was the teeth-chattering concern that the other  More\nThe post Terror Threats and Radicalization Down Under appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/terror-threats-and-radicalisation-down-under/",
          "publishedOn": "2024-08-09T05:48:23.000Z",
          "wordCount": null,
          "title": "Terror Threats and Radicalization Down Under",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330369",
          "author": "Eugene Doyle",
          "description": "In an astonishing “Fuck you” to the survivors of the 1945 US nuclear bombing of Nagasaki, several Western countries including the US, Australia, Canada, France, Italy and the UK have just dropped a bombshell: announcing their ambassadors are shunning this week’s commemorations in solidarity with Israel. Last week the mayor of Nagasaki, Shiro Suzuki, rescinded  More\nThe post Team Genocide Walks Out on Nagasaki Commemorations appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/team-genocide-walks-out-on-nagasaki-commemorations/",
          "publishedOn": "2024-08-09T05:47:29.000Z",
          "wordCount": null,
          "title": "Team Genocide Walks Out on Nagasaki Commemorations",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330327",
          "author": "John K. White",
          "description": "Everyone has a favorite Kubrick film, Supremes song, or baseball player – anything whose value can be judged, categorized, or argued about in a presumed pantheon of greats. Alas, ranked lists are hard to compile and open to much debate. My best may be your stinker and vice versa. Despite the difficulty, energy films would  More\nThe post The 20 Best Energy Films: From Gritty Carbon-Spewing Potboilers to Nuclear Reactor Catastrophes appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/the-20-best-energy-films-from-gritty-carbon-spewing-potboilers-to-nuclear-reactor-catastrophes/",
          "publishedOn": "2024-08-09T05:45:10.000Z",
          "wordCount": null,
          "title": "The 20 Best Energy Films: From Gritty Carbon-Spewing Potboilers to Nuclear Reactor Catastrophes",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330379",
          "author": "Rebecca Hart Holder",
          "description": "Four Women’s Health Services is a legitimate reproductive health care clinic and abortion provider in Attleboro, Massachusetts. Directly behind the clinic is a larger building bearing the sign “Attleboro Women’s Health Center.” This second facility advertises free ultrasounds, free pregnancy testing, and “pregnancy counseling.” Their website features the term “abortion” so many times that it’s  More\nThe post Anti-Abortion Centers Deceive Patients. Here’s How We Can Fight Back appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/anti-abortion-centers-deceive-patients-heres-how-we-can-fight-back/",
          "publishedOn": "2024-08-09T05:44:56.000Z",
          "wordCount": null,
          "title": "Anti-Abortion Centers Deceive Patients. Here’s How We Can Fight Back",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330368",
          "author": "Damon Orion",
          "description": "The economic repercussions of COVID-19 have dealt a heavy blow to intimate music venues in the U.S. and abroad. According to the music industry news platform Hypebot, “The UK lost 125 smaller music venues” in 2023, “and Australia lost 1,300 or one-third of its small and midsized music venues since the start of the COVID pandemic. While  More\nThe post The Aquadome Lives On appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/the-aquadome-lives-on/",
          "publishedOn": "2024-08-09T05:44:25.000Z",
          "wordCount": null,
          "title": "The Aquadome Lives On",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330372",
          "author": "Jonah Raskin",
          "description": "Someone, I forget who, said “we’re all Marxists now,” and, while that might have been truer during the antifascist 1930s  than at any other time in history, it is not true now. Marxism probably has as many if not more fierce foes today around the world, and from Hungary to Brazil,  as it had during the height  More\nThe post The Neo-Marxism of Malcolm Harris is Alive and Well in “Palo Alto” appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/the-neo-marxism-of-malcolm-harris-is-alive-and-well-in-palo-alto/",
          "publishedOn": "2024-08-09T05:42:12.000Z",
          "wordCount": null,
          "title": "The Neo-Marxism of Malcolm Harris is Alive and Well in “Palo Alto”",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330356",
          "author": "Dave Lindorff",
          "description": "A massive rally in Philadelphia on Tuesday evening at which presumptive Democratic presidential candidate Kamala Harris introduced Minnesota Gov. Tim Walz as her surprise pick for a vice-presidential running mate had an explosive energy and enthusiasm that reminded me of a 2020 visit to the same venue by then Democratic primary candidate Bernie Sanders. In  More\nThe post Kamala Harris is a Huge Draw at Massive Philadelphia Rally appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/09/kamala-harris-is-a-huge-draw-at-massive-philadelphia-rally/",
          "publishedOn": "2024-08-09T05:38:19.000Z",
          "wordCount": null,
          "title": "Kamala Harris is a Huge Draw at Massive Philadelphia Rally",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": [
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=31057",
          "author": "Richard Audoly, Miles Guerin, Giorgio Topa, and Roshie Xing",
          "description": "Has labor demand changed since the COVID-19 pandemic? In this post, we leverage detailed data on the universe of U.S. online job listings to study the dynamics of labor demand pre- and post-COVID. We find that there has been a significant shift in listings out of the central cities and into the “fringe” portion of large metro areas, smaller metro areas, and rural areas. We also find a substantial decline in job listings in computer and mathematical and business and financial operations occupations, and a corresponding increase in job openings in sales, office and administrative support, food preparation, and especially healthcare occupations. These patterns (by geography and by occupation) are interconnected: the biggest declines in job listings by occupation occurred in the largest and densest geographies, and the strongest increases in job listings by occupation occurred in the smaller and less populated geographies.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/08/the-anatomy-of-labor-demand-pre-and-post-covid/",
          "publishedOn": "2024-08-07T11:00:00.000Z",
          "wordCount": 4292,
          "title": "The Anatomy of Labor Demand Pre‑ and Post‑COVID",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/08/LSE_2024_anatomy-of-labor_topa_460_1acc65.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=31202",
          "author": "Andrew Haughwout, Donghoon Lee, Daniel Mangrum, Joelle W. Scally, and Wilbert van der Klaauw",
          "description": "Mortgage balances, the largest component of U.S. household debt, grew by only $77 billion (0.6 percent) in the second quarter of 2024, according to the latest Quarterly Report on Household Debt and Credit from the New York Fed’s Center for Microeconomic Data. This modest increase reflects a substantial slowdown in mortgage origination; only $374 billion was originated during the second quarter, compared to an average of about $1 trillion per quarter between 2021 and 2022. Meanwhile, after nearly thirteen years of decline, balances on home equity lines of credit (HELOC) have begun to rebound, gaining 20 percent since bottoming out at the end of 2021. In this post, we consider the factors behind this upswing, finding that HELOCs have likely become an attractive alternative to cash-out refinancings amid higher interest rates.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/08/mortgage-lock-in-spurs-recent-heloc-demand/",
          "publishedOn": "2024-08-06T15:00:00.000Z",
          "wordCount": 3977,
          "title": "Mortgage Lock‑In Spurs Recent HELOC Demand",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/08/LSE_2024_HHDC_scally_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=30916",
          "author": "Pablo D. Azar, Adrian G. Casillas, and Maryam Farboodi",
          "description": "Decentralized Finance, or DeFi, is a rapidly growing ecosystem of financial applications built on blockchain technology, primarily on the Ethereum network. These applications aim to recreate traditional financial instruments and services, such as lending, borrowing, trading, and insurance. The DeFi intermediation chain connects a series of intermediaries who find arbitrage opportunities, aggregate transactions into blocks, validate these blocks, and ultimately append them to the blockchain. In this post, we summarize results from our staff report describing how arbitrage opportunities arise in the Ethereum blockchain, and how the need to keep these arbitrage opportunities private gives rise to the intermediation chain.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/08/the-defi-intermediation-chain/",
          "publishedOn": "2024-08-05T11:00:00.000Z",
          "wordCount": 4173,
          "title": "The DeFi Intermediation Chain",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/08/LSE_2024_crypto-intermediation_azar_460.jpg"
        }
      ]
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45530",
          "author": "peterradford",
          "description": "from Peter Radford – a critique of the absurdity of economics I finally read “The Accountability Machine”, the book by Dan Davies.  It’s worth the effort.  You can read it in a number of ways.  As a peon to cybernetics and Stafford Beer.  As a critique of the absurdity of economics.  As a summary of […]",
          "link": "https://rwer.wordpress.com/2024/08/08/a-review-of-dan-davies-book/",
          "publishedOn": "2024-08-08T21:17:54.000Z",
          "wordCount": 5433,
          "title": "A review of Dan Davies’ book",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45523",
          "author": "Lars Syll",
          "description": "from Lars Syll Paul Davidson, the co-founder of the Journal of Post Keynesian Economics (JPKE) and a leading Post Keynesian economist, died on June 20, 2024, in Chicago. He was born in Brooklyn, NY, on October 23, 1930, about a year after the Great Crash of 1929. He was a staunch defender of the importance […]",
          "link": "https://rwer.wordpress.com/2024/08/07/paul-davidson-1930-2024-in-memoriam/",
          "publishedOn": "2024-08-07T18:18:01.000Z",
          "wordCount": 6475,
          "title": "Paul Davidson (1930-2024) In Memoriam",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45515",
          "author": "Asad Zaman",
          "description": "from Asad Zaman and WEA Pedagogy Blog This is the second post in a sequence explaining post WW2 USA strategies for global dominance. For the previous post, see: Hudson on Super Imperialism 1 U.S. Financial Strategies for Global Dominance  Introduction: Michael Hudson, in his podcast and writings, provides a profound critique of the U.S.’s economic and financial […]",
          "link": "https://rwer.wordpress.com/2024/08/05/hudson-on-super-imperialism-2/",
          "publishedOn": "2024-08-05T20:39:28.000Z",
          "wordCount": 5014,
          "title": "Hudson on Super Imperialism 2",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=276458",
          "author": "Yves Smith",
          "description": "Our bling-free daily links: monkey patrols, ticks woes, EU plastics headfake, new Covid variant? China's car win, Bangladesh as color revolution, Kirby scolds Smotrich, MoA on Kursk incursion, Russia hearts biometrics, Kamal \"I'm speaking,\" Alabama abortion aid prosecution legal challenge, Intel finanical engineering",
          "link": "https://www.nakedcapitalism.com/2024/08/links-8-10-2024.html",
          "publishedOn": "2024-08-10T10:55:43.000Z",
          "wordCount": 4628,
          "title": "Links 8/10/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/00-sheltie.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=276500",
          "author": "Yves Smith",
          "description": "If you have shopped at Kroger, please consider boycotting them over them over their surge pricing grifting plans.",
          "link": "https://www.nakedcapitalism.com/2024/08/corporate-greed-is-out-of-control-warren-slams-krogers-ai-pricing-scheme.html",
          "publishedOn": "2024-08-10T08:14:27.000Z",
          "wordCount": 3704,
          "title": "‘Corporate Greed Is Out of Control’: Warren Slams Kroger’s AI Pricing Scheme",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=276459",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics; Friday's charts: Covid wastewater (still bad) and polling charts (bad for Trump); Lambert lashes himself to the mast; Walz swiftboating: Nice try, no cigar. Boeing's Starliner debacle. Again. ~",
          "link": "https://www.nakedcapitalism.com/2024/08/200pm-water-cooler-8-9-2024.html",
          "publishedOn": "2024-08-09T18:00:32.000Z",
          "wordCount": 16106,
          "title": "2:00PM Water Cooler 8/9/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/helper_olympic.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=276444",
          "author": "Yves Smith",
          "description": "The US is bizarrely pretending it has influence over the coming Iran and Axis of Resistance response to Israel escalation.",
          "link": "https://www.nakedcapitalism.com/2024/08/us-deploys-pathetic-wizard-of-oz-messaging-strategy-to-pretend-it-can-influence-iran-conflict-trajectory.html",
          "publishedOn": "2024-08-09T15:10:04.000Z",
          "wordCount": 11958,
          "title": "US Deploys Pathetic Wizard of Oz Messaging Strategy to Pretend It Can Influence Iran Conflict Trajectory",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/Screen-Shot-2024-08-09-at-6.37.04-PM.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=276418",
          "author": "Lambert Strether",
          "description": "Our fan-based daily links",
          "link": "https://www.nakedcapitalism.com/2024/08/links-8-9-2024.html",
          "publishedOn": "2024-08-09T10:58:14.000Z",
          "wordCount": 16335,
          "title": "Links 8/9/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/falcon.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=276393",
          "author": "Nick Corbishley",
          "description": "\"Given the overwhelming evidence, it is clear to the United States... that Edmundo González Urrutia won the most votes in Venezuela’s July 28 presidential election.\" But it was only clear for four days.",
          "link": "https://www.nakedcapitalism.com/2024/08/why-did-us-quietly-reverse-its-decision-to-recognise-opposition-candidate-edmundo-gonzalez-as-venezuelas-president.html",
          "publishedOn": "2024-08-09T10:45:46.000Z",
          "wordCount": 7910,
          "title": "Why Did US Quietly Reverse Its Decision to Unilaterally Recognise Venezuela’s Opposition Candidate As President?",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=276428",
          "author": "Yves Smith",
          "description": "More evidence that the current level of advanced economy secondary market trading is bad for economic health.",
          "link": "https://www.nakedcapitalism.com/2024/08/the-irrationality-of-markets.html",
          "publishedOn": "2024-08-09T10:10:53.000Z",
          "wordCount": 3905,
          "title": "The Irrationality of Markets",
          "imageUrl": "http://www.nakedcapitalism.com/wp-content/uploads/2015/05/Screen-shot-2015-05-20-at-2.41.51-AM.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=276389",
          "author": "Yves Smith",
          "description": "The TSA is now harassing mere pretty mild political dissenters via intrusive bag checks and deploying heavy-duty surveillance teams",
          "link": "https://www.nakedcapitalism.com/2024/08/department-of-pre-crime-tsa-edition.html",
          "publishedOn": "2024-08-09T10:00:30.000Z",
          "wordCount": 7696,
          "title": "Department of Pre-Crime, TSA Edition",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/00-TSA.webp"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=276398",
          "author": "Lambert Strether",
          "description": "Eight talking points on mask bans.",
          "link": "https://www.nakedcapitalism.com/2024/08/eight-reasons-mask-bans-are-beyond-stupid.html",
          "publishedOn": "2024-08-08T20:25:53.000Z",
          "wordCount": 7244,
          "title": "Eight Reasons Mask Bans Are Beyond Stupid",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=276384",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Open Thread ~",
          "link": "https://www.nakedcapitalism.com/2024/08/200pm-water-cooler-8-8-2024.html",
          "publishedOn": "2024-08-08T18:00:54.000Z",
          "wordCount": 9194,
          "title": "2:00PM Water Cooler 8/8/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/nameless_weed.jpeg"
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "66b406ef4a25d6000ae1ca70",
          "author": "Alex Krivit",
          "description": "This new Automatic SSL/TLS setting will maximize and simplify the encryption modes Cloudflare uses to communicate with origin servers by using the SSL/TLS Recommender",
          "link": "https://blog.cloudflare.com/introducing-automatic-ssl-tls-securing-and-simplifying-origin-connectivity",
          "publishedOn": "2024-08-08T13:05:18.000Z",
          "wordCount": 3093,
          "title": "Introducing Automatic SSL/TLS: securing and simplifying origin connectivity",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/08/Introducing-Automatic-SSL-TLS--securing-and-simplifying-origin-connectivity-OG-1.png"
        },
        {
          "id": "66b360254a25d6000ae1c9cb",
          "author": "Zaid Zaid",
          "description": "August 8, 2024, marks the first anniversary of Project Cybersafe Schools, Cloudflare’s initiative to provide small K-12 public school districts in the United States with a package of Zero Trust cybersecurity solutions – for free, and with no time limit",
          "link": "https://blog.cloudflare.com/celebrating-one-year-of-project-cybersafe-schools",
          "publishedOn": "2024-08-08T13:00:25.000Z",
          "wordCount": 1807,
          "title": "Celebrating one year of Project Cybersafe Schools",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/08/image1-4.png"
        },
        {
          "id": "66b1ed934a25d6000ae1c93f",
          "author": "Shozo Moritz Takaya",
          "description": "Read through the latest milestones and expansions of Cloudflare's global backbone and how it supports our Connectivity Cloud and our services",
          "link": "https://blog.cloudflare.com/backbone2024",
          "publishedOn": "2024-08-06T13:00:22.000Z",
          "wordCount": 2959,
          "title": "The backbone behind Cloudflare’s Connectivity Cloud",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/08/The-Backbone-behind-Cloudflare-s-Connectivity-Cloud-OG-3.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": [
        {
          "id": "https://kubernetes.io/blog/2024/08/07/sig-api-machinery-spotlight-2024/",
          "author": null,
          "description": "We recently talked with Federico Bongiovanni (Google) and David\nEads (Red Hat), Chairs of SIG API Machinery, to know a bit more about\nthis Kubernetes Special Interest Group.\nIntroductions\nFrederico (FSM): Hello, and thank your for your time. To start with, could you tell us about\nyourselves and how you got involved in Kubernetes?\nDavid: I started working on\nOpenShift (the Red Hat\ndistribution of Kubernetes) in the fall of 2014 and got involved pretty quickly in API Machinery. My\nfirst PRs were fixing kube-apiserver error messages and from there I branched out to kubectl\n(kubeconfigs are my fault!), auth (RBAC and *Review APIs are ports\nfrom OpenShift), apps (workqueues and sharedinformers for example). Don’t tell the others,\nbut API Machinery is still my favorite :)\nFederico: I was not as …",
          "link": "https://kubernetes.io/blog/2024/08/07/sig-api-machinery-spotlight-2024/",
          "publishedOn": "2024-08-07T00:00:00.000Z",
          "wordCount": 5509,
          "title": "Spotlight on SIG API Machinery",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=21522",
          "author": null,
          "description": "AI networks play an important role in interconnecting tens of thousands of GPUs together, forming the foundational infrastructure for training, enabling large models with hundreds of billions of parameters such as LLAMA 3.1 405B. This week at ACM SIGCOMM 2024 in Sydney, Australia, we are sharing details on the network we have built at Meta [...]\nRead More...\nThe post RoCE networks for distributed AI training at scale appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/08/05/data-center-engineering/roce-network-distributed-ai-training-at-scale/",
          "publishedOn": "2024-08-05T16:00:26.000Z",
          "wordCount": 3513,
          "title": "RoCE networks for distributed AI training at scale",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/08/RoCE-AI-training_image-1.png"
        },
        {
          "id": "https://engineering.fb.com/?p=21502",
          "author": null,
          "description": "We are open-sourcing DCPerf, a collection of benchmarks that represents the diverse categories of workloads that run in data center cloud deployments. We hope that DCperf can be used more broadly by academia, the hardware industry, and internet companies to design and evaluate future products. DCPerf is available now on GitHub. Hyperscale and cloud datacenter [...]\nRead More...\nThe post DCPerf: An open source benchmark suite for hyperscale compute applications appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/08/05/data-center-engineering/dcperf-open-source-benchmark-suite-for-hyperscale-compute-applications/",
          "publishedOn": "2024-08-05T15:55:14.000Z",
          "wordCount": 2165,
          "title": "DCPerf: An open source benchmark suite for hyperscale compute applications",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2023/01/Eng-Blog-Self-Serve-Hero-Images-DATACENTERS-502-Orange-1.jpg"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=41207172",
          "author": "oefrha",
          "description": "Seems weird to start with “not talking about using something like SQLite where your data is still serialized”, then end up with a home grown transaction log that requires serialization and needs to be replicated, which is how databases are replicated anyway.\nIf your load fits entirely on one server, then just run the database on that damn server and forget about “special architectures to reduce round-trips to your database”. If your data fits entirely in RAM, then use a ramdisk for the database if you want, and replicate it to permanent storage with standard tools. Now that’s actually simple.",
          "link": "https://news.ycombinator.com/item?id=41207172",
          "publishedOn": "2024-08-10T03:51:16.000Z",
          "wordCount": 1472,
          "title": "New comment by oefrha in \"Building a highly-available web service without a database\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41206550",
          "author": "BessS",
          "description": "Hi everyone,\nThis is Bess, Jake's wife. I just want to say how deeply touched I am to see how much Jake and his writing are appreciated here on HN. The intellectual online community which made up a big piece of his life for so long was important to him, as was having a positive influence on others, and it would have meant so much to him- as it does to me- to see the impact he made. Thank you for the people who reached out while he was still alive to make sure he knew just how large that impact was.\nI've lost the love of my life, as well as my thinking and writing partner, and everything is strange and disorienting right now. It's a comfort when nothing feels comfortable to know how appreciated he was and still is. As soon as I'm able, and for anyone who is interested in joining the efforts, I promised him I'd continue the push for FDA reform, and to try to find ways to improve agency for cancer patients so that other people in his position might suffer less than he did. I've never known a braver person. I'll miss him forever, but won't stop trying to keep his legacy alive.\nPlease feel free to reach out anytime (I'm at drbstillman@gmail.com). Thank you also for all the well wishes for myself and Athena, who I hope will be just like her Dad.",
          "link": "https://news.ycombinator.com/item?id=41206550",
          "publishedOn": "2024-08-10T00:44:37.000Z",
          "wordCount": 496,
          "title": "New comment by BessS in \"Jake Seliger has died\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41205326",
          "author": "rseliger",
          "description": "This is Jake’s sister. He was reading and replying to as much as he could up until the end. He loved this community and would in turn be touched by this entire thread. Thank you all who supported him and read and shared his writing. He said it was bittersweet to go out on top.",
          "link": "https://news.ycombinator.com/item?id=41205326",
          "publishedOn": "2024-08-09T20:52:42.000Z",
          "wordCount": 371,
          "title": "New comment by rseliger in \"Jake Seliger has died\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41203548",
          "author": "dredmorbius",
          "description": "Jake posted as jseliger on HN:  https://news.ycombinator.com/user?id=jseliger\nHe blogged at https://jakeseliger.com/>, and numerous of his blog articles were submitted to HN:  https://news.ycombinator.com/from?site=jakeseliger.com>.  That includes numerous topics, over the past year or so his experience with cancer, often concerning frustrations with the process and mechanism.\nHis essay on agenticness especially strikes me as hugely insightful and underappreciated.  It was submitted several times to HN but saw little discussion:\nhttps://jakeseliger.com/2024/07/29/more-isnt-always-better-d...>\nJake's wife, now widow, Bess, blogs at Everything is an Emergency:  https://bessstillman.substack.com>.  That also details the cancer / caregiving experience, from the point of view of a wife, caregiver, expectant mother, and emergency-room doctor.",
          "link": "https://news.ycombinator.com/item?id=41203548",
          "publishedOn": "2024-08-09T16:59:14.000Z",
          "wordCount": null,
          "title": "New comment by dredmorbius in \"Jake Seliger has died\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41198724",
          "author": "chocolatkey",
          "description": "Here are the original posts themselves, probably more interesting to people here:\nhttps://blog.smithsecurity.biz/hacking-the-scammers\nhttps://blog.smithsecurity.biz/systematic-destruction-hackin...",
          "link": "https://news.ycombinator.com/item?id=41198724",
          "publishedOn": "2024-08-09T04:17:07.000Z",
          "wordCount": 653,
          "title": "New comment by chocolatkey in \"USPS text scammers duped his wife, so he hacked their operation\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41196363",
          "author": "jessetemp",
          "description": "I think what’s going on behind the verbal sleight of hand here, is focusing on the process (quest) instead of the outcome (goal). It’s the difference between doing a thing and having done a thing. I might enjoy having written a book, but I don’t think I would enjoy writing a book. And I don’t think calling it a quest instead of a goal would make much difference",
          "link": "https://news.ycombinator.com/item?id=41196363",
          "publishedOn": "2024-08-08T21:14:34.000Z",
          "wordCount": null,
          "title": "New comment by jessetemp in \"Do quests, not goals\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41195709",
          "author": "solatic",
          "description": "I don't get the hate for Kubernetes in this thread. TFA is from Figma. You can talk all day long about how early startups just don't need the kind of management benefits that Kubernetes offers, but the article isn't written by someone working for a startup, it's written by a company that nearly got sold to Adobe for $20 billion.\nY'all really don't think a company like Figma stands to benefit from the flexibility that Kubernetes offers?",
          "link": "https://news.ycombinator.com/item?id=41195709",
          "publishedOn": "2024-08-08T20:14:17.000Z",
          "wordCount": null,
          "title": "New comment by solatic in \"How we migrated onto K8s in less than 12 months\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41194744",
          "author": "davedx",
          "description": "IME what works best getting new projects kick started is hiring a very small team of senior freelancers, making one of them lead, and letting them loose. I worked on such a team once and it was really excellent. The advantage of this strategy is if the experiment doesn't work out, terminating freelancers is much easier than permanent (I noted you're based in Europe).\nContrary to what other people said, I wouldn't try find a CTO straightaway. It's a hard role to hire for, especially at the start. I think you're better off unleashing a small, excellent team of builders then hire management later to help build out the team if the initial effort succeeds.\nHappy to chat more about my experiences with this strategy, davedx@gmail.com (I'm in Europe too)",
          "link": "https://news.ycombinator.com/item?id=41194744",
          "publishedOn": "2024-08-08T18:34:03.000Z",
          "wordCount": null,
          "title": "New comment by davedx in \"Ask HN: Should we bring software dev in-house?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41193140",
          "author": "Retr0id",
          "description": "I used to be a tree-style-tabs power user but at some point I went back to regular tabs. I find that the amount of horizontal tab space is pretty close to the actual number of things I can usefully have open at once. Seeing the tabs get \"squished\" is my reminder to close the ones I no longer need.\nI was using the tab-state as a sort of short-term working memory and I don't think it was doing me any favours, particularly in terms of focus.\nNow when I'm working on a project, I keep a list of relevant URLs in a text file (i.e. bookmarks but checked into source control).\nI also use two browser windows, a regular one for \"stateful\" browsing, and a private-mode one for \"stateless\" browsing. Quick queries and exploratory research happens in the \"stateless\" session, with the understanding that I can close any of these tabs (or nuke the whole session) at any time without losing anything important. If I do come across something important, it gets noted down elsewhere.",
          "link": "https://news.ycombinator.com/item?id=41193140",
          "publishedOn": "2024-08-08T16:16:17.000Z",
          "wordCount": 5794,
          "title": "New comment by Retr0id in \"Firefox Sidebar and Vertical tabs: try them out\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41190527",
          "author": "diffeomorphism",
          "description": "I would argue the opposite. They are not aiming to be a neutral arbiter but an active advocate for better repairability. For that they should have for-profit business relationships with basically all companies manufacturing such devices. In particular, that would allow them to pressure or drop any one misbehaving company.\n> Providing consumers with information on where to find reputable companies selling repair parts would be a much more palatable alternative to selling them yourself.\nThat does not really make sense. They are a repair company and the only company selling specialized parts is, of course, the manufacturer.\n> also stands in the way of advocating for consumers.\nThat is much too bleak. They made a deal happen in the first place, which is large progress even if it did not quite work out, and compromises are a fact of life.",
          "link": "https://news.ycombinator.com/item?id=41190527",
          "publishedOn": "2024-08-08T11:56:13.000Z",
          "wordCount": null,
          "title": "New comment by diffeomorphism in \"The Story of Samsung's failed deal with iFixit, as told by iFixit's CEO\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41189189",
          "author": "somenameforme",
          "description": "I think many might not be aware of Starliner's sordid history. It has failed essentially every qualification test in various ways. Their pad abort test (where you simulate a launch abort while on the launch pad) resulted in only 2 of the 3 parachutes deploying in beyond optimal conditions. NASA considered that such a resounding success that they let them completely skip the far more challenging in-flight abort test. Their first automated mission to the ISS completely failed and did not make it to the station. NASA finally required a redo from Boeing and their second one did make it to the ISS, but only after experiencing widespread leaks and thruster failures literally identical to the ones that have now left these astronauts stranded.\nIf SpaceX or another company had remotely similar results, they would never have been greenlit. For instance in spite of a flawless pad abort test, NASA required SpaceX also carry out an in-flight abort. And that's completely reasonable - you don't simply skip tests, even with optimal performance. Skipping tests following suboptimal performance is simply unjustifiable. And so I think we're largely looking at another Challenger type disaster caused by a disconnect between management (and likely political appointees) versus engineering staff, rather than inherent risk. But this is not a vessel that should have ever had a single human anywhere near it, and so their official comments (and even actions) on the situation are going to be heavily biased due to their own behaviors.",
          "link": "https://news.ycombinator.com/item?id=41189189",
          "publishedOn": "2024-08-08T08:04:33.000Z",
          "wordCount": null,
          "title": "New comment by somenameforme in \"NASA says Boeing Starliner astronauts may fly home on SpaceX in 2025\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41187239",
          "author": "dongobread",
          "description": "I'm very skeptical on this, the paper they linked is not convincing. It says that GPT-4 is correct at predicting the experiment outcome direction 69% of the time versus 66% of the time for human forecasters. But this is a silly benchmark because people are not trusting human forecasters in the first place, that's the whole purpose for why the experiment is run. Knowing that GPT-4 is slightly better at predicting experiments than some human guessing doesn't make it a useful substitute for the actual experiment.",
          "link": "https://news.ycombinator.com/item?id=41187239",
          "publishedOn": "2024-08-08T01:30:08.000Z",
          "wordCount": null,
          "title": "New comment by dongobread in \"GPT-4 LLM simulates people well enough to replicate social science experiments\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41185845",
          "author": "GMoromisato",
          "description": "I listened to the whole conference and here's my impression:\n1. NASA manager Steve Stich said there's a relatively wide \"band of uncertainty\" in how risky a Starliner return is. Some (many?) NASA engineers are at the high end of the band and are advocating a return on Dragon instead. Boeing is obviously at the low end of the band and thinks it is a low risk.\nThe problem is, the data doesn't rule out either side of the band. So they are trying to get more data to narrow the uncertainty (in either or both directions). [Interestingly enough, the data from the White Sands testing made them more worried because it revealed the Teflon seal deformation.]\nBut my sense is that if they don't narrow the uncertainty (i.e., convince the NASA engineers) then they will very likely choose a Dragon return.…",
          "link": "https://news.ycombinator.com/item?id=41185845",
          "publishedOn": "2024-08-07T21:37:30.000Z",
          "wordCount": null,
          "title": "New comment by GMoromisato in \"NASA says Boeing Starliner astronauts may fly home on SpaceX in 2025\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41182936",
          "author": "refibrillator",
          "description": "I’ve built quite a few french drains in residential settings, some lasting longer than others - I’ll share a few hard earned lessons here:\nSoil migration is the number one failure mode. This is mentioned but perhaps a bit understated in the video.\nTo prevent soil migration you absolutely need commercial grade geotextile fabric wrapping the gravel and pipe.\nYou can buy pipe with much bigger and more numerous holes than the tiny slits depicted in the video. That also obviates the need to decide what orientation the holes should be.\nVoid space is the most critical factor when choosing gravel. You need a lot of space between the rocks to support fast drainage. Do not use playground pebbles or anything similar. Pay close attention to the type of aggregate you’re buying.\nCalculate how much water you actually need to drain. You can use the “100 year flood” values for your locale to get an upper bound on rainfall, then multiple by drainage area. This is especially important if your roof is part of the watershed.\nhttps://www.usgs.gov/special-topics/water-science-school/sci...\nSometimes there is insufficient gradient to move the water anywhere, ie the land is too flat. In this case you may be better off building a drywell, which is constructed very similarly.\nhttps://en.m.wikipedia.org/wiki/Dry_well",
          "link": "https://news.ycombinator.com/item?id=41182936",
          "publishedOn": "2024-08-07T16:28:53.000Z",
          "wordCount": null,
          "title": "New comment by refibrillator in \"How French Drains Work\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41174555",
          "author": "curiousllama",
          "description": "Cities' attractiveness feels u-shaped\nYoung adults love it bc they have the time to go to bars/restaurants/clubs\nMiddle aged folks hate it because they're so busy - they can't take advantage, and other people get in their way\n(some) Older folks like it again bc they have the time to go to restaurants/theater",
          "link": "https://news.ycombinator.com/item?id=41174555",
          "publishedOn": "2024-08-06T19:48:06.000Z",
          "wordCount": null,
          "title": "New comment by curiousllama in \"Twitter kills its San Francisco headquarters, will relocate to South Bay\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41174249",
          "author": "throw4847285",
          "description": "Just in response to your second point, I do think that's specific to you and your circles. I know multiple retired or semi-retired people who have moved towards the center of a city. Without work to keep them occupied, they want the hustle and bustle, which means something to do. And driving has become more of a hassle and a barrier to the kinds of lives they want to live. These are east coast or midwest cities, so maybe there is something about SF that's different, but that's my experience.",
          "link": "https://news.ycombinator.com/item?id=41174249",
          "publishedOn": "2024-08-06T19:17:36.000Z",
          "wordCount": null,
          "title": "New comment by throw4847285 in \"Twitter kills its San Francisco headquarters, will relocate to South Bay\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41174084",
          "author": "Tectosage",
          "description": "This pitch worked much better in the 80s and 90s when\nA) most investors had a broker not just for advice, but because there was no easy way to trade individually or get live stock quotes until the internet was widespread and matured\nB) telephone sales in general were more common then and less likely to be a scam (Stratton Oakmont and other boiler rooms played a large role in shifting public opinion on this)\nC) The most desirable prospects (High Net Worth Individuals) were accustomed to dealing with legitimate brokers over the phone and being solicited by brokers from other legitimate firms in such a way\nD) The markets were raging in such a way that everyone had FOMO and was dying to hear of a hot new tip\nAlmost nobody legitimate in the financial advising world acquires customers via cold call pitching anymore. Cold calling is still part of the toolkit for other sales niches (eg, tech sales) but it's a tough road with a low success rate.",
          "link": "https://news.ycombinator.com/item?id=41174084",
          "publishedOn": "2024-08-06T19:00:08.000Z",
          "wordCount": null,
          "title": "New comment by Tectosage in \"The real \"Wolf of Wall Street\" sales script\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41174067",
          "author": "hintymad",
          "description": "There is a famous paper about the location of company headquarters: they get as close as possible to the residence of company CEOs. If we don't consider the CEO's influence, I'm actually curious if the location of company headquarters has to do with the average age of the employees in the Bay Area. As the employees start to have families, they most likely move to the south bay for better or for worse, and I have a hard time imagine that they'd enjoy commuting via BART or Caltrain for more than an hour every day. And this is probably just me or my circles, a city's hustle and bustle becomes a distraction or at least increasing irrelevant as I age. I increasingly enjoy ample parking space, tranquil suburbs, being able to step out and start jogging in woods or huge parks, and certainly not having to deal with the craziness on SF streets. If more people are like me who prefers living outside of the city proper, then I'd imagine a company will have access to more talent by moving its headquarters to the south of SF.",
          "link": "https://news.ycombinator.com/item?id=41174067",
          "publishedOn": "2024-08-06T18:57:51.000Z",
          "wordCount": null,
          "title": "New comment by hintymad in \"Twitter kills its San Francisco headquarters, will relocate to South Bay\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41173980",
          "author": "seizethecheese",
          "description": "I’ve had several meetings, either in Twitter office or around it, and the street scene is very bad in that part of SF. If the claim is that this is a motivation for the move, it certainly passes the sniff test for me.",
          "link": "https://news.ycombinator.com/item?id=41173980",
          "publishedOn": "2024-08-06T18:51:44.000Z",
          "wordCount": null,
          "title": "New comment by seizethecheese in \"Twitter kills its San Francisco headquarters, will relocate to South Bay\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41173796",
          "author": "janalsncm",
          "description": "Had a recruiter call with Twitter a few months ago. Mandatory in office 5 days per week. Among other things, an hour commute both ways to work was not acceptable.\nMaybe they will have better luck in Santa Clara.\nI don’t buy any of the flamebait reasons for leaving SF. Reason 1 is money and reason 2 is talent pool.",
          "link": "https://news.ycombinator.com/item?id=41173796",
          "publishedOn": "2024-08-06T18:36:08.000Z",
          "wordCount": null,
          "title": "New comment by janalsncm in \"Twitter kills its San Francisco headquarters, will relocate to South Bay\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41173741",
          "author": "RomanPushkin",
          "description": "That's pretty cool and this is exactly why I am here :) To have this kind of advice. I'll implement these changes as soon as I can.",
          "link": "https://news.ycombinator.com/item?id=41173741",
          "publishedOn": "2024-08-06T18:30:37.000Z",
          "wordCount": null,
          "title": "New comment by RomanPushkin in \"Show HN: 1-FPS encrypted screen sharing for introverts\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41173644",
          "author": "vngzs",
          "description": "Good job releasing your project! It's a cool idea and surprisingly minimalist. That said, I've found a number of cryptographic flaws in the application source. This should not be used in instances where the encryption is mission-critical.\n1) You generate a random key [0] and then feed it into PBKDF2 [1] to generate a 32-byte AES-GCM key. If you can generate 32 random bytes instead of 10 reduced-ASCII characters and a key stretch, just do that. PBKDF2 is for turning a password into a key, and it's far from the recommended algorithm nowadays; prefer scrypt if you need to do this sort of thing.\n2) AES-GCM with random 12-byte nonces. Never use random IVs with GCM; this breaks the authentication [2] [3]. Given the pitfalls of AES-GCM with respect to random nonces, you might prefer switching to XSalsa20+Poly1305. The advantage of XSalsa is it has an extended nonce length, so you can use random nonces without fear.\n3) Random key derivation with a restricted character set can make brute force attacks easier. You should have a 256-bit random key, and if you want that key to be within a certain character set, then encode the byte output from the CSPRNG using that character set.\n4) 1fps achieves symmetric key distribution via a URL with a fragment identifier (\"#\") which IIRC is not sent to the server. Therefore it assumes you have a secure key distribution channel - the link contains the key, so it's important that only the intended recipient can view the part after the \"#\". If the server is truly malicious, it can deploy client-side Javascript to send the fragment to the server, allowing the server to access the key (and thus cleartext communication).\n[0]: https://github.com/1fpsvideo/1fps/blob/main/1fps.go#L99\n[1]: https://github.com/1fpsvideo/1fps/blob/main/1fps.go#L287\n[2]: https://eprint.iacr.org/2016/475.pdf\n[3]: https://soatok.blog/2020/05/13/why-aes-gcm-sucks/",
          "link": "https://news.ycombinator.com/item?id=41173644",
          "publishedOn": "2024-08-06T18:23:36.000Z",
          "wordCount": null,
          "title": "New comment by vngzs in \"Show HN: 1-FPS encrypted screen sharing for introverts\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41173303",
          "author": "dang",
          "description": "All: can you please not post low-quality angry/snarky junk comments to HN threads? They're tedious and have nasty effects.\nI realize this story is a cluster of divisive topics but that's why HN's guidelines say \"Comments should get more thoughtful and substantive, not less, as a topic gets more divisive.\"\nIf you wouldn't mind reviewing https://news.ycombinator.com/newsguidelines.html and taking the intended spirit of the site to heart, we'd be grateful.",
          "link": "https://news.ycombinator.com/item?id=41173303",
          "publishedOn": "2024-08-06T17:49:45.000Z",
          "wordCount": null,
          "title": "New comment by dang in \"Twitter kills its San Francisco headquarters, will relocate to South Bay\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41170134",
          "author": "drewda",
          "description": "That SF's payroll tax exemption was specifically created for Twitter: https://www.sfchronicle.com/news/article/twitter-will-get-pa...\nHere's one summary of it as of last year:\n> The infamous \"Twitter tax break\" provided by former Mayor Ed Lee to lure companies, including Twitter, to mid-Market by exempting them from a portion of their payroll taxes, had its sunset in 2019. Many argued that it did little to revitalize mid-Market — and certainly Twitter former fancy cafeteria didn't help in terms of workers spending money at local businesses — and it just ended up costing the city about $10 million a year in lost revenue.\n> https://sfist.com/2023/02/09/mayor-london-breed-announces-ta...\nWhen the Twitter tax break expired in 2019, the Chronicle also did a pretty thorough survey of the mixed effects: https://projects.sfchronicle.com/2019/mid-market/",
          "link": "https://news.ycombinator.com/item?id=41170134",
          "publishedOn": "2024-08-06T12:16:56.000Z",
          "wordCount": null,
          "title": "New comment by drewda in \"Twitter kills its San Francisco headquarters, will relocate to South Bay\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41169901",
          "author": "TheAdamist",
          "description": "Thats generally the point with sudden disruptive moves - high attrition. Reduce the headcount without having to be in the news for layoffs.",
          "link": "https://news.ycombinator.com/item?id=41169901",
          "publishedOn": "2024-08-06T11:46:44.000Z",
          "wordCount": null,
          "title": "New comment by TheAdamist in \"Twitter kills its San Francisco headquarters, will relocate to South Bay\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41167740",
          "author": "alvah",
          "description": "\"They simply have a better product\"\nI disagree. 100% they had a better product, but they have absolutely mangled it over the last few updates. Honestly, if I wanted the opinion of randomnumbers45123 on Reddit, I'd just search Reddit.\nGoogle achieved dominance ~25 years ago by being better than the alternatives, and the other search engines pretty much withered away rapidly. They (Google) are in a very precarious position right now. They will certainly not disappear overnight, but if / when the public becomes aware of something better, the implosion could be spectacular.",
          "link": "https://news.ycombinator.com/item?id=41167740",
          "publishedOn": "2024-08-06T04:20:15.000Z",
          "wordCount": null,
          "title": "New comment by alvah in \"Google loses antitrust suit over search deals on phones\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41166423",
          "author": "epolanski",
          "description": "It's insane the length we go as humans (in the US at least) to not invest in the easiest, most cost-effective and environmentally friendly mode of transportation: trains.\nHyperloops, wider and wider highways, now personal airplanes.\nAnything but goddamn trains.\nIt's mental to me.\nWish the best to the startup, after all they are filling a void someone else would, but still, not happy with the direction transport is going, which seems backwards sometimes.",
          "link": "https://news.ycombinator.com/item?id=41166423",
          "publishedOn": "2024-08-05T23:03:37.000Z",
          "wordCount": null,
          "title": "New comment by epolanski in \"Launch HN: Airhart Aeronautics (YC S22) – A modern personal airplane\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41164783",
          "author": "sethkim",
          "description": "Instrument-rated pilot (and engineer) here.\nFirst - congrats on the launch! I think you're working on an interesting set of components that will prove useful to GA aircraft technology. Bringing fly-by-wire, and lowering the cost of maintenance/manufacturing are both great efforts.\nThat being said, my personal view is that stick-and-rudder control is one of the less critical components to improving GA safety. Everything else - flight planning, comms, automation, navigation, weather, inspections, procedures, regs, and most importantly - working in the federal airspace system - are the \"hard\" parts of flying and where problems tend to occur. It's common belief that single-pilot IFR is the most challenging type of flying, because of how much you have to do all at once.\nIt may sound snobby - but I'm not super excited about the idea of lowering the barrier to entry for GA on a foundational skill basis. Like the light-sport rating, it encourages more people to be in the (already congested) airspace system who haven't really gained all the other skills necessary or experience to be there.\nTo be clear - I think improving technology and lowering costs = good. Lowering early-skill requirements for pilots and pushing more people without all the other skills into federal airspace = very bad. In general, I'd frame this effort more as an effort to raise the bar for system technology, not lower the bar to become a pilot in the first place.",
          "link": "https://news.ycombinator.com/item?id=41164783",
          "publishedOn": "2024-08-05T19:45:30.000Z",
          "wordCount": null,
          "title": "New comment by sethkim in \"Launch HN: Airhart Aeronautics (YC S22) – A modern personal airplane\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41164566",
          "author": "cletus",
          "description": "I expect this to be bad for everyone except Google if the ruling holds. Why? Mozilla and Apple will lose significant revenue from having Google as the default search engine and Google will no longer have to pay those billions. What's more, no one else can pay to be the default either (eg the short-lived Mozilla Bing deal).\nSo what's going to happen? Most users will probably still use Google, nobody is getting paid and Google is saving a bundle.\nI get the thinking that you have to prevent lock-in (eg Ticketmaster and venues) but Google didn't buy its way into dominance annd maintain their dominance through exclusivity deals. They simply have a better product and I don't expect anyone to match them anytime soon (cue the DDG \"I switched from Google to DDG 78 years ago\" crowd).",
          "link": "https://news.ycombinator.com/item?id=41164566",
          "publishedOn": "2024-08-05T19:27:55.000Z",
          "wordCount": null,
          "title": "New comment by cletus in \"Google loses antitrust suit over search deals on phones\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41164462",
          "author": "hugh_kagi",
          "description": "We face a number of challenges simply letting our paying customers change their search engine:\n1. On iOS the list of allowed search engines is simply baked into OS, we have a fiddly extension that hooks outbound calls to /search and redirects them but I wish we didn't need to.\n2. On Chrome, we use an extension to change the default search engine and enable search auto-complete etc, but Google has a policy that such an extension can do one thing and one thing only, and recently removed our extension on account of that [1]. We rebuilt it to meet their needs but had a lot of back-and-forth because we included 'search by image' on a context menu item and the first reviewer felt that was a bridge too far. You'll note that Chrome provides such a context menu item for Google Image search out of the box.\n3. On Chrome for Linux, the default search engine API is not available, so Linux users have to configure it manually through a series of silly steps [2]. This is at least in keeping with most Linux experiences.\nThere are other issues, but I say all this to highlight how surprisingly difficult it is to change this setting in a practical, consumer friendly way. It is most certainly this difficult by design, that's a lot of revenue to protect.\n1: https://news.ycombinator.com/item?id=41028924\n2: https://github.com/kagisearch/chrome_extension_basic?tab=rea...",
          "link": "https://news.ycombinator.com/item?id=41164462",
          "publishedOn": "2024-08-05T19:17:20.000Z",
          "wordCount": null,
          "title": "New comment by hugh_kagi in \"Google loses antitrust suit over search deals on phones\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=52963",
          "author": "Chris Bertram",
          "description": "Often on a Friday evening, we order a curry from our local “Indian” takeaway. They deliver, but it is easier and quicker for me to walk round and collect, and, anyway, I enjoy chatting to the guy behind the counter. He’s a Man United fan, I’m Liverpool, so we have some banter with a bit […]",
          "link": "https://crookedtimber.org/2024/08/10/fascist-violence-and-the-imaginative-failure-of-the-labour-government/",
          "publishedOn": "2024-08-10T07:55:31.000Z",
          "wordCount": 2681,
          "title": "Fascist violence and the imaginative failure of the Labour government",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52960",
          "author": "John Q",
          "description": "I have a letter in The Chronicle of Higher Education responding to Steven Teles’ call for more conservative college professors. It’s a shortened version of a longer piece I wrote, which I’m posting here. The fact that conservatives are thin in the humanities and social sciences departments of US college campuses is well known. A […]",
          "link": "https://crookedtimber.org/2024/08/08/the-not-so-strange-shortage-of-conservative-professors/",
          "publishedOn": "2024-08-08T00:24:02.000Z",
          "wordCount": 11123,
          "title": "The not-so-strange shortage of conservative professors",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52956",
          "author": "Harry",
          "description": "Once you know my age my musical tastes as a teenager are very easy to guess. Obviously Dylan, Mitchell, the Kinks and the Beatles – equally obviously not the Stones or the Who. Richard Thompson, Sandy Denny, Fairport, Steeleye Span, Roy Harper, The Watersons, Carthy, etc, etc and more than any of them, Kevin Coyne. […]",
          "link": "https://crookedtimber.org/2024/08/06/52956/",
          "publishedOn": "2024-08-06T22:30:27.000Z",
          "wordCount": 4385,
          "title": "Actually listening to 10cc.",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52950",
          "author": "Chris Bertram",
          "description": "Visit the post for more.",
          "link": "https://crookedtimber.org/2024/08/04/sunday-photoblogging-dean-lane/",
          "publishedOn": "2024-08-04T06:55:49.000Z",
          "wordCount": 1718,
          "title": "Sunday photoblogging: Dean Lane",
          "imageUrl": "https://live.staticflickr.com/65535/53897199196_fd5c64e26e.jpg"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/The-unfulfilled-promises-of-microcredit-some-new-evidence",
          "author": "CADTM, Stéphanie Jacquemont",
          "description": "The student movement in Bangladesh ousted Sheikh Hasina last Monday, August 5, 2024. A new interim government has been formed to restore order, end repression, and hold a fair election to facilitate a democratic transition of power. Nobel laureate Muhammad Yunus has been sworn in as the interim government's chief adviser, and many civil society activists and student leaders who have led the rebellion are included in the advisory group. There is a widespread hope that Prof. Yunus, the (...)\nEnglish\n\n/ \nPoverty, \nBangladesh, \nThird World Debt, \nPrivate debt, \nMicrocredit",
          "link": "https://www.cadtm.org/The-unfulfilled-promises-of-microcredit-some-new-evidence",
          "publishedOn": "2024-08-09T06:00:00.000Z",
          "wordCount": 4785,
          "title": "The unfulfilled promises of microcredit: some new evidence",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L153xH80/7d67b536955c2d468284cb35bf57de-31f2b.png"
        },
        {
          "id": "https://www.cadtm.org/Laundering-Carbon-The-Gulf-s-New-Scramble-for-Africa",
          "author": "Adam Hanieh",
          "description": "In early November 2023, shortly before the COP28 summit opened in Dubai, a hitherto obscure UAE firm attracted significant media attention around news of their prospective land deals in Africa. \n Reports suggested that Blue Carbon—a company privately owned by Sheikh Ahmed al-Maktoum, a member of Dubai's ruling family—had signed deals—a land grab enacted in the name of climate change mitigation. In response, Blue Carbon insisted the discussions were merely exploratory and would require (...)\nEnglish\n\n/ \nEcological debt, \nAfrica, \nEcology/Climate",
          "link": "https://www.cadtm.org/Laundering-Carbon-The-Gulf-s-New-Scramble-for-Africa",
          "publishedOn": "2024-08-08T13:13:21.000Z",
          "wordCount": 3564,
          "title": "Laundering Carbon—The Gulf's ‘New Scramble for Africa'",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/2a51a4cad085595cb3d994e1cce2a8-7363e.jpg"
        },
        {
          "id": "https://www.cadtm.org/The-Persistence-of-Global-Capitalism-s-Long-Depression",
          "author": "Ashley Smith, Michael Roberts",
          "description": "While the Biden administration and its liberal apologists crow about the economic recovery, in reality US capitalism, and indeed global capitalism, remain stuck in a slump with seemingly no end in sight. Spectre's Ashley Smith interviews Michael Roberts about the state of the US and world economy, the reasons for what he calls the Long Depression, and how it is driving political polarization within countries and imperial rivalries between the globe's dominant and rising powers. \nEnglish\n\n/ \nUnited States of America (USA), \nCapitalism, \nFinancial crisis",
          "link": "https://www.cadtm.org/The-Persistence-of-Global-Capitalism-s-Long-Depression",
          "publishedOn": "2024-08-08T10:49:42.000Z",
          "wordCount": 5693,
          "title": "The Persistence of Global Capitalism's Long Depression",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L846xH445/52a07ed0e52226205a30a6ce66b4ac-ac6d4.png"
        },
        {
          "id": "https://www.cadtm.org/Students-in-Bangladesh-Are-Challenging-a-Repressive-System",
          "author": "Sushovan Dhar",
          "description": "Repression of student protests in Bangladesh has killed more than 400 people. The protests began over the allocation of government jobs but developed into a wider challenge to a ruling party that's out of touch and increasingly authoritarian. \nEnglish\n\n/ \nSocial movements, \nBangladesh",
          "link": "https://www.cadtm.org/Students-in-Bangladesh-Are-Challenging-a-Repressive-System",
          "publishedOn": "2024-08-05T07:10:16.000Z",
          "wordCount": 3176,
          "title": "Students in Bangladesh Are Challenging a Repressive System",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L720xH378/4e68421343f058517b37cc111d6f2a-7e13b.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=8224",
          "author": "disassociated.com",
          "description": "Bad weather continues to hit coffee growers in Brazil and Vietnam, forcing Australian coffee suppliers to warn of shortages, and more price increases. It’s been a tough few years for coffee producers. When I wrote about production problems almost three years ago, droughts in Brazil were impacting harvest yields, causing a reduction in supply. Labour […]",
          "link": "https://disassociated.com/more-coffee-price-rises-on-the-way/",
          "publishedOn": "2024-08-08T21:00:12.000Z",
          "wordCount": 384,
          "title": "More price rises are on the way for coffee drinkers",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8162",
          "author": "disassociated.com",
          "description": "The Ledge is the fourth novel by Victoria based Australian writer, and master of twists that will leave you breathless and dumbfounded: Christian White. When human remains are discovered in a forest, police are baffled, the locals are shocked and one group of old friends starts to panic. Their long-held secret is about to be […]",
          "link": "https://disassociated.com/the-ledge-new-thriller-whodunit-christian-white/",
          "publishedOn": "2024-08-07T21:00:00.000Z",
          "wordCount": 279,
          "title": "The Ledge, a new thriller/whodunit by Christian White",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8203",
          "author": "disassociated.com",
          "description": "Made in 2021, I Was a Simple Man, trailer, is the third feature of American writer and filmmaker Christopher Makoto Yogi, who also wrote the screenplay. Masao Matsuyoshi (Steve Iwamoto), an elderly man who has spent most of his life in Hawaii, is terminally ill, and has months to live. As he nears death, he […]",
          "link": "https://disassociated.com/film-i-was-a-simple-man-christopher-makoto-yogi-steve-iwamoto/",
          "publishedOn": "2024-08-07T20:30:45.000Z",
          "wordCount": 290,
          "title": "I Was a Simple Man, a film by Christopher Makoto Yogi, with Steve Iwamoto",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8159",
          "author": "disassociated.com",
          "description": "Networking tips for music festivals, by Harry Carr: Don’t make the mistake that most people make and switch off as soon as you reach Paddington. Maximise your train journey by reaching out to your extended network, to see if they are going to Glastonbury Music Festival. If there’s a speaker or business guru you admire […]",
          "link": "https://disassociated.com/who-needs-linkedin-network-music-festivals/",
          "publishedOn": "2024-08-06T21:00:08.000Z",
          "wordCount": 254,
          "title": "Who needs LinkedIn when you can network at music festivals?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8193",
          "author": "disassociated.com",
          "description": "Melbourne based Australian designer and publisher Kai Brach’s weekly publication, Dense Discovery (DD), is one of the few newsletters I subscribe to. If you have an interest in, well, everything, then DD is for you. First published in September 2018, the three-hundredth edition was posted yesterday. And to mark this most impressive of milestones, Brach […]",
          "link": "https://disassociated.com/dense-discovery-three-hundred-editions-reader-community/",
          "publishedOn": "2024-08-06T20:30:18.000Z",
          "wordCount": 205,
          "title": "Dense Discovery notches three hundred editions, opens reader community",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8154",
          "author": "disassociated.com",
          "description": "Sydney based Australian author Charlotte Wood has been included on the 2024 longlist for the Booker Prize, with her latest novel, Stone Yard Devotional. It is the first time a work by an Australian writer has featured on the Booker longlist since 2016. I’m reading Stone Yard Devotional right now, and loving it. Some reviewers […]",
          "link": "https://disassociated.com/stone-yard-devotional-charlotte-wood-booker-prize-longlist/",
          "publishedOn": "2024-08-05T21:00:30.000Z",
          "wordCount": 236,
          "title": "Stone Yard Devotional by Charlotte Wood included on Booker Prize longlist",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8185",
          "author": "disassociated.com",
          "description": "This is — again: sort of — /timeline page content, which seems to be a bit popular on InterWebs and IndieWeb at the moment. Today — or rather last Sunday 4 August 2024 — does not really mark the twenty-first birthday of disassociated. That would’ve been back in 2018, given the first non-blog inception of […]",
          "link": "https://disassociated.com/disassociated-turns-twenty-one-again/",
          "publishedOn": "2024-08-05T20:30:02.000Z",
          "wordCount": 349,
          "title": "disassociated turns twenty-one again, sort of",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8150",
          "author": "disassociated.com",
          "description": "London based Anglo-Australian author Evie Wyld’s 2021 novel, The Bass Rock, which won the Stellar Prize literary award in the same year, was a riveting read. Her new book, The Echoes, looks like it will follow suit, given it incorporates elements of The Bass Rock, including settings across several locations and time, and a dollop […]",
          "link": "https://disassociated.com/the-echoes-a-new-novel-by-evie-wyld-author-of-the-bass-rock/",
          "publishedOn": "2024-08-04T21:00:24.000Z",
          "wordCount": 350,
          "title": "The Echoes, a new novel by Evie Wyld, author of The Bass Rock",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8146",
          "author": "disassociated.com",
          "description": "It depends how you define normal. Winter this year, or certainly in July, and absolutely since the recent Sudden Stratospheric Warming event, has felt distinctly chillier. But the bad news is, no this winter, when compared to the long term average, isn’t all that much cooler than “normal”. Despite the relatively cool conditions, most capitals […]",
          "link": "https://disassociated.com/australian-winter-2024-colder-normal/",
          "publishedOn": "2024-08-04T20:30:45.000Z",
          "wordCount": 229,
          "title": "Is the Australian winter 2024 colder than normal?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20240807",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20240807",
          "publishedOn": "2024-08-07T18:30:00.000Z",
          "wordCount": 521,
          "title": "Week Ending August 04, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/overwriting-palestine",
          "author": null,
          "description": "The complicity of the academy.",
          "link": "https://newleftreview.org/sidecar/posts/overwriting-palestine",
          "publishedOn": "2024-08-06T08:42:39.000Z",
          "wordCount": 2062,
          "title": "Ussama Makdisi: &ldquo;Overwriting Palestine&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/08/EEESDHHP7BP65JXRNJD6WSBPXI.jpg"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://notes.jeddacp.com/implementing-community-echoes/",
          "author": null,
          "description": "I’ve been seeing a lot of Reply posts, or just posts in general with bloggers playing off of each other’s blog posts and think it’s absolutely fantastic.\nDuring my Wordpress days, I took for granted the automatic pingbacks (is that still a thing?) when my post gets mentioned somewhere, and I know that Webmentions exist, but now I’m doing things a little bit more manual.\nEarlier last month, around the time I posted To Blogroll, or to not?, I added a section at the bottom of my posts (when it applies) titled 💬 COMMUNITY ECHOES. In this section, I add posts I run across that is either a response to that post, or references the post in some way.\nSome examples from my recent posts where you can see this section:\nVideo Games I've Owned and Played\nThe Plan to Not Have a Plan\nWhen Every Day Feels the Same\nAdding references to other posts that have been written on similar subjects allows readers to click through to see other people’s takes on that specific subject. I know that I personally enjoy reading other people’s blogs, and then finding a link to another blog that talks about the same thing, especially if it’s the same subject with a different (or same) perspective. It’s also (selfishly) nice for me to keep track of posts that mention mine for my own personal documentation.\nI welcome you all to go down the rabbit hole of posts with me.\nAlso, if there is a blog post of yours where mine is referenced that I missed, feel free to let me know, so that I can add it.\nHappy reading!\n9/31 - Blaugust\n💬 Community Echoes\nby Forking Mad\nEchoing the Community by Alexandra\nWebnotes: a simple replacement for comments, pingbacks, and webmentions by rscottjones\nReply by email",
          "link": "https://notes.jeddacp.com/implementing-community-echoes/",
          "publishedOn": "2024-08-09T16:43:00.000Z",
          "wordCount": 982,
          "title": "Implementing Community Echoes",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1723221681.png"
        },
        {
          "id": "https://matanabudy.com/i-loved-your-post-but-i-cant-tell-you-that/",
          "author": null,
          "description": "The Indie Web is a great place. Ever since I started writing on this website, I've received the most heartwarming reactions—from plain old emails to guestbook comments, and in some cases, even reply posts that can spark discussions in what might otherwise feel like posting into the void.\nA reply post like this was RE: Why Are Shoes Treated Differently Than Shirts by Marisabel, which really made me think about stuff I wrote in my original post. I loved that! She mentioned me on Mastodon, and I thanked her for the reply, it really made my day back then.\nLast week, I discovered another reply through the analytics page of my bear blog, which had a referrer I wasn’t familiar with—mgx. I visited the website and found a reply post to my bat incident! It had a short poem about it, which made me laugh and brightened my day, especially since I was feeling quite sick after the vaccine.\nI wanted to thank mgx for the reply, but I couldn’t find a way to contact on the website. Obviously, not everyone wants to be approachable, and I understand that, but I still wanted to acknowledge the reply—so here we are!",
          "link": "https://matanabudy.com/i-loved-your-post-but-i-cant-tell-you-that/",
          "publishedOn": "2024-08-09T15:29:09.223Z",
          "wordCount": 767,
          "title": "I Loved Your Post, but I Can’t Tell You That",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://tala.bearblog.dev/how-bearblog-makes-me-a-better-writer-new/",
          "author": null,
          "description": "I believe consistent Bearblogging has made me a better writer, but not in the way you might think. I don't mean it has drastically perked my English grammar or refined my sentence structure (though these have definitely been a bonus). Instead, it makes me write more, and, subjectively, that is my definition of a good writer: someone who writes.\nBefore Bearblog, I had a penchant for perfectionism with writing, which made me avoid it for years. For my first blogpost, I was rusty from the lack of practice, and I faced difficulty expressing my internal chaos of thoughts & ideas into coherent phrasing. I was practically forcing out words. That paid off, though, because regular Bearblogging has made my words come more naturally now. I easily phrase whatever crosses my mind, writing as I go along…",
          "link": "https://tala.bearblog.dev/how-bearblog-makes-me-a-better-writer-new/",
          "publishedOn": "2024-08-09T14:50:37.489Z",
          "wordCount": 867,
          "title": "how bearblog makes me a better writer",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://notes.jeddacp.com/how-i-title-my-blog-posts/",
          "author": null,
          "description": "Yesterday, I read a post by Bearly Significant titled: \"Headlines Terrify Me\". The post talked about the nuances of creating the perfect headline, that one time they made a typo, and their fear of sabotaging themselves with their words.\nThe post starts:\nCrafting an effective headline is an art form mastered only by the finest journalists and editors. In fewer words than a tweet, all nuances and \"yes, buts\" must be simplified. This is crucial because journalists are taught to always consider: \"if someone only reads the headline, will they be somewhat informed?\"\nAlthough the blog post was geared more towards the news sector, I can’t help but think that there is some parallelism with how bloggers craft their blog post titles.\nI think everyone has their own flavor of titling their posts that works with their niche, and blogging voice. I follow a few who title their blog posts…\nIn a super vague way that makes you want to click on the post to understand what their title means\nShort and straight to the point - you know exactly what you’re getting yourself into and the topic of the post\nA poetic title that encompasses the topic of the post\nA few words excerpt from their actual post\n…and so on.\nI think I do a mixture of some of the above. I tend to lean towards a blog title that evokes the same emotion as what I’m writing about. If it’s a more poetic piece, I title it as such. If it’s more casual, the title also tends to be. Although there are times when my posts tend to be vague, the goal is to rarely make the title vague. I always want you to know what you’re getting into so you can choose to read, or pass on my posts. I hate clickbait, and so I try to avoid that as much as I can.\nMy blog is pretty straight forward. What you see is typically what you get.\n8/31 - Blaugust\nReply by email",
          "link": "https://notes.jeddacp.com/how-i-title-my-blog-posts/",
          "publishedOn": "2024-08-08T15:07:00.000Z",
          "wordCount": 1052,
          "title": "How I Title My Blog Posts",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1723129435.png"
        },
        {
          "id": "https://birming.com/finding-blogging-voice/",
          "author": null,
          "description": "Hello fellow blogger,\nI found your blog and the \"Finding my Blogging Voice\" post through Bear's 'Most Recent' feed and felt like writing a reply.\nIt's wonderful to see that you got your first post out there. A good and interesting one too, that many bloggers can relate to. Now that you're up and running, the hardest part is over.\nI've been in a similar situation myself and understand how you feel. My advice is to not overthink it and just keep writing and posting, writing and posting, writing and posting...\nI always find myself thinking I could do better, write better, be better.\nWe can all do better, and the only way to achieve it is by consistently publishing content. Plus, what we consider our \"best writing\" today, will be replaced by \"even better\" soon. Looking back at what I thought was my \"best writing ever\" five years ago, I wouldn't even publish it today.\nBesides, we're terrible at being our own critics. We'll post texts we believe are outstanding, only to see them go by unnoticed. And we'll post texts we hesitate to share, which end up being our most read ever.\nBlogging is like a school without final exams, that’s what makes it so valuable and rewarding.\nJust keep on blogging and never skip class.\nGood luck!\nUpdate\nThe original post by \"Thoughtless Ramblings\" made ripples in cyberspace. Another great example of the beauty of blogging. A first post was all it took...\nBlog posts\nBearly Significant\nYou?\nMastodon\nI had a hard time finding my voice. I always felt like I needed to perform for someone with my writing. Took me a while to feel comfortable just writing for myself and to get stuff out of my head. And I think the way I see it now is like I'm doing an impromptu presentation and some people might stop and listen. — Juan Villela",
          "link": "https://birming.com/finding-blogging-voice/",
          "publishedOn": "2024-08-08T14:40:00.000Z",
          "wordCount": 978,
          "title": "Re: Finding my Blogging Voice",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1723127978.jpg"
        },
        {
          "id": "https://vixiss.bearblog.dev/how-to-love-yourself/",
          "author": null,
          "description": "Mikasacus recently made a video titled \"how to actually love yourself\"1 in which he details his own journey towards discovering self-love:\nI learned that self-love means giving yourself acceptance for your very being, accepting your flaws, quirks, and failures as a part of you and choosing to respect yourself despite your perceived shortcomings. It means treating yourself with the same respect you would treat anyone else with. You wouldn't tell someone something even half as cruel as the things you tell yourself. So why would you tell yourself those things?\nHis overall message comes down to self-love being something not about vanity but about developing a deep sense of self-assurance, acceptance, and trust with yourself. True self-love involves treating oneself with kindness, respect, and …",
          "link": "https://vixiss.bearblog.dev/how-to-love-yourself/",
          "publishedOn": "2024-08-08T12:00:00.000Z",
          "wordCount": 830,
          "title": "how to love yourself",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://notes.jeddacp.com/the-muse-that-keeps-getting-away/",
          "author": null,
          "description": "There are many ways I come up with blog post topics to publish. Most days, I sit down in front of my computer (or phone) and allow myself to just type, see what comes out, and then refine. Other times, I write intentional posts about topics that I have been ruminating on. Then there are moments when my emotions run so strong that I have to express them before I explode. I guess such was the case yesterday.\nOf course, there are other ways. I have a list of topics I want to get to one day, but those have been mostly ignored. They overwhelm me too much.\nAnyways, that's not the intention of this post.\nThe best topics come to me in the most inopportune times, and so half the time, they never see the light of day. I often find myself coming up with things I want to write about in that space betw…",
          "link": "https://notes.jeddacp.com/the-muse-that-keeps-getting-away/",
          "publishedOn": "2024-08-07T16:33:00.000Z",
          "wordCount": 1143,
          "title": "The Muse That Keeps Getting Away",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1723048282.png"
        },
        {
          "id": "https://hiddenperson.bearblog.dev/finding-my-blogging-voice/",
          "author": null,
          "description": "I want to blog but have never posted. I start a draft and work on it for hours and days, but I never think it's good enough. I always think that I could do better, write better, be better. For so long all I've written is essays and official memos, I find it hard to let down my standards and be natural.\nMy recent resume is working against me; four years of college with essays and lab reports, and a year at a corporate job with professional communications. Writing off the cuff to a casual audience doesn't come as easy to me as it once did. Somehow I need to undo the last five years of training and relearn simplicity and sincerity.\nThis is my first post and I don't expect it to make a splash, but rather just a drop in the sea of writers online. My real goal with this post and others are to find my \"blogging voice\", a version of myself who can write freely without worrying so much about the particulars.\nI'm afraid this post will join the myriad others on BearBlog in the \"meta-blogging\" category; blogging about blogging. While that may be true for this first entry, I'm hoping to expand my writing in the coming months, I just hope someone will join me on that journey.",
          "link": "https://hiddenperson.bearblog.dev/finding-my-blogging-voice/",
          "publishedOn": "2024-08-06T19:29:00.000Z",
          "wordCount": 692,
          "title": "Finding my Blogging Voice",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://birming.com/lost-everyday/",
          "author": null,
          "description": "One of the houses I visited at work today had an absolutely stunning view of the sea. I could have easily stayed there all day.\nWhen I mentioned how amazing the location was, the owner of the house replied, \"Yeah, but you don't think about it after a while.\"\nIt should be illegal to live like that if you don't even appreciate it, I thought as I walked back to my car. I started driving away and caught myself...\nBut what about me? I'm basically the same.\nI don't live in a house with a sea view, but I have an apartment with a window overlooking a beautiful courtyard. And every morning when I walk to my car, I pass amazing old buildings.\nHow often do I think about it? Hardly ever.\nYet, it's something I once marveled at for its beauty. Where did that awareness go? I looked out the window now and it still looks absolutely wonderful, of course.\nOkay, it's never going to be like \"the first high\" again, but that doesn't matter. Just a tenth of the first experience is still immensely precious and rewarding.\nA tiny bit of awareness is all it takes to start observing and appreciating our surroundings. Let's remind ourselves of the beauty of the mundane.",
          "link": "https://birming.com/lost-everyday/",
          "publishedOn": "2024-08-06T15:57:00.000Z",
          "wordCount": 877,
          "title": "Lost in the Everyday",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1722959284.jpg"
        },
        {
          "id": "https://notes.jeddacp.com/sometimes-things-are-just-hard/",
          "author": null,
          "description": "Lately, I’ve been feeling upset and frustrated about some of the things happening in my life. I’m screaming into the unknown because I’m not really sure what else to do. The right words have been hard to come by, probably because I’m not really sure what I’m legally allowed to say, and not say. I know I’m not the only one.\nTalking to people in the same space as me is a challenge in itself. There is a very small circle of people that I trust, but those numbers are dwindling down even more. There are a few that I’d love to open up to, but with the environment we’re in, I’m really not too sure who to trust. With everything that’s happening, I’m not sure whether or not to be grateful about where and how I currently stand.\nI have this nagging feeling that the worst is yet to come for me. I don’t know if this is just me overthinking or irrationally being a pessimist. All I know is that my mental health keeps going downhill, even when I think I’m nearing the bottom. My physical health isn’t doing any better. The more stressed I am, the worst my immune system gets.\nEvery day, I’m faced with another challenge, another thing actively blocking that light at the end of the tunnel. I’m trying to convince myself that I just need to persevere through this and everything will be OK, but at the same time, I think it may be time to try to actively dig my way out of it.\nI just need to figure out how.\n6/31 - Blaugust\nReply by email",
          "link": "https://notes.jeddacp.com/sometimes-things-are-just-hard/",
          "publishedOn": "2024-08-06T15:20:00.000Z",
          "wordCount": 959,
          "title": "Sometimes things are just hard.",
          "imageUrl": "https://live.staticflickr.com/4501/38067387122_b979410d9f_c.jpg"
        },
        {
          "id": "https://froggy.bearblog.dev/choosing-yourself/",
          "author": null,
          "description": "(note: choosing yourself == choosing to be yourself)\nI was having a phone call with my best friend last night. I know he's going through a really tough time and has been for a while. I felt anxious and stressed about whether or not I could be a good friend / what he needed. I knew that things between us are great and will be, and all I needed to do was be there to listen and support him.\nSo why would I be stressed? Zooming out a bit, I've always been shy, never really let anyone into my thoughts and feelings, and frequently deny any help offered to me. It's always been hard for me to get close to even my best friends. I really abused the shit out of \"I'm fine\", and \"I don't need your help\". Despite that, it felt like it really degenerated during lockdowns, to the point where I've had troub…",
          "link": "https://froggy.bearblog.dev/choosing-yourself/",
          "publishedOn": "2024-08-06T11:17:00.000Z",
          "wordCount": 1636,
          "title": "choosing yourself in every moment helps develop your sense of Self",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://blog.grubz.net/what-is-the-indieweb-even/",
          "author": null,
          "description": "If you've been into running a blog or personal site very long, it's safe to say you've heard the terms \"IndieWeb\" or \"small web\" thrown around. I've only been into this stuff for a few months at this point but my understanding of what that actually means has already matured and evolved a lot.\nReally, any personal website you use (instead of corporate social media) for your online presence is part of the IndieWeb. It's like independent music. You're writing, recording and distributing all on your own rather than finding a manager, record label, big name recording studio and getting wrapped up in contracts.\nIt's pretty punk, actually. Running your own corner of the internet is like recording an album in your bedroom and then selling it at the shows you independently worked with bars and venu…",
          "link": "https://blog.grubz.net/what-is-the-indieweb-even/",
          "publishedOn": "2024-08-05T16:56:00.000Z",
          "wordCount": 1370,
          "title": "What is the IndieWeb even?",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://birming.com/brother-blog-broken/",
          "author": null,
          "description": "Long after I'd finished creating the theme for this blog, I still thought the design was spot on (and still do). It's the ideal theme in my opinion.\nRecently, I asked my brother for his thoughts. He replied: \"It looks like the site is broken. There are no images or anything. It's so incredibly boring!\"\nI'd never seen it that way, but I understand his point... haha. It's true what they say, beauty is in the eye of the beholder. When it comes to the look of this blog, I think more people agree with him than me.\nAnyway, that, combined with Lou's post Website Fiddling, has inspired me to start working on a new design. It's always exciting and inspiring to try something different.\nI plan to use Bear's official theme as a starting point and customize it here and there. I'm also considering some larger changes as separate 'add-ons'.\nIf I finish it, anyone is welcome to use it. I'm not a professional designer (and have a full-time job), so Bear with me — it might take a while...or never get finished.",
          "link": "https://birming.com/brother-blog-broken/",
          "publishedOn": "2024-08-05T14:34:00.000Z",
          "wordCount": 871,
          "title": "My Brother Thinks My Blog is Broken (He Might Be Right)",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1722868319.jpg"
        },
        {
          "id": "https://valentine.bearblog.dev/endings-and-beginnings/",
          "author": null,
          "description": "The summer term is over! I'm back in my hometown, bothering my dogs and following my grandmother around the house like a little kid. I was hoping to get 100s all around this term, but I messed up one arts assignment, so I'm afraid I'll have to settle for almost there. I'll need all the tiny boosts I can get from electives if I want to graduate on time and with honors in two years. Agh.\nSchool aside, there's nothing much to write about today. The sky's been cloudy but bright the whole day, like the sun is playing hide-and-seek with the intention of being found. I ate banana bread and another unidentified sweet bread someone brought back from a trip. The banana bread was okay, but the other one (milk? Butter? Just normal sugary bread?) was really good. Thank God for bread.\nI'm starting and abandoning so many new posts. I couldn't settle on any of them, so I decided to do this one instead. Hope you had some good bread in your life today!",
          "link": "https://valentine.bearblog.dev/endings-and-beginnings/",
          "publishedOn": "2024-08-04T08:41:00.000Z",
          "wordCount": 806,
          "title": "endings and beginnings",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://blog.grubz.net/dont-be-embarrassed/",
          "author": null,
          "description": "I hate that lol you're nervous about something and someone tells you aw don't be nervous!\nOr you're stressing over something and they scream at you to CALM THE FUCK DOWN!!\nOh okay! I didn't think about it that way! I'm so silly 🤪\nFor real though, one of the things about getting older is caring less about what people think. I used to think my dad looked so lame wearing 10 year old, $7 jeans from Walmart, generic black tennis shoes and a plain solid color tee shirt all the time like he's some kinda Seinfeld character. Meanwhile I was straightening my blonde emo-ver hair, wearing skin tight skinny jeans with a pink studded belt from Spencer's and walking around in loud, multicolor, just... massive tongued skating shoes.\nThese days, half the time I'm at work anyway so I'm wearing a long-sleev…",
          "link": "https://blog.grubz.net/dont-be-embarrassed/",
          "publishedOn": "2024-08-04T04:49:24.178Z",
          "wordCount": 1106,
          "title": "Don't be embarrassed",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/dsa-libertarian-socialist-caucus-a-letter-to-the-libertarian-left?v=1723265632",
          "author": null,
          "description": "Author: DSA Libertarian Socialist Caucus\nTitle: A Letter to the Libertarian Left\nDate: 8/8/2024\nSource: Retrieved on 8/8/2024 from https://dsa-lsc.org/2024/08/08/a-letter-to-the-libertarian-left/\n\n “The idea is like grass. It craves light, likes crowds, thrives on crossbreeding, grows better for being stepped on.” \n - The Dispossessed, Ursula K. Le Guin \n We in the Libertarian Socialist Caucus (LSC) of the Democratic Socialists of America (DSA) recognize that our formation has dual obligations, both to the development of the socialist movement in the United States and to the broader libertarian socialist movement that exists outside of DSA. While much of our caucus’ focus thus far has been on DSA’s internal politics, we believe in cross-pollination with the broader libertarian left via an …",
          "link": "https://theanarchistlibrary.org/library/dsa-libertarian-socialist-caucus-a-letter-to-the-libertarian-left?v=1723265632",
          "publishedOn": "2024-08-10T04:53:52.000Z",
          "wordCount": 2912,
          "title": "DSA Libertarian Socialist Caucus - A Letter to the Libertarian Left",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "13582",
            "url": "https://theanarchistlibrary.org/library/dsa-libertarian-socialist-caucus-a-letter-to-the-libertarian-left.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anti-authoritarian-autonomous-action-about-israeli-war-on-gaza?v=1722937938",
          "author": null,
          "description": "Author: Anti-Authoritarian Autonomous Action\nTitle: ABOUT ISRAELI WAR ON GAZA\nDate: 2009\nSource: https://movementsarchive.org/doku.php?id=en:leaflets:aftonomidrasi:aftonomidrasi_gaza\n\n The number of Palestinian causalities is so high compared to previous Israeli attacks, 385 killed and more than 1750 injured (these numbers are valid at 31 December). The majority of Arab masses is only observing what is going on, with lot of outrage and anger, this is due mainly to the general atmosphere of fear and their marginalization that is strongly maintained by the ruling elites. Only a small minority of politically active individuals are participating in the protests on the streets. Those are mainly Islamic activists. This can be understood in two ways: That Hamas, which is leading Gaza strip, is th…",
          "link": "https://theanarchistlibrary.org/library/anti-authoritarian-autonomous-action-about-israeli-war-on-gaza?v=1722937938",
          "publishedOn": "2024-08-06T09:52:18.000Z",
          "wordCount": 1634,
          "title": "Anti-Authoritarian Autonomous Action - ABOUT ISRAELI WAR ON GAZA",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7818",
            "url": "https://theanarchistlibrary.org/library/anti-authoritarian-autonomous-action-about-israeli-war-on-gaza.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/c-l-james-anarchy?v=1722868773",
          "author": null,
          "description": "Author: C. L. James\nTitle: Anarchy\nSubtitle: A Tract for the Times\nDate: 1886\nSource: Retrieved on 2nd August 2024 from archive.org\n\n I claim credit for no originality on account of the pages which follow, except such as may be implied in putting together the discoveries of my predecessors so that they may support and illustrate each other better than this has been done previously. \n Anarchy, from the Greek a or an (not) and arche (the first, the chief) or archon (a magistrate) means that state of society in which there is no government. It is, therefore, very improperly applied to that state in which there are two, or more, governments contending for the supremacy. What Anarchists desire, is the permanent abolition of all government. It is contended, and is doubtless true, that this would…",
          "link": "https://theanarchistlibrary.org/library/c-l-james-anarchy?v=1722868773",
          "publishedOn": "2024-08-05T14:39:33.000Z",
          "wordCount": 16580,
          "title": "C. L. James - Anarchy",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "43130",
            "url": "https://theanarchistlibrary.org/library/c-l-james-anarchy.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/c-l-james-origin-of-anarchism?v=1722867578",
          "author": null,
          "description": "Author: C. L. James\nTitle: Origin of Anarchism\nDate: 1902\nSource: Retrieved on 3rd August 2024 from archive.org\n\n Anarchism, it can hardly be necessary to say, is not a conspiracy for the assassination of kings and such-like. It is not an armed movement of the proletariat or of a part of them. It is not a secret organization. Notions of its nature such as people of information have abandoned to journalists, journalists to politicians, and politicians to Mr. Roosevelt, require no further refutation. Anarchism, whatever it may give rise to, can be described as a theory only. The thesis of Anarchism is that men govern men by deceiving them — a view never very unfamiliar to statesmen like Machiavelli, but which evidently assumes a somewhat novel complexion when preached to the people who are g…",
          "link": "https://theanarchistlibrary.org/library/c-l-james-origin-of-anarchism?v=1722867578",
          "publishedOn": "2024-08-05T14:19:38.000Z",
          "wordCount": 6460,
          "title": "C. L. James - Origin of Anarchism",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "19655",
            "url": "https://theanarchistlibrary.org/library/c-l-james-origin-of-anarchism.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/constitution-of-the-industrial-workers-of-the-world?v=1722863698",
          "author": null,
          "description": "Author: Industrial Workers of the World\nTitle: Constitution of the Industrial Workers of the World\nDate: January 1, 2022\nSource: https://www.iww.org/constitution/\n\nPreamble\n The working class and the employing class have nothing in common. \n There can be no peace so long as hunger and want are found among millions of the working people and the few, who make up the employing class, have all the good things of life. \n Between these two classes a struggle must go on until the workers of the world organise as a class, take possession of the means of production, abolish the wage system, and live in harmony with the earth. \n We find that the centering of the management of industries into fewer and fewer hands makes the trade unions unable to cope with the evergrowing power of the employing class…",
          "link": "https://theanarchistlibrary.org/library/constitution-of-the-industrial-workers-of-the-world?v=1722863698",
          "publishedOn": "2024-08-05T13:14:58.000Z",
          "wordCount": 21333,
          "title": "Industrial Workers of the World - Constitution of the Industrial Workers of the World",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "98452",
            "url": "https://theanarchistlibrary.org/library/constitution-of-the-industrial-workers-of-the-world.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": [
        {
          "id": "https://medium.com/p/d29c26909580",
          "author": "Alibaba Cloud",
          "description": "The latest batch of Alibaba Cloud MVP applications is now open! Apply before 10 September, 2024.",
          "link": "https://alibaba-cloud.medium.com/alibaba-cloud-2024-autumn-mvp-application-now-open-d29c26909580?source=rss-8cdb52f9cdca------2",
          "publishedOn": "2024-08-09T09:05:15.000Z",
          "wordCount": 1393,
          "title": "Alibaba Cloud 2024 Autumn MVP Application Now Open",
          "imageUrl": "https://miro.medium.com/v2/resize:fit:1200/1*Pkv2jy8WoUfGEHCYD05H5A.jpeg"
        },
        {
          "id": "https://medium.com/p/8f26bee20273",
          "author": "Alibaba Cloud",
          "description": "This article guides the setting up of a RAG service using Alibaba Cloud Model Studio, Compute Nest, and AnalyticDB for PostgreSQL.",
          "link": "https://alibaba-cloud.medium.com/building-rag-services-on-compute-nest-with-alibaba-cloud-model-studio-and-analyticdb-for-8f26bee20273?source=rss-8cdb52f9cdca------2",
          "publishedOn": "2024-08-09T07:39:00.000Z",
          "wordCount": 2618,
          "title": "Building RAG Services on Compute Nest with Alibaba Cloud Model Studio and AnalyticDB for…",
          "imageUrl": "https://miro.medium.com/v2/resize:fit:1200/1*XeJ0pQ4yZGLKUjwfpJHcNQ.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}