{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "e0a304814f47b02fee302f211161315a528a747f",
          "author": "Esra Kayabali",
          "description": "Mistral Small, an efficient large language model, joins Amazon Bedrock's lineup, excelling in low-latency tasks, multilingual support, and coding prowess while maintaining cost-effectiveness.",
          "link": "https://aws.amazon.com/blogs/aws/optimized-for-low-latency-workloads-mistral-small-now-available-in-amazon-bedrock/",
          "publishedOn": "2024-05-24T16:52:16.000Z",
          "wordCount": 1606,
          "title": "Optimized for low-latency workloads, Mistral Small now available in Amazon Bedrock",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/05/06/Mistral-small-feat-img.png"
        },
        {
          "id": "3ec4a6e752f974d277f95d9da7228e9f5bba4ba4",
          "author": "Sébastien Stormacq",
          "description": "AWS Summit season is in full swing around the world, with last week’s events in Bengaluru, Berlin, and  Seoul, where my blog colleague Channy delivered one of the keynotes. Last week’s launches Here are some launches that got my attention: Amazon S3 will no longer charge for several HTTP error codes – A customer reported […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-application-load-balancer-ipv6-amazon-s3-pricing-update-amazon-ec2-flex-instances-and-more-may-20-2024/",
          "publishedOn": "2024-05-20T15:49:05.000Z",
          "wordCount": 1709,
          "title": "AWS Weekly Roundup – Application Load Balancer IPv6, Amazon S3 pricing update, Amazon EC2 Flex instances, and more (May 20, 2024)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/08/13/AWS-WIR-default.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": []
    },
    {
      "title": "The GitHub Blog: Engineering News and Updates",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/category/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": []
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "66b95967b06e8c62395ccb2841f747f47b41fe13",
          "author": "Rolando Jr Hilvano",
          "description": "Container based Telco workloads use Multus CNI primarily for traffic or network segmentation. Amazon Elastic Kubernetes Service (Amazon EKS) supports Multus CNI enabling users to attach multiple network interfaces, apply advanced network configuration and segmentation to Kubernetes-based applications running on AWS. One of the many benefits of running applications on AWS is resource elasticity (scaling out and scaling […]",
          "link": "https://aws.amazon.com/blogs/containers/deploying-karpenter-nodes-with-multus-on-amazon-eks/",
          "publishedOn": "2024-05-24T04:05:25.000Z",
          "wordCount": 4507,
          "title": "Deploying Karpenter Nodes with Multus on Amazon EKS",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/05/21/Featured-images-for-Containers-Blog-8-1260x630.jpg"
        },
        {
          "id": "6094b32da7c2d5cacc202444ec0b024d73ee06c4",
          "author": "Sebastian Lee",
          "description": "Independent Service Vendor (ISV) users often offer their end-user solutions hosted on a multi-tenant architecture to reduce cost and operational management. However, this approach can lead Kubernetes clusters to resource exhaustion or network starvation issues that impact neighboring workloads. By default, Kubernetes provides capabilities to enforce resource availability such as CPU and memory to prevent […]",
          "link": "https://aws.amazon.com/blogs/containers/ensuring-fair-bandwidth-allocation-for-amazon-eks-workloads/",
          "publishedOn": "2024-05-21T19:56:45.000Z",
          "wordCount": 3248,
          "title": "Ensuring fair bandwidth allocation for Amazon EKS Workloads",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/05/23/Featured-images-for-Containers-Blog-9-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=323471",
          "author": "Jeffrey St. Clair",
          "description": "In one of the most egregious uses of the pardon power since Bill Clinton freed billionaire tax cheat, Israeli agent and international fugitive Marc Rich as the clock struck midnight on his lamentable administration, last week Texas Gov. Greg Abbott freed an avowed racist who ran a red light, before plunging his car into a crowd of protesters and fatally shooting a man who was trying to protect people from being run over. Abbott granted the killer a pardon, even though the gunman had been obsessed for months with the idea of killing BLM activists. More\nThe post Set the Killers Free: the Pardoning of Daniel Perry appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/set-the-killers-free-the-pardoning-of-daniel-perry/",
          "publishedOn": "2024-05-24T06:05:49.000Z",
          "wordCount": null,
          "title": "Set the Killers Free: the Pardoning of Daniel Perry",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323513",
          "author": "Melvin Goodman",
          "description": "The Washington Post’s David Ignatius has always been an apologist for the Central Intelligence Agency; then he added the Pentagon to his list for institutional apologies.  But now Ignatius is going much further; he has become the mouthpiece for both the administrations of President Joe Biden and Prime Minister Benjamin Netanyahu.  His most recent editorial (“The U.S. is assembling the pieces of a Gaza war endgame”) foresees the “contours of a possible exit ramp” in Gaza that is constructed out of sheer fantasy. More\nThe post The Washington Post’s Mouthpiece for Israel: David Ignatius appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/the-washington-posts-mouthpiece-for-israel-david-ignatius/",
          "publishedOn": "2024-05-24T06:01:25.000Z",
          "wordCount": null,
          "title": "The Washington Post’s Mouthpiece for Israel: David Ignatius",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323539",
          "author": "Stewart Sinclair",
          "description": "Tina Cordova is intimately familiar with the legacy of the atomic bomb. Her hometown, Tularosa, New Mexico, is just thirty-four miles downwind from the Trinity Test Site, where Manhattan Project scientists first detonated what they called “the Gadget.” When both of her great-grandfathers, who were in Tularosa during the blast, succumbed to stomach cancer ten years later, it was just the beginning of her family’s troubles. More\nThe post The U.S. Tested Nukes on Its Own People. It’s Time to Apologize and Pay appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/the-u-s-tested-nukes-on-its-own-people-its-time-to-apologize-and-pay/",
          "publishedOn": "2024-05-24T05:59:29.000Z",
          "wordCount": null,
          "title": "The U.S. Tested Nukes on Its Own People. It’s Time to Apologize and Pay",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323614",
          "author": "JAKE ALIMAHOMED-WILSON, SABRINA ALIMAHOMED-WILSON, ARACELI ESPARZA, STEVEN OSUNA, DENNIS LÓPEZ AND AZZA BASARUDIN",
          "description": "“Over the years, Boeing and its employees have played a vital role in the advancement of Cal State Long Beach.” Jane Close Conoley, President, California State University, Long Beach Pro-Palestinian student protests and encampments have bloomed this spring across U.S. universities. Unsurprisingly, campus administrators have responded with calls for civility and peace — that is,  More\nThe post Boeing University: How the California State University Became Complicit in Palestinian Genocide appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/boeing-university-how-the-california-state-university-became-complicit-in-palestinian-genocide/",
          "publishedOn": "2024-05-24T05:58:16.000Z",
          "wordCount": null,
          "title": "Boeing University: How the California State University Became Complicit in Palestinian Genocide",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323581",
          "author": "Fawzia Afzal-Khan",
          "description": "So many trips back and forth from the US to Pakistan ever since I \"left\" Lahore on Sep 12th, 1979. My 21st birthday. I was off to conquer the world, become the free and independent woman I had always dreamt of being, away from the strictures of desi patriarchy- or so I imagined. So many tearful and joyful reunions, departures, and arrivals over four and a half decades that now appear to have passed in the blink of an eye. More\nThe post To Lahore, With Love: Musings of a Traveling Feminista, From Pakistan to Palestine appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/to-lahore-with-love-musings-of-a-traveling-feminista-from-pakistan-to-palestine/",
          "publishedOn": "2024-05-24T05:57:33.000Z",
          "wordCount": null,
          "title": "To Lahore, With Love: Musings of a Traveling Feminista, From Pakistan to Palestine",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323616",
          "author": "Matthew Stevenson",
          "description": "There has to be some irony that as Donald Trump sits in the dock in lower Manhattan, on charges of cooking his corporate books for $130,000 after paying off a porn star (only the flag-waving Supreme Court would let him walk), while slightly to the west, on Wall Street, the same grifter (here as the  More\nThe post Trump’s Three Penny Media Opera appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/trumps-three-penny-media-opera/",
          "publishedOn": "2024-05-24T05:57:31.000Z",
          "wordCount": null,
          "title": "Trump’s Three Penny Media Opera",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323491",
          "author": "Eve Ottenberg",
          "description": "Well-deserved indictments keep hitting Congress. The latest indicted legislator is Texas Democrat Henry Cuellar, the politician backed by former House speaker Nancy Pelosi in his last election, against a more progressive opponent, of course. On May 3, the justice department charged Cuellar with accepting roughly $600,000 from Azerbaijan’s state-owned oil company and a Mexican bank.  More\nThe post The Indicted Congressman’s Club appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/the-indicted-congressmans-club/",
          "publishedOn": "2024-05-24T05:56:43.000Z",
          "wordCount": null,
          "title": "The Indicted Congressman’s Club",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323514",
          "author": "Daniel Warner",
          "description": "While statements that “No one is above the law,” are repeated in the U.S. over the trials of former President Donald Trump, can the same be said internationally? By analogy, Chief Prosecutor Karim Khan of the International Criminal Court (ICC) said yes when he announced he was seeking arrest warrants for Hamas leader Yahya Sinwar and Israeli Prime Minister Benjamin Netanyahu on charges of war crimes and crimes against humanity. More\nThe post Who’s Above the Law? Israel, Hamas and the ICC appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/whos-above-the-law-israel-hamas-and-the-icc/",
          "publishedOn": "2024-05-24T05:56:10.000Z",
          "wordCount": null,
          "title": "Who’s Above the Law? Israel, Hamas and the ICC",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323600",
          "author": "Nick Turse",
          "description": "There are constants in this world — occurrences you can count on. Sunrises and sunsets. The tides. That, day by day, people will be born and others will die. Some of them will die in peace, but others, of course, in violence and agony. For hundreds of years, the U.S. military has been killing people.  More\nThe post Constant Killing appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/constant-killing/",
          "publishedOn": "2024-05-24T05:56:07.000Z",
          "wordCount": null,
          "title": "Constant Killing",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323637",
          "author": "Marc B. Sanganee",
          "description": "South of the Algerian town of Tindouf on the border with Western Sahara are five refugee camps. The camps are home to the Sahrawi people of Western Sahara and are administered by their freedom movement Polisario, which is fighting to liberate their homeland from Morocco. Life in the desert camps leaves a deep impression and  More\nThe post At Western Sahara: Visiting a Forgotten People appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/at-western-sahara-visiting-a-forgotten-people/",
          "publishedOn": "2024-05-24T05:55:54.000Z",
          "wordCount": null,
          "title": "At Western Sahara: Visiting a Forgotten People",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323602",
          "author": "Ramzy Baroud",
          "description": "Inadvertently, Israel has pressed the reset button on its war with the Palestinian people, taking back the so-called conflict to square one. Save for a few self-serving Palestinian officials affiliated with the Palestinian Authority (PA), most Palestinians do not seem consumed with the return to the peace process, or even engaged in discussions about two-state  More\nThe post Nakba Resurrected – How the Gaza Resistance Ended Segmentation of Palestine appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/nakba-resurrected-how-the-gaza-resistance-ended-segmentation-of-palestine/",
          "publishedOn": "2024-05-24T05:55:46.000Z",
          "wordCount": null,
          "title": "Nakba Resurrected – How the Gaza Resistance Ended Segmentation of Palestine",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323589",
          "author": "Robert Hunziker",
          "description": "“A major question is whether a large-scale collapse of the Amazon forest system could actually happen within the twenty-first century.” (Source: Bernardo M. Flores, et al, Critical Transitions in the Amazon Forest System, Nature, Feb. 14, 2024). It may seem absurd to consider collapse of the Amazon rainforest (65-million-years-old) which seems impossible, too far out,  More\nThe post Amazon Rainforest Collapse? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/amazon-rainforest-collapse/",
          "publishedOn": "2024-05-24T05:55:44.000Z",
          "wordCount": null,
          "title": "Amazon Rainforest Collapse?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323631",
          "author": "M. Reza Behnam",
          "description": "Israel has, for decades, created many versions of itself—Israel in politics, in history, in the United States, in books, in movies and on television.  The real Israel, however, has been shrouded behind a veil of deception.  After 7 October 2023, the undisguised coarse Israel has revealed itself.   For years, Israel has made sure that Palestine, with its  More\nThe post Lifting the Veil: Demystifying Israel  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/lifting-the-veil-demystifying-israel/",
          "publishedOn": "2024-05-24T05:55:35.000Z",
          "wordCount": null,
          "title": "Lifting the Veil: Demystifying Israel",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323639",
          "author": "Binoy Kampmark",
          "description": "The application for arrest warrants by the Prosecutor of the International Criminal Court, Karim A.A. Khan in the Israel-Hamas War gives us a chance to revisit a recurring theme in the commission of crimes in international humanitarian law.  Certain states, so this logic goes, either commit no crimes, or, if they do, have good reasons for doing so,  More\nThe post A Misplaced Purity: Democracies and Crimes Against International Law appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/a-misplaced-purity-democracies-and-crimes-against-international-law/",
          "publishedOn": "2024-05-24T05:55:26.000Z",
          "wordCount": null,
          "title": "A Misplaced Purity: Democracies and Crimes Against International Law",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323634",
          "author": "Vijay Prashad",
          "description": "In the apartment of my friends in Baghdad (Iraq), they tell me about how each of them had been impacted by the ugliness of the 2003 U.S.-imposed illegal war on their country. Yusuf and Anisa are both members of the Federation of Journalists of Iraq and both have experience as “stringers” for Western media companies  More\nThe post War Cuts the Heart Out of Humankind appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/war-cuts-the-heart-out-of-humankind/",
          "publishedOn": "2024-05-24T05:55:03.000Z",
          "wordCount": null,
          "title": "War Cuts the Heart Out of Humankind",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323642",
          "author": "Kim C. Domenico",
          "description": "No symbolic system [i.e., basis for culture] in history has been able to rival religious faith, which forges a bond between the routine behavior… of individuals and ultimate, imperishable truths.  It’s the most enduring, deep-rooted universal form of popular culture that history has ever witnessed….            – Terry Eagleton, Where Does Culture Come from? London Monthly Review 4/25/24  More\nThe post Where, Now, the Big Dream? An Amen for Ambivalence appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/where-now-the-big-dream-an-amen-for-ambivalence/",
          "publishedOn": "2024-05-24T05:54:24.000Z",
          "wordCount": null,
          "title": "Where, Now, the Big Dream? An Amen for Ambivalence",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323488",
          "author": "Iain Boal, T.J. Clark, Joseph Matthews, and Michael Watts",
          "description": "An Eastern race well versed in Western culture and profoundly in sympathy with Western ideals will be established in the Orient. Furthermore, a Jewish state will inevitably fall under the control of American Jews who will work out, along Jewish lines, American ideals and American civilization. —William Yale, US State Department consultant, 1919 Unrelenting mass  More\nThe post The Future of an Illusion appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/the-future-of-an-illusion/",
          "publishedOn": "2024-05-24T05:53:14.000Z",
          "wordCount": null,
          "title": "The Future of an Illusion",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323586",
          "author": "Daniel Falcone",
          "description": "The American cultural historian called the creation of the US Space Force an “open declaration of our national insanity.” This CounterPunch feature, in honor of Professor Franklin who passed away on May 19, 2024, is from a previous discussion with him in 2018 and found in Foreign Policy Journal. Bruce Franklin is a US academic who specializes in  More\nThe post In Memoriam: H. Bruce Franklin (1934-2024) appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/in-memoriam-h-bruce-franklin-1934-2024/",
          "publishedOn": "2024-05-24T05:52:12.000Z",
          "wordCount": null,
          "title": "In Memoriam: H. Bruce Franklin (1934-2024)",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323486",
          "author": "Michael Hudson",
          "description": "If a colloquium on early entrepreneurs had been convened in the early 20th century, most participants would have viewed traders as operating on their own, bartering at prices that settled at a market equilibrium established spontaneously in response to fluctuating supply and demand. According to the Austrian economist Carl Menger, money emerged as individuals and  More\nThe post Some Myths Regarding the Genesis of Enterprise appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/some-myths-regarding-the-genesis-of-enterprise/",
          "publishedOn": "2024-05-24T05:52:11.000Z",
          "wordCount": null,
          "title": "Some Myths Regarding the Genesis of Enterprise",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323583",
          "author": "Kim Scipes",
          "description": "The labor movement in the United States used to be respected and looked to for leadership; people cared about what positions labor took, watched when they mobilized, and noticed the causes they supported.  This was especially true among the left. Today, for most of the country, crickets.  Including much of the left.  And yet, labor  More\nThe post US Labor Today and the Way Forward appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/us-labor-today-and-the-way-forward/",
          "publishedOn": "2024-05-24T05:51:33.000Z",
          "wordCount": null,
          "title": "US Labor Today and the Way Forward",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323685",
          "author": "David Yearsley",
          "description": "It is not until the last of the eight episodes of Ripley, which dropped in April on Netflix, that Bach’s music makes an appearance. I’d been expecting it, and not just any piece from among the one-thousand-plus numbers in the Baroque master’s catalog. It had to be the Goldberg Variations. One of Bach’s most celebrated  More\nThe post Bach and the Beasts appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/323685/",
          "publishedOn": "2024-05-24T05:50:52.000Z",
          "wordCount": null,
          "title": "Bach and the Beasts",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323625",
          "author": "Shamus Cooke",
          "description": "“Gen·o·cide: the deliberate killing of a large number of people from a particular nation or ethnic group with the aim of destroying that nation or group.” -Oxford Dictionary “Now we all have one common goal— erasing the Gaza Strip from the face of the earth.” — Nissim Vaturi, Deputy Speaker of the Knesset [Israeli parliament].  More\nThe post Top Ten Ways to Soften a Genocide appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/top-ten-ways-to-soften-a-genocide/",
          "publishedOn": "2024-05-24T05:50:49.000Z",
          "wordCount": null,
          "title": "Top Ten Ways to Soften a Genocide",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323653",
          "author": "Paul Street",
          "description": "A bit of recent history seems worth recalling as the nation careens towards an election that seems somewhat likely to put a man Noam Chomsky once rightly called “the most dangerous criminal in human history” back in the world’s most powerful office. It’s quite possible that the fascist monster Donald “Take Down the Metal Detectors” Trump would  More\nThe post Fear of Violent Retribution appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/fear-of-violent-retribution/",
          "publishedOn": "2024-05-24T05:50:47.000Z",
          "wordCount": null,
          "title": "Fear of Violent Retribution",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323622",
          "author": "Graham Peebles",
          "description": "Earning enough to pay the rent or mortgage, cover utility bills and travel costs, buy food and have the occasional coffee is impossible for many. But its not hard for everyone, is it; there are a small number of people living among us who don’t have to worry about the bills, are not troubled when  More\nThe post 2024: People Starve As The Rich Get Richer appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/2024-people-starve-as-the-rich-get-richer/",
          "publishedOn": "2024-05-24T05:50:07.000Z",
          "wordCount": null,
          "title": "2024: People Starve As The Rich Get Richer",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323644",
          "author": "Robert Jensen",
          "description": "I was politicized and radicalized fairly late in life, beginning at the age of 30 at the end of the 1980s, when I embraced left politics and radical feminism at the same time. Despite tensions between the two philosophies, I remain committed to both. Back to the ‘80s: Until then, I had been a fairly  More\nThe post Radical Feminism and the Failures of the Left appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/radical-feminism-and-the-failures-of-the-left/",
          "publishedOn": "2024-05-24T05:45:44.000Z",
          "wordCount": null,
          "title": "Radical Feminism and the Failures of the Left",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323678",
          "author": "Ron Jacobs",
          "description": "Living through the 1970s was like walking through a never-ending storm.  The cavalcade of world-changing events never seemed to end.  Trying to make sense of the maelstrom was a constant game of catching up and keeping pace.  This was true in politics, international affairs, culture and community.  The contradictions of the post-World War Two world  More\nThe post We’ve Got a Bigger Problem Now appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/weve-got-a-bigger-problem-now/",
          "publishedOn": "2024-05-24T05:45:25.000Z",
          "wordCount": null,
          "title": "We’ve Got a Bigger Problem Now",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323605",
          "author": "Nicky Reid",
          "description": "“Libertarianism is a people’s movement and a liberation movement. it seeks the sort of open, non-coercive society in which the people, the living, free, distinct people may voluntarily associate, dis-associate and, as they see fit, participate in the decisions affecting their lives. This means a truly free market in everything from ideas to idiosyncrasies. It  More\nThe post Edgelords and Snowflakes appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/edgelords-and-snowflakes/",
          "publishedOn": "2024-05-24T05:45:24.000Z",
          "wordCount": null,
          "title": "Edgelords and Snowflakes",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323519",
          "author": "Algernon Austin",
          "description": "Asian American households have the highest median income of the major racial and ethnic groups. Although Asian Americans have a higher median income than the non-Hispanic white population, they also have a higher poverty ratethan the white population on the Supplemental Poverty Measure (SPM). (The SPM is a more comprehensive poverty measure that also makes  More\nThe post Many Asian American Renters Are Struggling to Pay for Housing appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/many-asian-american-renters-are-struggling-to-pay-for-housing/",
          "publishedOn": "2024-05-24T05:42:22.000Z",
          "wordCount": null,
          "title": "Many Asian American Renters Are Struggling to Pay for Housing",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323485",
          "author": "ANIS SHIVANI",
          "description": "Anis, I’m disturbed by the banner image you chose which paints Israel as a [sic] evil monolith—this is a particularly disturbing image as it draws on the antisemitic trope of blood libel. But beyond that, the image shows the Star of David with an impaled child—again, this pulls on some of the very worst anti-Semitic  More\nThe post Why Is the Literary World Silent on Gaza? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/why-is-the-literary-world-silent-on-gaza/",
          "publishedOn": "2024-05-24T05:38:52.000Z",
          "wordCount": null,
          "title": "Why Is the Literary World Silent on Gaza?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323681",
          "author": "Eric Toussaint",
          "description": "Why is the G7 discussing Ukraine’s debt? For more than a year, the leaders of the main powers allied against Russia following its invasion of Ukraine have been debating at the G7 (Canada, France, Germany, Italy, Japan, the United Kingdom and the United States), but they have been unable to reach agreement on how to  More\nThe post G7: Whether or Not to Maintain the Suspension of Ukrainian Debt Payments appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/g7-whether-or-not-to-maintain-the-suspension-of-ukrainian-debt-payments/",
          "publishedOn": "2024-05-24T05:38:40.000Z",
          "wordCount": null,
          "title": "G7: Whether or Not to Maintain the Suspension of Ukrainian Debt Payments",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": [
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=29773",
          "author": "Rajashri Chakrabarti, Dan Garcia, and Maxim Pinkovskiy",
          "description": "Veterans constitute a significant segment of the male labor force, and understanding labor market disparities between veterans and non‑veterans is an important component of studying disparities in the economy as a whole. In a previous Liberty Street Economics post, we have shown that even relative to a group of comparable non-veterans, veterans have lower employment and labor force participation rates. One year later, we see that veterans continue to experience lower labor market attachment and the employment gap has widened, though the earnings gap has closed.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/05/veterans-are-doing-better-in-the-labor-market/",
          "publishedOn": "2024-05-22T13:30:00.000Z",
          "wordCount": 4063,
          "title": "Veterans in the Labor Market: 2024 Update",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/05/LSE_2024_veterans_garcia_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=29223",
          "author": "Nina Boyarchenko and Leonardo Elias",
          "description": "Firms’ access to credit is a crucial determinant of their investment, employment, and overall growth decisions. While we usually think of their ability to borrow as determined by aggregate credit conditions, in reality firms have a number of markets where they can borrow, and conditions can vary across those markets. In this post, we investigate how the composition of debt instruments on U.S. firms’ balance sheets has evolved over the last twenty years.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/05/the-changing-landscape-of-corporate-credit/",
          "publishedOn": "2024-05-21T11:00:00.000Z",
          "wordCount": 4200,
          "title": "The Changing Landscape of Corporate Credit",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/05/LSE_2024_landscape-corp-credit_elias_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=30028",
          "author": "Jaison R. Abel and Richard Deitz",
          "description": "Supply chain disruptions became a major headache for businesses in the aftermath of the pandemic. Indeed, in October 2021, nearly all firms in our regional business surveys reported at least some difficulty obtaining the supplies they needed. These supply chain disruptions were a key contributor to the surge in inflation that occurred as the economy recovered from the pandemic recession. In this post, we present new measures of supply availability from our Business Leaders Survey and Empire State Manufacturing Survey that closely track the New York Fed’s Global Supply Chain Pressure Index (GSCPI). We will begin publishing these data on a monthly basis starting in June. These indexes indicate that supply availability had generally been improving since early 2023, but over the past couple of months, improvement has stalled. This trend is concerning since our May Supplemental Survey indicates that between a third and a half of businesses in the region are experiencing difficulties obtaining supplies, and many are reducing operations and raising prices to compensate, though to a lesser extent than a few years ago.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/05/supply-chain-disruptions-have-eased-but-remain-a-concern/",
          "publishedOn": "2024-05-20T12:30:00.000Z",
          "wordCount": 4190,
          "title": "Supply Chain Disruptions Have Eased, But Remain a Concern",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/05/LSE_2024_supply-chain-disruptions_deitz_460.jpg"
        }
      ]
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45375",
          "author": "Lars Syll",
          "description": "from Lars Syll While one can understand that some of the elements in DSGE models seem to appeal to Keynesians at first sight, after closer examination, these models are in fundamental contradiction to Post-Keynesian and even traditional Keynesian thinking. The DSGE model is a model in which output is determined in the labour market as […]",
          "link": "https://rwer.wordpress.com/2024/05/20/dsge-models-a-total-waste-of-time/",
          "publishedOn": "2024-05-20T00:52:00.000Z",
          "wordCount": 5753,
          "title": "DSGE models — a total waste of time",
          "imageUrl": "https://larspsyll.wordpress.com/wp-content/uploads/2013/12/12-02-03-ostwc3a4rts-dullien-01.jpeg?w=550"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "The Money Illusion",
      "feedUrl": "https://feeds.feedblitz.com/themoneyillusion",
      "siteUrl": "https://www.themoneyillusion.com",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=272149",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics, the Bragg trial winds down. imperceptible skin sensors, Hokusai's  Great Wave ~",
          "link": "https://www.nakedcapitalism.com/2024/05/200pm-water-cooler-5-24-2024.html",
          "publishedOn": "2024-05-24T18:00:30.000Z",
          "wordCount": 15594,
          "title": "2:00PM Water Cooler 5/24/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/rcp_2023-05-24.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272113",
          "author": "Lambert Strether",
          "description": "Our sporty daily links",
          "link": "https://www.nakedcapitalism.com/2024/05/links-5-24-2024.html",
          "publishedOn": "2024-05-24T10:55:21.000Z",
          "wordCount": 20320,
          "title": "Links 5/24/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/gaza_2035.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272099",
          "author": "Nick Corbishley",
          "description": "Even the US House of Representatives Foreign Affairs Committee has admitted that Plan Colombia was a resounding failure from a counter-narcotics perspective while providing short-term benefits from a counter-insurgency perspective",
          "link": "https://www.nakedcapitalism.com/2024/05/southcom-commander-laura-richardson-just-described-plan-colombia-as-roaring-success-a-model-for-region.html",
          "publishedOn": "2024-05-24T10:45:07.000Z",
          "wordCount": 5812,
          "title": "SouthCom Commander Laura Richardson Just Described “Plan Colombia” As A Success, A Model for the Region",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272124",
          "author": "Yves Smith",
          "description": "National Grid's biogas plant is performing poorly, as shown by downtimes and methane flaring, yet it wants more consumer subsidies to expand.",
          "link": "https://www.nakedcapitalism.com/2024/05/national-grid-wants-to-heat-more-homes-with-converted-food-waste-and-make-you-pay-for-it.html",
          "publishedOn": "2024-05-24T09:28:50.000Z",
          "wordCount": 5333,
          "title": "National Grid Wants to Heat More Homes With Converted Food Waste — and Make You Pay For It",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/00-national-grid.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272120",
          "author": "Yves Smith",
          "description": "“Modern” elements of enterprise were present  in Mesopotamia in the third millennium BC and the institutions supported long-term growth",
          "link": "https://www.nakedcapitalism.com/2024/05/michael-hudson-some-myths-regarding-the-genesis-of-enterprise.html",
          "publishedOn": "2024-05-24T08:19:49.000Z",
          "wordCount": 5580,
          "title": "Michael Hudson: Some Myths Regarding the Genesis of Enterprise",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272083",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, Pandemics;  can the Democrats allow Trump to take office, White House issues corrections, Marijuana policy (\"and boogie they will\") ~",
          "link": "https://www.nakedcapitalism.com/2024/05/200pm-water-cooler-5-23-2024.html",
          "publishedOn": "2024-05-23T18:00:43.000Z",
          "wordCount": 16772,
          "title": "2:00PM Water Cooler 5/23/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/rcp_05-17-2024.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272067",
          "author": "Yves Smith",
          "description": "Finally, a rigorous study on mask use shows definitively that masks do indeed work, as in reduce transmission of respiratory diseases.",
          "link": "https://www.nakedcapitalism.com/2024/05/masks-work-our-comprehensive-review-has-found.html",
          "publishedOn": "2024-05-23T13:55:57.000Z",
          "wordCount": 7550,
          "title": "Masks Work, Our Comprehensive Review Has Found",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272059",
          "author": "Lambert Strether",
          "description": "Our crepuscular daily links",
          "link": "https://www.nakedcapitalism.com/2024/05/links-5-23-2024.html",
          "publishedOn": "2024-05-23T10:58:02.000Z",
          "wordCount": 21777,
          "title": "Links 5/23/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/Aurelia_aurita_Cnidaria_Luc_Viatour.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=271986",
          "author": "Yves Smith",
          "description": "How economic, military and political costs and consequences are intersecting in the Ukraine and Israel-Palestine conflicts",
          "link": "https://www.nakedcapitalism.com/2024/05/satyajit-das-the-economic-costs-of-modern-war.html",
          "publishedOn": "2024-05-23T10:50:09.000Z",
          "wordCount": 6739,
          "title": "Satyajit Das: The Economic Costs of  Modern War",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272061",
          "author": "Yves Smith",
          "description": "Workers at companies like Apple and Starbucks face armies of union-busting lawyers advising employers to repeatedly violate labor laws.",
          "link": "https://www.nakedcapitalism.com/2024/05/why-corporations-choose-lawlessness-to-fight-unions.html",
          "publishedOn": "2024-05-23T09:25:30.000Z",
          "wordCount": 5234,
          "title": "Why Corporations Choose Lawlessness to Fight Unions",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "66448139abf9e2000aee8587",
          "author": "Wesley Evans",
          "description": "Today we're happy to announce expanded capabilities that will allow you to configure Regional Services for an increased set of defined regions to help you meet your specific requirements for being able to control where your traffic is handled",
          "link": "https://blog.cloudflare.com/expanding-regional-services-configuration-flexibility-for-customers",
          "publishedOn": "2024-05-22T13:00:54.000Z",
          "wordCount": 1917,
          "title": "Expanding Regional Services configuration flexibility for customers",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/05/Expanding-Regional-Services-configuration-flexibility-for-customers-OG-1.png"
        },
        {
          "id": "664cf64607441c000a06e4ed",
          "author": "Kathy Liao",
          "description": "AI Gateway is an AI ops platform that provides speed, reliability, and observability for your AI applications. With a single line of code, you can unlock powerful features including rate limiting, custom caching, real-time logs, and aggregated analytics across multiple providers",
          "link": "https://blog.cloudflare.com/ai-gateway-is-generally-available",
          "publishedOn": "2024-05-22T13:00:17.000Z",
          "wordCount": 1589,
          "title": "AI Gateway is generally available: a unified interface for managing and scaling your generative AI workloads",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/05/AI-Gateway-is-generally-available--a-unified-interface-for-managing-and-scaling-your-generative-AI-workloads-OG-1.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": [
        {
          "id": "https://slack.engineering/?p=16644",
          "author": "Sergii Gorbachov",
          "description": "In the world of frontend development, one thing remains certain: change is the only constant. New frameworks emerge, and libraries can become obsolete without warning. Keeping up with the ever-changing ecosystem involves handling code conversions, both big and small. One significant shift for us was the transition from Enzyme to React Testing Library (RTL), prompting […]\nThe post Balancing Old Tricks with New Feats: AI-Powered Conversion From Enzyme to React Testing Library at Slack appeared first on Slack Engineering.",
          "link": "https://slack.engineering/balancing-old-tricks-with-new-feats-ai-powered-conversion-from-enzyme-to-react-testing-library-at-slack/",
          "publishedOn": "2024-05-22T19:37:12.000Z",
          "wordCount": 3898,
          "title": "Balancing Old Tricks with New Feats: AI-Powered Conversion From Enzyme to React Testing Library at Slack",
          "imageUrl": "https://slack.engineering/wp-content/uploads/sites/7/2024/05/image1.png?w=640"
        }
      ]
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": [
        {
          "id": "https://kubernetes.io/blog/2024/05/20/completing-cloud-provider-migration/",
          "author": null,
          "description": "Since as early as Kubernetes v1.7, the Kubernetes project has pursued the ambitious goal of removing built-in cloud provider integrations (KEP-2395).\nWhile these integrations were instrumental in Kubernetes' early development and growth, their removal was driven by two key factors:\nthe growing complexity of maintaining native support for every cloud provider across millions of lines of Go code, and the desire to establish\nKubernetes as a truly vendor-neutral platform.\nAfter many releases, we're thrilled to announce that all cloud provider integrations have been successfully migrated from the core Kubernetes repository to external plugins.\nIn addition to achieving our initial objectives, we've also significantly streamlined Kubernetes by removing roughly 1.5 million lines of code and reduci…",
          "link": "https://kubernetes.io/blog/2024/05/20/completing-cloud-provider-migration/",
          "publishedOn": "2024-05-20T00:00:00.000Z",
          "wordCount": 4800,
          "title": "Completing the largest migration in Kubernetes history",
          "imageUrl": "/images/docs/components-of-kubernetes.svg"
        }
      ]
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=21235",
          "author": null,
          "description": "In recent years, Meta’s data management systems have evolved into a composable architecture that creates interoperability, promotes reusability, and improves engineering efficiency.  We’re sharing how we’ve achieved this, in part, by leveraging Velox, Meta’s open source execution engine, as well as work ahead as we continue to rethink our data management systems.  Data is at [...]\nRead More...\nThe post Composable data management at Meta appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/05/22/data-infrastructure/composable-data-management-at-meta/",
          "publishedOn": "2024-05-22T17:15:38.000Z",
          "wordCount": 3494,
          "title": "Composable data management at Meta",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/05/Composable-Data-Management-at-Meta-1.png"
        },
        {
          "id": "https://engineering.fb.com/?p=21222",
          "author": null,
          "description": "Today, the internet (like most digital infrastructure in general) relies heavily on the security offered by public-key cryptosystems such as RSA, Diffie-Hellman (DH), and elliptic curve cryptography (ECC). But the advent of quantum computers has raised real questions about the long-term privacy of data exchanged over the internet. In the future, significant advances in quantum [...]\nRead More...\nThe post Post-quantum readiness for TLS at Meta appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/05/22/security/post-quantum-readiness-tls-pqr-meta/",
          "publishedOn": "2024-05-22T16:35:59.000Z",
          "wordCount": 3275,
          "title": "Post-quantum readiness for TLS at Meta",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/05/Eng-Blog-Self-Serve-Hero-Images-PRIVACY-103-Orange.jpg"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=40468991",
          "author": "flourpower471",
          "description": "Not to mention, as somebody who works in quant trading doing ml all day on this kind of data. That ann benchmark is nowhere near state of the art.\nPeople didn't stop working on this in 1989 - they realised they can make lots of money doing it and do it privately.",
          "link": "https://news.ycombinator.com/item?id=40468991",
          "publishedOn": "2024-05-24T18:20:57.000Z",
          "wordCount": 5305,
          "title": "New comment by flourpower471 in \"Financial Statement Analysis with Large Language Models\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40468878",
          "author": "antimatter15",
          "description": "Figure 3 on p.40 of the paper seems to show that their LLM based model does not statistically significantly outperform a 3 layer neural network using 59 variables from 1989.\n  This figure compares the prediction performance of GPT and quantitative models based on machine learning. Stepwise Logistic follows Ou and Penman (1989)’s structure with their 59 financial predictors. ANN is a three-layer artificial neural network model using the same set of variables as in Ou and Penman (1989). GPT (with CoT) provides the model with financial statement information and detailed chain-of-thought prompts. We report average accuracy (the percentage of correct predictions out of total predictions) for each method (left) and F1 score (right). We obtain bootstrapped standard errors by randomly sampling 1,000 observations 1,000 times and include 95% confidence intervals.",
          "link": "https://news.ycombinator.com/item?id=40468878",
          "publishedOn": "2024-05-24T18:10:49.000Z",
          "wordCount": 6632,
          "title": "New comment by antimatter15 in \"Financial Statement Analysis with Large Language Models\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40467689",
          "author": "jedberg",
          "description": "This makes me sad.  I mean, I haven't logged in in about 20 years now, and couldn't if I wanted to (don't have the password or access to the email address).\nBut I had a low five digit user number, and built a lot of relationships on ICQ (some of which continue today!).  It was my main method of electronic communication in college. I had romantic relationships live and die on ICQ.\nAnother reminder of how things change over time.",
          "link": "https://news.ycombinator.com/item?id=40467689",
          "publishedOn": "2024-05-24T16:23:13.000Z",
          "wordCount": 7151,
          "title": "New comment by jedberg in \"ICQ will stop working from June 26\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40461262",
          "author": "alemanek",
          "description": "Adding an additional comment here for a little extra visibility.  I would absolutely love, like really love, a USB-C portrait monitor version of this.  If I could just plug this in to my existing laptop and use it for reading specs, technical docs, …etc that would be amazing.\nAndroid tablet is a tough sell for my employer due to compliance, security, and such.  So buying one of those for work use would take like a year minimum gathering all the necessary approvals and likely would still get denied by someone.  But, a dumb monitor with no real OS I can expense that without approval.  just a heads up to my boss really to say I am buying this and here is why.\nI know you are a small company so have to pick your battles.  But, maybe something to consider down the road.\nEDIt: forgot to say, congrats on the launch.  Looks like a great product.",
          "link": "https://news.ycombinator.com/item?id=40461262",
          "publishedOn": "2024-05-23T23:46:20.000Z",
          "wordCount": 3207,
          "title": "New comment by alemanek in \"Daylight Computer – New 60fps e-paper tablet\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40460251",
          "author": "jimmysong",
          "description": "As one of the beta testers, let me just say that I really like this device. It's very different than a kindle, kobo or reMarkable in that the refresh rate really makes a big difference. When I show this device to people, I show them how quickly zooming in on a PDF is. It's way faster and more responsive than any e-ink screen and it's way less addicting than the typical laptop, phone or tablet.\nI'm attempting to make this device my main driver over the next few months and while the ecosystem isn't exactly mature yet, most android apps just work out of the box and I've found myself doing a lot more reading, either through an e-reading app (Lithium), PDF reader or Instapaper. I have X, Primal, Telegram and many other apps installed, but I don't go to them nearly as much. The device really is a lot more human centered and it makes for a much more intentional device.",
          "link": "https://news.ycombinator.com/item?id=40460251",
          "publishedOn": "2024-05-23T21:42:19.000Z",
          "wordCount": null,
          "title": "New comment by jimmysong in \"Daylight Computer – New 60fps e-paper tablet\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40459428",
          "author": "ibejoeb",
          "description": "I'm sure there are many contexts in which this is a good idea.\nFor many others, though, I like to be able to press, move whatever pointing device I'm using from the hot zone, and release to cancel the action. It's like holding the chess piece.",
          "link": "https://news.ycombinator.com/item?id=40459428",
          "publishedOn": "2024-05-23T20:20:52.000Z",
          "wordCount": null,
          "title": "New comment by ibejoeb in \"Act on Press\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40458832",
          "author": "voidwtf",
          "description": "My partner has a Samsung phone with the curved/wrap around edge screen. The screen is cracked. She's been trying to get it replaced for months, but none of the \"Samsung approved\" repair shops around here can get a screen. Apparently they have screens meant for the same phone in different colors, but do not have the screen for her phone color. Samsung WILL NOT allow them to use a screen from a different color of the same phone, despite being a working part. Samsung has provided no ETA when the part will be available. This is the kind of problem that shouldn't exist. Would love it if our legislators would tell manufacturers to shove it, and if they want to be the exclusive source for parts that the parts must be sold at some limited/reasonable profit percentage and if they're not available they should not be able to limit the availability or function of 3rd party parts.",
          "link": "https://news.ycombinator.com/item?id=40458832",
          "publishedOn": "2024-05-23T19:22:40.000Z",
          "wordCount": 9740,
          "title": "New comment by voidwtf in \"We're ending our Samsung collaboration\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40458335",
          "author": "Cu3PO42",
          "description": "I feel really sorry for the developer. I've only been a casual observer, but from my view point the community's reaction was... not great, to put it lightly.\nI get that a lot of us are tired of 'AI' being shoved down our throat at every possible turn. I get that a lot of us have privacy concerns. I get that maybe you don't want it in your terminal emulator.\nBut iTerm is a free (both as in gratis and as in libre) open source project. The developer released a feature that they were probably happy and excited about. It was off by default and didn't siphon data or do anything malicious. And a ton of reactions were as if iTerm had just added the devil incarnate or attacked people personally.\nDisliking the feature is fine. Voicing your concerns and feedback is fine. But it should always be gracious and in good faith. I think this is a good change, if only to pacify the masses, and I applaud the developer for taking these steps, but I don't like how we got here.\nEDIT: gnachman, if you're reading this, thank you for your tireless work on iTerm. It serves me extremely well whenever I'm on macOS and holds a special place in my heart. I bought a MacBook in 2013 and it was the first *nix system that I daily drove as a desktop for a long time. I installed iTerm  2 in my first week and it was a constant companion for many years.",
          "link": "https://news.ycombinator.com/item?id=40458335",
          "publishedOn": "2024-05-23T18:45:47.000Z",
          "wordCount": null,
          "title": "New comment by Cu3PO42 in \"iTerm2 removes AI feature from core, creates separate plugin\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40457491",
          "author": "boochiboo12",
          "description": "Hi yall, founder of Daylight here.\nHappy to answer any questions you have. Long time lurker, so this is pretty cool to finally take part :)\nI made this because I wanted the eye-strain free and minimalist qualities of my kindle/Eink applied to so much more of what I do on a computer.\nLack of speed and ghosting felt like it made traditional Eink impossible to do most computing tasks. So we focused on making the most Paperlike epaper display that has no ghosting and high refresh rate - 60 to 120fps. We started working on this in 2018.\nWe developed our own custom epaper display tech we call LivePaper. We focused on solving the tradeoffs RLCDs traditionally have - around reflectance %, metallic-look / not Paperlike enough, viewing angle, white state, rainbow mura, parallax, resolution, size, lack of quality backlight, etc.\nFirst proof of concept in late 2021, and then it took us 2.5 years to get it into production.\nAnd we built a whole android tablet around it.\nIt’s essentially our attempt at making a remarkable tablet on steroids / kindle on steroids. Definitely some trade offs, but on the whole we think it’s worth it. (& on twitter a bunch of early customers seem to think so too)\nNote: it’s 60fps epaper, not off the shelf Eink. We spent years developing what we think is the best epaper display in the world and it’s exclusively manufactured by our display factory in Japan.\nThere’s still many cases where traditional Eink is going to be better (bistability, viewing angle, white state color, etc), but we feel for more general purpose computers you can code on and do google docs on and do fast multitouch amongst a thousand other things, the speed and lack of ghosting totally makes it worth it.\nThink of it as a Godzilla sized pebble watch with a decade of improvement\nOr think of it as a gameboy advanced, advanced",
          "link": "https://news.ycombinator.com/item?id=40457491",
          "publishedOn": "2024-05-23T17:29:17.000Z",
          "wordCount": null,
          "title": "New comment by boochiboo12 in \"Daylight Computer – New 60fps e-paper tablet\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40456256",
          "author": "HarHarVeryFunny",
          "description": "Clearly an SJ voice was the goal, given that Altman asked her to do it, asked her a second time just two days before the ChatGPT-4o release, and then tweeted \"her\" on the release day. The next day Karpathy, recently ex-OpenAI, then tweets \"The killer app of LLMs is Scarlett Johansson\".\nAltman appears to be an habitual liar. Note his recent claim not to be aware of the non-disparagement and claw-back terms he had departing employees agree to. Are we supposed to believe that the company lawyer or head of HR did this without consulting (or more likely being instructed by) the co-founder and CEO?!",
          "link": "https://news.ycombinator.com/item?id=40456256",
          "publishedOn": "2024-05-23T15:52:05.000Z",
          "wordCount": null,
          "title": "New comment by HarHarVeryFunny in \"OpenAI didn’t copy Scarlett Johansson’s voice for ChatGPT, records show\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40455846",
          "author": "jmull",
          "description": "Well, here are some things that aren't really being disputed:\n* OpenAI wanted an AI voice that sounds like SJ\n* SJ declined\n* OpenAI got an AI voice that sounds like SJ anyway\nI guess they want us to believe this happened without shenanigans, but it's bit hard to.\nThe headline of the article is a little funny, because records can't really show they weren't looking for an SJ sound-alike. They can just show that those records didn't mention it. The key decision-makers could simply have agreed to keep that fact close-to-the-vest -- they may have well understood that knocking off a high-profile actress was legally perilous.\nAlso, I think we can readily assume OpenAI understood that one of their potential voices sounded a lot like SJ. Since they were pursuing her they must have had a pretty good idea of what they were going after, especially considering the likely price tag. So even if an SJ voice wasn't the original goal, it clearly became an important goal to them. They surely listened to demos for many voice actors, auditioned a number of them, and may even have recorded many of them, but somehow they selected one for release who seemed to sound a lot like SJ.",
          "link": "https://news.ycombinator.com/item?id=40455846",
          "publishedOn": "2024-05-23T15:22:46.000Z",
          "wordCount": 18805,
          "title": "New comment by jmull in \"OpenAI didn’t copy Scarlett Johansson’s voice for ChatGPT, records show\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40454004",
          "author": "notRobot",
          "description": "Interesting how they insist that they use \"so much more\" than just Bing for their results, but the moment Bing goes down their search functionality is down entirely, unable to show a single result.",
          "link": "https://news.ycombinator.com/item?id=40454004",
          "publishedOn": "2024-05-23T12:43:16.000Z",
          "wordCount": null,
          "title": "New comment by notRobot in \"DuckDuckGo was down\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40453897",
          "author": "npteljes",
          "description": "I love the acknowledgement that DDG put on their page.\n    We're currently experiencing an issue with DuckDuckGo Search. Thanks for your patience while we get our ducks in a row.\n\n    In the meantime, you can use other search engines right here by using \"bangs\"\n\nSo fun and straightforward.",
          "link": "https://news.ycombinator.com/item?id=40453897",
          "publishedOn": "2024-05-23T12:30:44.000Z",
          "wordCount": null,
          "title": "New comment by npteljes in \"DuckDuckGo was down\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40451982",
          "author": "omnicognate",
          "description": "Comments full of people reading the headline and assuming that what OpenAI did here is fine because it's a different actress, but that's not how \"Right of publicity\" (*) laws work. The article itself explains that there is significant legal risk here:\n> Mitch Glazier, the chief executive of the Recording Industry Association of America, said that Johansson may have a strong case against OpenAI if she brings forth a lawsuit.\n> He compared Johansson’s case to one brought by the singer Bette Midler against the Ford Motor Co. in the 1980s. Ford asked Midler to use her voice in ads. After she declined, Ford hired an impersonator. A U.S. appellate court ruled in Midler’s favor, indicating her voice was protected against unauthorized use.\n> But Mark Humphrey, a partner and intellectual property lawyer at Mitchell, Silberberg and Knupp, said any potential jury probably would have to assess whether Sky’s voice is identifiable as Johansson.\n> Several factors go against OpenAI, he said, namely Altman’s tweet and his outreach to Johansson in September and May. “It just begs the question: It’s like, if you use a different person, there was no intent for it to sound like Scarlett Johansson. Why are you reaching out to her two days before?” he said. “That would have to be explained.”\n* A.K.A. \"Personality rights\": https://en.m.wikipedia.org/wiki/Personality_rights",
          "link": "https://news.ycombinator.com/item?id=40451982",
          "publishedOn": "2024-05-23T08:18:24.000Z",
          "wordCount": null,
          "title": "New comment by omnicognate in \"OpenAI didn’t copy Scarlett Johansson’s voice for ChatGPT, records show\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40451333",
          "author": "oxygen_crisis",
          "description": "WizTree is famously almost 50x faster than WinDirStat (on normal Windows NTFS drives) by reading the Master File Table (MFT) instead of walking the tree to measure each file.\nWizTree isn't open-source like WinDirStat but \"free as in beer\" with optional donations.\nThere's also a fork of WinDirStat patched to read the MFT but I don't know anyone who's tried it: https://github.com/ariccio/altWinDirStat",
          "link": "https://news.ycombinator.com/item?id=40451333",
          "publishedOn": "2024-05-23T06:52:17.000Z",
          "wordCount": null,
          "title": "New comment by oxygen_crisis in \"WinDirStat – Windows Directory Statistics\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40451129",
          "author": "serial_dev",
          "description": "I don't know, to me, it's just sounds like they know how to cover all their bases.\nTo me, it sounds like they had the idea to make their AI sound like \"her\". For the initial version, they had a voice actor that sounds like the movie, as a proof of concept.\nThey still liked it, so it was time to contact the real star. In the end, it's not just the voice, it would have been the brand, just imagine the buzz they would have got if Scarlett J was the official voice of the company. She said no, and they were like, \"too bad, we already decided how she will sound like, the only difference is whether it will be labelled as SJ or not\".\nIn the end, someone probably felt like it's a bit too dodgy as it resemblance was uncanny, they gave it another go, probably ready to offer more money, she still refused, but in the end, it didn't change a thing.",
          "link": "https://news.ycombinator.com/item?id=40451129",
          "publishedOn": "2024-05-23T06:21:44.000Z",
          "wordCount": null,
          "title": "New comment by serial_dev in \"OpenAI didn’t copy Scarlett Johansson’s voice for ChatGPT, records show\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40450139",
          "author": "ungreased0675",
          "description": "Anytime someone tried to get me to sign a terrible contract, they always said “This is just standard stuff.”",
          "link": "https://news.ycombinator.com/item?id=40450139",
          "publishedOn": "2024-05-23T03:25:11.000Z",
          "wordCount": null,
          "title": "New comment by ungreased0675 in \"Leaked OpenAI documents reveal aggressive tactics toward former employees\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40449476",
          "author": "QuadrupleA",
          "description": "Good. The first S in S3 is simple, despite nobody in software appreciating simplicity anymore.\nAdding features makes documentation more complicated, makes the tech harder to learn, makes libraries bigger, likely harms performance a bit, increases bug surface area, etc.\nWhen it gets too out of hand, people will paper it over with a new, simpler abstraction layer, and the process starts again, only with a layer of garbage spaghetti underneath.\nShow your age and be proud, Simple Storage Service.",
          "link": "https://news.ycombinator.com/item?id=40449476",
          "publishedOn": "2024-05-23T01:51:54.000Z",
          "wordCount": null,
          "title": "New comment by QuadrupleA in \"S3 is showing its age\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40449083",
          "author": "DoodahMan",
          "description": "PLEASE make this happen Uncle Sam! i am a lover of music, my friends are lovers of music, the circles i run in on the internet are lovers of music. i cannot express in words how much Live Nation sucks. they are ruining concerts. not only do they have a strangle-hold on venues, but why the hell are they \"allowed\" to run some in-house scalping ops? i cannot wait for the day i see their demise. i will not pour out a beer for them! sorry for the rant HN. Pearl Jam was right decades ago man.",
          "link": "https://news.ycombinator.com/item?id=40449083",
          "publishedOn": "2024-05-23T00:58:28.000Z",
          "wordCount": null,
          "title": "New comment by DoodahMan in \"US Justice Department to seek breakup of Live Nation-Ticketmaster\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40448397",
          "author": "EasyMark",
          "description": "The FTC and DoJ have been hitting it out of the park recently, unfortunately, there are a lot of judges out there that think corps should be able to do anything they want.",
          "link": "https://news.ycombinator.com/item?id=40448397",
          "publishedOn": "2024-05-22T23:48:13.000Z",
          "wordCount": null,
          "title": "New comment by EasyMark in \"US Justice Department to seek breakup of Live Nation-Ticketmaster\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40447979",
          "author": "julianeon",
          "description": "If Live Nation-Ticketmaster is not a monopoly then there is no such thing as a monopoly.",
          "link": "https://news.ycombinator.com/item?id=40447979",
          "publishedOn": "2024-05-22T23:12:10.000Z",
          "wordCount": null,
          "title": "New comment by julianeon in \"US Justice Department to seek breakup of Live Nation-Ticketmaster\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40447810",
          "author": "tedivm",
          "description": "I have worked for multiple startups (Malwarebytes, Vicarious, Rad AI, Explosion AI, Aptible, Kenna Security). Not once have I seen an exit agreement that stated they would steal back my vested equity if I didn't sign. This is definitely not \"standard restrictions\".",
          "link": "https://news.ycombinator.com/item?id=40447810",
          "publishedOn": "2024-05-22T22:57:07.000Z",
          "wordCount": null,
          "title": "New comment by tedivm in \"Leaked OpenAI documents reveal aggressive tactics toward former employees\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40447762",
          "author": "NotSammyHagar",
          "description": "This reads like more than standard restrictions. I hate those like everyone, they are just intended to chill complaints in my opinion with enough question to scare average people without legal expertise (like me, like most devs), just like non-competes used to seemingly primarily be used to discourage looking at other jobs, separate from whether it was enforceable - note the recent FTC decision to end non-competes.\nAbout 5 months ago I had a chance to join a company, their company had what looked like an extreme non-compete to me, you couldn't work for any company for the next two years after leaving if they had been a customer of that company.\nI pointed out to them that I wouldn't have been able to join their company if my previous job had that non-compete clause, it seemed excessive. Eventually I was in meetings with a lawyer at the company who told me it's probably not enforceable, don't worry about it, and the FTC is about to end non-competes. I said great, strike it from the contract and I'll sign it right now. He said I can't do that, no one off contracts. So then I said I'm not working there.",
          "link": "https://news.ycombinator.com/item?id=40447762",
          "publishedOn": "2024-05-22T22:53:06.000Z",
          "wordCount": null,
          "title": "New comment by NotSammyHagar in \"Leaked OpenAI documents reveal aggressive tactics toward former employees\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40447613",
          "author": "tedivm",
          "description": "If this really was a mistake the easiest way to deal with it would be to release people from their non disparagement agreements that were only signed by leaving employees under the duress of losing their vested equity.\nIt's really easy to make people whole for this, so whether that happens or not is the difference between the apologies being real or just them just backpedaling because employees got upset.\nEdit: Looks like they're doing the right thing here:\n> Altman’s initial statement was criticized for doing too little to make things right for former employees, but in an emailed statement, OpenAI told me that “we are identifying and reaching out to former employees who signed a standard exit agreement to make it clear that OpenAI has not and will not cancel their vested equity and releases them from nondisparagement obligations” — which goes much further toward fixing their mistake.",
          "link": "https://news.ycombinator.com/item?id=40447613",
          "publishedOn": "2024-05-22T22:38:55.000Z",
          "wordCount": null,
          "title": "New comment by tedivm in \"Leaked OpenAI documents reveal aggressive tactics toward former employees\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40447526",
          "author": "mateus1",
          "description": "What surprises me about these stories surrounding openAI is how they apologize while lying and downplaying  any blame. Do they expect anybody to believe they didn’t know about clawback clauses?",
          "link": "https://news.ycombinator.com/item?id=40447526",
          "publishedOn": "2024-05-22T22:30:30.000Z",
          "wordCount": null,
          "title": "New comment by mateus1 in \"Leaked OpenAI documents reveal aggressive tactics toward former employees\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40446830",
          "author": "UncleMeat",
          "description": "On the other hand, my uncle lost a fortune investing in a wireless networking company in the 00s. He has worked an entire career in networking and has contributed to bleeding edge systems in the area. This company had excellent tech, but ultimately didn't succeed. A lifetime of savings kaput.\nnvidia's p/e is also insanely high. \"Wow they sure sell a shitload of product\" isn't necessarily enough to justify the price. There are highly profitable companies that nevertheless see their stock price turn around.",
          "link": "https://news.ycombinator.com/item?id=40446830",
          "publishedOn": "2024-05-22T21:29:41.000Z",
          "wordCount": null,
          "title": "New comment by UncleMeat in \"Nvidia announces financial results for first quarter fiscal 2025\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40446545",
          "author": "vunderba",
          "description": "It's a little bit more work to set up, but I'd recommend Krita with diffusion if you want to get into this. Runs locally, swap exact checkpoints you want to use, supports poseable controlnets, and it doesn't phone home to mommy Microsoft.\nhttps://github.com/Acly/krita-ai-diffusion\nVideo demonstration\nhttps://youtu.be/AF2VyqSApjA",
          "link": "https://news.ycombinator.com/item?id=40446545",
          "publishedOn": "2024-05-22T21:06:06.000Z",
          "wordCount": null,
          "title": "New comment by vunderba in \"Microsoft Paint's new AI image generator builds on your brushstrokes\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40445715",
          "author": "michael9423",
          "description": "Actually, it's the opposite. At the level of automation we've reached, labor is worth, per hour, way more than 100 years ago. The problem is just that this value is siphoned off by shareholders who do not have to work to receive the monetary value that should go to the worker. So the issue is simply in how corporations are set up and how the stock market is designed.\nThe entire system is designed to drain as much value out of hardworking people into the pockets of those who do not work, but simply own shares.\nBeing able to buy and sell shares is not problematic per se, but there should be rules in place that give all workers of a publicly traded company better access to owning parts of said company. In other words, all workers of a rich company should be (relatively spoken) rich, corresponding to the value they provided to the company.",
          "link": "https://news.ycombinator.com/item?id=40445715",
          "publishedOn": "2024-05-22T20:05:17.000Z",
          "wordCount": null,
          "title": "New comment by michael9423 in \"One-third of Amazon warehouse workers are on food stamps or Medicaid\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40445595",
          "author": "notaustinpowers",
          "description": "The fact that it ensures to not take a snapshot of DRM content but also explains that it doesn't hide PASSWORDS in snapshots is INSANE to me!\nGod forbid it takes a screenshot of Bridgerton but my bank account password, that's fair game!",
          "link": "https://news.ycombinator.com/item?id=40445595",
          "publishedOn": "2024-05-22T19:56:20.000Z",
          "wordCount": null,
          "title": "New comment by notaustinpowers in \"Windows Recall sounds like a privacy nightmare\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40445278",
          "author": "atleastoptimal",
          "description": "Here's the thing. This is going to happen to everyone, as in, no person will be valuable enough via the contribution of their labor to survive without subsidies.\nAt the level of automation we've reached in society, low-skilled labor is worth, per hour, a very small amount.\nAs AI and automation improve, the majority of people will have negligible economic utility. The only way around this is to let those people starve or implement UBI. There is no magical future where AI serves as a democratizing \"labor enhancer\" for the masses. The value-add of some random person will be 0 in nearly all cases.\nWe will have to decouple our implicit assumption that a person's value is tied to their potential economic value.",
          "link": "https://news.ycombinator.com/item?id=40445278",
          "publishedOn": "2024-05-22T19:33:13.000Z",
          "wordCount": null,
          "title": "New comment by atleastoptimal in \"One-third of Amazon warehouse workers are on food stamps or Medicaid\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=52714",
          "author": "Ingrid Robeyns",
          "description": "I believe that no-one deserves to be a billionaire. In the public realm, defenders of wealth concentration often come up with an example of a person who has created all their wealth themselves – the selfmade billionaire. They didn’t get their money from inheritance or some other form of luck, but from entrepreneurial instincts and […]",
          "link": "https://crookedtimber.org/2024/05/22/a-genuine-selfmade-billionaire/",
          "publishedOn": "2024-05-22T08:10:52.000Z",
          "wordCount": 14091,
          "title": "A genuine selfmade billionaire",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52709",
          "author": "Chris Bertram",
          "description": "Visit the post for more.",
          "link": "https://crookedtimber.org/2024/05/19/sunday-photoblogging-pezenas-5/",
          "publishedOn": "2024-05-19T07:23:30.000Z",
          "wordCount": 1764,
          "title": "Sunday photoblogging: Pézenas",
          "imageUrl": "https://live.staticflickr.com/65535/53718888843_95f592d913.jpg"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/Biden-Should-Stop-Attacking-the-International-Criminal-Court",
          "author": "Branko Marcetic",
          "description": "The ICC seeking arrest warrants for Israeli leaders is a major step forward for international law. US officials' attacks on the ICC are a major step backward for US global standing. \nEnglish\n\n/ \nUnited States of America (USA), \nPalestine, \nIsrael, \nHuman Rights",
          "link": "https://www.cadtm.org/Biden-Should-Stop-Attacking-the-International-Criminal-Court",
          "publishedOn": "2024-05-25T05:21:19.000Z",
          "wordCount": 2015,
          "title": "Biden Should Stop Attacking the International Criminal Court",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1024xH538/48f001c59e819bf3face3ea64423b1-b586c.jpg"
        },
        {
          "id": "https://www.cadtm.org/G7-Whether-or-not-to-maintain-the-suspension-of-Ukrainian-debt-payments",
          "author": "Eric Toussaint",
          "description": "Why is the G7 discussing Ukraine's debt? \nEnglish\n\n/ \nG7 / G20, \nDebt in Northern countries, \nUkraine, \nNorth",
          "link": "https://www.cadtm.org/G7-Whether-or-not-to-maintain-the-suspension-of-Ukrainian-debt-payments",
          "publishedOn": "2024-05-23T15:11:27.000Z",
          "wordCount": 4061,
          "title": "G7: Whether or not to maintain the suspension of Ukrainian debt payments",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/13579425ad1b5e7aa88cfa6aa420ba-43aaa.jpg"
        },
        {
          "id": "https://www.cadtm.org/James-Wolfensohn-switches-on-the-charm-1995-2005",
          "author": "Eric Toussaint",
          "description": "In July 2024, the World Bank and the IMF will be 80 years old. 80 years of financial neo-colonialism and the imposition of austerity policies in the name of debt repayment. 80 years is enough! The Bretton Woods institutions must be abolished and replaced by democratic institutions serving an ecological, feminist and anti-racist bifurcation. To mark these 80 years, we are republishing a series of articles every Wednesday until July, looking in detail at the history and damage caused by these (...)\nEnglish\n\n/ \nIMF, \nWorld Bank, \nFinance against people, \n80 ans BM FMI EN",
          "link": "https://www.cadtm.org/James-Wolfensohn-switches-on-the-charm-1995-2005",
          "publishedOn": "2024-05-22T07:00:00.000Z",
          "wordCount": 6132,
          "title": "James Wolfensohn switches on the charm (1995-2005)",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L153xH80/7d67b536955c2d468284cb35bf57de-31f2b.png"
        },
        {
          "id": "https://www.cadtm.org/When-Mr-Mitsotakis-criminalizes-threatens-and-represses-students-who-defend",
          "author": "Yorgos Mitralias",
          "description": "“If some people think they can repeat what they've seen in other countries and occupy universities, pitch tents and make a mess, they're deeply mistaken”. This - so eminently delicate - statement by the Greek Prime Minister, which followed the brutal “evacuation” of the law faculty on Tuesday May 14 (28 arrests), can only surprise the uninformed: the Greek state and its governments have always had a soft spot for anything to do with apartheid and apartheid regimes! Today Israel, formerly South (...)\nEnglish\n\n/ \nGreece, \nPalestine, \nNorth",
          "link": "https://www.cadtm.org/When-Mr-Mitsotakis-criminalizes-threatens-and-represses-students-who-defend",
          "publishedOn": "2024-05-21T09:25:18.000Z",
          "wordCount": 1625,
          "title": "When Mr. Mitsotakis criminalizes, threatens and represses students who defend international legality!",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/9b079b626e24c10e45e9e1c0a22ccb-044e8.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=7664",
          "author": "J",
          "description": "Australia’s largest telecommunications company, Telstra, announced this week it was making about three thousand employees, or ten percent, of its workforce redundant. About three hundred people were sent home straightaway — hopefully with some sort of pay-out — while the remainder will depart between now and the end of the year. This is terrible news […]",
          "link": "https://disassociated.com/telstra-redundancies-ai-robots-future-now/",
          "publishedOn": "2024-05-23T21:00:57.000Z",
          "wordCount": 421,
          "title": "Telstra redundancies, AI robots come in, the future is now",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7671",
          "author": "J",
          "description": "NASA is dead set keen to return to the Moon. But their current plan, called Artemis, is dead set crazy, writes Polish-American entrepreneur and writer, Maciej Cegłowski: You don’t have to be a rocket scientist to wonder what’s going on here. If we can put a man on the moon, then why can’t we just […]",
          "link": "https://disassociated.com/build-bases-moon-instead-going-week/",
          "publishedOn": "2024-05-23T20:30:58.000Z",
          "wordCount": 412,
          "title": "Build bases on the Moon, instead of going for a week",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7657",
          "author": "J",
          "description": "Konrad Marshall, writing for the Sydney Morning Herald: Run South Yarra co-founder Tom Adair is wary of any suggestion that run clubs are the new Tinder, yet relationships are born here, and side-by-side chats while jogging, he notes, are definitely less pressurised than face-to-face interactions. (Plus, you can always pick up the pace and scoot […]",
          "link": "https://disassociated.com/running-clubs-indieweb-dating-realm/",
          "publishedOn": "2024-05-22T21:00:28.000Z",
          "wordCount": 327,
          "title": "Running clubs, the IndieWeb of the dating realm?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7631",
          "author": "J",
          "description": "Two and bit years ago, I spotted an entry on Fandom about a “remake” of the Stanley Kubrick sci-fi classic, 2001: A Space Odyssey. Being a 2001 fan, I naturally wrote about it. I’ve had a lot of fun with the post ever since. People stumble upon it every now and again, and link to […]",
          "link": "https://disassociated.com/2001-a-space-odyssey-remake-joke-post-trained-google-ai/",
          "publishedOn": "2024-05-21T21:00:21.000Z",
          "wordCount": 430,
          "title": "My 2001: A Space Odyssey remake joke post trained Google AI?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7637",
          "author": "J",
          "description": "She is the Earth, a work of verse, written by Yankunytjatjara (South Australia) poet Ali Cobby Eckermann, was named the NSW Premiers Literary Awards book of the year, on Monday 20 May 2024. Award judges were unstinting in their praise of Eckermann’s writing: She is the Earth is a stunning verse novel that takes the […]",
          "link": "https://disassociated.com/she-is-the-earth-wins-nsw-premiers-literary-awards-book-year-2024/",
          "publishedOn": "2024-05-21T20:30:32.000Z",
          "wordCount": 228,
          "title": "She is the Earth wins NSW Premiers Literary Awards book of year 2024",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7641",
          "author": "J",
          "description": "Sydney based product designer Wing Pang, whom I wrote about last week, has published a comprehensive guide to the IndieWeb. Coming from a design background, joining the IndieWeb was an incredibly exciting and rewarding, yet maze-like journey. To be honest, almost every step of the way was like a leap! But I’ve learnt so much […]",
          "link": "https://disassociated.com/indie-guide-indieweb-wing-pang/",
          "publishedOn": "2024-05-21T20:00:07.000Z",
          "wordCount": 180,
          "title": "An indie guide to the IndieWeb, by Wing Pang",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7643",
          "author": "J",
          "description": "Blog of the .Day, yes, styled as Blog of the .Day, a collaboration between James of James’ Coffee Blog, and Joe Crawford, will highlight a new blog every day. Aside from casting the spotlight daily on a blog, another goal of the project is to bring the term blogosphere back into popular usage. For those […]",
          "link": "https://disassociated.com/blog-of-the-day-bringing-back-blogosphere-one-blog-time/",
          "publishedOn": "2024-05-21T19:30:32.000Z",
          "wordCount": 193,
          "title": "Blog of the .Day, bringing back the blogosphere one blog at a time",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7628",
          "author": "J",
          "description": "As with many things we consume, the science on coffee can be conflicted. One decade caffeine consumption is a no-no, the next it seems coffee is quite beneficial. Regular readers will know I’m a coffee drinker, but in — what I consider to be — moderation: two (large serve) cups per day. But some people […]",
          "link": "https://disassociated.com/health-benefits-giving-up-drinking-coffee/",
          "publishedOn": "2024-05-20T21:00:32.000Z",
          "wordCount": 287,
          "title": "The health benefits of giving up drinking coffee",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7624",
          "author": "J",
          "description": "Every week, Australian radio station Triple J, invites a band or musician to record a cover of a song, for their Like A Version show. Anything goes here. About two years ago, Sydney based Australian DJ Dave Winnel performed a cover of Africa, by Toto, not the sort of music you’d usually hear on the […]",
          "link": "https://disassociated.com/what-happened-cover-versions-popular-songs/",
          "publishedOn": "2024-05-19T21:00:17.000Z",
          "wordCount": 331,
          "title": "What has happened to cover versions of popular songs?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20240522",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20240522",
          "publishedOn": "2024-05-22T19:00:00.000Z",
          "wordCount": 538,
          "title": "Week Ending May 19, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/favoured-nation",
          "author": null,
          "description": "Corporate America’s Anglophilia.",
          "link": "https://newleftreview.org/sidecar/posts/favoured-nation",
          "publishedOn": "2024-05-24T17:54:12.000Z",
          "wordCount": 1967,
          "title": "Tom Hazeldine: &ldquo;Favoured Nation&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/05/Bridget-Riley.jpeg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/a-reprieve-for-assange",
          "author": null,
          "description": "Journalism as ‘espionage’.",
          "link": "https://newleftreview.org/sidecar/posts/a-reprieve-for-assange",
          "publishedOn": "2024-05-20T17:06:21.000Z",
          "wordCount": 1019,
          "title": "Tariq Ali: &ldquo;A Reprieve for Assange&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/05/assange.jpeg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/battle-machine",
          "author": null,
          "description": "Retrospectives on Podemos.",
          "link": "https://newleftreview.org/sidecar/posts/battle-machine",
          "publishedOn": "2024-05-20T11:51:49.000Z",
          "wordCount": 4347,
          "title": "Rachel Godfrey Wood: &ldquo;Battle Machine&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/05/0x0-ezgif.com-webp-to-jpg-converter.jpg"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://itskristin.bearblog.dev/my-favorite-restaurant-closed/",
          "author": null,
          "description": "i'm watching the bear and sydney said something along the lines of \"it's hard to work in a restaurant and not lose your mind.\"\nwhen you have a neighborhood place, somewhere that's been a cornerstone of your community, it is like heartbreak to see it close. The Press in Claremont, California is, and has, been my favorite restaurant for years. it's where my family would go to eat before I was born, where my teenage cousin revealed to them that she was pregnant with my cousins, where my parents would go on date nights before I came around. and now it's gone.\nthey closed it in 2020 with lockdown, and their website has said they were coming back soon for months, for years. I'm watching the bear\nand sydney's risotto is a dish they would've had as a special and I'm thinking of them. I'm thinking …",
          "link": "https://itskristin.bearblog.dev/my-favorite-restaurant-closed/",
          "publishedOn": "2024-05-24T07:45:34.975Z",
          "wordCount": 1473,
          "title": "my favorite restaurant closed",
          "imageUrl": null
        },
        {
          "id": "https://mgx.me/the-rise-of-the-mini-navals/",
          "author": null,
          "description": "You may have noticed a proliferation of a new essayist archetype on the internet in recent years - the \"Mini Navals.\" Modeled after angel investor, entrepreneur, and philosopher Naval Ravikant, these mini me's desperately want to become the next big thought leader by aping Naval's pithy, maxim-filled style. Naval has achieved success through decades of experience, and he reflects on it. In contrast, Mini Navals try to compress \"wisdom\" into a handful of tweets and blog posts.\nMost Mini Navals tend to be in their early-to-mid 20s, still figuring things out but portraying themselves as gurus who have life all figured out. They boldly proclaim hot takes on everything from tech trends to philosophy to politics, with little credibility to back it up other than having read Naval's entire archive. With the Mini Navals, it's usually just word salad dressed up as profundity.\nSometimes, the best philosophy is just living intentionally without needing to proselytize your process. In a world that could use more wisdom, perhaps we don't need so many more mini-versions when the original is still strong.",
          "link": "https://mgx.me/the-rise-of-the-mini-navals/",
          "publishedOn": "2024-05-24T05:08:26.314Z",
          "wordCount": 1240,
          "title": "The Rise of the Mini Navals",
          "imageUrl": "https://static.mgx.me/images/2024/mini-navals.webp"
        },
        {
          "id": "https://erickrueger.com/good-gossip/",
          "author": null,
          "description": "⏲ 3-minute read | last updated {{ post_last_modified }} ago\nDifficult to control and spreads quickly - but unlike fires, not always dangerous.(photo credit: sippakorn yamkasikorn)\n\nHumans are social creatures, and we receive a lot of information about the world when we gossip - it isn't (necessarily) a bad thing.\nEvolution\nGossip is in our blood. Humans who shared information among social circles had an evolutionary advantage. They were able to find those among the group they could trust, and (more importantly) identify bad actors. At the most basic level, gossip was a tool for survival. It answered important questions that helped the group function:\nWho wields the most power/influence in the group? (alliances to make)\nWho has limited resources? (alliances to avoid)\nWhose sleeping with who…",
          "link": "https://erickrueger.com/good-gossip/",
          "publishedOn": "2024-05-24T00:00:00.000Z",
          "wordCount": 1042,
          "title": "Good Gossip",
          "imageUrl": "https://cdn.erickrueger.com/sippakorn-yamkasikorn-nVYEechGqqM-unsplash.jpeg"
        },
        {
          "id": "https://tinavanschelt.com/democracy-is-dead-long-live-democracy/",
          "author": null,
          "description": "This past Saturday, my little family and I went to Den Haag to vote in the 2024 South African National Election. An experience that has stayed with me all week, eventually morphing into this post.\nWe arrived at the embassy at 11:00, expecting to be there no more than two hours. Truthfully, we really weren’t prepared for what awaited us.\nA common joke (read truthism) among expats is that it’s incredibly easy to identify a South African embassy as it’s generally the only embassy with burglar bars, uncut grass and a queue outside. Walking through the doors of a South African embassy is like walking through a portal linked directly to The Department of Home Affairs in Bellville. It's quite a surreal experience actually.\nThe queue on Saturday was something else. It wrapped around several blocks…",
          "link": "https://tinavanschelt.com/democracy-is-dead-long-live-democracy/",
          "publishedOn": "2024-05-23T21:45:01.661Z",
          "wordCount": 2061,
          "title": "Democracy is dead, long live democracy",
          "imageUrl": null
        },
        {
          "id": "https://tiramisu.bearblog.dev/2024-shenyang/",
          "author": null,
          "description": "Some photographs from the Chinese city of 沈阳 (Shenyang).\n\nI could spend all day browsing these five-story malls. This one boasted restaurants, cafes, daycares, basketball courts, go-karting, and live fish.\n\nFine dining in 沈阳. These are the food models in the lobby. Outside the frame, my mom is fighting with my aunt and uncle-in-law first to pay the bill, and when she loses that battle, to order fewer items. Lots of 客气 to go around. \n\nAlthough it may look the part, those flowers are not lavender. You can't see it here, but the whole time we were in Shenyang it looked as though it were snowing. I later learned that the \"snow\" was actually the seed hairs of the willow and the poplar trees. It looks cool until the fuzz gets in your eyes, on your clothes, everywhere. (source)\n老北市\nA popular night market in 沈阳 which runs every night. If you're there at the right time, you can catch the show with flying drone-powered phoenixes shooting fireworks from their wings. Sadly I don't have any good photos of that show — my senses were overwhelmed for most of the night (in a good way).\n\n\n\n\n\n\n\n\n\n\nNight markets have been ruined for me forever. How can anything measure up to that? Not to mention we passed two markets en route to 老北市 that also looked better than anything I'd ever seen.",
          "link": "https://tiramisu.bearblog.dev/2024-shenyang/",
          "publishedOn": "2024-05-23T14:19:59.869Z",
          "wordCount": 666,
          "title": "沈阳 photo dump（mostly 老北市）",
          "imageUrl": null
        },
        {
          "id": "https://kartikay.bearblog.dev/skill-issue/",
          "author": null,
          "description": "The term skill issue is thrown around Twitter a lot. It comes from gaming culture. If you can't beat a level. It is a skill issue. Just level up and win. If you think about it, it is a powerful term. It gives power to the player.\nApplied to life everything is a skill issue. Can't do the perfect juggle? Skill issue. Can't write awesome distributed performant code? Skill issue. Can't convince a penguin to try your awesome new ice cream? You guessed it. Skill issue. It is a powerful mindset. Gives you extreme ownership.\nBut there is a catch. Do you take ownership of other people's shitty behavior? No. You can take ownership of the triggers and environment you perhaps created to lead to that shitty behavior. Especially if you are in positions of power to have a big impact(ie: manager/CEO). Otherwise, constant shitty behavior is their burden to bear. Avoid such people. People rarely change and you don't need the negativity in your life.\nHere the skill issue is effectively able to isolate and weed out the negativity. This is purely in a professional context. In a more personal context, things are a lot more messy. I don't have an answer for that which works. A skill issue on my end. Need more life experience to resolve it.\nMake everything a skill issue and just level up!",
          "link": "https://kartikay.bearblog.dev/skill-issue/",
          "publishedOn": "2024-05-23T10:37:22.552Z",
          "wordCount": 671,
          "title": "Skill Issue",
          "imageUrl": null
        },
        {
          "id": "https://pesto.bearblog.dev/apartment-hunting-and-finding-meaning-in-living-alone/",
          "author": null,
          "description": "In the fall, I'll be moving to a new city to pursue graduate studies. I thought it'd be a good idea to move in a few months early to get a feel for the area - and also avoid fighting over good areas around campus, especially if I wait too long.\nNext week I'm flying out to visit some apartments. It dawned upon me that this would be the first time where I live truly alone - no housemates, roommates, parents, pets - it'll be just me, in a new city. I'm excited of course, but also quite scared. The thought of being free and landing into a new city is something amazing, but for the first time, I'm really on my own.\nI moved back with my parents to save on rent a year ago. And while I do appreciate them for their generosity, I think it's time for me to leave; I've been paying rent with my mental health, something a lot of Asian kids can relate to. I also feel restricted when I came back to the city where I attended high school. It was like I'm in purgatory: suffering for some time before entering heaven (a place of my own).\nIt's a big step, despite something I'm excited for. Yet very scary. But if I'm scared to do it, it's exactly because I'm scared that I should do it.\nI think I'm ready now. Ready to take that big leap, into a new home, nearly a thousand miles away from where I grew up.\nThe (paper) journal I've kept since 2020 is reaching the last few pages, appropriately. It's as if it knew that my journey here was coming to an end, and a new one will begin soon.\nI'll be buying a new notebook once in Seattle. Only appropriate when closing a chapter, no?",
          "link": "https://pesto.bearblog.dev/apartment-hunting-and-finding-meaning-in-living-alone/",
          "publishedOn": "2024-05-22T05:38:01.193Z",
          "wordCount": 548,
          "title": "apartment hunting, and finding meaning in living alone",
          "imageUrl": null
        },
        {
          "id": "https://blog.memothon.com/why-do-i-have-to-write-my-own-anki-cards/",
          "author": null,
          "description": "You really shouldn't have to write your own Anki cards today.\nThere's a really common sentiment that using pre-made or llm generated decks can't replace creating your own.\nThis is probably true. Writing your own flashcards forces you into a state where you have to actually think and organize the concepts together in your head into things that are digestible.\nOften the flashcards that people create are not conducive to review. It's hard to create cards that aren't easy to remember the \"shape\" of later on instead of actually remembering the content. And drilling one small piece of the puzzle doesn't fill in the rest of the pie.\nLLMs are sophisticated enough now to generate variations on flashcards on-demand. But nobody has wired up LLMs natively with spaced repetition for learning. It seems like everyone has stopped at \"generate 100 flashcards for me based on this pdf,\" which does result in flashcards that aren't going to help you remember things.",
          "link": "https://blog.memothon.com/why-do-i-have-to-write-my-own-anki-cards/",
          "publishedOn": "2024-05-22T01:14:11.309Z",
          "wordCount": 606,
          "title": "Why do I have to write my own Anki cards?",
          "imageUrl": null
        },
        {
          "id": "https://kartikay.bearblog.dev/productivity/",
          "author": null,
          "description": "The fundamental selling point of all productivity advice is getting more done in less time. It's a good hook. I have over the years consumed a lot of content around productivity. It took me a long time to realise I was making a fundamental mistake.\nI assumed I would stumble upon some specific protocol that I can follow perfectly and my life is set. So I have tried it all. All kinds of wake-sleep times. Journaling. All kinds of productivity apps and timing techniques. Trying to get as much damn sunlight in my little eye holes within x minutes of waking up(yes, I had a Huberman era). Nothing worked.\nThe fundamental mistake in all of this is I thought of my mind as some unmotivated child that I could be strict with and discipline into getting stuff done. But if you have ever taught young children( I have) you will know that discipline and fear only get you so far. Getting them interested in the topic changes the game.\nThis realisation drastically changed my life. I can get my mind interested in doing things through self-programming. Everyone is different on how to do this. Many of these routines and techniques that we hear about are just outcomes of effective self-programming unique to that individual. Each of us needs to find our unique way.\nHow to program your mind? You can introspect and the documentation of your mind will reveal itself to you. Also, there are some ways you can make the mind more malleable to programming. I have given a framework I follow for this in my 'Hacking Hardwork' post.\nThere is no golden technique that will save you. Only you can save yourself.",
          "link": "https://kartikay.bearblog.dev/productivity/",
          "publishedOn": "2024-05-22T00:00:00.000Z",
          "wordCount": 714,
          "title": "Productivity",
          "imageUrl": null
        },
        {
          "id": "https://that-bloke.com/mouth-dildos/",
          "author": null,
          "description": "People that use mouth dildos annoy the shit out of me. Either commit and smoke a cigarette, or give it up.\nI hate smoking. I think it's fucking disgusting and I don't understand why anyone would want to do it. I especially hate it when there's a gaggle of smokers huddled around the front door of a pub, tooting away on their fags. It's vile and I don't want my pink fluffy lungs affected by that shit.\nBut do you know what I hate more than smoking?\nMouth dildos.\nWhat the fuck is a mouth dildo?\n-- Everyone\nThis is a mouth dildo:\n\nNot only do you look ridiculous putting that stupid fucking contraption in your mouth, but the plumes of flavoured vapour that bellow from these things make you look even more like an utter cunt.\nI don't want to be subjected to the cherry ice cream vapour pouring from your mouth dildos, seemingly by the bucket load. At least smokers are committing, knowing they're gonna kill themselves, have decided to enjoy it while they're here.\nBut you mouth dildo fuckers are the worst. We don't want to smell your stupid fucking vape. So put it away because you look (and smell) like a dick head.\nPeace ✌🏻\nReply by email",
          "link": "https://that-bloke.com/mouth-dildos/",
          "publishedOn": "2024-05-21T12:41:59.234Z",
          "wordCount": 885,
          "title": "Mouth Dildos",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/thatbloke-1713812790-0.webp"
        },
        {
          "id": "https://quincyzikmund.com/why-im-blogging-again/",
          "author": null,
          "description": "Back in the glory days of the internet, when social media was just becoming mainstream, I used to blog regularly. I would write and publish a post anywhere from 1 - 3 times a week.\nI didn't monetize my blog and I had no dreams of my personal site becoming a business. It was simply a place for me to share things that were on my mind and lessons learned from books I was reading.\nFast forward many years and what we have is the current state of the internet.\nEverything is an ad. Everyone is an influencer. And the algorithms determine what we see and dictate what we post. And for some reason they insist on the entire population becoming video producers.\nIt's an endless game that I lost my taste for long ago.\nThat's why I'm attempting to blog again. I need somewhere to get my thoughts and opinions out without distraction and without too much tech.\nIf the internet stresses you out as much as it does me, might I suggest starting your own blog?\nOr heck, maybe just quit the social internet altogether.",
          "link": "https://quincyzikmund.com/why-im-blogging-again/",
          "publishedOn": "2024-05-20T17:55:38.443Z",
          "wordCount": 622,
          "title": "Why I'm blogging again",
          "imageUrl": null
        },
        {
          "id": "https://paulogpd.bearblog.dev/o-povo-pelo-povo-e-o-rs-acaba-em-menos-de-seis-meses/",
          "author": null,
          "description": "A direita, os anarcocapitalistas (embora este termo seja discutível) e a extrema-direita brasileira, diante do crime ambiental praticado no Rio Grande do Sul, conseguiram emplacar uma bela história: o povo pelo povo.\nÉ muito importante salientar como o povo brasileiro se uniu para ajudar o povo do Rio Grande do Sul. É reconfortante observar que o próprio povo, especialmente os mais pobres, uniu-se no próprio RS para ajudar os outros. Voluntários que não têm muito em casa saem às 5h para atender 12h em um abrigo onde as pessoas perderam tudo. Isso é significativo, especialmente após o período de 2018 a 2023, em que o Brasil parecia uma poça de sangue (e ainda parece, em certa medida), pois mostra que o povo ainda é solidário, mesmo que precise de uma tragédia para uni-los.\nO problema é que …",
          "link": "https://paulogpd.bearblog.dev/o-povo-pelo-povo-e-o-rs-acaba-em-menos-de-seis-meses/",
          "publishedOn": "2024-05-20T13:31:41.361Z",
          "wordCount": 1557,
          "title": "O povo pelo povo e o RS acaba em menos de seis meses",
          "imageUrl": null
        },
        {
          "id": "https://meineeds.rest/hello-world-i-guess/",
          "author": null,
          "description": "Okay... exhales\nHere we go.\nHi, I'm Meï ! And welcome to this blog. Or this attempt at a blog.\nIt's been a few weeks since I felt a lot of nostalgia for the Internet of old, the one I discovered as a lil' kid, on my tenth birthday, circa 2007.\nA friend, Seeker, began working on his own blog a few months back. I really liked his articles about DIY and Game Dev, and on a whim asked him his tech stack with the intent of setting something up for myself.\nI used to write quite a bit a few years ago. Especially when I got to the big city after high school. Welcome to Fucktopia1 was a small series detailing my new life far from the countryside.\nAs of late, I've been trying to get back into writing. Essays to recommend some games, some small fictions, and lore for TTRPGs, I've been slowly but surely getting back into it. But I didn't really manage to find a public, even for the essays in places (well, Discord servers in this case) dedicated to the exact IP I was trying to promote.\nThis built up as a bit of frustration, and is another of the reasons I felt like doing a blog. I wanted to be more open to the world, able to write in a place anyone could read if they stumble on the place.\nSo once again, here we go!\n1. As a note, the \"Fucktopia\" is a reference to Souillon's comic book \"Hello Fucktopia\". Couldn't find a listing in English, sorry! It's available in French & Spanish, at least..\nMy small rules of writing\nTry to write regularly. Not necessarily everyday, but I should strive for a post per week at least.\nFocus! I'm super prone to tangents and often stray off-topic. A post should be on a single subject, unless this is a post consciously made for tangents and chaos.\nNo stressing over this. I already stress over too much, let's keep this place as my comfy Internet place.\nLet's hope it goes well. And I hope you'll enjoy this blog and its topics.\nFan-art of Cyberpunk Bartender Action: VA-11 HALL-A, by rnna_7",
          "link": "https://meineeds.rest/hello-world-i-guess/",
          "publishedOn": "2024-05-19T16:28:15.910Z",
          "wordCount": 1828,
          "title": "Hello World, I guess?",
          "imageUrl": null
        },
        {
          "id": "https://kartikay.bearblog.dev/smart-generalist/",
          "author": null,
          "description": "A bear in a circus is interesting. So is a juggler and a man on the unicycle. A bear on a unicycle juggling swords on the other hand is something extremely unique. Something you would pay good money to see. A smart generalist is kinda like that.\nA smart generalist is a person who is 80/20 across multiple fields. This means they have reached 80 Percent understanding/capability across multiple fields leveraging around 20 percent of the effort that would typically be needed to fully master it. It makes them unique.\nThe primary skill of a smart generalist is the ability to get from 0 to 80 in a new field quickly. They can quickly identify high ROI leverage points of a subject. It is a learned skill. They also have strong convictions that anything can be learned and learned fast. Even things considered 'tough' by society.\nOn the other hand, we have the cracked specialists. People really good at one thing. Getting to the frontiers and advancing human knowledge. Creating absolutely beautiful works in that 'one thing'.\nIt is a sliding scale. We all lie somewhere between a specialist and a generalist. But we could all do some good to realise we are not limited. We can do multiple things if we want to. It is easy to be hemmed in. To define your identity as 'Software Engineer' or 'Writer' or 'XYZ'. That is what school teaches -'Specialisation'. But humans are versatile. We are the OG general intelligence. Capable of adapting and doing multiple things.\nDon't forget the 'General' in General Intelligence.",
          "link": "https://kartikay.bearblog.dev/smart-generalist/",
          "publishedOn": "2024-05-19T00:00:00.000Z",
          "wordCount": 702,
          "title": "Smart Generalist",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/ilya-kharkow-the-advice-led-to-hell-cs?v=1716239906",
          "author": null,
          "description": "Author: Ilya Kharkow\nTitle: The Advice Led to Hell\nDate: May 16, 2024\nSource: https://actionweek.noblogs.org/post/2024/05/16/rady-vedou-do-pekla-ilya-kharkow/#more-1104\n\n I wrote about how difficult it was to get from Kyiv to Lviv on the first day of a full-scale war in the novel THE MINING BOYS. But when I finally got there, it only got worse. \n The people who sheltered me sincerely did not understand why I did not want to defend the country with weapons in my hands. My hope to go to Europe seemed like a betrayal to them. At the same time, I had to hide from them not only my fear, but also my culture and my orientation. \n These same people advised me to voluntarily join the territorial defense. Their acquaintances, who also didn’t want to fight, deliberately signed up there so they wouldn…",
          "link": "https://theanarchistlibrary.org/library/ilya-kharkow-the-advice-led-to-hell-cs?v=1716239906",
          "publishedOn": "2024-05-20T21:18:26.000Z",
          "wordCount": 1044,
          "title": "Ilya Kharkow - The Advice Led to Hell",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "5931",
            "url": "https://theanarchistlibrary.org/library/ilya-kharkow-the-advice-led-to-hell-cs.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anarchy-in-action-anarchy-in-the-haitian-revolution?v=1716166084",
          "author": null,
          "description": "Author: Anarchy In Action\nTitle: Anarchy in the Haitian Revolution\nSource: Retrieved on 19 May 2024 from anarchyinaction.org/index.php?title=Anarchy_in_the_Haitian_Revolution\n\n Following many years of hidden and small-scale resistance, African slaves in the French colony of Saint Domingue (or San Domingo) rose up in 1791 against their colonizers and slave masters. By 1804, they abolished slavery, expelled the French colonizers, and established the independent republic of Haiti. Haiti was the name given to the Caribbean island by the Tainos before colonizers arrived, slaughtered the entire indigenous population, and imported African slaves. \n While the 1776 and 1789 revolutions of the USA and France were grounded in exclusionary “citizens’ rights,” the Haitian Revolution stood out for a com…",
          "link": "https://theanarchistlibrary.org/library/anarchy-in-action-anarchy-in-the-haitian-revolution?v=1716166084",
          "publishedOn": "2024-05-20T00:48:04.000Z",
          "wordCount": 2749,
          "title": "Anarchy In Action - Anarchy in the Haitian Revolution",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "14012",
            "url": "https://theanarchistlibrary.org/library/anarchy-in-action-anarchy-in-the-haitian-revolution.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}