{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "823f176c71ff36d802a6912c8db66ae3c79403cf",
          "author": "Jeff Barr",
          "description": "Accelerate genomics, multimedia, big data, networking, and more with up to 192 vCPUs, 8 FPGAs, 2TiB memory, and 100Gbps network – outpacing CPUs by up to 95x.",
          "link": "https://aws.amazon.com/blogs/aws/now-available-second-generation-fpga-powered-amazon-ec2-instances-f2/",
          "publishedOn": "2024-12-11T23:09:48.000Z",
          "wordCount": 1688,
          "title": "Now Available – Second-Generation FPGA-Powered Amazon EC2 instances (F2)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/11/22/EC2-F2d.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": []
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps & Developer Productivity Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": []
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": [
        {
          "id": "https://engineering.atspotify.com/?p=7294",
          "author": "alexandrawei",
          "description": "TL;DR Getting a response from GenAI is quick and straightforward. But what about the confidence level for that response? In [...]\nThe post Building Confidence: A Case Study in How to Create Confidence Scores for GenAI Applications appeared first on Spotify Engineering.",
          "link": "https://engineering.atspotify.com/2024/12/building-confidence-a-case-study-in-how-to-create-confidence-scores-for-genai-applications/",
          "publishedOn": "2024-12-12T17:56:03.000Z",
          "wordCount": 2570,
          "title": "Building Confidence: A Case Study in How to Create Confidence Scores for GenAI Applications",
          "imageUrl": "https://storage.googleapis.com/production-eng/1/2024/12/EN226-GenAI-with-logos_1200-x-630.png"
        }
      ]
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "e5dc8b7d430b19b64ca0e6442d0af0464c387b94",
          "author": "pmm",
          "description": "This blog was authored by Johannes Brück, Senior Staff Engineer (Personio), Donald Dragoti, Lead Platform Engineer (Personio), Steve Flinchbaugh, Lead Platform Engineer (Personio), Maximilian Schellhorn, Senior Solutions Architect (AWS) and Dionysios Kakaletris, Technical Account Manager (AWS). Migrating your Amazon Elastic Kubernetes Service (Amazon EKS) nodes to use AWS Graviton based Amazon Elastic Compute Cloud (Amazon […]",
          "link": "https://aws.amazon.com/blogs/containers/migrating-from-x86-to-aws-graviton-on-amazon-eks-using-karpenter/",
          "publishedOn": "2024-12-11T05:26:54.000Z",
          "wordCount": 3147,
          "title": "Migrating from x86 to AWS Graviton on Amazon EKS using Karpenter",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/11/29/Featured-images-for-Containers-Blog-11-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=346772",
          "author": "Richard Schulman",
          "description": "The perch: It is a place where the eyes capture worlds colliding and dreams shaping: The perch is where my memories live: I listen to the eyes: The perch appears: Every dream becomes real for my camera: My every, begins with the nightmarish possibilities assumed in both Rod Serling’s “A Kind Of Stopwatch” and “Ninety  More\nThe post Architecture of Cities: The Yellow Rolls Royce and Philip Johnson appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/13/architecture-of-cities-the-yellow-rolls-royce-and-philip-johnson/",
          "publishedOn": "2024-12-13T06:35:20.000Z",
          "wordCount": null,
          "title": "Architecture of Cities: The Yellow Rolls Royce and Philip Johnson",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346709",
          "author": "John O'Kane",
          "description": "In the splurge of reactions to why Harris lost the election, her failure to distance herself from Biden was surely one of the most significant. She responded famously in one interview when questioned about what she would do different from her boss on the issues, that she couldn’t think of anything. As a result, she  More\nThe post What Will the DINOs Do Now? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/13/what-will-the-dinos-do-now/",
          "publishedOn": "2024-12-13T06:29:31.000Z",
          "wordCount": null,
          "title": "What Will the DINOs Do Now?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346712",
          "author": "Robert Koehler",
          "description": "You may not have noticed this. The world “celebrated” International Human Rights Day the other day, even as wars across the planet continued, bombs fell, children died. What if “freedom from war” were a human right? I don’t ask this to be cynical, but rather to expand the reach of what should be a global  More\nThe post Our Right to Sing — and Create the Future appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/13/our-right-to-sing-and-create-the-future/",
          "publishedOn": "2024-12-13T06:00:43.000Z",
          "wordCount": null,
          "title": "Our Right to Sing — and Create the Future",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346473",
          "author": "Gerald Sussman",
          "description": "A flurry of commentary has followed Joe Biden’s decision to invoke his presidential privilege in issuing a “full and unconditional pardon” to his son, Hunter Biden, who faced prison time for filing false tax statements, tax evasion, and carrying an unregistered gun. Leading Democrats, including Senator Elizabeth Warren (Mass.) and California Governor Gavin Newsom, came out in opposition to Biden’s nepotistic act, and a former Bernie Sanders adviser saw it as “a big fuck you” to the Democratic Party for forcing him to withdraw from the presidential race. More\nThe post Joe Biden: A Resumé of War Crimes appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/12/joe-biden-a-resume-of-war-crimes/",
          "publishedOn": "2024-12-12T07:00:38.000Z",
          "wordCount": null,
          "title": "Joe Biden: A Resumé of War Crimes",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346597",
          "author": "Jeffrey St. Clair",
          "description": "With Bashar al-Assad having fled Damascus to one of his 20 luxury suites in Russia (valued at $30 million), it is worth taking note of a time, not that long ago, when Assad was on more amicable terms with the American regime and opened his dungeons to the CIA for the torture and interrogation of unfortunate people, such as Maher Arar, who were mercilessly swept up in the War on Terror. These grim services to the empire earned the Assad regime no lasting favors from the US and the enduring animosity of many in the Arab world. More\nThe post Our Man in Damascus: When Syria Deployed Its Torture Chambers and Torturers for the CIA appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/12/our-man-in-damascus-when-syria-deployed-its-torture-chambers-and-torturers-for-the-cia/",
          "publishedOn": "2024-12-12T06:59:59.000Z",
          "wordCount": null,
          "title": "Our Man in Damascus: When Syria Deployed Its Torture Chambers and Torturers for the CIA",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346758",
          "author": "Paul Street",
          "description": "Fatherland/FOX News and the post-republican Republican party of the insurrectionist Donald “Poisoning Our Blood” Trump embrace the legitimacy and necessity of political violence. They look forward to the Trump’s pardoning of fascist thugs who tried to carry out a Trump-sparked coup on January 6, 2021. At the same time, they claim to be the “party  More\nThe post Why Luigi is Not a Hero at FOX but Kyle Is appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/12/why-luigi-is-not-a-hero-at-fox-but-kyle-is/",
          "publishedOn": "2024-12-12T06:56:32.000Z",
          "wordCount": null,
          "title": "Why Luigi is Not a Hero at FOX but Kyle Is",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346656",
          "author": "Stewart Lawrence",
          "description": "Nail salons are often hailed by labor economists as an immigrant success story. Well over half of the 200,000 salons nationwide – up from just 50,000 in 2010 — are owned and operated by Vietnamese women. But there’s a huge downside: the industry is rife with health and safety violations.  Not only are American consumers – mostly women,  More\nThe post The High Price of Pretty Feet: Addressing the Plight of Nail Salon Workers appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/12/the-high-price-of-pretty-feet-addressing-the-plight-of-nail-salon-workers/",
          "publishedOn": "2024-12-12T06:55:44.000Z",
          "wordCount": null,
          "title": "The High Price of Pretty Feet: Addressing the Plight of Nail Salon Workers",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346653",
          "author": "Marjorie Hecht",
          "description": "Numeracy or numerosity, the ability to think about and use numbers, varies among human cultures and within populations, much like intelligence does. Many known languages, for example, have no words for numerals above 2 or 3. A linguist who curated a database of the world’s languages in 2015 estimated that of the 6,880 languages for which there  More\nThe post Not as Simple as 1, 2, 3: Humanity Has a Surprisingly Diverse Understanding of Numbers appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/12/not-as-simple-as-1-2-3-humanity-has-a-surprisingly-diverse-understanding-of-numbers/",
          "publishedOn": "2024-12-12T06:55:35.000Z",
          "wordCount": null,
          "title": "Not as Simple as 1, 2, 3: Humanity Has a Surprisingly Diverse Understanding of Numbers",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346633",
          "author": "Matthew Vernon Whalan",
          "description": "(I) Bullock Prison in Union Springs, Alabama, opened in 1987 and is designed to hold 919 prisoners.1 Alabama Department of Corrections currently has the number of people imprisoned there at 1,512.2 Alabama prisons are currently, and consistently, around 70 percent overcapacity.3 In recent weeks, multiple prisoners from Bullock have reached out to do interviews with me about  More\nThe post Prisoner Discusses Living Incarcerated With HIV and Violence appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/12/prisoner-discusses-living-incarcerated-with-hiv-and-violence/",
          "publishedOn": "2024-12-12T06:55:30.000Z",
          "wordCount": null,
          "title": "Prisoner Discusses Living Incarcerated With HIV and Violence",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346671",
          "author": "John Laforge",
          "description": "Japan has doubled down on the nuclear industry’s routine practice of spreading radioactive pollutants to public air space and to common waterways.[1] In addition to the pumping of tens of thousands of tons of radioactively contaminated cooling water to the Pacific Ocean from the Fukushima-Daiichi reactor complex, the government has announced its intention to spread  More\nThe post Fukushima: Disaster Response is to Spread Radioactive Waste to the Commons appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/12/fukushima-disaster-response-is-to-spread-radioactive-waste-to-the-commons/",
          "publishedOn": "2024-12-12T06:54:56.000Z",
          "wordCount": null,
          "title": "Fukushima: Disaster Response is to Spread Radioactive Waste to the Commons",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346658",
          "author": "Nick Licata",
          "description": "Presidents Andrew Jackson and Donald Trump are not just changemakers or disruptors but revolutionaries who campaigned to overthrow the established political apparatus (see The Return of a Demagogic Populist President after 200 Years ). In their eyes, Jackson and Trump are leading a working-class movement to gain more power by dismantling government institutions. For Jackson, it was  More\nThe post Trump Uses Three Jacksonian Strategies to Rule: Define Citizenship, Use the Military, Hire Loyalists appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/12/trump-uses-three-jacksonian-strategies-to-rule-define-citizenship-use-the-military-hire-loyalists/",
          "publishedOn": "2024-12-12T06:54:50.000Z",
          "wordCount": null,
          "title": "Trump Uses Three Jacksonian Strategies to Rule: Define Citizenship, Use the Military, Hire Loyalists",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346673",
          "author": "Lynda Williams",
          "description": "On April 20, 2023, SpaceX’s Starship—the largest and most powerful rocket ever built—exploded just four minutes after liftoff from its Boca Chica spaceport in Texas. While CEO Elon Musk touted the mission as a success for clearing the launch pad, the environmental and community fallout painted a different picture. Scorched wetlands, debris scattered for miles,  More\nThe post SpaceX Wants to Increase Launches at Boca Chica Without a Full Environmental Review appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/12/spacex-wants-to-increase-launches-at-boca-chica-without-a-full-environmental-review/",
          "publishedOn": "2024-12-12T06:54:24.000Z",
          "wordCount": null,
          "title": "SpaceX Wants to Increase Launches at Boca Chica Without a Full Environmental Review",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346491",
          "author": "Carol Nackenoff – Julie Novkov",
          "description": "As President-elect Donald J. Trump prepares to implement sweeping policy changes affecting American immigration and immigrants, one of the issues under scrutiny by his allies appears to be birthright citizenship – the declaration in the 14th Amendment to the Constitution that anyone born on U.S. soil is a U.S. citizen, regardless of their parents’ nationalities  More\nThe post The Attack on Birthright Citizenship appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/12/the-attack-on-birthright-citizenship/",
          "publishedOn": "2024-12-12T06:52:41.000Z",
          "wordCount": null,
          "title": "The Attack on Birthright Citizenship",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346470",
          "author": "Margaret Knapke",
          "description": "Salvadoran President Nayib Bukele had a huge (though controversial) electoral victory in February 2024. But a small, stubborn legal movement is challenging his popular, indiscriminate war against gangs. Even as the reduction of gang violence brings relief to many Salvadorans, many low-income people see their law-abiding neighbors being swept up arbitrarily in Bukele’s war. Understandably,  More\nThe post Resisting Buekele’s Iron Fist appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/12/resisting-buekeles-iron-fist/",
          "publishedOn": "2024-12-12T06:52:16.000Z",
          "wordCount": null,
          "title": "Resisting Buekele’s Iron Fist",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346497",
          "author": "W. T. Whitney",
          "description": "Venezuelan President Nicolás Maduro warned recently that “the Southern Command is provoking our region …[as it]  tries to set up U.S. military bases in our Essequibo Guyana.” Venezuelan diplomat José Silva Aponte earlier had observed that, “the United States is intent upon both countries arriving at confrontation.” Dispute between Venezuela and Guyana over the Essequibo  More\nThe post US Military Meddles in Venezuela-Guyana Dispute, on Behalf of Imperialism appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/12/us-military-meddles-in-venezuela-guyana-dispute-on-behalf-of-imperialism/",
          "publishedOn": "2024-12-12T06:32:24.000Z",
          "wordCount": null,
          "title": "US Military Meddles in Venezuela-Guyana Dispute, on Behalf of Imperialism",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346426",
          "author": "Paul Buhle",
          "description": "Jim Williams, one of a handful early Students for a Democratic Society members still active politically, was also a founder of the Southern Student Organizing Committee and a veteran union organizer. He has finally provided us with a memoir, Life on the Left: James Williams and the Quest for Justice (Changemaker). Prof. Michael Honey, a  More\nThe post Jim Williams’s Quest for Justice appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/12/jim-williamss-quest-for-justice/",
          "publishedOn": "2024-12-12T06:29:58.000Z",
          "wordCount": null,
          "title": "Jim Williams’s Quest for Justice",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346675",
          "author": "Sovaida Ma'ani Ewing",
          "description": "The ability to see and accept things as they are is difficult for us humans. We tend to repeat behaviors that fail to yield the results we want, lulling ourselves into the belief that this time the outcome will somehow be different. We mask our repeated endeavors as exercises in optimism even when we’re deeply  More\nThe post The Emperor Has No Clothes: COP29 appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/12/the-emperor-has-no-clothes-cop29/",
          "publishedOn": "2024-12-12T06:07:15.000Z",
          "wordCount": null,
          "title": "The Emperor Has No Clothes: COP29",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346700",
          "author": "Elliot Sperber",
          "description": "The garbage truck With all its lights looks like a Christmas tree Blinking down the street And the Christmas tree, just as much, looks like a garbage truck\nThe post Christmas Truck  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/12/christmas-truck/",
          "publishedOn": "2024-12-12T05:10:06.000Z",
          "wordCount": null,
          "title": "Christmas Truck",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346551",
          "author": "Jeffrey St. Clair - Joshua Frank",
          "description": "Below is the alleged short manifesto written by Luigi Mangione, the suspected killer of UnitedHealthcare CEO Brian Thompson in New York City last week. To our knowledge, no major news outlet has published this in full, found in his backpack when Mangione was captured in Altoona, Pennsylvania. We believe it’s newsworthy enough to share here  More\nThe post “Deny,” “Defend” and “Depose”: Luigi Mangione’s Manifesto appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/deny-defend-and-depose-luigi-mangiones-manifesto/",
          "publishedOn": "2024-12-11T07:27:11.000Z",
          "wordCount": null,
          "title": "“Deny,” “Defend” and “Depose”: Luigi Mangione’s Manifesto",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346549",
          "author": "Desiree Hellegers",
          "description": "I don’t know about you, but personally, the whole festive holiday thing seems to be falling a bit flat this year. Don’t get me wrong, like every other year, I do plan to really go to town on a pumpkin pie or two. But this year, the annual deluge of Black Friday ads egging us on to higher levels of consumption–with corresponding carbon emissions and solid and liquid waste–seemed particularly hollow, morbid–predatory, even–falling as Black Friday did this year on November 29, the date the U.N. first recognized in 1977 as International Day of Solidarity with the Palestinian People. This year all the excess, forced pageantry, and planned obsolescence of Black Friday seems in such stark and ironic contrast to the poverty in Gaza. More\nThe post ‘Tis the Season to Talk Climate Collapse, Nuclear Colonialism, and Freeing Leonard Peltier appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/tis-the-season-to-talk-climate-collapse-nuclear-colonialism-and-freeing-leonard-peltier/",
          "publishedOn": "2024-12-11T07:02:00.000Z",
          "wordCount": null,
          "title": "‘Tis the Season to Talk Climate Collapse, Nuclear Colonialism, and Freeing Leonard Peltier",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346492",
          "author": "Patrick Bond",
          "description": "The sudden regime overthrow in Syria and the long-delayed opportunity to confront the legacy of Bashar al-Assad’s tyranny are either being celebrated or condemned, as explored below, but they come at a time that poses profound problems for solidarity with Palestine. More\nThe post From South Africa to Syria, Rising Perils for Palestine Solidarity appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/from-south-africa-to-syria-rising-perils-for-palestine-solidarity/",
          "publishedOn": "2024-12-11T06:59:52.000Z",
          "wordCount": null,
          "title": "From South Africa to Syria, Rising Perils for Palestine Solidarity",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346547",
          "author": "Daniel Falcone – Stephen Zunes",
          "description": "“There are indications that it was unarmed civil resistance led by the resurgent popular committees and local councils, which initially came to the fore in the early nonviolent phase of the revolution back in 2011, that actually wrested control of much of the local governance from the regime.” In this interview, exclusive for CounterPunch, foreign policy  More\nThe post The Ousting of the Brutal Assad Regime Brings Euphoria and More Questions appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/the-ousting-of-the-brutal-assad-regime-brings-euphoria-and-more-questions/",
          "publishedOn": "2024-12-11T06:56:30.000Z",
          "wordCount": null,
          "title": "The Ousting of the Brutal Assad Regime Brings Euphoria and More Questions",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346538",
          "author": "John W. Whitehead – Nisha Whitehead",
          "description": "“Rights aren’t rights if someone can take them away. They’re privileges. That’s all we’ve ever had in this country is a ‘Bill of Temporary Privileges.’ And if you read the news, even badly, you know that the list gets shorter and shorter.”—George Carlin Disguising its power grabs in the self-righteous fervor of national security, the Deep  More\nThe post When Rights Become Privileges: Is the Constitution Becoming Optional? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/when-rights-become-privileges-is-the-constitution-becoming-optional/",
          "publishedOn": "2024-12-11T06:55:24.000Z",
          "wordCount": null,
          "title": "When Rights Become Privileges: Is the Constitution Becoming Optional?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346537",
          "author": "David Rosen",
          "description": "Authoritarian leaders, like many others, need an enemy.  Hitler’s enemy was the Jews (among others); for Netanyahu, it’s been the Palestinians, and for Donald Trump and his MAGA followers, it’s been “immigrants” (among others). For generations in the U.S., African Americans have been the targeted enemy for “white” people, and for centuries women and girls have been  More\nThe post The Need for an Enemy appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/the-need-for-an-enemy/",
          "publishedOn": "2024-12-11T06:55:15.000Z",
          "wordCount": null,
          "title": "The Need for an Enemy",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346540",
          "author": "Binoy Kampmark",
          "description": "The reports through Western presses read rather familiarly.  Joyful residents taking selfies on abandoned, sullen tanks.  Armed men ebullient and shooting into the sky with adventurist stupidity.   The removal of statues and vulgar reminders of a regime.  Prisoners freed; torture prisons emptied.  The tyrant, deposed. This is the scene in Syria, a war with more external backers and sponsors than  More\nThe post Chilling Warnings for Syria: When Foreign Interventions Go Bad appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/chilling-warnings-for-syria-when-foreign-interventions-go-bad/",
          "publishedOn": "2024-12-11T06:55:05.000Z",
          "wordCount": null,
          "title": "Chilling Warnings for Syria: When Foreign Interventions Go Bad",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346458",
          "author": "Charles Thomson",
          "description": "The Tate Modern has barred artist, Edgeworth Johnstone from entering the gallery because of leaflets about the Tate Turner Prize in his bag. Johnstone, a member of the Stuckists art movement, said “I had protest leaflets titled “The Stomach Turner Prize”. I made it clear that I had no intention of distributing them inside the  More\nThe post Tate Artist Excluded from Tate for Turner Prize Leaflet appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/tate-artist-excluded-from-tate-for-turner-prize-leaflet/",
          "publishedOn": "2024-12-11T06:54:58.000Z",
          "wordCount": null,
          "title": "Tate Artist Excluded from Tate for Turner Prize Leaflet",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346382",
          "author": "Karen Bloom Gevirtz",
          "description": "Most of us are aware of the deep problems in the current US pharmaceutical industry. Yet few may realize that today’s issues stem from changes that occurred centuries ago. As I explain in The Apothecary’s Wife: The Hidden History of Medicine and How it Became a Commodity, the current medication system was established between 1650  More\nThe post Today’s Science Skepticism Goes Back to the Scientific Revolution appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/todays-science-skepticism-goes-back-to-the-scientific-revolution/",
          "publishedOn": "2024-12-11T06:49:30.000Z",
          "wordCount": null,
          "title": "Today’s Science Skepticism Goes Back to the Scientific Revolution",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346416",
          "author": "Peter Bach",
          "description": "I don’t know if it was murdered UnitedHealthcare CEO Brian Thompson or not, but I saw Taxi Driver again for the first time in years. Watching Robert De Niro’s Travis Bickle, however, I was reminded more of ‘lame duck’ South Korean president Yoon Suk Yeol and his declaration of martial law—an intensely straight line, in  More\nThe post Letter from London: Striking Home and Away appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/letter-from-london-striking-home-and-away/",
          "publishedOn": "2024-12-11T06:45:34.000Z",
          "wordCount": null,
          "title": "Letter from London: Striking Home and Away",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346417",
          "author": "Imran Khalid",
          "description": "Donald Trump, a man who never shied from bold declarations, has once again turned the global stage into a theater of economic brinkmanship. His target: the BRICS coalition, a bloc of emerging powers that includes China, Brazil, India, Russia, and South Africa (and now Iran, the UAE, Ethiopia, and Egypt as well). With more than  More\nThe post Trump Takes Aim at BRICS and the Global Economy appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/trump-takes-aim-at-brics-and-the-global-economy/",
          "publishedOn": "2024-12-11T06:42:21.000Z",
          "wordCount": null,
          "title": "Trump Takes Aim at BRICS and the Global Economy",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=346554",
          "author": "Evaggelos Vallianatos",
          "description": "Prologue One of the reasons I moved to Claremont, California, in 2008 was Claremont’s banning of the gasoline-powered leaf blowers. I detested them long before 2008. I still do. They are harmful and useless. Leaf blowers are mostly powered by Earth-heating petroleum and gasoline to move leaves from trees on the ground from one spot  More\nThe post Leaf Blowers: An Invisible Source of Climate Chaos and Harm to Human and Environmental Health appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/11/leaf-blowers-an-invisible-source-of-climate-chaos-and-harm-to-human-and-environmental-health/",
          "publishedOn": "2024-12-11T05:04:09.000Z",
          "wordCount": null,
          "title": "Leaf Blowers: An Invisible Source of Climate Chaos and Harm to Human and Environmental Health",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=283776",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, Syndemics; Trump: Time's \"Person of the Year\"; Why Ernst changed her mind on Hegseth (some speculation); Thumbs down on  UCLA's AI-designed textbook cover ~",
          "link": "https://www.nakedcapitalism.com/2024/12/200pm-water-cooler-12-12-2024.html",
          "publishedOn": "2024-12-12T19:00:16.000Z",
          "wordCount": 11686,
          "title": "2:00PM Water Cooler 12/12/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/covid-cdc-ww-natl-1.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=283769",
          "author": "Yves Smith",
          "description": "Warren revives a bill intended to put shareholder obligations in their proper place: at the bottom.",
          "link": "https://www.nakedcapitalism.com/2024/12/warren-bill-would-stop-companies-from-placing-shareholder-paydays-over-worker-rights.html",
          "publishedOn": "2024-12-12T14:55:49.000Z",
          "wordCount": 5586,
          "title": "Warren Bill Would Stop Companies From Placing Shareholder Paydays Over Worker Rights",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=283753",
          "author": "Lambert Strether",
          "description": "Our warm and cuddly daily links",
          "link": "https://www.nakedcapitalism.com/2024/12/links-12-12-2024.html",
          "publishedOn": "2024-12-12T11:58:29.000Z",
          "wordCount": 18128,
          "title": "Links 12/12/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/blog_civil_service.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=283752",
          "author": "Yves Smith",
          "description": "Another post-mortem on Syria's collapse, here on the Russia-Axis of Resistance non-relationship.",
          "link": "https://www.nakedcapitalism.com/2024/12/russia-dodged-a-bullet-by-wisely-choosing-not-to-ally-with-the-now-defeated-resistance-axis.html",
          "publishedOn": "2024-12-12T11:45:15.000Z",
          "wordCount": 21217,
          "title": "“Russia Dodged a Bullet by Wisely Choosing Not To Ally With the Now-Defeated Resistance Axis”",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/00-resistance.jpeg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=283749",
          "author": "Yves Smith",
          "description": "On the growth of a plastisphere in the Antarctic.",
          "link": "https://www.nakedcapitalism.com/2024/12/unveiling-the-antarctic-plastisphere-a-unique-and-potentially-hazardous-new-ecosystem-new-research.html",
          "publishedOn": "2024-12-12T07:07:24.000Z",
          "wordCount": 3373,
          "title": "Unveiling the Antarctic ‘Plastisphere’, a Unique and Potentially Hazardous New Ecosystem – New Research",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/Screen-Shot-2024-12-12-at-2.03.23-PM.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=283744",
          "author": "Yves Smith",
          "description": "Looking at the costs versus purported benefits of programs that require or encourage Federal agencies to purchase American products.",
          "link": "https://www.nakedcapitalism.com/2024/12/the-increasing-cost-of-buying-american.html",
          "publishedOn": "2024-12-12T06:15:04.000Z",
          "wordCount": 6420,
          "title": "The Increasing Cost of Buying American",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/00-American.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=283714",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics; Lina Khan out; Arnade on McDonald's: Trump and The Adjuster; Kamala's flawless campaign, lol; Bird flu carried by dust on the wind ~",
          "link": "https://www.nakedcapitalism.com/2024/12/200pm-water-cooler-12-11-2024.html",
          "publishedOn": "2024-12-11T19:00:20.000Z",
          "wordCount": 15031,
          "title": "2:00PM Water Cooler 12/11/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/covid-cdc-ww-natl-1.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=283676",
          "author": "Yves Smith",
          "description": "How the sudden collapse of the Syrian government exposes fundamental weaknesses in the BRICS initiative.",
          "link": "https://www.nakedcapitalism.com/2024/12/the-collapse-of-syria-brics-and-wishful-thinking.html",
          "publishedOn": "2024-12-11T16:00:41.000Z",
          "wordCount": 26694,
          "title": "The Collapse of Syria, BRICS, and Wishful Thinking",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=283694",
          "author": "Lambert Strether",
          "description": "Our \"things are going swimmingly\" daily links",
          "link": "https://www.nakedcapitalism.com/2024/12/links-12-11-2024.html",
          "publishedOn": "2024-12-11T11:58:11.000Z",
          "wordCount": 12567,
          "title": "Links 12/11/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/African_common_toad_swimming.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=283679",
          "author": "Conor Gallagher",
          "description": "Ankara burns bridges with Beijing and Moscow and is now stuck with Syrian albatross around the neck as emboldened Turkish imperialists eye future conquests.",
          "link": "https://www.nakedcapitalism.com/2024/12/did-turkiye-win-the-battle-but-lose-the-war.html",
          "publishedOn": "2024-12-11T11:00:10.000Z",
          "wordCount": 14363,
          "title": "Did Türkiye Win the Battle, But Lose the War?",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/Screenshot-2024-12-10-at-11.57.55 AM-516x1024.png"
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "6Bi6mGvw8vrskNZ7Mmp73F",
          "author": "Celso Martinho",
          "description": "Today, the AI Audit dashboard gets an upgrade: you can now quickly see which AI services are honoring your robots.txt policies and then automatically enforce the policies against those that aren’t.",
          "link": "https://blog.cloudflare.com/ai-audit-enforcing-robots-txt",
          "publishedOn": "2024-12-10T14:00:00.000Z",
          "wordCount": 1189,
          "title": "Robotcop: enforcing your robots.txt policies and stopping bots before they reach your website",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/LwAse1uBhNdJ0pjyskJcp/3feab8cfa7fc46c4ed93c347987e2a97/Enforcing_your_robots.txt_policies_and_stopping_bots_before_they_reach_your_website-OG.png"
        },
        {
          "id": "4oLkLHLIZ1vibq8dtPJP6F",
          "author": "David Belson",
          "description": "The 2024 Cloudflare Radar Year in Review is our fifth annual review of Internet trends and patterns at both a global and country/region level.",
          "link": "https://blog.cloudflare.com/radar-2024-year-in-review",
          "publishedOn": "2024-12-09T14:00:00.000Z",
          "wordCount": 9941,
          "title": "Cloudflare 2024 Year in Review",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/Xw63gQRdZSUjMoaW6oFyy/190bd0fc341de1277929e0ce620ffe7a/Cloudflare_2024_Year_in_Review-OG.png"
        },
        {
          "id": "1bFqI2J5pfAs7dEpRp8auV",
          "author": "João Tomé",
          "description": "The 2024 popular Internet services landscape highlights rising generative AI, e-commerce shifts, and the continued dominance of platforms like Google and Facebook, as revealed by Cloudflare’s rankings",
          "link": "https://blog.cloudflare.com/radar-2024-year-in-review-internet-services",
          "publishedOn": "2024-12-09T14:00:00.000Z",
          "wordCount": 6530,
          "title": "From ChatGPT to Temu: ranking top Internet services in 2024",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6Gcy2yfdnZuMS15PJI4A6z/c12cc48677d172ded59519995b825c79/BLOG-1033_OG.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": [
        {
          "id": "https://medium.com/p/207d989b64ad",
          "author": "Capital One Tech",
          "description": "Explore our contributions to the world’s premier AI research conference, from papers and workshops to expert presentations.",
          "link": "https://medium.com/capital-one-tech/neurips-2024-capital-one-showcases-leading-ai-research-207d989b64ad?source=rss----3db3a67cb648---4",
          "publishedOn": "2024-12-12T16:09:36.000Z",
          "wordCount": 3364,
          "title": "NeurIPS 2024: Capital One showcases leading AI research",
          "imageUrl": "https://miro.medium.com/v2/resize:fit:1200/0*GJiHs0BUx9TuPuh2.jpg"
        },
        {
          "id": "https://medium.com/p/976de4f9d35e",
          "author": "Andrew Bonham",
          "description": "How and when to use DMN as a business logic solution.",
          "link": "https://medium.com/capital-one-tech/the-power-of-decision-model-and-notation-dmn-976de4f9d35e?source=rss----3db3a67cb648---4",
          "publishedOn": "2024-12-12T14:45:56.000Z",
          "wordCount": 5473,
          "title": "The Power of Decision Model and Notation (DMN)",
          "imageUrl": "https://miro.medium.com/v2/resize:fit:1200/0*xd6_syG9ulMbWtiA.jpg"
        },
        {
          "id": "https://medium.com/p/9cab17c9071b",
          "author": "Capital One Tech",
          "description": "Getting to know Capital One’s Head of Research and Design Operations.",
          "link": "https://medium.com/capital-one-tech/jen-cardello-q-a-advancing-design-research-and-operations-9cab17c9071b?source=rss----3db3a67cb648---4",
          "publishedOn": "2024-12-11T18:23:18.000Z",
          "wordCount": 2472,
          "title": "Jen Cardello Q&A: Advancing design research and operations",
          "imageUrl": "https://miro.medium.com/v2/resize:fit:1200/0*1LyQ3IjLoeN-Vrn0.png"
        }
      ]
    },
    {
      "title": "Engineering at Slack",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": [
        {
          "id": "https://slack.engineering/?p=17310",
          "author": "Sean Madden",
          "description": "“A complex system can fail in an infinite number of ways.” -“Systemantics” by John Gall   Incidents are stressful but inevitable. Even services designed for availability will eventually encounter a failure. Engineers naturally find it daunting to defend their systems against the “infinite number of ways” things can go wrong.  Our team found ourselves in…\nThe post Break Stuff on Purpose appeared first on Engineering at Slack.",
          "link": "https://slack.engineering/break-stuff-on-purpose/",
          "publishedOn": "2024-12-10T09:00:41.000Z",
          "wordCount": 1940,
          "title": "Break Stuff on Purpose",
          "imageUrl": "https://slack.engineering/wp-content/uploads/sites/7/2024/12/pot-breaking.jpg"
        },
        {
          "id": "https://slack.engineering/?p=17321",
          "author": "Ryan Katkov",
          "description": "What are Slack Audit Logs? Like many Software as a Service (SaaS) offerings, Slack provides audit logs to Enterprise Grid customers that record when entities take an action on the platform. For example, when a user logs in, when a user updates their profile, when an app downloads a file, etc. The actual list of…\nThe post Slack Audit Logs and Anomalies appeared first on Engineering at Slack.",
          "link": "https://slack.engineering/slack-audit-logs-and-anomalies/",
          "publishedOn": "2024-12-09T17:02:13.000Z",
          "wordCount": 2373,
          "title": "Slack Audit Logs and Anomalies",
          "imageUrl": "https://slack.engineering/wp-content/uploads/sites/7/2024/12/image1.png?w=640"
        }
      ]
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": [
        {
          "id": "https://code.visualstudio.com/updates/v1_96",
          "author": null,
          "description": "Learn what is new in the Visual Studio Code November 2024 Release (1.96)\nRead the full article",
          "link": "https://code.visualstudio.com/updates/v1_96",
          "publishedOn": "2024-12-11T17:00:00.000Z",
          "wordCount": 7091,
          "title": "Visual Studio Code November 2024",
          "imageUrl": "https://code.visualstudio.com/assets/updates/1_96/release-highlights.png"
        }
      ]
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=22052",
          "author": null,
          "description": "How do you take a mixed reality (MR) headset from idea to finished product? Alfred Jones, VP of hardware engineering at Meta Reality Labs, joins Pascal Hartig (@passy) on the latest episode of the Meta Tech Podcast for a discussion on the realities (no pun intended) of building MR hardware. Jones shares his strategy for [...]\nRead More...\nThe post How to build a mixed reality headset appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/12/12/virtual-reality/how-to-build-a-mixed-reality-headset/",
          "publishedOn": "2024-12-12T17:00:44.000Z",
          "wordCount": 1530,
          "title": "How to build a mixed reality headset",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/12/Meta-Tech-Podcast-episode-68-how-to-build-a-mixed-reality-headset.webp"
        },
        {
          "id": "https://engineering.fb.com/?p=22037",
          "author": null,
          "description": "We’re explaining the end-to-end systems the Facebook app leverages to deliver relevant content to people. Learn about our video-unification efforts that have simplified our product experience and infrastructure, in-depth details around mobile delivery, and new features we are working on in our video-content delivery stack. The end-to-end delivery of highly relevant, personalized, timely, and responsive [...]\nRead More...\nThe post Inside Facebook’s video delivery system appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/12/10/video-engineering/inside-facebooks-video-delivery-system/",
          "publishedOn": "2024-12-10T17:00:13.000Z",
          "wordCount": 4453,
          "title": "Inside Facebook’s video delivery system",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/12/Inside-Facebook-video-delivery-system.png"
        },
        {
          "id": "https://engineering.fb.com/?p=22026",
          "author": null,
          "description": "Ten years after the introduction of PEP 484, we surveyed the current state of the Python type system and the tools developers are using.\nRead More...\nThe post Typed Python in 2024: Well adopted, yet usability challenges persist appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/12/09/developer-tools/typed-python-2024-survey-meta/",
          "publishedOn": "2024-12-09T17:00:14.000Z",
          "wordCount": 2546,
          "title": "Typed Python in 2024: Well adopted, yet usability challenges persist",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/12/Meta-Python-typing-survey-2024-HeroImage_dark.png"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=42385358",
          "author": "jmward01",
          "description": "It is clear that Jones and his relatives have moved money and assets around in order to shield them from the verdict. Now, money that should have been already given to the victims is being used to steal back the megaphone that caused harmed in the first place. The end effect will probably be even more subscribers and money for Jones which he will use with even less restraint since he knows there are no consequences. There are no words for the evil going on here. What recourse is left when the legal system is this broken?",
          "link": "https://news.ycombinator.com/item?id=42385358",
          "publishedOn": "2024-12-11T06:31:31.000Z",
          "wordCount": null,
          "title": "New comment by jmward01 in \"Bankruptcy judge rejects sale of Infowars to The Onion\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42385137",
          "author": "alwa",
          "description": "Isn't it a little strange, though, that the system notionally decided that the families are owed an enormous amount of economic power as compensation for the nasty behavior of Alex Jones' media company, but at the same time it's obliging them not to use that economic power to prevent the sale of the media company to a \"new owner\" still affiliated with an unrepentant Alex Jones, who will undoubtedly continue the nasty behavior? Just in order to get cash to compensate them at pennies on the dollar for his previous round of nasty behavior?\nI have to say, just as a matter of gut instinct, it sure feels like when the court finds that Alex Jones damaged people—at a value orders of magnitude beyond that of his company—those people should be allowed to decide that, to them, there's value in snuffing out his ill-behaving company altogether.\nIs the issue that there are other creditors who are unhappy with this, who would get paid before the aggrieved families' damages would? The lawyers seem to be fine with it, as they're the ones advocating for this plan...",
          "link": "https://news.ycombinator.com/item?id=42385137",
          "publishedOn": "2024-12-11T05:44:37.000Z",
          "wordCount": 5188,
          "title": "New comment by alwa in \"Bankruptcy judge rejects sale of Infowars to The Onion\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42382006",
          "author": "nsxwolf",
          "description": "Man, reading this makes me feel so small. Being a \"software engineer\" consuming APIs and updating database rows seems laughably childish compared to whatever the hell it is I just read. I can't even imagine why I should bother trying to understand it. It's completely inaccessible. Only an elite few get to touch these machines.",
          "link": "https://news.ycombinator.com/item?id=42382006",
          "publishedOn": "2024-12-10T21:53:58.000Z",
          "wordCount": null,
          "title": "New comment by nsxwolf in \"The Google Willow Thing\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42380418",
          "author": "nspeller",
          "description": "I built an interactive Music Theory course 8 years ago over a winter break and it continues to bring in enough to pay my rent each month.\nI just thought there had to be a more intuitive way to learn music theory than the very boring and jargon-heavy alternatives.\nIt uses Tone.js to include little interactive pianos, guitars, and other demos.\nI've done no marketing, it hit the HN front page for a day, and after that initial spike in traffic has been fairly consistent over the past 8 years.\nIt uses Stripe for payments and for the first few years it was only Stripe. 3 years in I decided to add PayPal support... revenue doubled overnight, mostly from international customers.\nhttps://www.lightnote.co/",
          "link": "https://news.ycombinator.com/item?id=42380418",
          "publishedOn": "2024-12-10T19:24:35.000Z",
          "wordCount": null,
          "title": "New comment by nspeller in \"Ask HN: Those making $500/month on side projects in 2024 – Show and tell\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42379400",
          "author": "simonw",
          "description": "For me, the license change upset me mainly for two reasons:\n1. Many people had contributed their efforts to the Redis project for free - both in terms of code but also in advocacy, writing tutorials, publishing example code etc - and when they did that it was under the understanding that project would remain under the same open source license. It honestly felt like a betrayal of trust.\n2. From a purely selfish point of view, my favourite thing about open source licenses is that they let me know exactly what I'm allowed to do and build on that software without having to consult a license. Licenses like the new Redis one leave me potentially needing to get my own legal advice depending on what I'm building on the software. I don't want to spend my time, energy or money on that stuff!\nI do also see these kinds of license trends as harmful to open source generally. It used to be that you could pick an open source project and build a business on it and expect that the project would stay available to you under those well understood terms. That's not the case any more - not just because of Redis, there are a number of other high-profile license rug-pulling projects. I'm sad about that.\n(And yes, I do understand and dislike the trend of businesses building on open source without contributing back. There are no clearly correct answers here.)",
          "link": "https://news.ycombinator.com/item?id=42379400",
          "publishedOn": "2024-12-10T18:04:42.000Z",
          "wordCount": 20071,
          "title": "New comment by simonw in \"From where I left\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42379074",
          "author": "gkoberger",
          "description": "I was at Mozilla when this was implemented.\nIt was completely optional for websites to support this. A few did at first.\nA lot of people internally wanted it to be on-by-default, but the argument was that if it was, nobody would respect it – after all, what tracking platform would willingly only track the 0.1% of people who went into the settings to enable it? (Internet Explorer did eventually enable it by default, which got them good press but ultimately killed the feature since everyone stopped respecting it.)\nOverall, I'm happy to see this sunsetted. I don't think it actually did anything – in fact, I think it implies that it did way more than it did, so it was just a faux feeling of security.\n(All that being said, I would love if the cookie modals on each site became browser-level, but I'm sure there's many reasons that hasn't happened yet. And I suspect a bit reason starts with a G and ends with an Oogle.)",
          "link": "https://news.ycombinator.com/item?id=42379074",
          "publishedOn": "2024-12-10T17:37:46.000Z",
          "wordCount": 7691,
          "title": "New comment by gkoberger in \"Firefox removes \"do not track\" feature support\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42368381",
          "author": "codeulike",
          "description": "They opened the API for it and I'm sending requests but the response always comes back 300ms before I send the request, is there a way of handling that with try{} predestined{} blocks? Or do I need to use the Bootstrap Paradox library?",
          "link": "https://news.ycombinator.com/item?id=42368381",
          "publishedOn": "2024-12-09T17:44:03.000Z",
          "wordCount": 1050,
          "title": "New comment by codeulike in \"Willow, Our Quantum Chip\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42364033",
          "author": "leafo",
          "description": "I'm the one running itch.io, so here's some more context for you:\nFrom what I can tell, some person made a fan page for an existing  Funko Pop video game (Funko Fusion), with links to the official site and screenshots of the game. The BrandShield software is probably instructed to eradicate all \"unauthorized\" use of their trademark, so they sent reports independently to our host and registrar claiming there was \"fraud and phishing\" going on, likely to cause escalation instead of doing the expected DMCA/cease-and-desist. Because of this, I honestly think they're the malicious actor in all of this. Their website, if you care: https://www.brandshield.com/\nAbout 5 or 6 days ago, I received these reports on our host (Linode) and from our registrar (iwantmyname). I expressed my disappointment in my responses to both of them but told them I had removed the page and disabled the account. Linode confirmed and closed the case. iwantmyname never responded. This evening, I got a downtime alert, and while debugging, I noticed that the domain status had been set to \"serverHold\" on iwantmyname's domain panel. We have no other abuse reports from iwantmyname other than this one. I'm assuming no one on their end \"closed\" the ticket, so it went into an automatic system to disable the domain after some number of days.\nI've been trying to get in touch with them via their abuse and support emails, but no response likely due to the time of day, so I decided to \"escalate\" the issue myself on social media.",
          "link": "https://news.ycombinator.com/item?id=42364033",
          "publishedOn": "2024-12-09T08:19:52.000Z",
          "wordCount": 13182,
          "title": "New comment by leafo in \"Itch.io Taken Down by Funko\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42363906",
          "author": "KingOfCoders",
          "description": "\"Phishing report to our registrar, iwantmyname, who ignored our response and just disabled the domain\"\nOne registrar off the list of registrars you wanna use.",
          "link": "https://news.ycombinator.com/item?id=42363906",
          "publishedOn": "2024-12-09T07:55:44.000Z",
          "wordCount": null,
          "title": "New comment by KingOfCoders in \"Itch.io Taken Down by Funko\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42362565",
          "author": "CodeHorizon",
          "description": "Bring back Pat.\nWas Pat perfect, no. But Pat acknowledged Intel’s problems - something Otellini, Krzanich, and Swan never did. These CEOs, all non-technical, focused on dividends, buybacks, and next-quarter results while Intel fell behind in advanced nodes and innovation.\nGelsinger inherited a disaster: 10nm delays, TSMC pulling ahead, and no GPU strategy. He had the courage to cut buybacks and slashed dividends. He poured billions into fabs in Arizona, Ohio, Germany, and Ireland. He delivered Intel 18A, powered on first silicon, released PDK 1.0 for Microsoft, and secured Microsoft and Amazon as customers. There were even rumors Apple might join.\nContrast this with Nadella at Microsoft back in 2014. He didn’t reboot the company by tearing everything down. Instead, he built on Ballmer-era wins like Azure, Office 365 while shifting Microsoft’s focus to the cloud. Gelsinger had to start from scratch in many ways, tackling years of neglect while facing harsher challenges.\nYes, Intel’s stock dropped $150 billion, but Gelsinger was upfront - it wouldn’t turn around before 2025. He was trained by Gordon Moore and Andy Grove, and while some saw him as arrogant, that confidence came from decades of technical leadership.\nThe real issue? The board. Full of people like Boeing execs. They don’t get engineering. Trusting them to fix Intel is like hoping a plane door won’t pop open mid-flight. They’re the ones who should be replaced.",
          "link": "https://news.ycombinator.com/item?id=42362565",
          "publishedOn": "2024-12-09T02:27:12.000Z",
          "wordCount": 9538,
          "title": "New comment by CodeHorizon in \"Pat Gelsinger was wrong for Intel\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42360161",
          "author": "jsheard",
          "description": "Can we do gambling ads next? We banned tobacco ads and then seemingly forgot the lesson that it's actually bad to let advertisers shove addictive and self-destructive products in the publics face, including to former addicts at risk of relapse.",
          "link": "https://news.ycombinator.com/item?id=42360161",
          "publishedOn": "2024-12-08T20:32:54.000Z",
          "wordCount": null,
          "title": "New comment by jsheard in \"UK bans daytime TV ads for cereals, muffins and burgers\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42342724",
          "author": "tobyjsullivan",
          "description": "The fact that the search works impressed me more than anything. Of course, like every great magic trick, it seems so simple once it is explained.\nFor the curious, here's the linked blog post describing how the project works: https://eieio.games/blog/writing-down-every-uuid/\nEdit to add: I'd only tried searching for an exact UUID when I wrote this comment. I didn't realize it supports full text search! Now I'm even more impressed.",
          "link": "https://news.ycombinator.com/item?id=42342724",
          "publishedOn": "2024-12-06T18:39:31.000Z",
          "wordCount": null,
          "title": "New comment by tobyjsullivan in \"Every V4 UUID\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42342712",
          "author": "croes",
          "description": "Seems like some hacker leaked all UUIDs.\nCheck if your UUIDs are part of the leak.",
          "link": "https://news.ycombinator.com/item?id=42342712",
          "publishedOn": "2024-12-06T18:38:58.000Z",
          "wordCount": null,
          "title": "New comment by croes in \"Every V4 UUID\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/From-South-Africa-to-Syria-rising-perils-for-Palestine-solidarity",
          "author": "Patrick Bond",
          "description": "The sudden regime overthrow in Syria and the long-delayed opportunity to confront the legacy of Bashar al-Assad's tyranny are either being celebrated or condemned, as explored below, but they come at a time that poses profound problems for solidarity with Palestine. \nEnglish\n\n/ \nSouth Africa, \nPalestine, \nIsrael, \nSyria",
          "link": "https://www.cadtm.org/From-South-Africa-to-Syria-rising-perils-for-Palestine-solidarity",
          "publishedOn": "2024-12-10T17:52:57.000Z",
          "wordCount": 5320,
          "title": "From South Africa to Syria, rising perils for Palestine solidarity",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1200xH630/3d59d743c4dde7886cbad1933f4fd2-6e2a3.jpg"
        },
        {
          "id": "https://www.cadtm.org/The-International-Monetary-Fund-an-ABC-2-0",
          "author": "Eric Toussaint",
          "description": "The World Bank and the IMF are 80 years old. 80 years of financial neo-colonialism and the imposition of austerity policies in the name of debt repayment. 80 years is enough! The Bretton Woods institutions must be abolished and replaced by democratic institutions serving an ecological, feminist and anti-racist bifurcation. To mark these 80 years, we are republishing a series of articles every Wednesday, looking in detail at the history and damage caused by these two institutions. \nDebt\n\n/ \nIMF, \nWorld Bank, \nFinance against people, \n80 ans BM FMI EN",
          "link": "https://www.cadtm.org/The-International-Monetary-Fund-an-ABC-2-0",
          "publishedOn": "2024-12-10T09:34:51.000Z",
          "wordCount": 6015,
          "title": "The International Monetary Fund: an ABC 2.0",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/9d0e386e5fe9c7f0d7ee69f85fc94a-6e5f0.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=8952",
          "author": "disassociated.com",
          "description": "We’re twelve days out from the big one, and high in the silly season, as the brevity of recent posts here may allude to. Otherwise, the major highlight has to be the annual announcement of the PANTONE colour of the year. As I wrote two years ago, this was a big deal during my web […]",
          "link": "https://disassociated.com/mocha-mousse-17-1230-pantone-colour-year-2025/",
          "publishedOn": "2024-12-12T20:00:30.000Z",
          "wordCount": 332,
          "title": "Mocha Mousse 17-1230 selected as the PANTONE colour of year 2025",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8946",
          "author": "disassociated.com",
          "description": "I’m not sure if this horror re-imagining, trailer, of the Y2K “bug” will have a cinematic run in Australia, or is going straight to streaming. Two high school nobodies make the decision to crash the last major celebration before the new millennium on New Year’s Eve 1999. The night becomes even crazier than they could […]",
          "link": "https://disassociated.com/film-y2k-kyle-mooney-y2k-bug-strikes-back/",
          "publishedOn": "2024-12-11T20:00:00.000Z",
          "wordCount": 533,
          "title": "Y2K, a film by Kyle Mooney, the Y2K bug seriously strikes back",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8944",
          "author": "disassociated.com",
          "description": "Henrik Karlsson worked for several years at an art gallery in Denmark. The work seems more varied, and entrepreneurial, than some of us might think: Ie. you don’t say, “This is my job and that thing is outside my area”—no, if the value you are trying to promote requires you to go outside your role […]",
          "link": "https://disassociated.com/learn-about-work-working-art-gallery/",
          "publishedOn": "2024-12-10T20:00:56.000Z",
          "wordCount": 192,
          "title": "You can learn a lot about work when working at an art gallery",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8939",
          "author": "disassociated.com",
          "description": "The details are pretty scant at the moment. So far the flu-like disease killed close to one-hundred-and-fifty people in the south west of the Democratic Republic of the Congo, in November. Infected people had flu-like symptoms including high fever and severe headaches, Remy Saki, the deputy governor of Kwango province, and Apollinaire Yumba, the provincial […]",
          "link": "https://disassociated.com/mysterious-deadly-flu-like-disease-outbreak-in-congo/",
          "publishedOn": "2024-12-09T20:00:26.000Z",
          "wordCount": 196,
          "title": "Mysterious, deadly, flu-like disease outbreak in Congo",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8929",
          "author": "disassociated.com",
          "description": "At some point in 2025, Australians under the age of sixteen will no longer be able to operate social media accounts. I thought up to high school age, about thirteen, seemed sensible, but lawmakers decided otherwise. Anyway, I imagine the new regulations will require, eventually, those of us sixteen or over, to verify, or certify, […]",
          "link": "https://disassociated.com/will-australian-social-media-users-need-id-prove-age/",
          "publishedOn": "2024-12-08T20:00:36.000Z",
          "wordCount": 484,
          "title": "Will Australian social media users need ID to prove their age? Maybe not",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20241210",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20241210",
          "publishedOn": "2024-12-10T22:00:00.000Z",
          "wordCount": 422,
          "title": "Week Ending December 8, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/the-roads-to-damascus",
          "author": null,
          "description": "Assad’s fall from power.",
          "link": "https://newleftreview.org/sidecar/posts/the-roads-to-damascus",
          "publishedOn": "2024-12-09T19:05:25.000Z",
          "wordCount": 1876,
          "title": "Tariq Ali: &ldquo;The Roads to Damascus&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/12/9aaaeafd-7cab-486a-902e-935b9c1a97ee_-_7027d49f-c858-4577-a7a7-febd695a040f-cover-ezgif.com-webp-to-jpg-converter.jpg"
        }
      ]
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    },
    {
      "title": "News Minimalist",
      "feedUrl": "https://rss.beehiiv.com/feeds/4aF2pGVAEN.xml",
      "siteUrl": "https://newsletter.newsminimalist.com/",
      "articles": [
        {
          "id": "https://newsletter.newsminimalist.com/p/china-deploys-historic-naval-fleet-near-taiwan-2-more-stories",
          "author": null,
          "description": "Global advertising revenue is projected to exceed $1 trillion; garment workers face increased heat risks; Taiwan raises alert over China's largest naval fleet deployment.",
          "link": "https://newsletter.newsminimalist.com/p/china-deploys-historic-naval-fleet-near-taiwan-2-more-stories",
          "publishedOn": "2024-12-10T18:00:55.000Z",
          "wordCount": 7120,
          "title": "China deploys historic naval fleet near Taiwan + 2 more stories",
          "imageUrl": "https://beehiiv-images-production.s3.amazonaws.com/uploads/publication/thumbnail/d0318cb6-0493-4e34-b055-76456e6c0f76/landscape_template__3_.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}