{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "86d9ddca83c600aa88d09a9cd01d58ac64149314",
          "author": "Danilo Poccia",
          "description": "Generate photorealistic images with exceptional detail. Enhance visuals effortlessly across industries with improved multi-subject prompts, stunning image quality, and impeccable typography.",
          "link": "https://aws.amazon.com/blogs/aws/stability-ais-best-image-generating-models-now-in-amazon-bedrock/",
          "publishedOn": "2024-09-04T17:01:57.000Z",
          "wordCount": 2262,
          "title": "Stability AI’s best image generating models now in Amazon Bedrock",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/09/04/StabilityAI-models-news-blog.png"
        },
        {
          "id": "31662511be8cd6f35550c899cca6ff0926eba21e",
          "author": "Taylor Jacobsen",
          "description": "The AWS Heroes program recognizes outstanding individuals who are making meaningful contributions within the AWS community. These technical experts generously share their insights, best practices, and innovative solutions to help others create efficiencies and build faster on AWS. Heroes are thought leaders who have demonstrated a commitment to empowering the broader AWS community through their […]",
          "link": "https://aws.amazon.com/blogs/aws/the-latest-aws-heroes-have-arrived-september-2024/",
          "publishedOn": "2024-09-04T16:36:23.000Z",
          "wordCount": 1502,
          "title": "The latest AWS Heroes have arrived – September 2024",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/10/AWS-Heroes-program_RGB_Social-blog.png"
        },
        {
          "id": "148be78c8c914b1e3dc764e8933faaf4e4bf8aad",
          "author": "Channy Yun (윤석찬)",
          "description": "Amazon Web Services (AWS) AI code assistant Amazon Q Developer named a Leader in Gartner's first Magic Quadrant for its Ability to Execute and Completeness of Vision, driving innovation across the software development lifecycle with enterprise-grade controls.",
          "link": "https://aws.amazon.com/blogs/aws/aws-named-as-a-leader-in-the-first-gartner-magic-quadrant-for-ai-code-assistants/",
          "publishedOn": "2024-09-03T21:48:08.000Z",
          "wordCount": 1655,
          "title": "AWS named as a Leader in the first Gartner Magic Quadrant for AI Code Assistants",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/09/03/Blog_AI_ML_Image2.png"
        },
        {
          "id": "4fb73ba1739dd770b73cc79b69696086e450955f",
          "author": "Esra Kayabali",
          "description": "With the arrival of September, AWS re:Invent 2024 is now 3 months away and I am very excited for the new upcoming services and announcements at the conference. I remember attending re:Invent 2019, just before the COVID-19 pandemic. It was the biggest in-person re:Invent with 60,000+ attendees and it was my second one. It was […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-aws-parallel-computing-service-amazon-ec2-status-checks-and-more-september-2-2024/",
          "publishedOn": "2024-09-02T17:42:42.000Z",
          "wordCount": 2169,
          "title": "AWS Weekly Roundup: AWS Parallel Computing Service, Amazon EC2 status checks, and more (September 2, 2024)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/09/02/AWS-WIR-default-AWSNEWS-2068.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": []
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps & Developer Productivity Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": [
        {
          "id": "3dabf76f52f09592f27882dc6288dd0f2a88080e",
          "author": "Aaron Sempf",
          "description": "Amazon Q Developer is a generative artificial intelligence (AI) powered conversational assistant that can help you understand, build, extend, and operate AWS applications. You can ask questions about AWS architecture, your AWS resources, best practices, documentation, support, and more. With Amazon Q Developer in your IDE, you can write a comment in natural language that […]",
          "link": "https://aws.amazon.com/blogs/devops/amazon-q-developer-code-challenge/",
          "publishedOn": "2024-09-05T11:32:18.000Z",
          "wordCount": 1918,
          "title": "Amazon Q Developer Code Challenge",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/09/05/Amazon-Q-Developer-Code-Challenge-1120x630.png"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": [
        {
          "id": "https://engineering.atspotify.com/?p=7199",
          "author": "Spotify Engineering",
          "description": "On Spotify’s Analytics Platform, we’re dedicated to building products that empower data practitioners to discover, analyze, and share insights — [...]\nThe post Are You a Dalia? How We Created Data Science Personas for Spotify’s Analytics Platform appeared first on Spotify Engineering.",
          "link": "https://engineering.atspotify.com/2024/09/are-you-a-dalia-how-we-created-data-science-personas-for-spotifys-analytics-platform/",
          "publishedOn": "2024-09-05T19:15:45.000Z",
          "wordCount": 1941,
          "title": "Are You a Dalia? How We Created Data Science Personas for Spotify’s Analytics Platform",
          "imageUrl": "https://storage.googleapis.com/production-eng/1/2024/09/EN223_Dalia-Persona_BlogPost_1200-x-630.png"
        }
      ]
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "ee6078e423b3fd64703d6132396bdc3f58b8887c",
          "author": "Tsahi Duek",
          "description": "Cloud native technologies empower organizations to build and run scalable applications in modern, dynamic environments. Among Cloud Native patterns, Containers, and Kubernetes are mainstream across multiple businesses. According to the Cloud Native Computing Foundation Annual Survey of 2022, 44% of respondents are already using containers for nearly all applications and business segments, and another 35% say containers are […]",
          "link": "https://aws.amazon.com/blogs/containers/optimize-log-management-for-amazon-eks-with-amazon-fsx-for-netapp-ontap/",
          "publishedOn": "2024-09-03T23:01:10.000Z",
          "wordCount": 3474,
          "title": "How to optimize log management for Amazon EKS with Amazon FSx for NetApp ONTAP",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/09/03/Featured-images-for-Containers-Blog-6-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=332653",
          "author": "Arun Gupta",
          "description": "It’s not that the Democrats did not show any concern about Palestinians at the Democratic National Convention. They showed extraordinary concern given the lengths they went to erase them from Kamala’s coronation.\nAfterwards the Democrats seemed ecstatic that a little genocide didn’t disrupt their joy. But there were still plenty of protests and signs of divisions that could pose problems with Harris’s path to election especially as student protesters look to reinvigorate the movement. More\nThe post Why is Kamala Harris Erasing Palestinians? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/why-is-kamala-erasing-palestinians/",
          "publishedOn": "2024-09-06T06:01:29.000Z",
          "wordCount": null,
          "title": "Why is Kamala Harris Erasing Palestinians?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332845",
          "author": "Melvin Goodman",
          "description": "The horrors of the Second World War sparked the creation of international organizations and international laws to ensure that such horrors would never occur again.  The center piece of these international bodies was the United Nations and its regional and functional agencies that were designed to provide international guardrails to limit the use of force.  The National Security Act of 1947 was designed in part to make sure that U.S. administrations played an active role in managing and even transforming the international community. More\nThe post The Disappearance of International Law appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/the-disappearance-of-international-law/",
          "publishedOn": "2024-09-06T06:00:35.000Z",
          "wordCount": null,
          "title": "The Disappearance of International Law",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332780",
          "author": "Jeffrey St. Clair",
          "description": "A country that tolerates the routine shootings of its own school children as the cost of doing business in our weird notion of a \"free society\" is unlikely to feel any empathy for Palestinian children killed by the weapons we sell Israel. Violence is our chief export; indifference to the bloodshed is our national characteristic. More\nThe post Roaming Charges: Ain’t That America, Something to See, Baby? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/roaming-charges-116/",
          "publishedOn": "2024-09-06T05:59:54.000Z",
          "wordCount": null,
          "title": "Roaming Charges: Ain’t That America, Something to See, Baby?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332759",
          "author": "Jamal Kanj",
          "description": "September 1, 2024, twenty-seven Palestinian families woke up to mourn their loved ones, including at least 11 who were killed at a “safe” shelter, Safad School in Zaitune neighborhood east of Gaza city. On the same day, the Israeli occupying army recovered the bodies of six Israeli captives, who died as a direct or indirect result of an Israeli incursion into a tunnel in Rafah. More\nThe post Why Would Six Israelis Receive More Attention Than Tens of Thousands of Murdered Palestinians appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/why-would-six-israelis-receive-more-attention-than-tens-of-thousands-of-murdered-palestinians/",
          "publishedOn": "2024-09-06T05:56:15.000Z",
          "wordCount": null,
          "title": "Why Would Six Israelis Receive More Attention Than Tens of Thousands of Murdered Palestinians",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332688",
          "author": "Farrah Hassen",
          "description": "This summer is on track to being the hottest on record, with 2024 very likely to be the hottest year. Fueled by global warming, extreme heat is the leading weather-related cause of death in the United States. It claims the lives of around 2,000 workers and injures another 170,000 in heat stress-related incidents each year,  More\nThe post Workers Need Protection From Record-Breaking Heat appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/workers-need-protection-from-record-breaking-heat/",
          "publishedOn": "2024-09-06T05:55:44.000Z",
          "wordCount": null,
          "title": "Workers Need Protection From Record-Breaking Heat",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332800",
          "author": "Binoy Kampmark",
          "description": "The government of Sir Keir Starmer, despite remaining glued to a foreign policy friendly and accommodating to Israel, has found the strain a bit much of late.  While galloping to victory in the July elections, leaving the British Labour Party a heaving majority, a certain ill-temper could be found among the ranks on his attitudes regarding  More\nThe post Craven Tokenism: The UK Suspension of Arms Export Licenses to Israel appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/craven-tokenism-the-uk-suspension-of-arms-export-licenses-to-israel/",
          "publishedOn": "2024-09-06T05:55:17.000Z",
          "wordCount": null,
          "title": "Craven Tokenism: The UK Suspension of Arms Export Licenses to Israel",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332740",
          "author": "Robert Hunziker",
          "description": "It was only 3 years ago when a group of distinguished climate scientists led by Erin C. Pettit (Oregon State University) said Thwaites Eastern Ice Shelf of the Thwaites Glacier/Antarctica, aka: Doomsday Glacier, could collapse “within as little as 5 years.” (Source: C34A-07 Collapse of Thwaites Eastern Ice Shelf by intersecting fractures, American Geophysical Union,  More\nThe post Humans Rescue Doomsday Glacier? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/humans-rescue-doomsday-glacier/",
          "publishedOn": "2024-09-06T05:54:55.000Z",
          "wordCount": null,
          "title": "Humans Rescue Doomsday Glacier?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332685",
          "author": "Mark Muhich",
          "description": "The U.S. Nuclear Employment Guideline Report, according to Department of Defense websites, appears to be a detailed target menu in the event the president orders a nuclear attack. It is required of the executive by Congress, Section 491, when the president alters the nuclear weapons strategy of the U.S. As alluded to by top-ranking administration  More\nThe post Nuclear Roulette: The U.S. Nuclear Employment Guideline appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/nuclear-roulette-the-u-s-nuclear-employment-guideline/",
          "publishedOn": "2024-09-06T05:54:46.000Z",
          "wordCount": null,
          "title": "Nuclear Roulette: The U.S. Nuclear Employment Guideline",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332783",
          "author": "Howard Lisnoff",
          "description": "When the subway riders boarded the 1 train at 116th Street on Manhattan’s West Side, it was apparent that many riders on this Labor Day were students. The subway car wasn’t particularly crowded and one of the people I guessed was a student sat down next to me. We began talking about the difference in  More\nThe post A Conversation With a Columbia University Undergraduate appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/a-conversation-with-a-columbia-university-undergraduate/",
          "publishedOn": "2024-09-06T05:54:26.000Z",
          "wordCount": null,
          "title": "A Conversation With a Columbia University Undergraduate",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332794",
          "author": "Algernon Austin and Dedrick Asante-Muhammad",
          "description": "As the country moves rapidly toward the 2024 elections, Black Americans are experiencing the best economic conditions they’ve had in generations. Record low unemployment rates, record low poverty rates, and record high levels of income and wealth paint a picture of Black prosperity. Yet African Americans remain mired in great economic insecurity, reflected in their  More\nThe post The Paradox of Progress for Black Americans appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/the-paradox-of-progress-for-black-americans/",
          "publishedOn": "2024-09-06T05:54:02.000Z",
          "wordCount": null,
          "title": "The Paradox of Progress for Black Americans",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332704",
          "author": "Joseph Natoli",
          "description": "Anyone who thinks my story is anywhere near over is sadly mistaken. ― Donald Trump Caught as we are at a deeply polarized moment, so intensely consuming, that it’s hard to recognize that, to quote Ecclesiastes, time and chance happens to us all. In other words, things will move on. Or just move. The curtain  More\nThe post Final Act appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/final-act/",
          "publishedOn": "2024-09-06T05:53:32.000Z",
          "wordCount": null,
          "title": "Final Act",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332627",
          "author": "Daniel Warner",
          "description": "One of the most underestimated differences in the Kamala Harris vs Donald Trump presidential competition is the question of time. Yes Donald Trump was born in 1946 and Kamala Harris in 1964, so there is an obvious generation gap between them. But beyond the obvious question of age and generations is the larger question of  More\nThe post Harris vs Trump and the Time Competition appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/harris-vs-trump-and-the-time-competition/",
          "publishedOn": "2024-09-06T05:53:20.000Z",
          "wordCount": null,
          "title": "Harris vs Trump and the Time Competition",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332788",
          "author": "Emily Guerra",
          "description": "I’ve always felt that working in customer-facing jobs is my calling. I’m passionate about making people feel comfortable when they enter a business, be it a retail store or a restaurant. But it was hard to keep that passion when I worked at Dollar General. Like workers at many other big retailers, we were so  More\nThe post Low Wage Work Isn’t Just Bad for Employees — It Hurts Customers, Too  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/low-wage-work-isnt-just-bad-for-employees-it-hurts-customers-too/",
          "publishedOn": "2024-09-06T05:52:26.000Z",
          "wordCount": null,
          "title": "Low Wage Work Isn’t Just Bad for Employees — It Hurts Customers, Too",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332756",
          "author": "Tom Engelhardt",
          "description": "Yes, long ago, I dreamt of being a novelist. Two ancient manuscripts packed away in a distant corner of my closet attest to that (ir)reality, as does one novel focused on the world of publishing (in which I’d been an editor) that made it into print, even if it was barely noticed. Still, from time to  More\nThe post Trumptopia and Beyond appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/trumptopia-and-beyond/",
          "publishedOn": "2024-09-06T05:50:23.000Z",
          "wordCount": null,
          "title": "Trumptopia and Beyond",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332644",
          "author": "Marcy Winograd",
          "description": "In Norman Solomon’s new Afterword in the paperback edition of his book War Made Invisible: How America Hides the Human Toll of Its Military Machine, the author excoriates the White House for arming a genocide with assistance from a negligent press. Solomon tracks events following Hamas’ killings and kidnappings of Israelis on October 7th, a  More\nThe post Holding the Press and White House Accountable: Solomon’s Afterword on the Gaza War appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/holding-the-press-and-white-house-accountable-solomons-afterword-on-the-gaza-war/",
          "publishedOn": "2024-09-06T05:50:11.000Z",
          "wordCount": null,
          "title": "Holding the Press and White House Accountable: Solomon’s Afterword on the Gaza War",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332631",
          "author": "James Bovard",
          "description": "In a democracy, people automatically become liable for whatever the government inflicts upon them. Many of the most deadly errors of contemporary political thinking stem from the notion that in a democracy the government is the people and vice versa, so there is scant reason to distinguish between the two—or to worry about protecting citizens  More\nThe post Democracy’s Damndest Defamation appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/democracys-damndest-defamation/",
          "publishedOn": "2024-09-06T05:50:07.000Z",
          "wordCount": null,
          "title": "Democracy’s Damndest Defamation",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332777",
          "author": "Esther Afolaranmi and Carter Dillard",
          "description": "The actual cause of the climate crisis is the anthropogenic emission of greenhouse gases into the atmosphere since the start of the industrial revolution. But the proximate cause—the underlying activity that sparked the climate crisis and the intertwined environmental crises—is how we have built society, starting from when humans are born. Despite the threat of the sixth extinction, ecosystem collapse, air and water  More\nThe post Why Children’s Rights Are Critical for Climate Policy and Environmental Activism appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/why-childrens-rights-are-critical-for-climate-policy-and-environmental-activism/",
          "publishedOn": "2024-09-06T05:49:43.000Z",
          "wordCount": null,
          "title": "Why Children’s Rights Are Critical for Climate Policy and Environmental Activism",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332775",
          "author": "Ron Jacobs",
          "description": "The Haitian revolution was the first victorious anti-colonial war in the so-called New World led by those enslaved by the colonizers. The battle engaged against the slavers and their empires was long and bloody. European kings and European republics fought and lost. In doing so, the latter revealed their colonialist and white supremacist similarities to  More\nThe post The Red Hour of Miracles: Aimé Césaire’s And the Dogs Were Silent appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/the-red-hour-of-miracles-aime-cesaires-and-the-dogs-were-silent/",
          "publishedOn": "2024-09-06T05:49:19.000Z",
          "wordCount": null,
          "title": "The Red Hour of Miracles: Aimé Césaire’s And the Dogs Were Silent",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332779",
          "author": "Jan Ritch-Frel and Marjorie Hecht",
          "description": "The release of Determined, a new book by renowned Stanford professor of primate behavior and neuroscience Robert M. Sapolsky, has catapulted him into the middle of an ancient debate: whether humans have free will and agency over their actions. Determined isn’t just a bio-philosophical treatise: It covers the potential benefits that a society that accepts Sapolsky’s thesis of  More\nThe post Are We Better Off Accepting There’s No Free Will? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/are-we-better-off-accepting-theres-no-free-will/",
          "publishedOn": "2024-09-06T05:48:40.000Z",
          "wordCount": null,
          "title": "Are We Better Off Accepting There’s No Free Will?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332738",
          "author": "Paul Street",
          "description": "I mourn the six dead Israeli hostages recently murdered by Hamas before Israeli Defense Forces could claim them as military victories because I strive to be a human being. But it has been revolting to hear and see so much detail in the dominant media about the beauty and humanity of one group of people  More\nThe post From Hiroshima to Genocide in Gaza appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/from-hiroshima-to-genocide-in-gaza/",
          "publishedOn": "2024-09-06T05:48:19.000Z",
          "wordCount": null,
          "title": "From Hiroshima to Genocide in Gaza",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332634",
          "author": "Anthony Petro",
          "description": "The Centers for Disease Control and Prevention first used the term “AIDS” on Sept. 24, 1982, more than a year after the first cases appeared in medical records. Those early years of the crisis were marked by a great deal of confusion over what caused the disease, who it affected and how it spread. But  More\nThe post How HIV/AIDS Got Its Name: Science, Stigma and Religious Language appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/how-hiv-aids-got-its-name-science-stigma-and-religious-language/",
          "publishedOn": "2024-09-06T05:46:22.000Z",
          "wordCount": null,
          "title": "How HIV/AIDS Got Its Name: Science, Stigma and Religious Language",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332797",
          "author": "Eugene Doyle",
          "description": "ASML, a Dutch firm that currently is the world’s only manufacturer of the extreme ultraviolet lithography machines that produce the most advanced chips, is repeatedly getting stiff-armed by the US – intimidated into breaking deals and told not to sell a widening range of goods to China. Back at the start of the year, after a  More\nThe post The US Made the Dutch an Offer They Couldn’t Refuse appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/the-us-made-the-dutch-an-offer-they-couldnt-refuse/",
          "publishedOn": "2024-09-06T05:44:54.000Z",
          "wordCount": null,
          "title": "The US Made the Dutch an Offer They Couldn’t Refuse",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332637",
          "author": "David Carrier",
          "description": "Consider a short list of the defining qualities, the necessary and sufficient conditions of European modernism, in contrast or opposition to old master sacred tradition. Modernism involves secular rather than sacred subjects. Compare Impressionist landscapes with High Renaissance altarpieces. Modernism requires a system in which art is made to be sold in the marketplace rather  More\nThe post The Venetian Birth of Modernism appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/the-venetian-birth-of-modernism/",
          "publishedOn": "2024-09-06T05:44:50.000Z",
          "wordCount": null,
          "title": "The Venetian Birth of Modernism",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332830",
          "author": "Tom Valovic",
          "description": "In November 2020, Common Dreams published my op-ed “Three Questions That Didn’t Get Asked During the Presidential Debates (and Probably Never Will).” The article offered several probing policy questions that (I surmised) would never make it through the corporate media’s screening process. Sure enough, none of those issues were addressed in the widely televised debates in advance of the  More\nThe post Three Important Questions You Won’t Hear Asked in the Presidential Debates appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/three-important-questions-you-wont-hear-asked-in-the-presidential-debates/",
          "publishedOn": "2024-09-06T05:44:46.000Z",
          "wordCount": null,
          "title": "Three Important Questions You Won’t Hear Asked in the Presidential Debates",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332803",
          "author": "Kim C. Domenico",
          "description": "The world pushes you into poetry by withdrawing something, not giving it. – Martin Shaw, Courting the Wild Twin Culture is defined not by what you gained but by what you were prepared to live without.  – Ibid. As many nerve endings as there are in a body, are the messages attempting to issue forth amongst place, animal  More\nThe post Slaying Neoliberalism With ‘Holy Rashness’ and the Slow Build of Character appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/slaying-neoliberalism-with-holy-rashness-and-the-slow-build-of-character/",
          "publishedOn": "2024-09-06T05:43:59.000Z",
          "wordCount": null,
          "title": "Slaying Neoliberalism With ‘Holy Rashness’ and the Slow Build of Character",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332784",
          "author": "Jonah Raskin",
          "description": "The N-word appears sparingly in James, Percival Everett’s 2024 novel that reinvents the escaped slave narrative while it recycles Mark Twain’s The Adventures of Huckleberry Finn, a classic set in the antebellum American South where Black men and Black women, both free and enslaved, were lashed with the word “nigger.” Make no mistake about it, the  More\nThe post The N-Word: Still Troublesome After all These Years appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/the-n-word-still-troublesome-after-all-these-years/",
          "publishedOn": "2024-09-06T05:43:52.000Z",
          "wordCount": null,
          "title": "The N-Word: Still Troublesome After all These Years",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332439",
          "author": "Shameka Parrish-Wright",
          "description": "Our country is at a critical moment when it comes to overdose deaths. The number of people dying from preventable overdose deaths is  higher than ever — we’re losing more than 220 people every single day in this country. At the same time, states have secured more than $55 billion in funding from successful lawsuits  More\nThe post How We Should Spend the Opioid Settlement Funds appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/how-we-should-spend-the-opioid-settlement-funds/",
          "publishedOn": "2024-09-06T05:39:31.000Z",
          "wordCount": null,
          "title": "How We Should Spend the Opioid Settlement Funds",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332844",
          "author": "Richard Schulman",
          "description": "Kipling’s If is heard loudly: Moments become encouragements: I play endlessly with more: I cannot remember when I became a photographer: I merely remember speaking photography: The history of photography may be begins in France: Paris at one time was the heart of all dreams sometimes seen and always heard: Photography’s romance transforms not a generation but  More\nThe post Architecture of Cities: Paris and More appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/06/architecture-of-cities-paris-and-more/",
          "publishedOn": "2024-09-06T05:35:09.000Z",
          "wordCount": null,
          "title": "Architecture of Cities: Paris and More",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332696",
          "author": "Yoav Litvin",
          "description": "[caption id=\"attachment_332697\" align=\"alignnone\" width=\"680\"] Image by Emad El Byed.[/caption]\nThe most significant recent escalation in the ongoing Zionist real estate project, enabled by apartheid and genocide of the Palestinian people, occurred on October 7th, 2023, when Hamas fighters broke through Gaza’s prison fence, carrying out a bloody incursion on Israeli military installations and border towns. Since, the Israel “Defense” Forces (IDF) have engaged in the offensive flattening of Gaza, destruction of its infrastructure, extensive land seizure and elimination, torture and expulsion of its Palestinian population. More\nThe post From ‘Defense’ to Destruction: The Evolution of Zionist Aggression appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/05/from-defense-to-destruction-the-evolution-of-zionist-aggression/",
          "publishedOn": "2024-09-05T06:07:03.000Z",
          "wordCount": null,
          "title": "From ‘Defense’ to Destruction: The Evolution of Zionist Aggression",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332630",
          "author": "Ramzy Baroud",
          "description": "The Israeli war on Gaza has become a war on Palestinian children. This was as true on October 7 as it is today. More\nThe post War on Children – Gaza Kids Are Unvaccinated, Hungry and Orphaned  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/05/war-on-children-gaza-kids-are-unvaccinated-hungry-and-orphaned/",
          "publishedOn": "2024-09-05T06:00:36.000Z",
          "wordCount": null,
          "title": "War on Children – Gaza Kids Are Unvaccinated, Hungry and Orphaned",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": [
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=31531",
          "author": "Jaison R. Abel, Richard Deitz, Natalia Emanuel, and Benjamin Hyman",
          "description": "The rapid rise in Artificial Intelligence (AI) has the potential to dramatically change the labor market, and indeed possibly even the nature of work itself. However, how firms are adjusting their workforces to accommodate this emerging technology is not yet clear. Our August regional business surveys asked manufacturing and service firms special topical questions about their use of AI, and how it is changing their workforces. Most firms that report expected AI use in the next six months plan to retrain their workforces, with far fewer reporting adjustments to planned headcounts.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/09/ai-and-the-labor-market-will-firms-hire-fire-or-retrain/",
          "publishedOn": "2024-09-04T12:30:00.000Z",
          "wordCount": 4340,
          "title": "AI and the Labor Market: Will Firms Hire, Fire, or Retrain?",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/08/LSE_2024_artificial-intelligence_hyman_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=31494",
          "author": "Marco Del Negro",
          "description": "Economic surveys are very popular these days and for a good reason. They tell us how the folks being surveyed—professional forecasters, households, firm managers—feel about the economy. So, for instance, the New York Fed’s Survey of Consumer Expectations (SCE) website displays an inflation uncertainty measure that tells us households are more uncertain about inflation than they were pre-COVID, but a bit less than they were a few months ago. The Philadelphia Fed’s Survey of Professional Forecasters (SPF) tells us that forecasters believed last May that there was a lower risk of negative 2024 real GDP growth than there was last February. The question addressed in this post is: Does this information actually have any predictive content? Specifically, I will focus on the SPF and ask: When professional forecasters indicate that their uncertainty about future output or inflation is higher, does that mean that output or inflation is actually becoming more uncertain, in the sense that the SPF will have a harder time predicting these variables?",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/09/can-professional-forecasters-predict-uncertain-times/",
          "publishedOn": "2024-09-04T11:00:00.000Z",
          "wordCount": 4119,
          "title": "Can Professional Forecasters Predict Uncertain Times?",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/08/LSE_2024_forecasting-uncertainty_delnegro_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=31528",
          "author": "Marco Del Negro",
          "description": "The post-COVID years have not been kind to professional forecasters, whether from the private sector or policy institutions: their forecast errors for both output growth and inflation have increased dramatically relative to pre-COVID (see Figure 1 in this paper). In this two-post series we ask: First, are forecasters aware of their own fallibility? That is, when they provide measures of the uncertainty around their forecasts, are such measures on average in line with the size of the prediction errors they make? Second, can forecasters predict uncertain times? That is, does their own assessment of uncertainty change on par with changes in their forecasting ability? As we will see, the answer to both questions sheds light of whether forecasters are rational. And the answer to both questions is “no” for horizons longer than one year but is perhaps surprisingly “yes” for shorter-run forecasts.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/09/are-professional-forecasters-overconfident/",
          "publishedOn": "2024-09-03T11:00:00.000Z",
          "wordCount": 4681,
          "title": "Are Professional Forecasters Overconfident?",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/08/LSE_2024_overconfidence_delnegro_460.jpg"
        }
      ]
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45582",
          "author": "deanbaker1",
          "description": "from Dean Baker In the last-half century, productivity has outpaced the growth of real compensation for the median worker by more than 40 percent. This means that if workers’ pay had kept pace with productivity, as it did in the three decades after World War II, it would be roughly 40 percent higher than it is today. […]",
          "link": "https://rwer.wordpress.com/2024/09/03/diverting-class-warfare-into-generational-warfare/",
          "publishedOn": "2024-09-03T15:13:46.000Z",
          "wordCount": 4392,
          "title": "Diverting class warfare into generational warfare",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=278037",
          "author": "Lambert Strether",
          "description": "Our joyful daily links",
          "link": "https://www.nakedcapitalism.com/2024/09/links-9-6-2024.html",
          "publishedOn": "2024-09-06T10:58:12.000Z",
          "wordCount": 5578,
          "title": "Links 9/6/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/bibi_map.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277927",
          "author": "Nick Corbishley",
          "description": "\"Criminal groups are migrating from physical to virtual crimes because it is a better, more lucrative and less risky business.\"",
          "link": "https://www.nakedcapitalism.com/2024/09/first-sweden-now-brazil-digital-crime-is-exploding-in-the-worlds-most-cashless-economies.html",
          "publishedOn": "2024-09-06T10:45:04.000Z",
          "wordCount": 5112,
          "title": "First Sweden, Now Brazil: Digital Crime is Exploding in Two of the World’s Most Cashless Economies",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=278029",
          "author": "Yves Smith",
          "description": "The US ceding its once-dominant position in rare earths comes back to bite, as China uses rare earths to retaliate against US sanctions.",
          "link": "https://www.nakedcapitalism.com/2024/09/chinas-rare-earth-restrictions-shake-up-global-markets.html",
          "publishedOn": "2024-09-06T06:52:02.000Z",
          "wordCount": 4771,
          "title": "China’s Rare Earth Restrictions Shake Up Global Markets",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/00-rare-earths.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277969",
          "author": "Yves Smith",
          "description": "Not only do most people not want to die for questionable causes like the US empire, they don't want to kill for them either.",
          "link": "https://www.nakedcapitalism.com/2024/09/who-wants-to-kill-and-die-for-the-american-empire.html",
          "publishedOn": "2024-09-06T05:07:32.000Z",
          "wordCount": 7461,
          "title": "Who Wants to Kill and Die for the American Empire?",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-05-at-10.59.23-PM.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277974",
          "author": "Lambert Strether",
          "description": "A ramble about food (and ultimately kindness).",
          "link": "https://www.nakedcapitalism.com/2024/09/book-review-anthony-bourdains-kitchen-confidential.html",
          "publishedOn": "2024-09-05T20:25:28.000Z",
          "wordCount": 6642,
          "title": "Book Review: Anthony Bourdain’s “Kitchen Confidential”",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/alouette.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277986",
          "author": "Yves Smith",
          "description": "Kudos! We are clipping along at a healthy pace towards meeting our fundraiser goals. Now on to our second, supporting the comments section.",
          "link": "https://www.nakedcapitalism.com/2024/09/hooray-met-first-goal-quickly-now-on-to-the-second-supporting-the-commentariat.html",
          "publishedOn": "2024-09-05T18:02:59.000Z",
          "wordCount": 4227,
          "title": "Hooray! Met First Goal Quickly, Now on to the Second: Supporting the Commentariat",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277977",
          "author": "Lambert Strether",
          "description": "Today's Water Cooler: Politics, syndemics; Lichtman opines: It's Kamala! RussiaGate II; Commercial real estate woes; Keith Haring ~",
          "link": "https://www.nakedcapitalism.com/2024/09/200pm-water-cooler-9-5-2024.html",
          "publishedOn": "2024-09-05T18:00:19.000Z",
          "wordCount": 15093,
          "title": "2:00PM Water Cooler 9/5/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/rcp_2024-08-30.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277932",
          "author": "Yves Smith",
          "description": "Support Naked Capitalism for its focus on details and substance, and its fearlessness.",
          "link": "https://www.nakedcapitalism.com/2024/09/matt-stoller-naked-capitalism-a-lighthouse-for-our-morality-and-community-to-be-reckoned-with.html",
          "publishedOn": "2024-09-05T15:00:47.000Z",
          "wordCount": 3583,
          "title": "Matt Stoller: Naked Capitalism  – A Lighthouse for Our Morality and a Community to Be Reckoned With",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277953",
          "author": "Lambert Strether",
          "description": "Fewer quits and historically low layoffs & discharges mean fewer job openings, and less hiring to fill them. The massive pandemic churn slowed. But that’s only part of it.",
          "link": "https://www.nakedcapitalism.com/2024/09/is-the-labor-market-normalizing-what-even-is-normal.html",
          "publishedOn": "2024-09-05T13:55:14.000Z",
          "wordCount": 4477,
          "title": "Is the Labor Market “Normalizing?” What Even Is “Normal?”",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/US-Jolts-2024-09-03-openings-SA-NSA.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277943",
          "author": "Lambert Strether",
          "description": "Our unregulated daily links",
          "link": "https://www.nakedcapitalism.com/2024/09/links-9-5-2024.html",
          "publishedOn": "2024-09-05T10:58:46.000Z",
          "wordCount": 20512,
          "title": "Links 9/5/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/hummingbird.jpg"
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "2PQ5yUYNh250JZfC8YuElJ",
          "author": "Ram Sundara Raman",
          "description": "Cloudflare brings visibility to the practice of connection tampering as observed from our global network.",
          "link": "https://blog.cloudflare.com/connection-tampering",
          "publishedOn": "2024-09-05T07:00:00.000Z",
          "wordCount": 5276,
          "title": "A global assessment of third-party connection tampering",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7qfmk2t7Ak57tVFtpXUwg1/cc651e21e36471edc85a140c81e84710/A_global_assessment_of_third-party_connection_tampering-OG.png"
        },
        {
          "id": "3SsAGFwmMK2KDYd7THI6Dn",
          "author": "Luke Valenta",
          "description": "New TCP resets and timeouts dataset on Cloudflare Radar surfaces connection tampering, scanning, DoS attacks, and more.",
          "link": "https://blog.cloudflare.com/tcp-resets-timeouts",
          "publishedOn": "2024-09-05T07:00:00.000Z",
          "wordCount": 5131,
          "title": "Bringing insights into TCP resets and timeouts to Cloudflare Radar",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5APY13o9KlTv5iPbO8WMow/d733488213791e449f8cd2806e7d0d28/1622-OG.png"
        },
        {
          "id": "10dR1e1P8WbOojN0JGTPOp",
          "author": "Mike Conlow",
          "description": "On September 3, 2024, the White House published a report on Internet routing security. We’ll talk about what that means and how you can help.",
          "link": "https://blog.cloudflare.com/white-house-routing-security",
          "publishedOn": "2024-09-02T23:00:00.000Z",
          "wordCount": 3418,
          "title": "Making progress on routing security: the new White House roadmap",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/114uY9j6317ypdHHPhMKHR/27a19c1738472d8c1b0c8970b7f504ba/Making_progress_on_routing_security-_the_new_White_House_roadmap-OG.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": []
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": [
        {
          "id": "https://code.visualstudio.com/updates/v1_93",
          "author": null,
          "description": "Learn what is new in the Visual Studio Code August 2024 Release (1.93)\nRead the full article",
          "link": "https://code.visualstudio.com/updates/v1_93",
          "publishedOn": "2024-09-05T17:00:00.000Z",
          "wordCount": 5694,
          "title": "Visual Studio Code August 2024",
          "imageUrl": "https://code.visualstudio.com/assets/updates/1_93/release-highlights.png"
        }
      ]
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=21669",
          "author": null,
          "description": "[...]\nRead More...\nThe post Read Meta’s 2024 Sustainability Report appeared first on Engineering at Meta.",
          "link": "https://sustainability.atmeta.com/2024-sustainability-report/",
          "publishedOn": "2024-09-04T17:04:59.000Z",
          "wordCount": 2114,
          "title": "Read Meta’s 2024 Sustainability Report",
          "imageUrl": "https://sustainability.atmeta.com/wp-content/uploads/2024/08/kayak.png"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=41462100",
          "author": "BadHumans",
          "description": "This entire piece starts from the conclusion that engineers leave because they aren't paid enough then works backwards from there. This is wrong from my experience. Anecdotally, I have never left a job because of money. Sure, I left jobs and got ones that ended up paying more money but the reason I started looking in the first place wasn't money. It was for other reasons that usually included frustrations with management.",
          "link": "https://news.ycombinator.com/item?id=41462100",
          "publishedOn": "2024-09-06T01:44:44.000Z",
          "wordCount": 6154,
          "title": "New comment by BadHumans in \"Why Don't Tech Companies Pay Their Engineers to Stay?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41461808",
          "author": "burningChrome",
          "description": "Early on in my career (I was a late bloomer and already in early 30's) as a developer, I got burnt out pretty bad twice. After the second time and teetering on a third, I knew I had to do something to change what I was doing and how I managed my work load.\nI just focused on getting MY stuff done and that was it. I stopped taking on other's people work. I stopped taking on more work once I got my stuff done. I would do exactly what a Sprint called for. Nothing more, nothing less. If I finished early with my tasks, I would stretch out the time and just tell the scrum master I was close, but not done yet, but always finished on time. I basically just did what was required of me. I wasn't out to impress anybody, I just became \"Mr. Dependable\" on any of the teams I worked on.\nThis was the approach that changed everything.\nNow, some ten years later? I'm never too high or too low. I still do the same thing, I still just do what is asked of me and that's it. 5pm every night? Laptop gets turned off. Friday at 6pm? Laptop is off for the entire weekend. I turn it back on right before my meetings on Monday. Separating my personal life from my work life with a hard delimiter was paramount.\nI found out that if you don't protect your sanity and your own well being, people will take advantage of you and your time and it will never end. Once you break the cycle and get that time back for yourself? You'll make sure you never willingly give it to someone else ever again.\nProtect yourself. Protect your sanity. Once you lose it, like OP said, it's very, very hard to get back.\nI hope this helps someone else struggling to break this cycle.",
          "link": "https://news.ycombinator.com/item?id=41461808",
          "publishedOn": "2024-09-06T00:52:26.000Z",
          "wordCount": 4329,
          "title": "New comment by burningChrome in \"Tell HN: Burnout is bad to your brain, take care\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41454990",
          "author": "dannyobrien",
          "description": "I disagree with this assessment on  many levels, but I think the most important challenge I can make is to the idea that Brewster Kahle is a rogue actor, who in some sense mis-interpreted the mission and strategy of the Internet Archive.\nFor those of you who are just learning that name from this lawsuit, here's his wikipedia page:\nhttps://en.wikipedia.org/wiki/Brewster_Kahle\nKahle founded the Archive in the nineties, in the midst of the fairly determined attempts at that time to either delay or even re-engineer the early Internet to be more respectful of existing intellectual property and decency laws.\nWe inherit a searchable, saveable web, because of the work done then to establish the norm that the Internet itself should exist, and that open digital archives can exist, legally. Many many…",
          "link": "https://news.ycombinator.com/item?id=41454990",
          "publishedOn": "2024-09-05T09:29:48.000Z",
          "wordCount": 5141,
          "title": "New comment by dannyobrien in \"The Internet Archive has lost its appeal in Hachette vs. Internet Archive\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41452097",
          "author": "lolinder",
          "description": "I agree with you about copyright, but the fact is that the IA never had a chance and we knew it years ago.\nThe top comment on HN a week after their launch of the EL is critical [0], right at the moment when HN would be most expected to rally to their defense. By the time the lawsuit was actually starting to take shape most commenters had become very concerned for the fate of the IA [1]. This is on a forum that reliably champions freedom of information, but most of us knew even at the time that what they'd done was extremely unlikely to pass muster.\nThe IA was never going to be hailed as a cultural hero because they stood no chance, and they are too valuable for other, unrelated reasons to make themselves a martyr. This never should have happened under the same legal entity as the web archive.\n[0] https://news.ycombinator.com/item?id=22731472\n[1] https://news.ycombinator.com/item?id=23485182",
          "link": "https://news.ycombinator.com/item?id=41452097",
          "publishedOn": "2024-09-05T00:00:18.000Z",
          "wordCount": 5850,
          "title": "New comment by lolinder in \"The Internet Archive has lost its appeal in Hachette vs. Internet Archive\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41450224",
          "author": "tptacek",
          "description": "The further you take a federal case the more precedent you create. The infinitesimal odds IA seemed to have at winning this case have to be weighed against the precedent they have created that may bind on future controlled digital lending cases with better facts. What IA did here wasn't costless.",
          "link": "https://news.ycombinator.com/item?id=41450224",
          "publishedOn": "2024-09-04T20:12:31.000Z",
          "wordCount": 1389,
          "title": "New comment by tptacek in \"The Internet Archive has lost its appeal in Hachette vs. Internet Archive\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41450153",
          "author": "teruakohatu",
          "description": "> In his many interviews with U.S. media, he portrays the court cases and legal judgements as a crusade against the Internet Archive and all librarians. It's not. It's the logical outcome of one man's seemingly fanatical conviction against the law and the people who work very hard to bring new books into being.\nIf IA had won, IA would be hailed as a cultural hero. They hit and they missed. Claiming Brewster Kahle is against \"the people who work very hard to bring new books into being\" is unfair. The copyright goalposts have moved so far past where they were originally, the people who work very hard can be dead for decades and their works still in copyright, and by the time they are dead for 70 years, the copyright will probably be extended again.",
          "link": "https://news.ycombinator.com/item?id=41450153",
          "publishedOn": "2024-09-04T20:06:53.000Z",
          "wordCount": 21743,
          "title": "New comment by teruakohatu in \"The Internet Archive has lost its appeal in Hachette vs. Internet Archive\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41449965",
          "author": "ilamont",
          "description": "This has been playing out for many years. And it's all because Brewster Kahle decided that an overly broad interpretation of the Internet Archive's mission trumped the rights of authors and publishers, and the laws of the United States.\nWhen IA was asked to stop CDL - many times - he continued. The National Writers Union tried to open a dialogue as early as 2010 but was ignored:\nThe Internet Archive says it would rather talk with writers individually than talk to the NWU or other writers’ organizations. But requests by NWU members to talk to or meet with the Internet Archive have been ignored or rebuffed.\nhttps://nwu.org/nwu-denounces-cdl/\nWhen the requests to abandon CDL turned into demands, Kahle dug in his heels. When the inevitable lawsuits followed, and IA lost, he insisted that he was still in the right and plowed ahead with appeals.\nHe also opened a new front in the court of public opinion. In his blog posts and interviews with U.S. media, Kahle portrays the court cases and legal judgements as a crusade against the Internet Archive and all librarians (see https://blog.archive.org/2023/12/15/brewster-kahle-appeal-st...). It's not. It's the logical outcome of one man's seemingly fanatical conviction against the law and the people who work very hard to bring new books into being.\nIn addition, there has been real collateral damage to the many noble aspects of the Internet Archive. Legal fees and judgements have diverted resources away from the Wayback Machine, the library of public domain works, and other IA programs that provide real value to society. I truly hope the organization can survive.",
          "link": "https://news.ycombinator.com/item?id=41449965",
          "publishedOn": "2024-09-04T19:52:35.000Z",
          "wordCount": 42345,
          "title": "New comment by ilamont in \"The Internet Archive has lost its appeal in Hachette vs. Internet Archive\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41449761",
          "author": "jmward01",
          "description": "I had a discussion with someone recently about how tech is enabling enforcement of laws/policies/etc at a scale never before possible and how that is a bad thing. The problem is that people can't conform perfectly and the tighter we force people to conform the more likely they are to 'break' and disconnect from society. Basically, if 'acceptable' is so narrowly defined that you can't achieve it 100% of the time, why try even a little to conform? In companies there is somewhat of an off-ramp, quit (which isn't always a realistic option obviously), but these enforcement abilities are invading areas that we can't avoid and that is a real problem.",
          "link": "https://news.ycombinator.com/item?id=41449761",
          "publishedOn": "2024-09-04T19:35:02.000Z",
          "wordCount": null,
          "title": "New comment by jmward01 in \"Amazon bans its drivers from moving their own lips too much at work\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41449694",
          "author": "cube2222",
          "description": "To repeat myself from a recent HN thread:\nI've been using Kagi for a while (almost two years now!) and it's been nothing but excellent!\nLenses are very useful (Reddit lens is on every second search), and I personally really like the AI features they are working on.\nThe new more advanced assistant which is able to do searches, which can also be constrained to lenses, and lets you pick an arbitrary model, is excellent, and basically means I don't need a chatgpt/claude subscription, as Kagi covers it very well.\nAll in all, great product which I'm happy to pay for.",
          "link": "https://news.ycombinator.com/item?id=41449694",
          "publishedOn": "2024-09-04T19:29:03.000Z",
          "wordCount": null,
          "title": "New comment by cube2222 in \"Kagi Assistant\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41448341",
          "author": "AnotherGoodName",
          "description": "Intel is trapped. Its debt repayments alone are massive. The poor performance in stock has encouraged 20years of wage stagnation to the point where you can literally earn over 50% more at amd or nvidia or even an startup for equivalent roles so they aren’t hiring the best. Their pay in the Bay Area is double tsmc in taiwan for equivalent roles in raw dollar terms but the ppp differences means your better off working for tsmc in Taiwan than intel in the Bay Area. That’s not a joke. Intel are literally incapable of attracting talent from Taiwan right now.\nThey don’t have the talent they need and the debt trap and poor performance means a lot of push back to the needed doubling of wages to attract that talent. It’s a very hard sell for any exec trying to correct this problem. They sidelined lip bu tan who was one of the advocates for even more layoffs and wage freezes but he’s one of many backwards thinkers they need to remove. It’s going to be difficult to fix their board.\nWithout talent intel has no hope of winning and they can’t get that talent due to poor stock performance for the past 20years leading to executives and shareholders wishing to implement the opposite of what they need right now. In fact they have ongoing layoffs right now. A true downward spiral and the only real hope is for a newcomer to step up.",
          "link": "https://news.ycombinator.com/item?id=41448341",
          "publishedOn": "2024-09-04T17:34:41.000Z",
          "wordCount": null,
          "title": "New comment by AnotherGoodName in \"Intel Honesty\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41446964",
          "author": "semiquaver",
          "description": "FWIW, I’ve worked at many RedHat shops over the years and I’ve never seen one where disabling SELinux wasn’t a normal part of provisioning a server. I haven’t seen the same thing with AppArmor (although I admit I have less visibility into debian systems administration). YMMV but it seems to me that a component which is so inconvenient that it’s normally disabled doesn’t provide much security in the end.",
          "link": "https://news.ycombinator.com/item?id=41446964",
          "publishedOn": "2024-09-04T15:31:41.000Z",
          "wordCount": null,
          "title": "New comment by semiquaver in \"The Insecurity of Debian\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41446120",
          "author": "paxys",
          "description": "> Closest thing we have to a Manhattan Project in the modern era?\nMinus the urgency, scientific process, well-defined goals, target dates, public ownership, accountability...",
          "link": "https://news.ycombinator.com/item?id=41446120",
          "publishedOn": "2024-09-04T14:16:12.000Z",
          "wordCount": null,
          "title": "New comment by paxys in \"Ilya Sutskever's SSI Inc raises $1B\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41446027",
          "author": "paxys",
          "description": "$1B raise, $5B valuation. For a company that is a couple months old and doesn't have a product or even a single line of code in production. Wild.",
          "link": "https://news.ycombinator.com/item?id=41446027",
          "publishedOn": "2024-09-04T14:08:25.000Z",
          "wordCount": null,
          "title": "New comment by paxys in \"Ilya Sutskever's SSI Inc raises $1B\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41445458",
          "author": "laserbeam",
          "description": "I love my remarkable 2. Bought it before \"Connect\" was a thing, so I don't have a subscription. But I cannot recommend it to anyone. There are better alternatives out there and MyDeepGuide (youtube) has reviewed them all better than I ever could.\nThe software is moving too slowly and often in a wrong direction. Especially since they released the keyboard folio most updates were around typing (which is supar on any eink device)... and they generally made my experience as a pen user worse.\nI don't care if the new hardware is awesome, whenever mine breaks I will switch to a competitor.\nEDIT: the reviewer I mention is excited about the device https://www.youtube.com/watch?v=ZkEg8WLeW4Q",
          "link": "https://news.ycombinator.com/item?id=41445458",
          "publishedOn": "2024-09-04T13:22:06.000Z",
          "wordCount": null,
          "title": "New comment by laserbeam in \"ReMarkable Paper Pro\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41442168",
          "author": "teractiveodular",
          "description": "Modified traffic behavior using TM:PE mod to reflect Sri Lankan driving habits:\n- Buses may ignore lane arrows\n- Vehicles may enter blocked junctions\n- Vehicles may do U-turns at junctions\n- 10% of drivers are reckless\n- Vehicles may park on the sides of streets\n- Three wheelers and scooters\nBrilliant!",
          "link": "https://news.ycombinator.com/item?id=41442168",
          "publishedOn": "2024-09-04T05:24:37.000Z",
          "wordCount": null,
          "title": "New comment by teractiveodular in \"We built the city of Colombo in Cities:Skylines\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41441178",
          "author": "JimDabell",
          "description": "This is not how these kinds of things should be designed for the web.\nInstead of putting resources in the root of the web, this is what /.well-known/ was designed for. See RFC 5785:\nhttps://datatracker.ietf.org/doc/html/rfc5785\nInstead of munging URLs to get alternate formats, this is what content negotiation or rel=alternate were designed for.\nI’m not sure making it easier to consume content is something that is needed. I think it might be more useful to define script type=llm that would expose function calling to LLMs embedded in browsers.",
          "link": "https://news.ycombinator.com/item?id=41441178",
          "publishedOn": "2024-09-04T02:06:11.000Z",
          "wordCount": 1465,
          "title": "New comment by JimDabell in \"Llms.txt\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41438346",
          "author": "panarky",
          "description": "It's not just YubiKey.\nNinjaLab: \"All Infineon security microcontrollers (including TPMs) that run the Infineon cryptographic library (as far as we know, any existing version) are vulnerable to the attack.\"\n- Chips in e-passports from the US, China, India, Brazil and numerous European and Asian nations\n- Secure enclaves in Samsung and OnePlus phones\n- Cryptocurrency hardware wallets like Ledger and Trezor\n- SIM cards\n- TPMs in laptops from Lenovo, Dell, and HP\n- EMV chips in credit and debit cards",
          "link": "https://news.ycombinator.com/item?id=41438346",
          "publishedOn": "2024-09-03T19:34:45.000Z",
          "wordCount": 2369,
          "title": "New comment by panarky in \"EUCLEAK Side-Channel Attack on the YubiKey 5 Series\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41437728",
          "author": "edent",
          "description": "As per https://arstechnica.com/security/2024/09/yubikeys-are-vulner...\nAn attacker not only needs your username and password, they also need physical access to your key. They then have to disassemble the device. If they want to give it back to you, they'll need to reassemble it.\nSo not exactly trivial!\nA blob of nail-varnish over a plastic seam might be a useful canary.\nBut this does highlight one weakness of these FIDO tokens - you have to manually maintain a list of where you've registered them. And if your token is lost or stolen, you have to manually revoke every single one.",
          "link": "https://news.ycombinator.com/item?id=41437728",
          "publishedOn": "2024-09-03T18:35:44.000Z",
          "wordCount": null,
          "title": "New comment by edent in \"EUCLEAK Side-Channel Attack on the YubiKey 5 Series\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41436904",
          "author": "bko",
          "description": "I found this interesting:\n> Another option is to put it to beneficial use to create heat or even electricity. The Puente Hills landfill I showed earlier has a gas-to-energy facility that’s been running since 1987, and even though the landfill is now closed, it currently provides enough electricity to power around 70,000 homes.\nAnd towards the end\n> Landfills seem like an environmental blight, but really, properly designed ones play a huge role in making sure waste products don’t end up in our soil or air or water. It’s not possible to landfill waste everywhere... But my point is: landfills are a surprisingly low-impact way to manage solid waste in a lot of cases. I hope the future is a utopia where all the stuff we make maintains its beneficial value forever, but for now, I am thankful for the sanitary engineers and the other professions involved in safely and economically dealing with our trash so we don’t have to.\nI love reading about landfills. I wish more environmentalists would be excited about engineering solving environmental ills and relied less on knee-jerk reactions.",
          "link": "https://news.ycombinator.com/item?id=41436904",
          "publishedOn": "2024-09-03T17:05:33.000Z",
          "wordCount": 9107,
          "title": "New comment by bko in \"The Engineering of Landfills\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41435515",
          "author": "yjftsjthsd-h",
          "description": "So obviously claiming that there's no good reason for process to read argv[0] is either demonstrating the author's ignorance or needs a much stronger defense; I'd be fascinated to hear how they think busybox should work on an OpenWrt box with a 16MB root filesystem.\nHowever, I am willing to consider the discussion about whether there could be merit to restricting the ability to write that value; I could imagine a system that populated it only from the actual file name and did not allow it to be written by the parent process or the child process at runtime. The obvious place this still falls apart is that an attacker could just\n    ln /bin/curl ./some\\ other\\ name\n\nbut there are sometimes security measures that we use even though they're less than 100% effective so it at least conceivable that this might be a trade off worth making.",
          "link": "https://news.ycombinator.com/item?id=41435515",
          "publishedOn": "2024-09-03T14:50:41.000Z",
          "wordCount": 6886,
          "title": "New comment by yjftsjthsd-h in \"Why bother with argv[0]?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41432569",
          "author": "laserbeam",
          "description": "Scenarios where an IDE with full syntactic understanding is better:\n- It's your day to day project and you expect to be working in it for a long time.\nScenarios where grepping is more useful:\n- Your language has #ifdef or equivalent syntax which does conditional compilation making syntactic tools incomplete.\n- You just opened the project for the first time.\n- It's in a language you don't daily drive (you write backend but have to delve in frontend code, it's a 3rd party library, it's configuration files, random json/xml files or data)\n- You're editing or searching through documentation.\n- You haven't even downloaded the project and are checking things out in github (or some similar site for your project).\n- You're providing remote assistance to someone and you are not at your main development machine.\n- You're remoting via SSH and have access to code there (say it's a python server).\nYes, an IDE will save you time daily driving. But there's no reason to sabotage all the other usecases.",
          "link": "https://news.ycombinator.com/item?id=41432569",
          "publishedOn": "2024-09-03T08:21:17.000Z",
          "wordCount": null,
          "title": "New comment by laserbeam in \"Greppability is an underrated code metric\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41431701",
          "author": "lucumo",
          "description": "Grepping for symbols like function names and class names feels so anemic compared to using a tool that has a syntactic understanding of the code. Just \"go to definition\" and \"find usages\" alone reduce the need for text search enormously.\nFor the past decade-plus I have mostly only searched for user facing strings. Those have the advantage of being longer, so are more easily searched.\nHonestly, posts like this sound like the author needs to invest some time in learning about better tools for his language. A good IDE  alone will save you so much time.",
          "link": "https://news.ycombinator.com/item?id=41431701",
          "publishedOn": "2024-09-03T05:51:50.000Z",
          "wordCount": null,
          "title": "New comment by lucumo in \"Greppability is an underrated code metric\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41431211",
          "author": "egypturnash",
          "description": "I got hue 174 as my threshold and really I just wanted to say \"neither, this is turquoise/teal\" for most of the questions. But blue/green was the only option.",
          "link": "https://news.ycombinator.com/item?id=41431211",
          "publishedOn": "2024-09-03T04:17:09.000Z",
          "wordCount": 3003,
          "title": "New comment by egypturnash in \"Is My Blue Your Blue?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41431114",
          "author": "db48x",
          "description": "Rust and Javascript and Lisp all get extra points because they put a keyword in front of every function definition. Searching for “fn doTheThing” or “defun do-the-thing” ensures that you find the actual definition. Meanwhile C lacks any such keyword, so the best you can do is search for the name. That gets you a sea of callers with the declarations and definitions mixed in. Some C coding conventions have you split the definition into two lines, first the return type on a line followed by a second line that starts with the function name. It looks ugly, but at least you can search for “^doTheThing” to find just the definition(s).",
          "link": "https://news.ycombinator.com/item?id=41431114",
          "publishedOn": "2024-09-03T03:58:36.000Z",
          "wordCount": 11050,
          "title": "New comment by db48x in \"Greppability is an underrated code metric\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41430492",
          "author": "doe_eyes",
          "description": "I suspect it tests your monitor and monitor calibration as much as your color perception. In particular, sRGB displays have a pretty severely limited green gamut. If you have a wide-gamut display, the test is probably gonna appear different.\nBut another problem is with displaying the colors essentially full-window, which is going to be nearly-full-screen for many users. When we're staring at a screen with a particular tint, our eyes quickly do \"auto white balance\" that skews the results. It's the mechanism behind a bunch of optical illusions.\nTo address that last problem, I think the color display area should be much smaller, or you should be shown all hues at once and asked to position a cut-off point.",
          "link": "https://news.ycombinator.com/item?id=41430492",
          "publishedOn": "2024-09-03T01:57:39.000Z",
          "wordCount": null,
          "title": "New comment by doe_eyes in \"Is My Blue Your Blue?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41430477",
          "author": "fogleman",
          "description": "I think this is flawed. You quickly end up on a color that's clearly not \"blue\" or \"green\" and you're unlikely to keep hitting \"this is green\" several times in a row, conceding that ok, fine, maybe this is blue, whatever. You're basically measuring how many times people are willing to click the same button in a row.\nEdit: Possible improvements: changing the wording to \"this is MORE green\" and \"this is MORE blue\" and randomizing the order in which they are shown, somehow. I realize you're just doing some kind of binary search, narrowing the color range.\nThis is not to mention color calibration of your monitor, or your eyes adjusting / fatiguing to the bold color over time...",
          "link": "https://news.ycombinator.com/item?id=41430477",
          "publishedOn": "2024-09-03T01:55:17.000Z",
          "wordCount": null,
          "title": "New comment by fogleman in \"Is My Blue Your Blue?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41429751",
          "author": "jumploops",
          "description": "We've had the best success by first converting the HTML to a simpler format (i.e. markdown) before passing it to the LLM.\nThere are a few ways to do this that we've tried, namely Extractus[0] and dom-to-semantic-markdown[1].\nInternally we use Apify[2] and Firecrawl[3] for Magic Loops[4] that run in the cloud, both of which have options for simplifying pages built-in, but for our Chrome Extension we use dom-to-semantic-markdown.\nSimilar to the article, we're currently exploring a user-assisted flow to generate XPaths for a given site, which we can then use to extract specific elements before hitting the LLM.\nBy simplifying the \"problem\" we've had decent success, even with GPT-4o mini.\n[0] https://github.com/extractus\n[1] https://github.com/romansky/dom-to-semantic-markdown\n[2] https://apify.com/\n[3] https://www.firecrawl.dev/\n[4] https://magicloops.dev/",
          "link": "https://news.ycombinator.com/item?id=41429751",
          "publishedOn": "2024-09-02T23:45:40.000Z",
          "wordCount": null,
          "title": "New comment by jumploops in \"Web scraping with GPT-4o: powerful but expensive\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41429127",
          "author": "solomonb",
          "description": "I relate heavily to the author's dilemma. My projects span from math, to programming, to pinball repair, to amateur radio, to gardening, to mycology, to who knows what else. I personally enjoy the process of bike-shedding and endlessly exploring the solution space for a problem. That said, there is a point where you need to make hard decisions and button up projects.\nAs long as I don't care what project gets completed at what time, I've found a little trick to broadly move the needle. I jokingly call it \"Sol's fast five\" but the name is actually pretty on point.\nI take a step back, look around me, and pick out the first five things I can reasonably achieve in less then a day prioritizing things where I have all the tools and materials at hand. These 5 things are never entire projects, the goal is to maximally decompose the projects until each action is as close to trivial as possible.\nOnce I have my list of 5 things I stop thinking about anything else and strictly work towards those 5 goals. There is a sense of relief in having reduced the scope and the tasks tend to be finished very quickly. Checking them off the list always feels good.\nOnce I have completed my 5 items I start a new list and pick out the next five items. This can feel like a huge reward.\nI've used this system to great effect in the past few years.",
          "link": "https://news.ycombinator.com/item?id=41429127",
          "publishedOn": "2024-09-02T21:59:55.000Z",
          "wordCount": 2930,
          "title": "New comment by solomonb in \"The Art of Finishing\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41426483",
          "author": "uv-depression",
          "description": "Starting with my undergrad but fully committing to it by grad school, I (and several of my friends who went through similar programs in math/cs) have a strategy that uses this. If, for example, I had a new problem set in a math course, I would bash my head against it in the evening for an hour or two. I'd make an honest attempt but move on from problems quickly if I got stuck. I'd rarely get much done. Then, I'd do my best to get a good night's sleep (at least 7.5 hours quality sleep). In the morning I'd try the problems again first thing after coffee, and frequently found that I could do a significant portion of the problems, or at least make headway. This might be biased by the fact that I'm really much more of a morning person to begin with, but I know several people who use this strategy.",
          "link": "https://news.ycombinator.com/item?id=41426483",
          "publishedOn": "2024-09-02T15:52:42.000Z",
          "wordCount": 2529,
          "title": "New comment by uv-depression in \"Sleep on it: How the brain processes many experiences, even when 'offline'\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41424153",
          "author": "WoodenChair",
          "description": "Whatever you think of the site itself, this is prime HN content. A kid in high school starts a site that scales to 1,000,000 registered users while working on it during nights and weekends in college. If the founder is on here, what tech stack did you use and how long had you been programming before you built it?",
          "link": "https://news.ycombinator.com/item?id=41424153",
          "publishedOn": "2024-09-02T10:17:01.000Z",
          "wordCount": null,
          "title": "New comment by WoodenChair in \"1M Users\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=53158",
          "author": "Ingrid Robeyns",
          "description": "In response to my previous post on the imminent threat to Dutch universities to have their budgets cut with up to 1 billion euros a year, I received a few emails from (mainly younger) staff to ask how they could contribute to the protests. I will respond specifically for the current Dutch case, but I […]",
          "link": "https://crookedtimber.org/2024/09/06/action-list-to-protect-universities-from-budget-cuts/",
          "publishedOn": "2024-09-06T09:30:02.000Z",
          "wordCount": 2530,
          "title": "Action list to protect universities from budget cuts",
          "imageUrl": "https://crookedtimber.org/wp-content/uploads/2024/09/RedSquares-225x300.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53149",
          "author": "Belle Waring",
          "description": "Plain People of Crooked Timber: can’t see why you’re drafting us in here so often after leaving us out in the cold for five years or whatever, we are busy people with our own lives and so on. Me: but I love you and you’re the best! Plain People of Crooked Timber: well if you’re […]",
          "link": "https://crookedtimber.org/2024/09/05/am-i-the-immoral-person/",
          "publishedOn": "2024-09-05T07:52:23.000Z",
          "wordCount": 6807,
          "title": "Am I The Immoral Person",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53130",
          "author": "Ingrid Robeyns",
          "description": "On Monday, the first day of our academic year, I went to a demonstration. The reason for the demonstration are the announced budget cuts for higher education, which our new right/extreme-right government wants to implement. The figures aren’t set in stone yet, but the financial appendix that was presented when the new government took office […]",
          "link": "https://crookedtimber.org/2024/09/04/dark-clouds-over-dutch-universities/",
          "publishedOn": "2024-09-04T06:46:46.000Z",
          "wordCount": 3718,
          "title": "Dark clouds over Dutch Universities",
          "imageUrl": "https://crookedtimber.org/wp-content/uploads/2024/09/Demonstration-Utrecht-CT-300x225.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53118",
          "author": "John Q",
          "description": "This study showing that US academic faculty members are 25 times more likely than Americans in general to have a parent with a PhD or Masters degree has attracted a lot of attention, and comments suggesting that this is unusual and unsatisfactory. But is it? For various reasons, I’ve interacted quite a bit with farmers, […]",
          "link": "https://crookedtimber.org/2024/09/01/academic-nepo-babies/",
          "publishedOn": "2024-09-01T21:47:08.000Z",
          "wordCount": 6805,
          "title": "Academic nepo babies ?",
          "imageUrl": "https://crookedtimber.org/wp-content/uploads/2024/09/InheritedJobs-300x279.png"
        },
        {
          "id": "https://crookedtimber.org/?p=53107",
          "author": "John Holbo",
          "description": "So is Trump going to be able to pivot to pro-choice in the run-up to the election? I mean: he’s trying. But will it work? And will his pro-life base accept it, because he’s Trump? I hope no pro-choice voters are fooled. I hope they hold him responsible for overturning Roe. It’s beyond obvious they […]",
          "link": "https://crookedtimber.org/2024/09/01/a-thought-about-conservative-psychology-re-the-abortion-issue/",
          "publishedOn": "2024-09-01T13:00:18.000Z",
          "wordCount": 16812,
          "title": "A thought about conservative psychology re: the abortion issue",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53104",
          "author": "Chris Bertram",
          "description": "Visit the post for more.",
          "link": "https://crookedtimber.org/2024/09/01/sunday-photoblogging-looking-towards-great-howard-street-liverpool-at-night/",
          "publishedOn": "2024-09-01T05:57:25.000Z",
          "wordCount": 1884,
          "title": "Sunday photoblogging: Looking towards Great Howard Street (Liverpool) at night",
          "imageUrl": "https://live.staticflickr.com/65535/53951428111_69ecbd9b9a.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53098",
          "author": "Belle Waring",
          "description": "I read reddit. Yeah, I know. Plain People of Crooked Timber: “why would you go and do a thing like that when you could sit on the kitchen floor and watch your packet of English muffins slowly pass its sell-by date and develop that unpleasant sour flavour you usually don’t notice until it’s too late […]",
          "link": "https://crookedtimber.org/2024/08/31/how-best-to-do-bad-things-that-hurt-your-spirit/",
          "publishedOn": "2024-08-31T14:57:05.000Z",
          "wordCount": 3147,
          "title": "How Best to Do Bad Things That Hurt Your Spirit",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/CADTM-what-to-do-with-the-Financial-sector-and-the-Banks",
          "author": "CADTM, Christoph Sorg",
          "description": "Extract from “Social Movements and the Politics of Debt: Transnational Resistance against Debt on Three Continents” \nEnglish\n\n/ \nArbitration, \nBank of the South, \nBanks",
          "link": "https://www.cadtm.org/CADTM-what-to-do-with-the-Financial-sector-and-the-Banks",
          "publishedOn": "2024-09-06T05:38:56.000Z",
          "wordCount": 2983,
          "title": "CADTM : what to do with the Financial sector and the Banks and, with the Sovereign Debt arbitration",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1200xH630/950ac0b9a4e54b23a26f51c2551439-3490b.jpg"
        },
        {
          "id": "https://www.cadtm.org/Ecuador-From-Rafael-Correa-to-Guillermo-Lasso-via-Lenin-Moreno",
          "author": "Eric Toussaint",
          "description": "The World Bank and the IMF are 80 years old. 80 years of financial neo-colonialism and the imposition of austerity policies in the name of debt repayment. 80 years is enough! The Bretton Woods institutions must be abolished and replaced by democratic institutions serving an ecological, feminist and anti-racist bifurcation. To mark these 80 years, we are republishing a series of articles every Wednesday until July, looking in detail at the history and damage caused by these two institutions. (...)\nEnglish\n\n/ \nEcuador, \nSouth, \n80 ans BM FMI EN",
          "link": "https://www.cadtm.org/Ecuador-From-Rafael-Correa-to-Guillermo-Lasso-via-Lenin-Moreno",
          "publishedOn": "2024-09-04T08:00:00.000Z",
          "wordCount": 6921,
          "title": "Ecuador: From Rafael Correa to Guillermo Lasso via Lenin Moreno",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L710xH373/fd445ef503d94fcc2b5f65e72879c3-a9a94.png"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=8419",
          "author": "disassociated.com",
          "description": "As if climate change, and the increasingly unstable weather it will bring, isn’t enough to worry about, parts of Australia may see an increase in volcanic activity. Not in the immediate future, thankfully, but at some point nonetheless: It is much less likely that a volcano that has already erupted will start again. It is […]",
          "link": "https://disassociated.com/add-new-australian-volcanic-activity-list-worries/",
          "publishedOn": "2024-09-05T21:00:58.000Z",
          "wordCount": 239,
          "title": "Add new Australian volcanic activity to the list of worries…",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8414",
          "author": "disassociated.com",
          "description": "Mick Tsikas, writing for The Conversation: The severe weather rounds out a weird winter across Australia. The nation’s hottest ever winter temperature was recorded when Yampi Sound in Western Australia reached 41.6C on Tuesday. Elsewhere across Australia, winter temperatures have been way above average. 41.6°C? It doesn’t even get that hot in summer, at least […]",
          "link": "https://disassociated.com/weird-winter-weather-points-more-unstable-weather/",
          "publishedOn": "2024-09-04T21:00:43.000Z",
          "wordCount": 361,
          "title": "Weird winter weather points to yet more unstable weather",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8399",
          "author": "disassociated.com",
          "description": "There’s been a bit of a surge in discussion recently about Indie Web, and seemingly what it means to be a true adherent. This time the focus appears to be about what I’m going to call technical proficiency. From what I can gather, having your own website, with your own domain name, and your own […]",
          "link": "https://disassociated.com/indie-web-small-web-social-web-whatever-web-my-web/",
          "publishedOn": "2024-09-03T21:00:49.000Z",
          "wordCount": 815,
          "title": "Indie Web, small web, social web, whatever web, my web",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8394",
          "author": "disassociated.com",
          "description": "Well, I’m sure pretty no AI is involved. What’s really incredible about this three minute video, made by Faruk Korkmaz, is that it was filmed entirely by a device, a smartphone, many of us carry in our pockets. The narration is fitting also. It comes from a speech given by Canadian-American actor and comedian Jim […]",
          "link": "https://disassociated.com/short-film-iphone-15-pro-max/",
          "publishedOn": "2024-09-02T21:00:02.000Z",
          "wordCount": 265,
          "title": "A short film shot on the iPhone 15 Pro Max, with no lens, filter, or AI",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8381",
          "author": "disassociated.com",
          "description": "Publication of Irish author Sally Rooney’s fourth novel, Intermezzo, on 24 September 2024, nears. It promises to be quite the event. I don’t know about Australia, but in Ireland and the UK, some bookshops will open early on the day, so eager Rooney fans can get hold of her latest offering. But Sally Rooney is […]",
          "link": "https://disassociated.com/ireland-home-best-literature-world/",
          "publishedOn": "2024-09-01T21:00:50.000Z",
          "wordCount": 411,
          "title": "Ireland: home of some of the best literature in the world",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8376",
          "author": "disassociated.com",
          "description": "Brazilians are turning to Bluesky — the microblogging platform founded by then Twitter co-founder Jack Dorsey — in droves, following a ban on X in the South American country. The surge in signups however has prompted warnings from Bluesky that the service may experience outages, as a result. But that seems like a good sort […]",
          "link": "https://disassociated.com/brazilians-flock-bluesky-authorities-block-x/",
          "publishedOn": "2024-09-01T20:30:40.000Z",
          "wordCount": 287,
          "title": "Brazilians flock to Bluesky after authorities block X",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20240905",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20240905",
          "publishedOn": "2024-09-05T16:12:00.000Z",
          "wordCount": 611,
          "title": "Week Ending September 1, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/regional-interests",
          "author": null,
          "description": "In the Sahel.",
          "link": "https://newleftreview.org/sidecar/posts/regional-interests",
          "publishedOn": "2024-09-06T11:20:06.000Z",
          "wordCount": 3211,
          "title": "Martin Barnay: &ldquo;Regional Interests&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/09/36538648262_546c68324a_k-1200x640-1.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/darker-turn",
          "author": null,
          "description": "Elections in Thuringia.",
          "link": "https://newleftreview.org/sidecar/posts/darker-turn",
          "publishedOn": "2024-09-05T10:39:27.000Z",
          "wordCount": 1807,
          "title": "Loren Balhorn: &ldquo;Darker Turn&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/09/4f8097aa-711f-4f02-b54a-2f1488174651_g_570.jpeg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/something-monstrous",
          "author": null,
          "description": "Britain’s colonial pathologies.",
          "link": "https://newleftreview.org/sidecar/posts/something-monstrous",
          "publishedOn": "2024-09-04T00:44:56.000Z",
          "wordCount": 1522,
          "title": "Nadine El-Enany: &ldquo;Something Monstrous&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/09/vip-54420.jpg"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://veronique.ink/september-sun/",
          "author": null,
          "description": "I just got back from getting my hair lopped at Mastercuts. $30. And let me tell you, this lady got it right, and I didn't have to spend a small fortune.\nI stopped and got a cream cheese and lox bagel with a blood orange Pelligrino around the corner from the salon. I sat by the window, and people watched, hurrying to and from their office jobs high in the sky.\nThe bagel was alright, although I think I got spoiled living at Bathurst and Lawrence, a predominantly Jewish community, with their spectacular bagels, that now, every other bagel shop, pales in comparison. My people know how to make a mean cream cheese and lox.\nI've been up to my neck in job search.\nThere's one in particular I'm hoping will call back. Not because I like the job, but because it's close to home, and i can do the job with my eyes closed.\n\nI'm still spending most of my writing efforts on my email blog.\nI wrote two letters: end of august diary, and deep affection. Hope you liked them <3\nIf you're a regular reader of my blog (hi ilu 🦄), consider signing up!\nThis past week, I've been trying out Substack. I know, I know, a lot of you don't like the platform for various reasons. I'm with you on quite a few of them.\nBut. BUT. What a pleasure it is to write in their editor. Things WORK! Can you even imagine?\nThere are no weird formatting issues. I can easily upload a picture and write a caption easy peasy. Bullet lists don't go all wonky when i hit publish.\nBut on the flip side, it doesn't feel like my writing home. The writers use the same writerly language, discussing Important Things in highly sophisticated, educated, long-form essays.\nI feel like the outcast in the cafeteria sitting by myself eating a wet sandwich my mom made me.\non another note...\n\nthe most magical time of the year is finally upon us 🍂",
          "link": "https://veronique.ink/september-sun/",
          "publishedOn": "2024-09-05T18:54:00.000Z",
          "wordCount": 883,
          "title": "september sun",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/veronique/img_cfe8d87c576f-1.jpeg"
        },
        {
          "id": "https://tiramisu.bearblog.dev/going-home/",
          "author": null,
          "description": "By this time next week I will be back at home. Although I love my life\nhere more than even I anticipated, I'm very much looking forward to\nbeing home. In a moment which I recognize as an incredibly rare\noccurrence in my life, I want to be both places.\nLike most people in the States after I turned eighteen I started\nsplitting time between home and school, or work, or wherever I\nhappened to be at the time. At first I didn't go home very often\nbecause I felt stagnant there, lost, and my parents' presence\nexhausted me. I found ways to leave school days later than everyone\nelse and ways to return early from break. Most years I think I wanted\nto be only in one place, if that — where I was — and in lower points\nof my life I wanted to be neither where I was nor at home. So it is\nwith great gratitu…",
          "link": "https://tiramisu.bearblog.dev/going-home/",
          "publishedOn": "2024-09-05T16:58:00.000Z",
          "wordCount": 1047,
          "title": "will you miss me when i’m gone?",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://jeddacp.me/throwback-thursday-011-washington-monument/",
          "author": null,
          "description": "Sometimes I feel like I took seeing these monuments in DC for granted. I thought I would have more time to see them more often, but then my move to the West Coast happened (and it happened FAST), and I haven't been back since.\nAnyways, I miss it.\n\nFebruary 2017, Washington D.C, Canon EOS M3",
          "link": "https://jeddacp.me/throwback-thursday-011-washington-monument/",
          "publishedOn": "2024-09-05T15:12:28.168Z",
          "wordCount": 887,
          "title": "Throwback Thursday 011 - Washington Monument",
          "imageUrl": "https://img.playbook.com/LCgtcz_yU35AUnc-e5jM-OuZkVXzUv8bxFsGyOjc360/Z3M6Ly9wbGF5Ym9v/ay1hc3NldHMtcHVi/bGljL2Q2ZmUwYjgy/LTQ1MTctNDVhNC1i/ZTM4LTE2OGJjN2Uy/YjFjNQ"
        },
        {
          "id": "https://birming.com/letting-go/",
          "author": null,
          "description": "I was listening to a documentary about Joni Mitchell. I was struck by something she wrote in a telegram to her partner when she felt her free artistic spirit was starting to be constrained:\nIf you hold sand too tightly, it will slip through your fingers.\nIt's often like that when we cling too tightly to things. Relationships, status, possessions — they risk slipping through our hands. The more value we place on them, the more we cling. It's almost as if we're inviting a self-fulfilling prophecy.\nMoreover, we squeeze the joy and beauty out of what we hold dear when our grip is too strong. What we have here and now is neglected by thoughts of what we \"must do\" to keep it, and what might happen if we don't do it. We stand with one foot in the present and the other in an imaginary future.\nWe can never know what the future holds. We can secure things as much as possible, nothing wrong with that, but we must be open to the fact that life is, after all, transient and unpredictable. There is a beauty in that too, if we accept that inevitable truth. We become more open and receptive to our surroundings.\nWhen we let go, we begin to let in.\nCommunity echoes\nAlexandra",
          "link": "https://birming.com/letting-go/",
          "publishedOn": "2024-09-05T13:40:00.000Z",
          "wordCount": 1408,
          "title": "Letting Go",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert/studio-a08b5a28ff721d1ace107c3e924d2691-2jejgl8u.jpg"
        },
        {
          "id": "https://louplummer.lol/books-and-more-books/",
          "author": null,
          "description": "I am genetically blessed with a good memory. I was born with it and I've done absolutely nothing special to cultivate it, other than to stuff it full of facts that I can pull out during games of Trivial Pursuit or at random times to surprise Wonder Woman. My mother saved a book she bought for me as a toddler that was a directory of horse breeds: Percheron, Clydesdale, Morgan - I memorized them all and family legend says I would \"read\" the book to visiting adults as a party trick.\nBooks were important to my parents. I've been surrounded by books my whole life. My mother still has the set of encyclopedias that she and my dad bought in 1970, along with a collection of classics like Gulliver's Travels and Pilgrim's Progress, books I challenged during elementary school. I was allowed to read an…",
          "link": "https://louplummer.lol/books-and-more-books/",
          "publishedOn": "2024-09-05T11:30:00.000Z",
          "wordCount": 1241,
          "title": "Books and More Books, Never Enough",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/livingoutloud/old_cincinnati_library-1.jpg"
        },
        {
          "id": "https://mgx.me/sucks-to-be-me-you-usoh-frig-off/",
          "author": null,
          "description": "I came across a comment ==post== (now deleted) on X the other day that said, \"man, if you're indian and trying to make some bread, first thing is change your name online, Rachid Deepak Kumar does not transmit competence, i'm sorry but it's facts.\"\nThis person was arguing that having an Indian name can be a hindrance when trying to do business online.\nI don't think the issue is limited to Indians. I've worked with SaaS makers from mainland China who choose not to reveal they are from China and sometimes use alternate names online. They do this because of perceived negative stereotypes about quality and reliability that can come with a \"Made in China\" label.\nIt seems national stereotypes can also influence perceptions regardless of actual ability or experience. As someone with over a decade of professional experience working mostly with non-Indian folks, I've found that potential clients always fall into one of two camps -  those willing to fairly compensate based on skills and those expecting to pay less simply because I'm Indian.\nAs an Indian, it does sting to see the stereotyping. But defending it by pointing to the success of individuals like Naval Ravikant or Balaji Srinivasan doesn't address the root issue (I noticed this pattern on X).\nDon't let ignorance ruin your day.",
          "link": "https://mgx.me/sucks-to-be-me-you-usoh-frig-off/",
          "publishedOn": "2024-09-05T04:34:00.000Z",
          "wordCount": 1325,
          "title": "sucks to be me. you. us...oh frig off!",
          "imageUrl": "https://static.mgx.me/images/2024/jroc.jpg"
        },
        {
          "id": "https://notes.jeddacp.com/when-being-alone-doesnt-have-to-be-lonely/",
          "author": null,
          "description": "I consider myself an extroverted introvert. Or is it introverted extrovert? More on that later.\nI feel like often times, us introverts are misunderstood. A lot of people mistake introverts to be anti-social, or shy… but that’s not always the case. Being an introvert means that our batteries are recharged by spending time alone, away from social interactions. This past weekend, I fully embraced my recharge by spending 3 days in solitude.\nI mean… I mostly stayed away from human interaction. At least, I didn’t interact with any humans physically, and only through text with my other half, LC. This is also not because I don’t enjoy the company of others, especially LC’s, but there’s just something rejuvenating about spending time alone. You know… just existing in my own space, without the need to formulate words out loud, because sometimes there are just too many words. Of course, my dog got an earful from me every time I decided I needed to speak out loud.\nThere was a lot of silence, and little words, this weekend. It was nice not having any obligations outside of my own personal to-do list. I did a lot of reading, and a lot of binge watching (Dexter), which typically take a backseat in all of the life admin stuff I have to do. It was a great opportunity for me to recharge my mental and emotional batteries, and to force myself to find comfort in the quiet and the familiar.\nI missed having my other half here, a lot, but it also felt good to take a step back from the world to focus on myself.\nSo here’s to the long weekend spent solo, the comfort in the quiet, and the understanding that being alone doesn’t have to be lonely.\nSide note: I never really felt alone (even when I was) since I have a Velcro dog who literally needs to be attached to me at all times. That kind of balances things out, right?\n53/100\nReply by email",
          "link": "https://notes.jeddacp.com/when-being-alone-doesnt-have-to-be-lonely/",
          "publishedOn": "2024-09-04T15:16:00.000Z",
          "wordCount": 1205,
          "title": "When Being Alone Doesn’t Have to be Lonely",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda/alone.png"
        },
        {
          "id": "https://tiramisu.bearblog.dev/coffee-chats/",
          "author": null,
          "description": "The office I work out of runs an opt-in coffee chat program which\nmatches you with someone each week to have a short chat over coffee. I\ndon't know anyone in the office, so at the behest of my director I\nsigned up.\nI had my first coffee chat today. The guy I was supposed to meet with\nshowed up fifteen minutes late, which might have irked me if (i) I\nhadn't rescheduled our chat something like three times and (ii) if I\nactually enjoyed networking. Even though our conversation wasn't bad,\nall things considered, I still found myself rather grateful when we\nhad to run to our 4 PM meetings. I always feel phony networking with\nother people in the office, especially when they're a married\nfortysomething busy salesman high up on the org chart who has better\nthings to do than talk to a lowly peasant…",
          "link": "https://tiramisu.bearblog.dev/coffee-chats/",
          "publishedOn": "2024-09-03T22:24:00.000Z",
          "wordCount": 1259,
          "title": "coffee chats and donut dates",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://birming.com/bearboost-shortcut-bloggers/",
          "author": null,
          "description": "BearBoost\n\nBearBoost is an Apple shortcut designed to help you boost your blogging.\nIt's for all bloggers, but especially those who use the Bear blogging platform. The idea is to give you a quick and easy tool to help you get writing when you're feeling stuck.\nIt's like having your personal muse whisper, \"No more writer's block! Let's turn this blank page into a blog masterpiece!\" Okay, maybe not exactly that, but kind of.\nThe shortcut currently offers nine menu options:\nTrending Posts (Bear discovery feed)\nRecent Posts (Bear discovery feed)\nTen Topics (pick one and start writing)\nDaily Prompt (via Kevin McDonald)\nRandom Prompt (from Blog Prompts)\nRandom Quote (from Random Quotations)\nToday’s Word (via Merriam-Webster)\nBlog Inspiration (a page of mine)\nDiscover Blogs (the blog directory)\nI'll likely add more features over time. If you have any requests, please let me know.\nGet the BearBoost shortcut",
          "link": "https://birming.com/bearboost-shortcut-bloggers/",
          "publishedOn": "2024-09-03T19:29:00.000Z",
          "wordCount": 1358,
          "title": "BearBoost Shortcut for Bear Bloggers",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert/untitled-1.jpeg"
        },
        {
          "id": "https://birming.com/unforeseen/",
          "author": null,
          "description": "This day didn't start off great. I was supposed to be working in the archipelago, which I love, but someone had forgotten to book a boat for me. I was supposed to be on the island at 8:30 AM, but the mistake meant I would arrive at 11:30 AM instead.\nThree hours wasted, and I was supposed to visit six different clients. I could just see myself coming home very late, if I even managed to catch the last ferry back.\nOnce I got there, it turned out that all the houses were close to each other. The houses were also small, so each visit was short. When I was finished with the last customer, she offered to drive me back to the mainland in her boat.\nThe day ended with me finishing ridiculously early.\nSo, why am I telling you this? Because it's so incredibly stupid to paint scenarios in advance when we don't actually have a clue. We imagine how...\n...the workday will be long.\n...the job interview will go badly.\n...the family dinner will be stressful.\n...the date will be awkward.\n...the weather will be a disaster.\nAnd then it turns out in the end that those thoughts weren't accurate at all. The sun came out and during the job interview, it turned out that we had a mutual friend, so it felt very relaxed and good.\nIt's so much unnecessary time and energy that we spend trying to predict what hasn't happened yet. Things we can't possibly know in advance.\nOf course, it's good and even necessary to plan certain things in advance. To do your research and prepare. But it easily gets out of hand or is used when it doesn't serve any sensible purpose.\nWe might tell ourselves that \"you want to be prepared for the worst,\" but is that really a wise strategy? Isn't it better, sometimes, to face the future with an open mind and open arms? That attitude in itself might even increase the chance that it all ends in a surprisingly positive way.\nLet’s embrace the unknown and see where it takes us.",
          "link": "https://birming.com/unforeseen/",
          "publishedOn": "2024-09-03T14:32:00.000Z",
          "wordCount": 1547,
          "title": "The Unforeseen",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert/studio-e070e9bda490adc6e3a3ae6aae7a8620-ht6bcboi.jpg"
        },
        {
          "id": "https://louplummer.lol/my-partner/",
          "author": null,
          "description": "I am deeply and hopelessly in love and there's not much I can do about it. Luckily, the object of my affection is my wife of eleven years. Whenever we are separated, regardless for how long, I unconsciously begin a countdown in my mind until I see her again, even it it's just from the beginning of the work day until lunch. I've never known anyone as well as I know her. I can tell her mood from the sound of her footsteps as she descends the stairs from our bedroom into the living room. Neither of us ever attempt to hide an emotion from the other, so intune we are with each other's feelings.\nMy wife is a classic introvert. Our home is her haven, the place where she recharges her batteries. I long ago accepted the responsibility for answering every knock at the door and being the one to deal …",
          "link": "https://louplummer.lol/my-partner/",
          "publishedOn": "2024-09-03T11:30:00.000Z",
          "wordCount": 1039,
          "title": "My Partner",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/livingoutloud-1725326614.jpeg"
        },
        {
          "id": "https://aco.bearblog.dev/getting-a-life/",
          "author": null,
          "description": "i dont like getting asked \"what have you been up to?\". i don't know. i could have had the most interesting past few days, or the most uneventful, and i would simply not remember. my memory is slim these days, and comes to me in fleeting moments when i can form links with events in the present. sitting here in the sun the sun sends me back to the beach i was on this summer. the embrace from a friend brings the scent of the perfume my grandmother used to wear. the unassumed path we bike on takes me to my mom's hometown. i wonder at times if i only remember things by association.\n\ni've been doing a lot of things recently, which has been nice. i've been seeing friends and getting out of the house most days. at times i wonder if this is what life is supposed to be all about; these joyful moments shared with others, kept a secret from the rest of the world. i don't take many photos when i'm out like that. my mom gets mad i don't have anything to show for my outings. having a photo of the occasion makes me feel like i have cheated myself out of a memory by constraining it to a handful of pixels. who do i need prove i had a good time to?",
          "link": "https://aco.bearblog.dev/getting-a-life/",
          "publishedOn": "2024-09-03T01:42:00.000Z",
          "wordCount": 1254,
          "title": "getting a life",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://louplummer.lol/how-to-be-yourself-and-get-along-online/",
          "author": null,
          "description": "Since I started blogging in January, I've invested time in several different communities, starting with OMG.LOL, followed by Microblog, Scribbles, r/MacApps, r/Obsidian, BearBlog, 500.social and the Blaugust Discord. The most personal of these are the Mastodon community around OMG.LOL, Scribbles and Microblog. The two Reddit communities are the most impersonal. As in any group environment, I have personal interactions with other people and with groups of other people. I also get to watch interactions where I'm not directly involved because of the way the Internet is structured.\nSome of my rules are:\nStay out of other people's fights\nNever ignore racism, homophobia or misogyny\nNever go \"Well, actually…\"\nGive lots of complements\nOffer sympathy\nAnswer questions\nAvoid taking sides unless moral…",
          "link": "https://louplummer.lol/how-to-be-yourself-and-get-along-online/",
          "publishedOn": "2024-09-02T11:30:00.000Z",
          "wordCount": 1082,
          "title": "How to Be Yourself and Get Along Online",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/livingoutloud-1725244010.webp"
        },
        {
          "id": "https://secemp9.bearblog.dev/how-i-mastered-english-through-sheer-anger/",
          "author": null,
          "description": "I was once so angry that I reached this current level of understanding English, the level you see right now.\nIt was in the summer of 2016.\nI wasn’t particularly angry at the time, until a certain event occurred. Looking back, it probably wasn’t that significant, but, to put it briefly, the main cause was an English teacher I had at the time. It might have been a childish reason, but I was just a kid back then.\nDuring that summer, fueled by anger, I took the first hardcover English book I could find at home (I remember the title was \"Frankenstein\") and tried to read it.\nI didn’t have my laptop, internet, TV, or even a paper dictionary at the time. I was furious and struggled to read the book.\nOn my first read, I understood only about 1-5% of the entire book. But I kept going. As I struggled…",
          "link": "https://secemp9.bearblog.dev/how-i-mastered-english-through-sheer-anger/",
          "publishedOn": "2024-09-01T22:06:00.000Z",
          "wordCount": 891,
          "title": "How I mastered English through sheer Anger",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://unwissen.bearblog.dev/blogs-are-weird-and-i-do-not-understand-them/",
          "author": null,
          "description": "Off course I knew what a blog was before finding Bear.1 I read blogposts and used tumblr (…), and I think my mother had a blog for some time, too. But I did not know about the technicalities (wtf is RSS?) and the culture of blogging. And although it took some time to set this whole endeavor up2, it is the culture-thing that is the hardest for me.\nI am used to Twitter and Bluesky, where posts have to be short and draw attention. This combination rewards posts that say divisive shit3 and punishes those that are nuanced and complex. It is easier to wish death onto some asshole politician than to explain what they did wrong. If you want to write something personal or sincere you have to meme and/or bury it under ironic detachment.\nLike posts on microblogging platforms, blogposts follow their o…",
          "link": "https://unwissen.bearblog.dev/blogs-are-weird-and-i-do-not-understand-them/",
          "publishedOn": "2024-08-31T19:45:00.000Z",
          "wordCount": 1027,
          "title": "Blogs are weird and I do not understand them",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://bakavic.net/psa-remove-your-location-when-uploading-pictures-to-bearblog/",
          "author": null,
          "description": "TL;DR: Bearblog doesn't (currently) strip location data from your uploads, so you need to do it yourself\nUPDATE: Herman just added a comment in the nolt suggestion that locations are now removed, and there is a corresponding commit.\nA new uploaded photo shows that EXIF metadata (including location) is now removed:\n\nThanks Herman for the fast work! 💨\nI noticed that bear blog posts with pictures were loading rather slowly - turns out images are being stored and served as-is, full-sized and all.\nThis is probably a Good Thing(tm) for people running photo blogs, but I also realised that photo metadata, including your location, are being retained - not something you would want, e.g. if your pictures were taken at home.\nIf you have posted images via the native bearblog insert image feature in th…",
          "link": "https://bakavic.net/psa-remove-your-location-when-uploading-pictures-to-bearblog/",
          "publishedOn": "2024-08-31T06:09:00.000Z",
          "wordCount": 852,
          "title": "PSA: Remove your location when uploading pictures to bearblog (fixed!)",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/david-graeber-the-wisdom-of-kandiaronk?v=1725518188",
          "author": null,
          "description": "Author: David Graeber\nTitle: The Wisdom of Kandiaronk\nSubtitle: The Indigenous Critique, the Myth of Progress and the Birth of the Left\nDate: 2019\nNotes: Article publié le 28 septembre 2019 Pour citer cet article : David Graeber , « La sagesse de Kandiaronk : la critique indigène, le mythe du progrès et la naissance de la Gauche », Revue du MAUSS permanente, 28 septembre 2019 [en ligne].\nSource: Original: journaldumauss.net/?La-sagesse-de-Kandiaronk-la-critique-indigene-le-mythe-du-progres-et-la Translated at: nevermoremedia.substack.com/i/140700070/the-wisdom-of-kandiaronk-the-indigenous-critique-the-myth-of-progress-and-the-birth-of-the-left\n\n \n \nAnthropologist David Graeber has been working for seven years, with archaeologist David Wengrow, on a work devoted to a history of inequality. …",
          "link": "https://theanarchistlibrary.org/library/david-graeber-the-wisdom-of-kandiaronk?v=1725518188",
          "publishedOn": "2024-09-05T06:36:28.000Z",
          "wordCount": 23176,
          "title": "David Graeber - The Wisdom of Kandiaronk",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "64415",
            "url": "https://theanarchistlibrary.org/library/david-graeber-the-wisdom-of-kandiaronk.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}