{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": []
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": [
        {
          "id": "dab37534fc31f5c3a2ba27f017579fdc4f34674c",
          "author": "Syed Masudullah Sadullah",
          "description": "This post explores how Amazon Bedrock can transform property management operations and optimize costs. We examine a practical approach to tackle challenges such as processing high volumes of lease agreements, maintaining compliance with varied regulatory requirements.",
          "link": "https://aws.amazon.com/blogs/architecture/transform-lease-agreement-workflows-with-amazon-bedrock/",
          "publishedOn": "2024-12-31T15:06:09.000Z",
          "wordCount": 4086,
          "title": "Transform lease agreement workflows with Amazon Bedrock",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fc074d501302eb2b93e2554793fcaf50b3bf7291/2024/12/23/Rental-Blog-Solution-architecture-Picture2-1.png"
        }
      ]
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps & Developer Productivity Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": [
        {
          "id": "84ca02a5b48a54f88f390089a009976e87922bea",
          "author": "Brian Beach",
          "description": "As we kick off 2025, I wanted to take a moment to highlight the top posts from 2024. Without further ado, here are the top 10 DevOps and developer productivity blog posts of 2024. Announcing CDK Migrate A single command to migrate to the AWS CDK – This blog post announces the general availability of […]",
          "link": "https://aws.amazon.com/blogs/devops/the-most-visited-devops-and-developer-productivity-blog-posts-in-2024-copy/",
          "publishedOn": "2025-01-02T14:21:08.000Z",
          "wordCount": 1925,
          "title": "The most visited DevOps and Developer Productivity blog posts in 2024",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/12/31/The-most-visited-DevOps-and-developer-productivity-blog-posts-in-2024-1120x630.png"
        },
        {
          "id": "c0274ae9899bf1d6fa6f868d7f7e54714956d4a0",
          "author": "Brian Beach",
          "description": "The dust has settled after another re:Invent. I once again had the privilege of organizing the DevOps and Developer Productivity (DOP) track along with Jessie VanderVeen, Krishna Dalal, Megan Sattler and countless others. For 2024, the DOP track included 60 sessions. If you weren’t able to attend, I have compiled a list of the on-demand […]",
          "link": "https://aws.amazon.com/blogs/devops/reinvent-2024-devops-and-developer-productivity-playlist/",
          "publishedOn": "2025-01-02T14:20:10.000Z",
          "wordCount": 2461,
          "title": "re:Invent 2024 DevOps and Developer Productivity Playlist",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/12/31/re-Invent-2024-DevOps-and-Developer-Productivity-Playlist-1120x630.png"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/4f1f53b4ab0f",
          "author": "Netflix Technology Blog",
          "description": "This article is the second in a multi-part series sharing a breadth of Analytics Engineering work at Netflix, recently presented as part of…",
          "link": "https://netflixtechblog.com/part-2-a-survey-of-analytics-engineering-work-at-netflix-4f1f53b4ab0f?source=rss----2615bd06b42e---4",
          "publishedOn": "2025-01-02T21:07:11.000Z",
          "wordCount": 4729,
          "title": "Part 2: A Survey of Analytics Engineering Work at Netflix",
          "imageUrl": "https://miro.medium.com/v2/da:true/resize:fit:1200/0*j2wKL4S3ywEs9mpf"
        }
      ]
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": []
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=348780",
          "author": "Joe Allen",
          "description": "Screen shot from the Teamsters Facebook page. The Teamsters’ five day long strike against Amazon ended inconclusively, but the union hinted at future actions with “Stay tuned.” Beginning on Thursday, December 19, the Teamsters called strikes in response to the failure of Amazon to meet the union’ s demand to come to the bargaining table  More\nThe post The Teamsters’ Amazon “Strikes”: a Critical Assessment appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/02/the-teamsters-amazon-strikes-a-critical-assessment/",
          "publishedOn": "2025-01-02T07:00:48.000Z",
          "wordCount": null,
          "title": "The Teamsters’ Amazon “Strikes”: a Critical Assessment",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348829",
          "author": "Jonah Raskin",
          "description": "It wasn’t Abbie Hoffman's finest moment. But it was one of them. It was a critical moment in 1987 when he and the daughter of a president protested against the presence of the CIA and CIA recruitment on the campus of the University of Massachusetts in Amherst. Abbie was 50. Amy was less than half his age. Together, they spanned the generation gap that sprawled across much of the 1980s. The daughter of a president and the co-founder of the Yippies and one of the eight defendants at the Chicago Conspiracy Trial showed that the American spirit of defiance had not evaporated into the thin air of the Reagan years. Nationally acclaimed lawyer, Lenny Weinglass, came out of semi-retirement and led the defense team for Amy and Abbie. More\nThe post The Abbie and Amy Show appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/02/the-abbie-and-amy-show/",
          "publishedOn": "2025-01-02T06:55:45.000Z",
          "wordCount": null,
          "title": "The Abbie and Amy Show",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348826",
          "author": "Binoy Kampmark",
          "description": "The late centenarian, Jimmy Carter, occupied a difficult position in the line of imperial magistrates we know as US Presidents.  Coming to power in the aftermath of murderous US adventurism in Indochina and the debauching of the presidency by Richard Nixon (“when the president does it, it means that it is not illegal”), he took an axe to the welfare state, nourished the strapping, dangerous creature that would become neoliberalism, and made foreign policy decisions of disastrous consequence, punctuated by such successes as normalising relations between Egypt and Israel. More\nThe post Jimmy Carter, Israel and the Apartheid Question appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/02/jimmy-carter-israel-and-the-apartheid-question/",
          "publishedOn": "2025-01-02T06:55:34.000Z",
          "wordCount": null,
          "title": "Jimmy Carter, Israel and the Apartheid Question",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348431",
          "author": "Lawrence Reichard",
          "description": "Every foreign-policy remembrance of Jimmy Carter I have seen has focused on the taking of U.S. hostages in Iran, and on the Camp David accord, which re-established diplomatic relations between Israel and Egypt. Camp David did much to bring Anwar Sadat’s Egypt back into the Western fold, but, as later history would bear out, the  More\nThe post Jimmy Carter and the Resurrection of U.S. Empire appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/02/jimmy-carter-and-the-resurrection-of-u-s-empire/",
          "publishedOn": "2025-01-02T06:55:28.000Z",
          "wordCount": null,
          "title": "Jimmy Carter and the Resurrection of U.S. Empire",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348483",
          "author": "John Feffer",
          "description": "In the late 1990s, at the request of five South Korean organizations, I put together a conflict resolution training program in Seoul. The groups were interested in learning more about nonviolent ways of resolving disputes in the community, at a national level, and across borders. Another aim of the program was to explore ways for  More\nThe post The Transformation of Korean Civil Society appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/02/the-transformation-of-korean-civil-society-2/",
          "publishedOn": "2025-01-02T06:45:42.000Z",
          "wordCount": null,
          "title": "The Transformation of Korean Civil Society",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348787",
          "author": "Chloe Atkinson",
          "description": "With just weeks to go before Donald Trump waltzes back into the White House, America has an additional problem on its hands. The homelessness rate has surged, rising by 18% in 2024 compared to last year. According to the Department of Housing and Urban Development’s annual assessment report, more than 770,000 people were experiencing homelessness on a  More\nThe post The Homelessness Crisis is About to Get a Lot Worse appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/02/the-homelessness-crisis-is-about-to-get-a-lot-worse/",
          "publishedOn": "2025-01-02T06:44:19.000Z",
          "wordCount": null,
          "title": "The Homelessness Crisis is About to Get a Lot Worse",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348628",
          "author": "Megan Russell",
          "description": "Thomas Friedman probably thought he was being clever when he titled his most recent article How Elon Musk and Taylor Swift Can Resolve U.S.-China Relations. It’s a headline meant to catch your attention– appealing to the Swifties, who think Taylor can save the world, the Musketeers, who are certain Elon can save the world, and, of  More\nThe post Can’t Believe It’s the New York Times and Not Daily Mail appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/02/cant-believe-its-the-new-york-times-and-not-daily-mail/",
          "publishedOn": "2025-01-02T06:11:20.000Z",
          "wordCount": null,
          "title": "Can’t Believe It’s the New York Times and Not Daily Mail",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348655",
          "author": "Alexander Cockburn – Jeffrey St. Clair",
          "description": "People marvel at the idiocy of these Nobel awards, but there’s method in the madness, since in the end they train people to accept without demur or protest absurdity as part and parcel of the human condition, which they should accept as representing the considered opinion of rational men, albeit Norwegian. It’s a twist on the Alger myth, inspiring to youth: you too can get to murder Filipinos, or Palestinians, or  Vietnamese or Afghans  and still  win a Peace Prize. That’s the audacity of hope at full stretch. More\nThe post Jimmy Carter and the Uses of the Nobel Peace Prize appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/01/jimmy-carter-and-the-uses-of-the-nobel-peace-prize/",
          "publishedOn": "2025-01-01T07:02:07.000Z",
          "wordCount": null,
          "title": "Jimmy Carter and the Uses of the Nobel Peace Prize",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348349",
          "author": "Kathleen Wallace",
          "description": "A report released on December 27 from hud.gov dropped an extremely startling new statistic. In the last year the number of homeless individuals in America shot up an astounding 18%, bringing the number of Americans without a home to 770,000. Of course, this number is probably a distinct underestimation as it is difficult to properly include the souls out there without reliable housing, or of course those who are still sheltered, but barely existing on a shoestring, juggling numerous jobs and falling behind daily. More\nThe post Half a Trillion Reasons for Shame appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/01/half-a-trillion-reasons-for-shame/",
          "publishedOn": "2025-01-01T07:00:23.000Z",
          "wordCount": null,
          "title": "Half a Trillion Reasons for Shame",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348638",
          "author": "Medea Benjamin - Nicolas J. S. Davies",
          "description": "In April 2019, Jimmy Carter told his church congregation in Georgia that President Trump had called him for advice about China. Carter said he told Trump that China was economically overtaking the United States as the world’s largest and most dynamic economy because the United States had spent decades wasting trillions of dollars to fight endless wars, while China had instead focused on economic development and lifted hundreds of millions of its people out of extreme poverty. “China has not wasted a single penny on war,” Carter said, “and that’s why they’re ahead of us, in almost every way.” More\nThe post Jimmy Carter Told Trump How to Put America First, But Will He Do It? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/01/jimmy-carter-told-trump-how-to-put-america-first-but-will-he-do-it/",
          "publishedOn": "2025-01-01T06:55:31.000Z",
          "wordCount": null,
          "title": "Jimmy Carter Told Trump How to Put America First, But Will He Do It?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348355",
          "author": "Peter Bach",
          "description": "In the English countryside, dogs are let off leads. Pharmacy queues are well informed. Green-winged teals are recorded on birdwatching sites. Civil servants are criticised for working from home. Old amphitheatres are muddy. There are many Graham Greene novels in the Oxfam shop. More\nThe post Letter Not from London: the English Countryside appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/01/letter-not-from-london-the-english-countryside/",
          "publishedOn": "2025-01-01T06:55:24.000Z",
          "wordCount": null,
          "title": "Letter Not from London: the English Countryside",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348721",
          "author": "Daniel Falcone",
          "description": "Introduction Soundtrack to a Coup d’Etat, originally a four-hour film, is still a very long 151-minute documentary by Johan Grimonprez. While the filmmaker may have at times oversimplified the intersections of US Civil Rights, jazz, literature, Cold War diplomacy, and the complicated nature of domestic politics of Congo, he provides an excellent focus on decolonization and  More\nThe post Soundtrack to a Coup d’Etat: A Productive Misunderstanding appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/01/soundtrack-to-a-coup-detat-a-productive-misunderstanding/",
          "publishedOn": "2025-01-01T06:55:02.000Z",
          "wordCount": null,
          "title": "Soundtrack to a Coup d’Etat: A Productive Misunderstanding",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348395",
          "author": "Ryan Hutson",
          "description": "Ryan Hutson of Humboldt Freelance Reporting is a Freelance Journalist based in Humboldt County, California. You can find Ryan’s reporting at Kymkemp.com with Redheaded Blackbelt News,  KMUD Radio, and at PBS’s KEET-13 TV. More\nThe post California Taxpayers File Class Action Lawsuit Against Congressional Reps, Demand Stop to Genocide Funding appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/01/california-taxpayers-file-class-action-lawsuit-against-congressional-reps-demand-stop-to-genocide-funding/",
          "publishedOn": "2025-01-01T06:54:20.000Z",
          "wordCount": null,
          "title": "California Taxpayers File Class Action Lawsuit Against Congressional Reps, Demand Stop to Genocide Funding",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348723",
          "author": "Grant Inskeep",
          "description": "“If you always vote for the lesser of two evils, you will always have evil, and you will always have less.” — Ralph Nader Jimmy Carter died over the weekend. As one would expect, there’s been loads of corporate media hype about “Jimmy Carter, the liberal saint.” Though all one needs to do is look  More\nThe post The Real Jimmy Carter appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/01/the-real-jimmy-carter/",
          "publishedOn": "2025-01-01T06:54:17.000Z",
          "wordCount": null,
          "title": "The Real Jimmy Carter",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348485",
          "author": "Susan Block",
          "description": "Happy Slappy Mother-Effing 2025. Will anyone here get out alive? I’ll take my chances… 2024 having been such a bust (and not the good kind) of a year, an awful spin cycle of sorrow and fear, un-bonoboneopuritanism, Artificial Ignorance censoring and killing us, sadistic injustice, raging extortion, medical murders, the rich enriching the rich, war  More\nThe post Go Bonobos in 2025 appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/01/go-bonobos-in-2025/",
          "publishedOn": "2025-01-01T06:50:36.000Z",
          "wordCount": null,
          "title": "Go Bonobos in 2025",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348624",
          "author": "Sarena Neyman",
          "description": "Call him a misguided hero or villain, but the man who killed the United Healthcare CEO struck a nerve, exposing a deep rage shared by many Americans across the political spectrum — anger at an industry that earns obscene profits from the suffering of others. His chilling act shifted the national conversation from immigration to  More\nThe post Killing of the United Healthcare CEO Sparked Long Overdue Conversation About Greed appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/01/killing-of-the-united-healthcare-ceo-sparked-long-overdue-conversation-about-greed/",
          "publishedOn": "2025-01-01T06:42:44.000Z",
          "wordCount": null,
          "title": "Killing of the United Healthcare CEO Sparked Long Overdue Conversation About Greed",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347681",
          "author": "Jeffrey St. Clair",
          "description": "Here are my entries (and a taste of their music) for the 19th Annual Francis Davis Jazz Critics Poll for the best jazz recordings and archival/reissues of 2024. The full results from all 70+writers will be published here later in January. NEW RELEASES 1) Vijay Iyer, Linda May Han Oh, Tyshawn Sorey, Compassion (ECM) 2)  More\nThe post Sound Grammar: the Best Jazz Recordings of 2024 appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/01/sound-grammar-the-best-jazz-recordings-of-2024/",
          "publishedOn": "2025-01-01T06:42:31.000Z",
          "wordCount": null,
          "title": "Sound Grammar: the Best Jazz Recordings of 2024",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348350",
          "author": "Urariano Mota",
          "description": "Journalist and writer Paulo Carneiro, a friend from our long youth, invited me by email to write about “I’m still here”. And in this way I introduce myself below. The film’s excellences have layers that, when speaking about them, may seem like timid restrictions on the part of this author. In the first of them,  More\nThe post On Walter Salles’ “I’m Still Here” appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2025/01/01/on-walter-salles-im-still-here/",
          "publishedOn": "2025-01-01T06:30:43.000Z",
          "wordCount": null,
          "title": "On Walter Salles’ “I’m Still Here”",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348344",
          "author": "Stephen F. Eisenman",
          "description": "In liberal, Jewish households, Hanukkah has always been something of an embarrassment. First, there’s the unavoidable truth that Hannukah is no match for Christmas. Liturgically speaking, it’s a minor holiday; it ranks somewhere between Simchat Torah and Tu Bishvat, neither of which most Gentiles (and many Jews) have even heard of. So, efforts by assimilated Jews since the 19th century, and especially the 1950s, to treat Hanukkah like Christmas are a stretch. The birthday of God (even if you are a non-believer) in 1 CE is objectively speaking a much bigger deal than the re-dedication by the victorious Maccabees (Judean rebels) of the second temple of Jerusalem (long since destroyed) in the 2nd century BCE. More\nThe post Hanukkah 2024: Festival of Darkness and Light appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/31/hanukkah-2024-festival-of-darkness-and-light/",
          "publishedOn": "2024-12-31T07:00:32.000Z",
          "wordCount": null,
          "title": "Hanukkah 2024: Festival of Darkness and Light",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348449",
          "author": "Binoy Kampmark",
          "description": "History shows that empires acquire territories in various ways.  Dynasties link arms through marriage, as the Habsburgs were famous for doing.  Territories are pinched by means of arms or stolen through sham contracts and undertakings.  They might also be purchased. The United States made much of the vast property sale in acquiring an empire.  The Louisiana purchase of 1803  More\nThe post Greenland Redux: Trump and America’s Continuing Obsession appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/31/greenland-redux-trump-and-americas-continuing-obsession/",
          "publishedOn": "2024-12-31T06:55:08.000Z",
          "wordCount": null,
          "title": "Greenland Redux: Trump and America’s Continuing Obsession",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348348",
          "author": "Lawrence Davidson",
          "description": "At Home and Abroad Police in America need a great deal of reform, a project that translates to freeing them from the racist nature of U.S. culture while tying them more firmly to the culture of civil and human rights. Not easy, but certainly a worthwhile task compared to maintaining the present situation. Here is  More\nThe post Auschwitz to Gaza: The War Against International Law appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/31/auschwitz-to-gaza-the-war-against-international-law/",
          "publishedOn": "2024-12-31T06:50:05.000Z",
          "wordCount": null,
          "title": "Auschwitz to Gaza: The War Against International Law",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348337",
          "author": "Ted Olson",
          "description": "The Bob Dylan biopic “A Complete Unknown,” starring Timothée Chalamet, focuses on Dylan’s early 1960s transition from idiosyncratic singer of folk songs to internationally renowned singer-songwriter. As a music historian, I’ve always respected one decision of Dylan’s in particular – one that kicked off the young artist’s most turbulent and significant period of creative activity.  More\nThe post Dylan’s Creative Leap appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/31/dylans-creative-leap/",
          "publishedOn": "2024-12-31T06:45:12.000Z",
          "wordCount": null,
          "title": "Dylan’s Creative Leap",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348425",
          "author": "Susan Block",
          "description": "After 100 years among us, Jimmy Carter is gone. Like a lot of people, I’m playing Ramblin’ Man in his memory tonight. Saying good-bye to Jimmy Carter is complicated as Dickey Bett’s guitar. All complications considered, Jimmy was my favorite U.S. President during my lifetime. Nobody’s perfect, and a U.S. President’s imperfections are bound to  More\nThe post Farewell Jimmy Carter appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/31/farewell-jimmy-carter/",
          "publishedOn": "2024-12-31T06:45:02.000Z",
          "wordCount": null,
          "title": "Farewell Jimmy Carter",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348381",
          "author": "Cesar Chelala",
          "description": "There are two kinds of cowards. Charles Joseph Coward was a British soldier who grew up in Edmonton, London, and enlisted in the British Army in 1937. During the war, he was wounded and captured by the Germans at the fall of Calais in 1940 while serving as a battery sergeant. He tried to escape  More\nThe post What Cowards Do appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/31/what-cowards-do/",
          "publishedOn": "2024-12-31T06:36:53.000Z",
          "wordCount": null,
          "title": "What Cowards Do",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348375",
          "author": "Ron Jacobs",
          "description": "There’s a precipice and we are standing on its edge. The world as it exists on the eve of 2025 is a world of war and genocide. It is a world where millions of humans exist in a state not just of uncertainty, but in a state where tomorrow is likely to be worse than  More\nThe post New Year’s Resolution Number One: Join the Movement Against World War appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/31/new-years-resolution-number-one-join-the-movement-against-world-war/",
          "publishedOn": "2024-12-31T06:10:34.000Z",
          "wordCount": null,
          "title": "New Year’s Resolution Number One: Join the Movement Against World War",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348401",
          "author": "Dean Baker",
          "description": "Last week, Delaware Senator Chris Coons, the chair of the Senate Subcommittee on Intellectual Property, made an assertion about the nature of patents that is flat out wrong. Senator Coons said: “OUR FOUNDING FATHERS MADE IT CLEAR THAT INVENTORS SHOULD HAVE EXCLUSIVE RIGHTS TO THEIR INVENTIONS. IN OTHER WORDS, THE CONSTITUTION IN ITS SCRIPT GUARANTEES  More\nThe post Sen. Chris Coons and the Cult of Patent Monopolies appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/31/sen-chris-coons-and-the-cult-of-patent-monopolies/",
          "publishedOn": "2024-12-31T05:59:19.000Z",
          "wordCount": null,
          "title": "Sen. Chris Coons and the Cult of Patent Monopolies",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348487",
          "author": "Elliot Sperber",
          "description": "The bombs are falling Trump’s taking Greenland By force of course It’s a crime — Or maybe it’s not Let’s ask Alito, see if he thinks so Maybe he’ll find It’s necessary for the pipeline Pipe that melting ice To the golf clubs of Nevada, Refill the Ogallala And don’t forget Oprah Who alone needs  More\nThe post Bombs Over Greenland appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/31/bombs-over-greenland/",
          "publishedOn": "2024-12-31T05:28:28.000Z",
          "wordCount": null,
          "title": "Bombs Over Greenland",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348356",
          "author": "Ramzy Baroud",
          "description": "The story of the Israeli war on Gaza can be epitomized in the story of the Israeli war on Beit Lahia, a small Palestinian town in the northern part of the Strip. When Israel launched its ground operations in Gaza, Beit Lahia was already largely destroyed due to many days of relentless Israeli bombardment which  More\nThe post A Palestinian Year in Review: Genocide, Resistance and Unanswered Questions   appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/30/a-palestinian-year-in-review-genocide-resistance-and-unanswered-questions/",
          "publishedOn": "2024-12-30T07:01:25.000Z",
          "wordCount": null,
          "title": "A Palestinian Year in Review: Genocide, Resistance and Unanswered Questions",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348336",
          "author": "Melvin Goodman",
          "description": "The mainstream media ignored the passing of a beloved former colleague of mine, Ambassador Raymond Garthoff, whose career spanned the most important years of arms control and disarmament between the United States and the Soviet Union.  Over the years, the media have devoted much attention to the opponents of arms control such as George W. Bush, Paul Wolfowitz, John Bolton, and Casper Weinberger, but have done little to explore the importance of its advocates and practitioners.   More\nThe post The Death of Ambassador Raymond Garthoff and Disarmament appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/30/the-death-of-ambassador-raymond-garthoff-and-disarmament/",
          "publishedOn": "2024-12-30T07:01:05.000Z",
          "wordCount": null,
          "title": "The Death of Ambassador Raymond Garthoff and Disarmament",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348392",
          "author": "Michael K. Smith",
          "description": "A pious Sunday school teacher confessing to lust in his heart but swearing never to lie, he came to Washington to reestablish public faith in government just when popular disgust at monstrous U.S. crimes in Indochina had reached unprecedented heights. The big business agenda during his term in office (1977-1981) was to roll back the welfare state, break the power of unions, fan the flames of the Cold War to increase military spending, engineer tax breaks for wealthy corporate interests, and repeal government regulation of business. While portraying himself as a peanut-farming populist, Carter delivered the goods for Wall Street.\nMore\nThe post Jimmy Carter: the False Savior appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/30/jimmy-carter-the-false-savoir/",
          "publishedOn": "2024-12-30T06:59:53.000Z",
          "wordCount": null,
          "title": "Jimmy Carter: the False Savior",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=284891",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics;  Mangione judge, defense fund; WSWS on managing disease through allowing infection; Populism and the Wizard of Oz ~",
          "link": "https://www.nakedcapitalism.com/2025/01/200pm-water-cooler-1-2-2025.html",
          "publishedOn": "2025-01-02T19:00:20.000Z",
          "wordCount": 10993,
          "title": "2:00PM Water Cooler 1/2/2025",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/covid-cdc-ww-natl-4.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284887",
          "author": "Yves Smith",
          "description": "The unduly respected New York Times columnist Tom Friedman again plays ignorant American, here despite a visit to China.",
          "link": "https://www.nakedcapitalism.com/2025/01/elon-musk-taylor-swift-antony-blinken-china-and-the-idiocy-of-tom-friedman.html",
          "publishedOn": "2025-01-02T14:55:14.000Z",
          "wordCount": 8128,
          "title": "Elon Musk, Taylor Swift, Antony Blinken, China, and the Idiocy of Tom Friedman",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284866",
          "author": "Yves Smith",
          "description": "Our fractious daily links: butterfly collection, Yellowstone caldera, US Covid spike, tequila glut, extra wildfire coverage required? China hacks, Russia advances, Magnomics worries, New Orleans and Vegas attacks, AI and ancient texts, breakfast costs woes",
          "link": "https://www.nakedcapitalism.com/2025/01/links-1-2-2025.html",
          "publishedOn": "2025-01-02T11:55:49.000Z",
          "wordCount": 12703,
          "title": "Links 1/2/2025",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/00-skunk-and-possum.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284873",
          "author": "Yves Smith",
          "description": "A new neocon scheme,  reportedly with backing among incoming Trump officials, to bring Russia to its knees with improved energy sanctions.",
          "link": "https://www.nakedcapitalism.com/2025/01/trumps-push-to-shut-down-the-axis-of-upheaval-starts-with-lng.html",
          "publishedOn": "2025-01-02T10:36:55.000Z",
          "wordCount": 11457,
          "title": "Trump’s Push To Shut Down the Axis of Upheaval Starts With LNG",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284876",
          "author": "Yves Smith",
          "description": "India’s policymakers have ambitious plans for pathogen research. Can  biolab  safety infrastructure keep up?",
          "link": "https://www.nakedcapitalism.com/2025/01/as-biolabs-multiply-globally-some-experts-worry-about-oversight.html",
          "publishedOn": "2025-01-02T08:40:57.000Z",
          "wordCount": 9009,
          "title": "As Biolabs Multiply Globally, Some Experts Worry About Oversight",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284856",
          "author": "Yves Smith",
          "description": "More on the H-1B visa scam.",
          "link": "https://www.nakedcapitalism.com/2025/01/the-truth-about-h-1b-visas.html",
          "publishedOn": "2025-01-02T05:55:57.000Z",
          "wordCount": 10661,
          "title": "The Truth About H-1B Visas",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/00-H-1B.webp"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284822",
          "author": "Yves Smith",
          "description": "Our jazzy daily links: Weird American practices, China governance explained, EU energy wars, SKorea on the ropes? Starmer flails, Iran economic woes, Syria non-PC, Musk sabotaged Ukraine? Roberts warns on judge threats, Texas Pfizer susit tosses, US shale depletion, US credit card defaults spike",
          "link": "https://www.nakedcapitalism.com/2025/01/links-1-1-2025.html",
          "publishedOn": "2025-01-01T11:59:10.000Z",
          "wordCount": 18861,
          "title": "Links 1/1/2025",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/Screen-Shot-2024-12-31-at-10.14.57-PM.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284844",
          "author": "Yves Smith",
          "description": "Cancers among the young have risen so much that some experts have called it an epidemic. What are the probable causes and preventatives?",
          "link": "https://www.nakedcapitalism.com/2025/01/the-rise-in-early-onset-cancers-their-origins-and-what-to-do-about-them.html",
          "publishedOn": "2025-01-01T11:57:44.000Z",
          "wordCount": 10217,
          "title": "The Rise in Early-Onset Cancers: Their Origins and What to Do About Them",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/01/00-cancers.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284731",
          "author": "Yves Smith",
          "description": "A new study tries to find out how extensive self-censorship is among university teaching staff.",
          "link": "https://www.nakedcapitalism.com/2025/01/self-selection-and-self-censorship-on-campus-and-the-fire-report.html",
          "publishedOn": "2025-01-01T11:00:21.000Z",
          "wordCount": 7601,
          "title": "Self-Selection and Self-Censorship on Campus, and the FIRE Report",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/00-censorship.jpeg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284831",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Open Thread ~",
          "link": "https://www.nakedcapitalism.com/2024/12/200pm-water-cooler-new-years-eve-2024.html",
          "publishedOn": "2024-12-31T19:00:46.000Z",
          "wordCount": 8100,
          "title": "2:00PM Water Cooler New Year’s Eve 2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/hiroshige.jpeg"
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "chVlt8JAjFduvvOJ5c1yl",
          "author": "Kyle Boutette",
          "description": "Let’s talk about Stream Live’s design, and how it leverages the distributed nature of Cloudflare’s network, rather than centralized locations as many other live services do.",
          "link": "https://blog.cloudflare.com/behind-the-scenes-with-stream-live-cloudflares-live-streaming-service/",
          "publishedOn": "2025-01-02T14:00:00.000Z",
          "wordCount": 2617,
          "title": "Behind the scenes with Stream Live, Cloudflare’s live streaming service",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/22xpisp6kbEqdM6zRXu3dA/94a28da12c2384c800639e2d25a1b0a3/Behind_the_scenes_with_Stream_Live__Cloudflare_s_live_streaming_service-OG.png"
        },
        {
          "id": "2b03lxutI7PqAfcxswe5aE",
          "author": "Marek Majkowski",
          "description": "Follow along as I build a custom weather display using Cloudflare Workers and a popular e-paper display.",
          "link": "https://blog.cloudflare.com/the-forecast-is-clear-clouds-on-e-paper-powered-by-the-cloud/",
          "publishedOn": "2024-12-31T14:00:00.000Z",
          "wordCount": 2185,
          "title": "The forecast is clear: clouds on e-paper, powered by the cloud",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/5O3BzxuFQsKnohnMZgLXiM/e355a5b79d6ac5de41c7eee530742b03/The_forecast_is_clear-_clouds_on_e-paper__powered_by_the_cloud-OG.png"
        },
        {
          "id": "2yX9ADcaKBprzyI9BaBoqN",
          "author": "Lucas Pardue",
          "description": "h3i is a command line tool and Rust library designed for low-level testing and debugging of HTTP/3, which runs over QUIC.",
          "link": "https://blog.cloudflare.com/h3i/",
          "publishedOn": "2024-12-30T14:00:00.000Z",
          "wordCount": 5021,
          "title": "Open sourcing h3i: a command line tool and library for low-level HTTP/3 testing and debugging",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/49kGUhFhN2iZIdcgGwDL6l/9f70e5deb1d4148f41be228340633c66/Open_sourcing_h3i-_a_command_line_tool_and_library_for_low-level_HTTP_3_testing_and_debugging-OG.png"
        },
        {
          "id": "1zc4C9M6VIkj5TrfugGxum",
          "author": "Mari Galicer",
          "description": "This roundup blog post shares the latest new features and capabilities at Cloudflare.",
          "link": "https://blog.cloudflare.com/masque-now-powers-1-1-1-1-and-warp-apps-dex-available-with-remote-captures/",
          "publishedOn": "2024-12-27T14:00:00.000Z",
          "wordCount": 1727,
          "title": "What’s new in Cloudflare: MASQUE now powers 1.1.1.1 & WARP apps, DEX now generally available with Remote Captures",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/5zrTvvNWjdNCJGCScEAReA/9934881512fae110663c5de87ea8ffc0/What_s_new_in_Cloudflare-_MASQUE_now_powers_1.1.1.1___WARP_apps__DEX_now_generally_available_with_Remote_Captures-OG.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Engineering at Slack",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": []
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=42569873",
          "author": "cperciva",
          "description": "In 2005, my paper on breaking RSA by observing a single private-key operation from a different hyperthread sharing the same L1 cache -- literally the first publication of a cryptographic attack exploiting shared caches -- was rejected from the cryptology preprint archive on the grounds that \"it was about CPU architecture, not cryptography\".  Rejection from journals is like rejection from VCs -- it happens all the time and often not for any good reason.\n(That paper has now been cited 971 times according to Google Scholar, despite never appearing in a journal.)",
          "link": "https://news.ycombinator.com/item?id=42569873",
          "publishedOn": "2025-01-01T22:34:02.000Z",
          "wordCount": 522,
          "title": "New comment by cperciva in \"One of my papers got declined today\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42568746",
          "author": "dwaltrip",
          "description": "Hilarious irony:\n> With hindsight, some of my past rejections have become amusing.  With a coauthor, I once almost solved a conjecture, establishing the result with an \"epsilon loss\" in a key parameter.  We submitted to a highly reputable journal, but it was rejected on the grounds that it did not resolve the full conjecture.  So we submitted elsewhere, and the paper was accepted.\n> The following year, we managed to finally prove the full conjecture without the epsilon loss, and decided to try submitting to the highly reputable journal again.  This time, the paper was rejected for only being an epsilon improvement over the previous literature!",
          "link": "https://news.ycombinator.com/item?id=42568746",
          "publishedOn": "2025-01-01T19:54:15.000Z",
          "wordCount": 14570,
          "title": "New comment by dwaltrip in \"One of my papers got declined today\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42563992",
          "author": "Donald",
          "description": "45^2 = 2025\nHappy perfect square year, everyone. The previous one was 1936 and the next one will be 2116.",
          "link": "https://news.ycombinator.com/item?id=42563992",
          "publishedOn": "2025-01-01T04:39:33.000Z",
          "wordCount": null,
          "title": "New comment by Donald in \"Happy New Year 2025\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42553307",
          "author": "davidclark",
          "description": "> Credit card delinquency rates, which are seen as a precursor to write-offs, peaked in July, according to data from Moody’s, but have only fallen slightly and remain nearly a percentage point higher than they were on average in the year before the pandemic.\nThis is a prime example of a style of reporting that really grinds my gears.\nThe citation is clearly to another internet source, so a link should be provided. If it truly cannot be linked because it is private, more context is still needed to understand what this data means.\nI actually can’t find the source myself, but I can find “Delinquency Rate on Credit Card Loans, All Commercial Banks” from the Federal Reserve. [1]\nThe percents from that source somewhat match those referenced in the FT quote. “Peaked in July”\n- 2024Q1 3.15%\n- 2024Q2 3.24%\n- 2024Q3 3.23%\nUsing 2019 as “the year before the pandemic”, the average was 2.5825. Is +0.6475 “nearly a percentage point”? I guess it technically would round up.\nSeemingly important context that the quote doesn’t give is that 3.23% is lower than any time 1991Q3 to 2011Q4. But, maybe the trend matters more for this metric.\n[1] https://fred.stlouisfed.org/series/DRCCLACBS",
          "link": "https://news.ycombinator.com/item?id=42553307",
          "publishedOn": "2024-12-30T20:46:04.000Z",
          "wordCount": null,
          "title": "New comment by davidclark in \"US credit card defaults jump to highest level since 2010\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42552719",
          "author": "ghewgill",
          "description": "I worked with John for a few years in the 1990s. This was during the heyday of BBSes, when he joined our small team at Mustang Software after Mustang bought Qmodem. John moved to Bakersfield California (with his family, including OP!) to be with us. John left a few years later due to I think business differences with management.\nJohn was personable and full of joy. He always loved a good joke. I remember the parties (not wild, we were pretty tame back then) we would have around the pool at his place. He was generous with his time.\nThe story of Qmodem itself was a bit different. Qmodem for DOS was a one-man shareware business and was John's pride and joy. It was clear that he poured everything into that program. It was finely tuned and just worked. Times were changing though, and people were calling for a Windows version. Unfortunately, John was not interested in learning Windows programming, so Scott Hunter (now at Microsoft), Dan Horn, and I built Qmodem for Windows. It was good, but it really never had the same level of polish that John's work did. It was \"Qmodem\" in name only.\nAfter John left Mustang he also left Bakersfield and I lost touch with him. I'm sure he continued to make the people around him smile. Thank you for your time and contributions, John.",
          "link": "https://news.ycombinator.com/item?id=42552719",
          "publishedOn": "2024-12-30T19:46:57.000Z",
          "wordCount": 484,
          "title": "New comment by ghewgill in \"Tell HN: John Friel my father, internet pioneer and creator of QModem, has died\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42551173",
          "author": "markerz",
          "description": "One of my websites was absolutely destroyed by Meta's AI bot: Meta-ExternalAgent https://developers.facebook.com/docs/sharing/webmasters/web-...\nIt seems a bit naive for some reason and doesn't do performance back-off the way I would expect from Google Bot.  It just kept repeatedly requesting more and more until my server crashed, then it would back off for a minute and then request more again.\nMy solution was to add a Cloudflare rule to block requests from their User-Agent.  I also added more nofollow rules to links and a robots.txt but those are just suggestions and some bots seem to ignore them.\nCloudflare also has a feature to block known AI bots and even suspected AI bots: https://blog.cloudflare.com/declaring-your-aindependence-blo... As much as I dislike Cloudflare centralization, this was a super convenient feature.",
          "link": "https://news.ycombinator.com/item?id=42551173",
          "publishedOn": "2024-12-30T17:07:23.000Z",
          "wordCount": 8103,
          "title": "New comment by markerz in \"AI companies cause most of traffic on forums\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42550873",
          "author": "ababaian",
          "description": "Cool :) I'm a co-author on this. AMA.\nThis is now a peer-reviewed paper, published last month in Cell [https://www.cell.com/cell/fulltext/S0092-8674(24)01091-2].\nObelisks are part of a larger research program we're developing at the University of Toronto + collaborators, see also: Virus-Viroid Hybrids paper [https://www.nature.com/articles/s41467-023-38301-2] and the Zeta-Elements [https://www.nature.com/articles/s41586-021-04332-2].\nComputational biology is driving a revolutionary expansion of our understanding of Earth's biodiversity. I believe Zeta-elements, Ambiviruses, and Obelisks are just the beginning. If you're interested, our \"Laboratory for RNA-Based Lifeforms\" (University of Toronto) is hiring passionate developers/post-docs/graduate students [https://www.rnalab.ca].\nEdit: OK going to call it for now. I'll check in later today if there's any outstanding questions.",
          "link": "https://news.ycombinator.com/item?id=42550873",
          "publishedOn": "2024-12-30T16:40:38.000Z",
          "wordCount": 5188,
          "title": "New comment by ababaian in \"'Obelisks': New class of life has been found in human digestive system\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42550846",
          "author": "chrismorgan",
          "description": "> SQLite is not open source in the legal sense, as “open source” has a specific definition and requires licenses approved by the Open Source Initiative (OSI).\nThis is wrong, and harmfully wrong. OSI are not the arbiters of open source. Their Open Source Definition, though generally useful and accepted, is not without legitimate criticism and controversy. As for their approval, that’s a dreadful thing to rely on for any purpose; https://writing.kemitchell.com/2019/05/05/Rely-on-OSI.html> is a good description of most of what’s wrong with it (it doesn’t really get into the broken politics enough; but some of his other articles contain more), and I like its summary: “The list of OSI-approved licenses reflects OSI’s practical and political history, not any useful, consistently functional category of license terms.”\nAs for whether SQLite is open source, well, the only reason a public domain dedication doesn’t meet the OSD is that it’s not a license. It’s more open. In a way that is legally mildly uncertain in some jurisdictions, sure, but to call it “not open source in the legal sense” is just wrong.",
          "link": "https://news.ycombinator.com/item?id=42550846",
          "publishedOn": "2024-12-30T16:38:09.000Z",
          "wordCount": null,
          "title": "New comment by chrismorgan in \"Fun facts about SQLite\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42548985",
          "author": "freetonik",
          "description": "In some parallel universe, each computing device manufacturer is required by law to provide a storage so that the user can plug in their single, universal, transferrable set of security credentials (like passkeys). Instead of \"many cooks\" mentioned in the article, there is one standard.\nI cannot bring myself to agree to any \"switch to passkey\" prompt from any device because I have no idea (and too tired to figure out) how and where that key will be stored, how do I deal with different devices, etc. I already have a universal solution for credentials: 1password, which is cross-platform. With Apple's keychain, and I suspect other companies' solutions, passkeys are connected to your account and at best synced between devices from the same manufacturer. But even with Apple, I can't sync stuff between my personal and work computer because they use different Apple IDs, even though the underlying true identity (me) is the same.\nLike with many other solutions, the current approach with passkeys is designed for an imaginary \"user in vacuum\" model each company dreams about, where people are 100% into one ecosystem, forever.",
          "link": "https://news.ycombinator.com/item?id=42548985",
          "publishedOn": "2024-12-30T13:15:07.000Z",
          "wordCount": 8990,
          "title": "New comment by freetonik in \"Passkey technology is elegant, but it's most definitely not usable security\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42543338",
          "author": "jmclnx",
          "description": "Looking back, to me he was a much better president then people believed in the 80s.\nI believe if he got re-elected in 1980, the US would be in a much better place.  One thing, it could be argued real work on Climate Change would have begun in 1981 as opposed to where we are now, which is just watching the average probably blowing past 3C in around 70 years from now.\nFor his loss in 1980, I still blame Kennedy.\nRIP, he did a lot to help regular people through his life, far more than our current crop of politicians.",
          "link": "https://news.ycombinator.com/item?id=42543338",
          "publishedOn": "2024-12-29T21:26:37.000Z",
          "wordCount": null,
          "title": "New comment by jmclnx in \"Jimmy Carter has died\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42537165",
          "author": "jchw",
          "description": "What I want is very simple: I want software that doesn't send anything to the Internet without some explicit intent first. All of that work to try to make this feature plausibly private is cool engineering work, and there's absolutely nothing wrong with implementing a feature like this, but it should absolutely be opt-in.\nTrust in software will continue to erode until software stops treating end users and their data and resources (e.g. network connections) as the vendor's own playground. Local on-device data shouldn't be leaking out of radio interfaces unexpectedly, period. There should be a user intent tied to any feature where local data is sent out to the network.\nSo why didn't Apple just simply ask for user permission to enable this feature? My cynical opinion is because Apple knows some portion of users would instantly disallow this if prompted, but they feel they know better than those users. I don't like this attitude, and I suspect it is the same reason why there is an increasing discontent growing towards opt-out telemetry, too.",
          "link": "https://news.ycombinator.com/item?id=42537165",
          "publishedOn": "2024-12-29T03:17:21.000Z",
          "wordCount": 15175,
          "title": "New comment by jchw in \"Apple Photos phones home on iOS 18 and macOS 15\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42535276",
          "author": "MrMember",
          "description": "I'm seeing a lot of back in forth in the comments between hiring managers and employees discussing who is more responsible for the current situation, but from the perspective of someone looking for a job what should I be doing?\nI've been pretty aggressively looking for a job for the past six months or so. I have 10+ years of professional software dev experience so I've mostly been looking at senior dev positions. I haven't used LLMs at all in my resume, cover letters, etc. I only apply to jobs that I believe I meet the requirements for and that I would likely accept if given an offer. How do I signal that 1) I am a real person 2) I really do have the job experience and skills listed on my resume, and 3) I really am interested in the specific job I'm applying for. Because doing this my hit rate has been abysmal. I've had maybe 10-12 initial phone screens (never an issue, I easily make it past these). Past that I've had maybe 3-4 interviews that get into the later rounds. From that I've had zero offers.\nSo why should I keep doing what I'm doing when it's getting me nowhere? Why shouldn't I switch to an automated \"shotgun\" approach that applies me to as many jobs as possible to which I vaguely fit the requirements? The only other way I've seen suggested to signal that I'm a real person with real experience is to know someone in the company who can vouch for me (which I almost never do).",
          "link": "https://news.ycombinator.com/item?id=42535276",
          "publishedOn": "2024-12-28T22:15:23.000Z",
          "wordCount": null,
          "title": "New comment by MrMember in \"I automated my job application process\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42534096",
          "author": "scosman",
          "description": "\"I don't understand most of the technical details of Apple's blog post\"\nI do:\n- Client side vectorization: the photo is processed locally, preparing a non-reversible vector representation before sending (think semantic hash).\n- Differential privacy: a decent amount of noise is added the the vector before sending it. Enough to make it impossible to reverse lookup the vector. The noise level here is ε = 0.8, which is quite good privacy.\n- OHTTP relay: it's sent through a 3rd party so Apple never knows your IP address. The contents are encrypted so the 3rd party never doesn't learn anything either (some risk of exposing \"IP X is an apple photos user\", but nothing about the content of the library).\n- Homomorphic encryption: The lookup work is performed on server with encrypted data. Apple can't decrypt the vector contents, or response contents. Only the client can decrypt the result of the lookup.\nThis is what a good privacy story looks like. Multiple levels of privacy security, when any one of the latter 3 should be enough alone to protect privacy.\n\"It ought to be up to the individual user to decide their own tolerance for the risk of privacy violations.\" -> The author themselves looks to be an Apple security researcher, and are saying they can't make an informed choice here.\nI'm not sure what the right call is here. But the conclusion \"Thus, the only way to guarantee computing privacy is to not send data off the device.\" isn't true. There are other tools to provide privacy (DP, homomorphic encryption), while also using services. They are immensely complicated, and user's can't realistically evaluate risk. But if you want features that require larger-than-disk datasets, or frequently changing content, you need tools like this.",
          "link": "https://news.ycombinator.com/item?id=42534096",
          "publishedOn": "2024-12-28T20:03:43.000Z",
          "wordCount": 23474,
          "title": "New comment by scosman in \"Apple Photos phones home on iOS 18 and macOS 15\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42533327",
          "author": "HarHarVeryFunny",
          "description": "Maybe not your company, but it seems hiring companies brought this upon themselves with immediate AI rejects of qualified candidates, ghost jobs, ghosting candidates after interview, etc, etc.\nIf it takes a qualified candidate 100's of applications to land a single interview, then can you blame someone for automating it? I'd say that having the initiative and ability to automate it well would make this guy a great hire, if he hadn't already found a job!",
          "link": "https://news.ycombinator.com/item?id=42533327",
          "publishedOn": "2024-12-28T18:41:49.000Z",
          "wordCount": 5735,
          "title": "New comment by HarHarVeryFunny in \"I automated my job application process\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42532172",
          "author": "vikingerik",
          "description": "Just to clarify on the facts, as gathered from reddit threads:\nHe wasn't trying to protest the dress code or make a scene, it wasn't on his mind at all.  He had been out for an appearance with a sponsor during a break, then came back to the venue for the next round, and didn't notice that he was wearing jeans and it didn't cross his mind that that would be a violation.\nThen he was told to change, and there wasn't enough time for him to go do that before the upcoming round.  He thought he was told he could do it either after that round or for the next day, but then was told he would be excluded from that round, and at that point he said f--- it and withdrew entirely.\nThe controversy was about exactly how the penalty is imposed.  The rule is a fine for the first violation and disqualification for multiple.  It wasn't clear if his appearance for the day would count as one violation (so he could just incur the fine and wear correct clothing tomorrow), or if each round would be a separate violation.  It also wasn't clear if he could play while in violation or would be excluded from each round until he changed.  Precedent from other events wasn't clear for either of these.\nThe headline of \"disqualified\" is wrong and did not happen - he chose to withdraw.",
          "link": "https://news.ycombinator.com/item?id=42532172",
          "publishedOn": "2024-12-28T16:36:23.000Z",
          "wordCount": null,
          "title": "New comment by vikingerik in \"Carlsen quits World Rapid and Blitz championship after dress code disagreement\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42527809",
          "author": "noodlesUK",
          "description": "There are significant downsides to the digitalization of travel documents. The biggest one I can think of is ownership - the UK is moving to an entirely digital visa system and bringing in an ESTA style system called ETA for visa free countries. Unfortunately this means that residency cards for noncitizens are being phased out. This means that when the Home Office messes up and accidentally deletes your immigration status, or you are at an airport with no internet access, you have no evidence whatsoever of what status you hold. It also means you will no longer be in possession of any records that might be useful years in the future when the current database containing immigration records will likely have been replaced. It’s much easier to keep a piece of paper around for 30+ years than it is to make sure a digital record doesn’t rot in that time.\nI feel strongly that any future digital travel credentials that are offered by governments should be able to operate entirely offline, and provide records that can be retained by the data subject. That means that revocation is harder, but IMO that’s a tradeoff that is worth making to avoid another Windrush scandal.\nThis has already become a pain when dealing with countries that don’t stamp passports, because when you need to apply for something that asks for your travel history over the past 10 years, you might not have any records anymore.",
          "link": "https://news.ycombinator.com/item?id=42527809",
          "publishedOn": "2024-12-28T01:40:00.000Z",
          "wordCount": null,
          "title": "New comment by noodlesUK in \"The paper passport's days are numbered\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42527549",
          "author": "dlisboa",
          "description": "Coming from a Latin American the idea of re-starting your life across the country for college and then again for work (multiple times sometimes) while away from family and friends is very foreign.\nA lot of the conversation around modern American youth feeling isolated, lacking socialization and not building strong relationships seems that stem from this drive.\nAnother thing that’s really weird and related is another recurring theme in the American ethos: the cultural shame that comes with living “at home” or staying in the same small town for your whole life. Somehow they made it so living close to your family and friends for your 20s-30s  and maybe forever means you’re a “loser”.",
          "link": "https://news.ycombinator.com/item?id=42527549",
          "publishedOn": "2024-12-28T00:51:31.000Z",
          "wordCount": null,
          "title": "New comment by dlisboa in \"Should more of us be moving to live near friends?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42522209",
          "author": "paxys",
          "description": "I don't understand why they are spending so much time and effort trying to put a positive spin on this whole for-profit thing. No one is buying it. We all know what's going on. Just say \"we want to make lots of money\" and move on with your lives.",
          "link": "https://news.ycombinator.com/item?id=42522209",
          "publishedOn": "2024-12-27T14:17:28.000Z",
          "wordCount": 4450,
          "title": "New comment by paxys in \"Why OpenAI's Structure Must Evolve to Advance Our Mission\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/Personal-endebtment-and-debt",
          "author": "Jean Andreau",
          "description": "The year 2025 is considered by Christians to be a jubilee year under the banner of debt cancellation. To mark the occasion, the CADTM is republishing a series of articles on debt cancellation, the struggles for debt cancellation and the role of debt in political, social and geostrategic conflicts throughout history. \nEnglish\n\n/ \nAlternatives, \nDebt in History, \nHistoire Jubi EN",
          "link": "https://www.cadtm.org/Personal-endebtment-and-debt",
          "publishedOn": "2024-12-30T08:00:00.000Z",
          "wordCount": 5975,
          "title": "Personal endebtment and debt forgivness in the Roman empire",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L153xH80/7d67b536955c2d468284cb35bf57de-31f2b.png"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=9041",
          "author": "disassociated.com",
          "description": "From yesterday, 1 January 2025, the price of a ten-year Australian passport rose to four-hundred-and-twelve Australian dollars. That’s the cost of thirty-five pints of Victoria Bitter at the local pub. Happy New Year. As a comparison, the new price converts to a little over two-hundred-and-fifty dollars American, a little under two-hundred-and-fifty Euros, and about two-hundred […]",
          "link": "https://disassociated.com/australian-passport-worlds-most-expensive/",
          "publishedOn": "2025-01-01T20:00:58.000Z",
          "wordCount": 241,
          "title": "Australia, land of the most expensive passport in the world",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9038",
          "author": "disassociated.com",
          "description": "Maxwell Neely-Cohen, writing for Harvard Law School’s Library Innovation Lab: If you, right now, had the goal of digitally storing something for 100 years, how should you even begin to think about making that happen? How should the bits in your stewardship be stored with such a target in mind? How do our methods and […]",
          "link": "https://disassociated.com/storing-digital-data-one-hundred-years/",
          "publishedOn": "2025-01-01T19:30:22.000Z",
          "wordCount": 312,
          "title": "Storing digital data for one hundred years: how is this possible?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9035",
          "author": "disassociated.com",
          "description": "The annual Hottest 100 countdown is part and parcel of the Australian music scene. Hosted by Australian indie radio station Triple J, since 1978, the poll gives listeners the chance to vote for their favourite music of the previous year. The countdown itself takes place on Saturday 25 January 2025. I don’t always listen in […]",
          "link": "https://disassociated.com/voting-open-2024-triple-j-hottest-100-music-poll/",
          "publishedOn": "2025-01-01T19:00:10.000Z",
          "wordCount": 196,
          "title": "Voting open for the 2024 Triple J Hottest 100 music poll",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9030",
          "author": "disassociated.com",
          "description": "The concept of gravastars (or gravitational vacuum stars) is a fascinating alternative to the idea of black holes, although if their presence were ever proved, they would not rule out the existence of black holes. Proposed by Pawel O. Mazur and Emil Mottola some twenty years ago, these objects are consistent with Albert Einstein’s general […]",
          "link": "https://disassociated.com/gravastars-black-holes-weird-cosmic-double-act/",
          "publishedOn": "2025-01-01T18:30:02.000Z",
          "wordCount": 270,
          "title": "Gravastars and black holes, a weird cosmic double act",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9015",
          "author": "disassociated.com",
          "description": "Code is code, what difference does the font you choose in whatever app you use for coding possibly make? As long as the code works as intended, what does appearance have to do with it? But the conversation I found on the topic — which in fact started months ago — actually relates to a […]",
          "link": "https://disassociated.com/favourite-monospaced-font-coding/",
          "publishedOn": "2024-12-30T20:00:32.000Z",
          "wordCount": 326,
          "title": "Favourite monospaced font for coding, do people have such a thing?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9021",
          "author": "disassociated.com",
          "description": "Literary writers at The Sydney Morning Herald canvassed critics, editors, and writers, including Jane Sullivan, David Free, Gyan Yankovich, and Beejay Silcox, to determine the best ten books of this century, or the last twenty-five years. Producing such a small list from a relatively long time frame, will doubtless generate discussion. Anyway, Praiseworthy by Alexis […]",
          "link": "https://disassociated.com/ten-best-novels-twenty-first-century/",
          "publishedOn": "2024-12-30T19:30:21.000Z",
          "wordCount": 214,
          "title": "The ten best novels of the twenty-first century to date",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9027",
          "author": "disassociated.com",
          "description": "I’m talking about the Australian downtempo electronica music act, not the public broadcaster of India. In the hubbub of the silly season, I forgot to mention a new album, Tranquil Motion, was released earlier this month. Track it down on Bandcamp, or your favourite music streamer. I could use some tranquil motion right now…",
          "link": "https://disassociated.com/music-tranquil-motion-new-album-all-india-radio/",
          "publishedOn": "2024-12-30T19:00:16.000Z",
          "wordCount": 166,
          "title": "Tranquil Motion, a new album from All India Radio",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": []
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/a-year-in-german-culture",
          "author": null,
          "description": "Gaza and censorship.",
          "link": "https://newleftreview.org/sidecar/posts/a-year-in-german-culture",
          "publishedOn": "2024-12-31T15:30:46.000Z",
          "wordCount": 2275,
          "title": "Thomas Meaney: &ldquo;A Year in German Culture&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/12/csm-kosmos-klee-nordzimmer-6fbb647a2d.jpg"
        }
      ]
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    },
    {
      "title": "News Minimalist",
      "feedUrl": "https://rss.beehiiv.com/feeds/4aF2pGVAEN.xml",
      "siteUrl": "https://newsletter.newsminimalist.com/",
      "articles": [
        {
          "id": "https://newsletter.newsminimalist.com/p/new-ai-tool-will-identify-diabetes-risk-13-years-early-2-more-stories",
          "author": null,
          "description": "NHS launches trial for AI diabetes prediction; Eni unveils €100 million supercomputer for energy; UN Security Council approves peacekeeping in Somalia.",
          "link": "https://newsletter.newsminimalist.com/p/new-ai-tool-will-identify-diabetes-risk-13-years-early-2-more-stories",
          "publishedOn": "2024-12-28T17:44:35.000Z",
          "wordCount": 6692,
          "title": "New AI tool will identify diabetes risk 13 years early + 2 more stories",
          "imageUrl": "https://beehiiv-images-production.s3.amazonaws.com/uploads/publication/thumbnail/d0318cb6-0493-4e34-b055-76456e6c0f76/landscape_template__3_.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}