{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "d9bc4ab0950931ef589e91784abcf2b095b29367",
          "author": "Channy Yun (윤석찬)",
          "description": "Unleash your creativity: Stable Diffusion 3.5 Large in Amazon Bedrock generates stunning high-resolution images with superior detail, style variety, and prompt adherence for accelerated visual content creation.",
          "link": "https://aws.amazon.com/blogs/aws/stable-diffusion-3-5-large-is-now-available-in-amazon-bedrock/",
          "publishedOn": "2024-12-19T19:22:10.000Z",
          "wordCount": 1715,
          "title": "Stable Diffusion 3.5 Large is now available in Amazon Bedrock",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/12/17/Bedrock-stabilityAI.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": []
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps & Developer Productivity Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": []
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/d2fb8e9ba1c6",
          "author": "Netflix Technology Blog",
          "description": "David J. Berg*, David Casler^, Romain Cledat*, Qian Huang*, Rui Lin*, Nissan Pow*, Nurcan Sonmez*, Shashank Srikanth*, Chaoying Wang*…",
          "link": "https://netflixtechblog.com/introducing-configurable-metaflow-d2fb8e9ba1c6?source=rss----2615bd06b42e---4",
          "publishedOn": "2024-12-20T07:11:37.000Z",
          "wordCount": 6583,
          "title": "Introducing Configurable Metaflow",
          "imageUrl": "https://miro.medium.com/v2/resize:fit:1143/1*XrOVl25ZLx8_4nHLRxNgDg.png"
        }
      ]
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": []
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=347817",
          "author": "L. Michael Hager",
          "description": "Amnesty International (AI) issued its 296-page report ('You Feel Like You Are Subhuman: Israel's Genocide Against Palestinians in Gaza\") on December 4th. Israel immediately called it \"a fabricated report that is entirely false and based on lies.\" The US. State Department echoed the Israeli government in disagreeing with  the report.  Spokesperson Vedant Patel declared: \"We have said previously and continue to find that the allegations of genocide are unfounded.\" He gave no reasons for that opinion. More\nThe post Three Declarations of Genocide and the U.S. Responses appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/24/three-declarations-of-genocide-and-the-u-s-responses/",
          "publishedOn": "2024-12-24T07:00:14.000Z",
          "wordCount": null,
          "title": "Three Declarations of Genocide and the U.S. Responses",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347875",
          "author": "Jamal Kanj",
          "description": "Since the 1993 Oslo Accord, Israel has invaded Jenin Camp numerous times. The City of Jenin and the nearby camp are in what is considered as Area A of the Accord. Area A, which comprises approximately 18% of the West Bank, or 18% of the 22% of historical Palestine, is supposed to be under the  More\nThe post Palestinian Authority: Protecting the “Homeland,” or a New Zionist Bantustan appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/24/palestinian-authority-protecting-the-homeland-or-a-new-zionist-bantustan/",
          "publishedOn": "2024-12-24T06:57:51.000Z",
          "wordCount": null,
          "title": "Palestinian Authority: Protecting the “Homeland,” or a New Zionist Bantustan",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347880",
          "author": "Haymarket Books - Spectre Journal",
          "description": "Syrians have overthrown Bashar al-Assad’s brutal dictatorship, liberated cities, freed political prisoners, and opened space to struggle for an inclusive, democratic, egalitarian country. But imperial, regional, and internal forces are angling to contain the revolution. Join this Spectre Live! webinar led by Joseph Daher, Leila al-Shami, Yasser Munif, and Spectre’s Shireen Akram-Boshar to learn about  More\nThe post After the Fall of Assad: The Struggle for a Free Syria appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/24/after-the-fall-of-assad-the-struggle-for-a-free-syria/",
          "publishedOn": "2024-12-24T06:57:19.000Z",
          "wordCount": null,
          "title": "After the Fall of Assad: The Struggle for a Free Syria",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347903",
          "author": "Binoy Kampmark",
          "description": "The NSO Group, Israel’s darling of malware infection and surveillance for the global security market, was the brainchild of three engineers drawn from that busiest of cyber outfits in the Israeli Defense Forces known as Unit 8200.  Niv Carmi, Shalev Hulio and Omri Lavie, have certainly made an impression since they founded their technology company in 2010. The  More\nThe post Catching Pegasus: Mercenary Spyware and the Liability of the NSO Group appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/24/catching-pegasus-mercenary-spyware-and-the-liability-of-the-nso-group/",
          "publishedOn": "2024-12-24T06:55:51.000Z",
          "wordCount": null,
          "title": "Catching Pegasus: Mercenary Spyware and the Liability of the NSO Group",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347905",
          "author": "Thomas Knapp",
          "description": "It’s “year in review” time for most political columnists, so here’s my opinion on 2024, along with a recommendation for 2025. Opinion: Zero out of ten, would not recommend. If you’re reading this in the year 2525 as you’re preparing to test a time machine and trying to decide what past year to visit, avoid  More\nThe post Happy Holidays (There Ought to be a Law to Help With That) appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/24/happy-holidays-there-ought-to-be-a-law-to-help-with-that/",
          "publishedOn": "2024-12-24T06:55:02.000Z",
          "wordCount": null,
          "title": "Happy Holidays (There Ought to be a Law to Help With That)",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347804",
          "author": "Julian McBride",
          "description": "Against the backdrop of nearly 11 years of total war in Ukraine, Russia and North Korea are increasing military cooperation into a full military defense pact. Both Pyongyang and Moscow have signed a mutual defense obligation if either country is attacked. Currently, several thousand North Korean troops have been deployed to fight Ukrainian forces in  More\nThe post Is Russia’s Mutual Defense Pact With North Korea Truly Mutual? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/24/is-russias-mutual-defense-pact-with-north-korea-truly-mutual/",
          "publishedOn": "2024-12-24T06:52:36.000Z",
          "wordCount": null,
          "title": "Is Russia’s Mutual Defense Pact With North Korea Truly Mutual?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347877",
          "author": "Nicolas J S Davies",
          "description": "The United States, Turkey and Israel all responded to the fall of the Assad government in Damascus by launching bombing campaigns on Syria. Israel also attacked and destroyed most of the Syrian Navy in port at Latakia, and invaded Syria from the long-occupied Golan Heights, advancing to within 16 miles of the capital, Damascus. The  More\nThe post Israelis Invade Syria: Who Will Stop Israel? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/24/israelis-invade-syria-who-will-stop-israel/",
          "publishedOn": "2024-12-24T06:40:08.000Z",
          "wordCount": null,
          "title": "Israelis Invade Syria: Who Will Stop Israel?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347770",
          "author": "Rachel Blaser",
          "description": "We named him Squirt – not because he was the smallest of the 16 cuttlefish in the pool, but because anyone with the audacity to scoop him into a separate tank to study him was likely to get soaked. Squirt had notoriously accurate aim. As a comparative psychologist, I’m used to assaults from my experimental  More\nThe post On the Consciousness of Cephalopods appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/24/on-the-consciousness-of-cephalopods/",
          "publishedOn": "2024-12-24T06:37:52.000Z",
          "wordCount": null,
          "title": "On the Consciousness of Cephalopods",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347929",
          "author": "Giorgos Mitralias",
          "description": "Thousands and thousands of Syrians of all ages dancing and embracing, weeping and singing, waving the country’s new flag and celebrating the end of tyranny, in the center of Syrian cities but also in Paris, Istanbul and Moscow, in Berlin or Stockholm, everywhere in the world where the almost 7 million Syrians driven from their  More\nThe post The Syrian People Have Freed Themselves, Who Will Wake the Amnesiacs? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/24/the-syrian-people-have-freed-themselves-who-will-wake-the-amnesiacs/",
          "publishedOn": "2024-12-24T06:31:09.000Z",
          "wordCount": null,
          "title": "The Syrian People Have Freed Themselves, Who Will Wake the Amnesiacs?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347738",
          "author": "Richard D. Wolff",
          "description": "The Republicans (GOP), traditionally the U.S.’s anti-tax party, now promise to use tariffs to wage trade wars, to massively deport immigrants, and to stop drug traffic. But tariffs are simply the name of one kind of tax (on imported goods and services). So the GOP becomes both anti-tax and pro-tax. Likewise, the traditional party of minimal government, today’s GOP now favors massive subsidies to industries that big government will select as well as economic sanctions and bans on enterprises and whole countries that big government will select. Beyond the right-wing ideology and financial self-serving, Trump reflects deeper contradictions in the GOP’s evolution. More\nThe post Political Economy Contradictions as We Lurch Into 2025 appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/23/political-economy-contradictions-as-we-lurch-into-2025/",
          "publishedOn": "2024-12-23T07:01:50.000Z",
          "wordCount": null,
          "title": "Political Economy Contradictions as We Lurch Into 2025",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347769",
          "author": "Marcy Winograd",
          "description": "Launched in 1913 to counter antisemitism and discrimination, the Anti-Defamation League (ADL) now resembles a mythological shapeshifter that presents alternately as a civil rights organization and a pro-Israel propagandist.\nIn its “No Place for Hate” program that caters to both elementary and secondary schools, the ADL’s stated mission is to empower students, teachers and parents to “stand against bias and bullying ...” with school-wide pledges, projects and games aimed at celebrating diversity and stamping out hate in the halls, in the cafeteria, in the reading circle, anywhere that hate may manifest. More\nThe post Schools are No Place for the ADL appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/23/schools-are-no-place-for-the-adl/",
          "publishedOn": "2024-12-23T07:01:37.000Z",
          "wordCount": null,
          "title": "Schools are No Place for the ADL",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347730",
          "author": "Cal Winslow",
          "description": "The extraordinary thing about this strike is that it really is a strike for patients and for the public’s health, a strike for mental health care parity, a strike in a time of acute mental healthcare crisis in this country. Perhaps never before has depression and anxiety and increasingly suicide reached into the lives of so many people and their families. This strike is about equity in behavioral health care. The strikers have told me this time and again. They insist they would rather be with their patients, not on a picket line, but they can’t keep working in a system that treats mental health workers like automatons and denies them the time and resources to provide the care they know their patients need.  More\nThe post The Strike at Kaiser Permanente:  California Mental Healthcare Workers Demand Parity appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/23/the-strike-at-kaiser-permanente-california-mental-healthcare-workers-demand-parity/",
          "publishedOn": "2024-12-23T07:00:45.000Z",
          "wordCount": null,
          "title": "The Strike at Kaiser Permanente:  California Mental Healthcare Workers Demand Parity",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347519",
          "author": "Ramzy Baroud",
          "description": "Israel is getting ready to annex the occupied Palestinian West Bank. The annexation will be a major step backward on the road to Palestinian freedom and will likely serve as a catalyst for a new Palestinian uprising. Though annexation has been on the Israeli agenda for years, this time around a ‘great opportunity’ – in  More\nThe post Israel to Annex the West Bank – Why Now? And What are the Likely Scenarios? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/23/israel-to-annex-the-west-bank-why-now-and-what-are-the-likely-scenarios/",
          "publishedOn": "2024-12-23T06:58:50.000Z",
          "wordCount": null,
          "title": "Israel to Annex the West Bank – Why Now? And What are the Likely Scenarios?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347773",
          "author": "Nuvpreet Kalra - Tim Biondo",
          "description": "Earlier this month, the company that brings us ChatGPT announced its partnership with California-based weapons company, Anduril, to produce AI weapons. The OpenAI-Anduril system, which was tested in California at the end of November, permits the sharing of data between external parties for decision making on the battlefield. This fits squarely within the US military and OpenAI’s  More\nThe post OpenAI is Using its Technology to Kill appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/23/openai-is-using-its-technology-to-kill/",
          "publishedOn": "2024-12-23T06:57:43.000Z",
          "wordCount": null,
          "title": "OpenAI is Using its Technology to Kill",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347734",
          "author": "Dean Baker",
          "description": "Virtually everyone, except Elon Musk, agrees that the rich have too much political power these days. When a single individual can put tens or even hundreds of millions of dollars behind their favored candidate, it seriously distorts democracy. Unfortunately, there are few serious strategies for addressing this problem. Given the Supreme Court’s ruling in Citizens  More\nThe post Fixing the Media and Campaign Spending by the Rich appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/23/fixing-the-media-and-campaign-spending-by-the-rich/",
          "publishedOn": "2024-12-23T06:56:47.000Z",
          "wordCount": null,
          "title": "Fixing the Media and Campaign Spending by the Rich",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347826",
          "author": "Binoy Kampmark",
          "description": "Of late, a spate of incidents has taken place in Australia giving sheer delight to the simian-resembling Opposition Leader, Peter Dutton.  On a visit to South Australia, he showed himself to be merrily divisive in attacking protestors who had shown solidarity for Palestinians in Gaza in the wake of their catastrophic suffering since October last year: “If you allow  More\nThe post The Strawman of Antisemitism: Banning Protests Against Israel Down Under appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/23/the-strawman-of-antisemitism-banning-protests-against-israel-down-under/",
          "publishedOn": "2024-12-23T06:55:36.000Z",
          "wordCount": null,
          "title": "The Strawman of Antisemitism: Banning Protests Against Israel Down Under",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347824",
          "author": "Damon Orion",
          "description": "Author, journalist, and child advocacy expert Richard Louv famously coinedthe term “nature deficit disorder” to describe the detrimental effects of children’s disconnection from nature. His assertions are backed by data that strongly suggests a link between increased exposure to nature and improved cognitive function, brain activity, and mental and physical health. Paraphrasing Louv, nature schoolteacher Angela Garcia notes, “America is completely deficient  More\nThe post Enrollment in Nature Schools Soars as Families Rediscover the Benefits of Outdoor Learning appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/23/enrollment-in-nature-schools-soars-as-families-rediscover-the-benefits-of-outdoor-learning/",
          "publishedOn": "2024-12-23T06:55:15.000Z",
          "wordCount": null,
          "title": "Enrollment in Nature Schools Soars as Families Rediscover the Benefits of Outdoor Learning",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347828",
          "author": "Pavan Kulkarni",
          "description": "The lives of hundreds of thousands in the famine-struck Zamzam camp for internally displaced persons (IDPs) hang in the balance as the paramilitary Rapid Support Forces (RSF) have intensified attacks on North Darfur state’s capital El Fasher. Having overrun the Sudanese Armed Forces (SAF) in the other four states of Darfur, the RSF has besieged this  More\nThe post Besieged and Bombed Amid Famine, Hundreds of Thousands of IDPs Struggle to Survive in Darfur appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/23/besieged-and-bombed-amid-famine-hundreds-of-thousands-of-idps-struggle-to-survive-in-darfur/",
          "publishedOn": "2024-12-23T06:54:20.000Z",
          "wordCount": null,
          "title": "Besieged and Bombed Amid Famine, Hundreds of Thousands of IDPs Struggle to Survive in Darfur",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347741",
          "author": "Jim Kavanagh",
          "description": "I am finding it very hard to swallow the disaster that has occurred in Syria, or to digest its consequences. It makes me sick. Though it foresaw the looming disaster, my last article was written just before the flight of Assad and the fall of Damascus, and it was still possible to imagine there might  More\nThe post Swallowing Syria appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/23/swallowing-syria/",
          "publishedOn": "2024-12-23T06:52:49.000Z",
          "wordCount": null,
          "title": "Swallowing Syria",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347729",
          "author": "Victor Grossman",
          "description": "It’s reached that time again, a time to look forward but also, for an old geezer like me, to look backward. Being 96 for a while yet (until  March), I can permit myself some retrospection (while noting that those two digits, if only reversed and embodied, might well have been greatly preferable. Wot-the-hell, while I can  More\nThe post Looking Backward, Autobiographically appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/23/looking-backward-autobiographically/",
          "publishedOn": "2024-12-23T06:37:44.000Z",
          "wordCount": null,
          "title": "Looking Backward, Autobiographically",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347767",
          "author": "Karl Grossman",
          "description": "The Cold Spring Harbor Laboratory, a private research laboratory, is located on Long Island, New York, where I live. Its outrageous history is detailed in a forthcoming book, “Long Island and the Legacy of Eugenics: Station of Intolerance.” The book, by Mark A. Torres, an attorney as well as an author, will be released by  More\nThe post Long Island’s Station of Intolerance. appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/23/long-islands-station-of-intolerance/",
          "publishedOn": "2024-12-23T06:28:42.000Z",
          "wordCount": null,
          "title": "Long Island’s Station of Intolerance.",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347508",
          "author": "Scott Remer",
          "description": "Image by Tim Mossholder. Image by Tim Mossholder. Image by Tim Mossholder. Image by Tim Mossholder. Image by Tim Mossholder. Image by Tim Mossholder. Image by Tim Mossholder. Image by Tim Mossholder. Image by Tim Mossholder. Image by Tim Mossholder. Image by Tim Mossholder. Image by Tim Mossholder. Image by Tim Mossholder. Image by Tim […]\nTo read this article, log in here or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post A Nation of Immigrants? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/22/a-nation-of-immigrants-3/",
          "publishedOn": "2024-12-22T07:59:09.000Z",
          "wordCount": null,
          "title": "A Nation of Immigrants?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347725",
          "author": "Kent Paterson",
          "description": "“We’ve shown that this struggle is not in vain. We are here, the relatives and survivors of the Dirty War, and thanks to our relatives who had to participate in an armed struggle against a tyranny that was called democracy. They are the important ones,” Judith Galarza said. “We will thank all the recognitions, but it’s for them, our brothers and sisters who sacrificed their lives, their safety and their children to struggle for all the children of Mexico, for a just society so our children will have food, education, culture, sports, like what is happening now.”\nTo read this article, log in here or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Mexico’s Dirty War, 50 Years Later appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/22/mexicos-dirty-war-50-years-later/",
          "publishedOn": "2024-12-22T06:56:12.000Z",
          "wordCount": null,
          "title": "Mexico’s Dirty War, 50 Years Later",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347637",
          "author": "Jeffrey St. Clair",
          "description": "US delegation led by Anthony Blinken meeting with Netanyahu and his war cabinet. Photo: US State Department. US delegation led by Anthony Blinken meeting with Netanyahu and his war cabinet. Photo: US State Department. US delegation led by Anthony Blinken meeting with Netanyahu and his war cabinet. Photo: US State Department. US delegation led by […]\nTo read this article, log in here or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post “We Just Do What the Israelis Want Us to Do” appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/21/we-just-do-what-the-israelis-want-us-to-do/",
          "publishedOn": "2024-12-21T15:14:37.000Z",
          "wordCount": null,
          "title": "“We Just Do What the Israelis Want Us to Do”",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347551",
          "author": "Melvin Goodman",
          "description": "Biden and his national security team believe they can “contain” China; they can’t.  The U.S.-China relationship is important in all policy areas: political, economic, environmental, and military.  The United States and China have the two largest economies in the world, and are the world’s two greatest emitters of greenhouse gasses.  China leads the world in the production of solar cells and panels, lithium-ion batteries, and electric vehicles; the United States is far behind in these areas and the promotion of increased tariffs on these items will not help the deteriorating environmental situation.  The environmental challenge cannot be resolved without Sino-American cooperation. More\nThe post US China Policy: Too Late, Too Little to Offer appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/20/us-china-policy-too-late-too-little-to-offer/",
          "publishedOn": "2024-12-20T07:02:55.000Z",
          "wordCount": null,
          "title": "US China Policy: Too Late, Too Little to Offer",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347540",
          "author": "Todd Miller",
          "description": "When I first meet the fisherman Gerardo Delgado, he is sitting in his boat, surrounded by pelicans, off the shore of Lake Toronto, in central south Chihuahua, Mexico. Perhaps the pelicans are waiting for Delgado to toss a fillet, but his catch is, yet again, meager. In the last couple of years, it’s been hard to make a living from fishing on the lake. I am with another fisherman, Alonso Montañes, and we approach Delgado on a motorboat. More\nThe post “Está Cabrón”: An End-of-Year Reflection on a World at the Crossroads appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/20/esta-cabron-an-end-of-year-reflection-on-a-world-at-the-crossroads/",
          "publishedOn": "2024-12-20T06:59:57.000Z",
          "wordCount": null,
          "title": "“Está Cabrón”: An End-of-Year Reflection on a World at the Crossroads",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347300",
          "author": "Jeffrey St. Clair",
          "description": "2024 will be the warmest year on record, the year warming topped 1.5 degrees Celsius. It’s the year the US set new oil and gas production records, surpassing Saudi Arabia and Russia. It’s a year that saw the US re-elect a climate denier who vows to double US oil production over these record levels, assuming that’s even possible.  It’s a year that saw two of the most destructive hurricanes in US history roar back-to-back across the Gulf Coast. It's the year the temperatures in the Atlantic basin shattered records, the Arctic Ocean went ice-free, and the Atlantic Current continued to collapse. It’s the year a tropical cyclone demolished the French colony of Mayotte, killing as many as 10,000 people. It’s the year the UN climate conference, held in the oil city of Baku, failed to reach an agreement on phasing out fossil fuels and committed to providing less than a third of the annual climate funding needed for developing nations to transition from fossil fuels. It’s the year when CO2 levels hit 425.01 PPM, nearly 3 PPM more than last year’s record high. It’s the year when wildfires in Canada burned all year long. More\nThe post Hell and High Water: the Year in Climate Chaos appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/20/hell-and-high-water-the-year-in-climate-chaos/",
          "publishedOn": "2024-12-20T06:59:11.000Z",
          "wordCount": null,
          "title": "Hell and High Water: the Year in Climate Chaos",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347299",
          "author": "CounterPunch Radio",
          "description": "On this episode of CounterPunch Radio, Silky Shah and Eman Abdelhadi join Joshua Frank and Erik Wallenberg to discuss how we should gear up to take on the Trump administration, and the best way to empower our movements going forward, from immigration to Palestine. https://content.blubrry.com/counterpunch_radio/SilkyandEman.mp3  \nThe post Silky Shah & Eman Abdelhadi: The Battles Ahead appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/20/silky-shah-eman-abdelhadi-the-battles-ahead-2/",
          "publishedOn": "2024-12-20T06:58:48.000Z",
          "wordCount": null,
          "title": "Silky Shah & Eman Abdelhadi: The Battles Ahead",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347550",
          "author": "Dan Glazebrook",
          "description": "Although Russia might have found it difficult to commit large numbers of its own troops to Syria, it could certainly have subsidised the salaries of Syrian army soldiers, which could well have gone some way to mitigating the mundane bread-and-butter defections and passivity within the Syrian army. It chose not to do so, presumably for a reason. More\nThe post Did Putin Make a Deal Over Syria? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/20/did-putin-make-a-deal-over-syria/",
          "publishedOn": "2024-12-20T06:58:21.000Z",
          "wordCount": null,
          "title": "Did Putin Make a Deal Over Syria?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347395",
          "author": "Eve Ottenberg",
          "description": "It’s been a bad few months for democracy. Election results offensive to the European Union were annulled in Romania; an attempted coup occurred in Georgia over elections that didn’t go the way the west wanted; the French government, widely hated, teetered over the abyss as president Emmanual Macron tried to ignore the last election; on December 16, Washington’s pet German government fell; lots of funny-business happened in the Moldovan referendum and election, amid widespread disenfranchisement of Moldovan voters living in Russia; elections were long ago cancelled in dictatorial Ukraine; and South Korea hosted an attempted coup. In short, western democracies’ storied enchantment with elections is over. More\nThe post The West’s Romance With Elections Is Dead…the Rules-Based Order Killed It appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/20/the-wests-romance-with-elections-is-dead-the-rules-based-order-killed-it/",
          "publishedOn": "2024-12-20T06:58:14.000Z",
          "wordCount": null,
          "title": "The West’s Romance With Elections Is Dead…the Rules-Based Order Killed It",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=284448",
          "author": "Yves Smith",
          "description": "Our holidazed daily links: blind cat rescue, early cocaine, a case for lower populations, moar US v. China chips, Galapagos base, EU electricity taxes, Israel child murders, Fico, Erdogan threat display v. Kurds (as in US), Walmart shopper surveillance, Biden death row pardon row, Gaetz rap sheet, Fed bank regs rethink",
          "link": "https://www.nakedcapitalism.com/2024/12/links-12-24-2024.html",
          "publishedOn": "2024-12-24T11:55:07.000Z",
          "wordCount": 3992,
          "title": "Links 12/24/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/1734969039400blob.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284361",
          "author": "Nick Corbishley",
          "description": "\"Both the USMCA and this ruling issued by the trade dispute panel are designed primarily to protect the interests of transnational corporations.\"",
          "link": "https://www.nakedcapitalism.com/2024/12/with-help-of-usmca-biden-administration-strikes-decisive-blow-against-mexican-food-sovereignty-health-and-global-biodiversity.html",
          "publishedOn": "2024-12-24T11:45:09.000Z",
          "wordCount": 5028,
          "title": "With Help From NAFTA 2.0, US Strikes Brutal Blow Against Mexican Food Sovereignty, Health and Global Biodiversity",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284526",
          "author": "Yves Smith",
          "description": "Israel is in the midst of a land grab in Syria. Ex Ansar Allah, the disapproving world majority merely finger-wags.",
          "link": "https://www.nakedcapitalism.com/2024/12/israelis-invade-syria-who-will-stop-israel.html",
          "publishedOn": "2024-12-24T10:50:06.000Z",
          "wordCount": 4742,
          "title": "Israelis Invade Syria: Who Will Stop Israel?",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284450",
          "author": "Lambert Strether",
          "description": "In CDC's approach to Hospital Acquired Infections, strategies to prevent the spread of pathogens through the air  are ignored or downplayed.",
          "link": "https://www.nakedcapitalism.com/2024/12/cdcs-research-program-on-hospital-acquired-infections-hais-has-nothing-on-airborne-transmission-at-all.html",
          "publishedOn": "2024-12-23T22:25:05.000Z",
          "wordCount": 6166,
          "title": "CDC’s Research Program on Hospital-Acquired Infections (HAIs) Minimizes Airborne Transmission",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284453",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, Syndemics; Trump to pull out of WHO; Covid and the brain; Boeing 737 crashes not due to MCAS?!; Quantum consciousness ~",
          "link": "https://www.nakedcapitalism.com/2024/12/12-200pm-water-cooler-12-23-2024.html",
          "publishedOn": "2024-12-23T19:00:58.000Z",
          "wordCount": 13839,
          "title": "2:00PM Water Cooler 12/23/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/covid19-is-not-airborne.jpeg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284421",
          "author": "Conor Gallagher",
          "description": "",
          "link": "https://www.nakedcapitalism.com/2024/12/links-12-23-2024.html",
          "publishedOn": "2024-12-23T11:55:27.000Z",
          "wordCount": 19386,
          "title": "Links 12/23/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/Screenshot-2024-12-22-at-8.41.42 PM-e1734925486718.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284425",
          "author": "Conor Gallagher",
          "description": "More hidden than rising seas or heatwaves, long-term changes in the nutritional value of plants could be even more disruptive.",
          "link": "https://www.nakedcapitalism.com/2024/12/climate-change-is-making-plants-less-nutritious-%e2%88%92-that-could-already-be-hurting-animals-that-are-grazers.html",
          "publishedOn": "2024-12-23T09:00:01.000Z",
          "wordCount": 4723,
          "title": "Climate Change Is Making Plants Less Nutritious − That Could Already Be Hurting Animals That Are Grazers",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/Screenshot-2024-12-22-at-9.37.44 PM-765x1024.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284403",
          "author": "Yves Smith",
          "description": "We've kicking back a bit over the holiday season, but not to worry. We'll have new fare and updates every day. Best wishes for 2025!",
          "link": "https://www.nakedcapitalism.com/2024/12/holiday-schedule-and-moderation-holiday.html",
          "publishedOn": "2024-12-22T17:12:58.000Z",
          "wordCount": 3810,
          "title": "Holiday Schedule and Moderation Holiday",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/Screen-Shot-2024-12-23-at-12.02.31-AM-201x300.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284348",
          "author": "Conor Gallagher",
          "description": "",
          "link": "https://www.nakedcapitalism.com/2024/12/link-12-22-2024.html",
          "publishedOn": "2024-12-22T11:55:04.000Z",
          "wordCount": 15063,
          "title": "Link 12/22/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/Screenshot-2024-12-21-at-4.55.22 AM-1024x726.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284376",
          "author": "Conor Gallagher",
          "description": "Ignoring the true causes of the homeless crisis while expanding the carceral state helps discipline labor.",
          "link": "https://www.nakedcapitalism.com/2024/12/the-us-embrace-of-incarceration-for-the-homeless-is-a-win-win-for-the-plutocrats.html",
          "publishedOn": "2024-12-22T11:00:28.000Z",
          "wordCount": 10431,
          "title": "The US Embrace of Incarceration for the Homeless Is a Win-Win for the Plutocrats",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/Screenshot-2024-12-04-at-10.37.17 AM-1024x655.png"
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "5hrEiGd7frxGgAirAdHCM0",
          "author": "João Tomé",
          "description": "From Christmas Eve dinners in Europe to New Year’s Eve countdowns in Asia, Cloudflare data reveals how global festivities have typically shaped Internet usage and cultural rhythms",
          "link": "https://blog.cloudflare.com/when-the-world-logs-off-christmas-new-years-and-the-internets-holiday-rhythm/",
          "publishedOn": "2024-12-24T10:00:00.000Z",
          "wordCount": 2936,
          "title": "When the world logs off: Christmas, New Year’s, and the Internet’s holiday rhythm",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/5AD4eKfR9SW5z1OGQzVTOe/7b13add7b0a6c1143aaf749d4ef68bb7/When_the_world_logs_off-_Christmas__New_Year_s__and_the_Internet_s_holiday_rhythm-OG.png"
        },
        {
          "id": "5yiWFM9NumXY8HARoEP8x6",
          "author": "Avi Jaisinghani",
          "description": "Cloudflare observed a 4x increase in bot-related traffic on Black Friday in 2024. 29% of all traffic on our network on Black Friday was Grinch Bots wreaking holiday havoc.",
          "link": "https://blog.cloudflare.com/grinch-bot-2024/",
          "publishedOn": "2024-12-23T14:01:00.000Z",
          "wordCount": 2036,
          "title": "Grinch Bots strike again: defending your holidays from cyber threats",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/ojlVeSywa5FwEy5uaXWvN/9c04b8e954f32c984a9956c2298fda2b/Grinch_Bots_strike_again-_defending_your_holidays_from_cyber_threats-OG.png"
        },
        {
          "id": "20PQRE3QVidqRIeb9OYby8",
          "author": "João Tomé",
          "description": "In 2024, as elections took place across over 60 countries, the Internet became both a battleground for cyberattacks and a vital platform for democratic engagement.",
          "link": "https://blog.cloudflare.com/elections-2024-internet/",
          "publishedOn": "2024-12-23T14:00:00.000Z",
          "wordCount": 3054,
          "title": "Global elections in 2024: Internet traffic and cyber threat trends",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/7e7RgUK4mC3F5W5nFyQdrC/a9735efab89d42719a621269abbb2dac/Global_elections_in_2024-_Internet_traffic_and_cyber_threat_trends-OG.png"
        },
        {
          "id": "aWV4m3ZRWKcTPXMFuhumH",
          "author": "Dina Kozlov",
          "description": "Want Claude to interact with your app directly? Build an MCP server on Cloudflare Workers, enabling you to connect your service directly, allowing Claude to understand and run tasks on your behalf.",
          "link": "https://blog.cloudflare.com/model-context-protocol/",
          "publishedOn": "2024-12-20T14:50:00.000Z",
          "wordCount": 1713,
          "title": "Hi Claude, build an MCP server on Cloudflare Workers",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2KaRI8bs4IMS9CARSmDQMQ/f956a5212fae938c209cc201df750bd7/Hi_Claude__build_an_MCP_server_on_Cloudflare_Workers-OG.png"
        },
        {
          "id": "HTZlONeYfVQ79aKvAsgxI",
          "author": "Will Allen",
          "description": "Bring ChatGPT to your next video meeting with Cloudflare Calls.",
          "link": "https://blog.cloudflare.com/bring-multimodal-real-time-interaction-to-your-ai-applications-with-cloudflare-calls/",
          "publishedOn": "2024-12-20T14:00:00.000Z",
          "wordCount": 1476,
          "title": "Bring multimodal real-time interaction to your AI applications with Cloudflare Calls",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/1eVNx1FmFUnUNIIeLzREPh/94bbc69eccbeadb7745c63bdf478f701/image1.png"
        },
        {
          "id": "4fVFiDpaCJhYAFUvAocDDC",
          "author": "Ayush Kumar",
          "description": "As threats evolve, SOC teams must adapt their operations. With Cloudflare’s holistic approach to managing user-based risk, SOC teams can operate more efficiently and reduce the likelihood of a breach.",
          "link": "https://blog.cloudflare.com/the-role-of-email-security-in-reducing-user-risk-amid-rising-threats/",
          "publishedOn": "2024-12-19T14:00:00.000Z",
          "wordCount": 2252,
          "title": "The role of email security in reducing user risk amid rising threats",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/74pgqaKfcXIFEGPLtzSLkf/c3d5704dae4e5a3a9a8a4dcd68e7aa76/BLOG-2645_OG.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Engineering at Slack",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=22095",
          "author": null,
          "description": "We’re sharing details about Glean, Meta’s open source system for collecting, deriving, and working with facts about source code. In this blog post we’ll talk about why a system like Glean is important, explain the rationale for Glean’s design, and run through some of the ways we’re using Glean to supercharge our developer tooling at [...]\nRead More...\nThe post Indexing code at scale with Glean appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/12/19/developer-tools/glean-open-source-code-indexing/",
          "publishedOn": "2024-12-19T14:00:29.000Z",
          "wordCount": 3941,
          "title": "Indexing code at scale with Glean",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2022/07/Eng-Blog-Self-Serve-Hero-Images-DEBUGGING-203-Teale-1.jpg"
        },
        {
          "id": "https://engineering.fb.com/?p=22074",
          "author": null,
          "description": "Meta has been on a years-long undertaking to translate our entire Android codebase from Java to Kotlin. Today, despite having one of the largest Android codebases in the world, we’re well past the halfway point and still going. We’re sharing some of the tradeoffs we’ve made to support automating our transition to Kotlin, seemingly simple [...]\nRead More...\nThe post Translating Java to Kotlin at Scale appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/12/18/android/translating-java-to-kotlin-at-scale/",
          "publishedOn": "2024-12-18T17:00:18.000Z",
          "wordCount": 4387,
          "title": "Translating Java to Kotlin at Scale",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2022/11/Eng-Blog-Self-Serve-Hero-Images-ANALYTICS-401-Orange.jpg"
        },
        {
          "id": "https://engineering.fb.com/?p=22060",
          "author": null,
          "description": "How did the Threads iOS team maintain the app’s performance during its incredible growth? Here’s how Meta’s Threads team thinks about performance, including the key metrics we monitor to keep the app healthy. We’re also diving into some case studies that impact publish reliability and navigation latency. When Meta launched Threads in 2023, it became [...]\nRead More...\nThe post How we think about Threads’ iOS performance appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/12/18/ios/how-we-think-about-threads-ios-performance/",
          "publishedOn": "2024-12-18T15:00:44.000Z",
          "wordCount": 4871,
          "title": "How we think about Threads’ iOS performance",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/12/Threads-iOS-Hero_crop2.png"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=42491528",
          "author": "SamPatt",
          "description": "I'm sure the debate over the definition of AGI is important and will continue for a while, but... I can't care about it anymore.\nBetween Perplexity searching and summarizing, Claude explaining, and qwen (and other tools) coding, I'm already as happy as can be with whatever you want to call this level of intelligence.\nJust today I used a completely local AI research tool, based on Ollama. It worked great.\nMaybe it won't get much better? Or maybe it'll take decades instead of years? Ok. I remember not having these tools. I never want to go back.",
          "link": "https://news.ycombinator.com/item?id=42491528",
          "publishedOn": "2024-12-23T03:41:14.000Z",
          "wordCount": 18967,
          "title": "New comment by SamPatt in \"GPT-5 is behind schedule\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42490362",
          "author": "jschafer",
          "description": "Note that the measurements in the paper were made before they fixed a bug where they confused bits and bytes.\nSo SQLite only used 1/8 of the reserved bloom filter space, thus increasing the false positive rate significantly:\nhttps://sqlite.org/src/info/56d9bb7aa63043f5\nI found and reported the bug because I wanted to know how the bloom filters work in SQLite for my uni seminar paper. Still wondering if one can find those kind of bugs with test cases.",
          "link": "https://news.ycombinator.com/item?id=42490362",
          "publishedOn": "2024-12-23T00:11:27.000Z",
          "wordCount": null,
          "title": "New comment by jschafer in \"How bloom filters made SQLite 10x faster\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42488447",
          "author": "jph00",
          "description": "The original answer to \"why does FastMail use their own hardware\" is that when I started the company in 1999 there weren't many options. I actually originally used a single bare metal server at Rackspace, which at that time was a small scrappy startup. IIRC it cost $70/month. There weren't really practical VPS or SaaS alternatives back then for what I needed.\nRob (the author of the linked article) joined a few months later, and when we got too big for our Rackspace server, we looked at the cost of buying something and doing colo instead. The biggest challenge was trying to convince a vendor to let me use my Australian credit card but ship the server to a US address (we decided to use NYI for colo, based in NY). It turned out that IBM were able to do that, so they got our business. Both IBM and NYI were great for handling remote hands and hardware issues, which obviously we couldn't do from Australia.\nA little bit later Bron joined us, and he automated absolutely everything, so that we were able to just have NYI plug in a new machine and it would set itself up from scratch. This all just used regular Linux capabilities and simple open source tools, plus of course a whole lot of Perl.\nAs the fortunes of AWS et al rose and rose and rose, I kept looking at their pricing at features and kept wondering what I was missing. They seemed orders of magnitude more expensive for something that was more complex to manage and would have locked us into a specific vendor's tooling. But everyone seemed to be flocking to them.\nTo this day I still use bare metal servers for pretty much everything, and still love having the ability to use simple universally-applicable tools like plain Linux, Bash, Perl, Python, and SSH, to handle everything cheaply and reliably.\nI've been doing some planning over the last couple of years on teaching a course on how to do all this, although I was worried that folks are too locked in to SaaS stuff -- but perhaps things are changing and there might be interest in that after all?...",
          "link": "https://news.ycombinator.com/item?id=42488447",
          "publishedOn": "2024-12-22T19:26:59.000Z",
          "wordCount": null,
          "title": "New comment by jph00 in \"Why we use our own hardware\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42487432",
          "author": "cassiepaper",
          "description": "From: James Guthrie interview\n> Another piece that worked better than expected was the telephone operator. Roger was keen to illustrate the personal disconnect of being on the road. We were in L.A. at Producer’s Workshop so I phoned my neighbour, Chris Fitzmorris in London. He had the keys to my flat and I asked him to go there and said that I would call him through an operator. “No matter how many times I call”, I said, “just pick up the phone, say ‘Hello’, let the operator speak and then hang up”. I placed a telephone in a soundproof area, got on to an extension phone and started recording to ¼” tape. It took a couple of operators – the first 2 were a bit abrupt, but the 3rd was perfect. I told her that I wanted to make a collect call to Mrs. Floyd. “Who’s calling?” she asked. “Mr. Floyd”, I replied. Chris’s timing was terrific, over and over he would hang up just at the right moment and she became genuinely concerned. “Is there supposed to be someone there besides your wife?” I was playing her along saying things like “No! I don’t know who that is!” “What’s going on?” and she would try the call again. Unwittingly, she was helping to tell the story. Afterwards I went through the ¼” and edited my voice out, just leaving her and Chris. I sometimes wonder if she ever heard herself on the record.\nSource: https://www.brain-damage.co.uk/other-related-interviews/jame...",
          "link": "https://news.ycombinator.com/item?id=42487432",
          "publishedOn": "2024-12-22T16:42:10.000Z",
          "wordCount": 2361,
          "title": "New comment by cassiepaper in \"Decoding the telephony signals in Pink Floyd's 'The Wall'\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42484409",
          "author": "cwzwarich",
          "description": "I was the only person working on it for ~2 years, and I wrote the majority of the code in the first version that shipped. That said, I’m definitely glad that I eventually found someone else (and later a whole team) to work on it with me, and it wouldn’t have been as successful without that.\nWhen people think of a binary translator, they usually just think of the ISA aspects, as opposed to the complicated interactions with the OS etc. that can consume just as much (or even more) engineering effort overall.",
          "link": "https://news.ycombinator.com/item?id=42484409",
          "publishedOn": "2024-12-22T04:38:33.000Z",
          "wordCount": 2562,
          "title": "New comment by cwzwarich in \"Rosetta 2 creator leaves Apple to work on Lean full-time\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42484037",
          "author": "cwzwarich",
          "description": "This is me! Didn’t expect to see this on here, but I’m looking forward to working with everyone else at the Lean FRO and the wider Lean community to help make Lean even better.\nMy background is in mathematics and I’ve had an interest in interactive theorem provers since before I was ever a professional software engineer, so it’s a bit of a dream come true to be able to pursue this full-time.",
          "link": "https://news.ycombinator.com/item?id=42484037",
          "publishedOn": "2024-12-22T02:41:47.000Z",
          "wordCount": null,
          "title": "New comment by cwzwarich in \"Rosetta 2 creator leaves Apple to work on Lean full-time\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42476313",
          "author": "atoav",
          "description": "Please just adhere to the XDG-standards. Although my co-poster here didn't use the most diplomatic way of phrasing their grievance Grayjay is better off if it sticks to well established standards.\nYou would probably look weird at an software that installs itself in C:\\MYAWESOMEAPPLICATION instead of using the Windows program folder like literally every other piece of software (except for legacy stuff like LTSpice). Creating visible directories in the home folder without asking is the Linux equivalent of doing just that.\nCheck if the XDG environment variables are set and store your stuff in these places — as it is now can be used as a last resort fallback. For reading config/data you do the same.",
          "link": "https://news.ycombinator.com/item?id=42476313",
          "publishedOn": "2024-12-20T23:51:47.000Z",
          "wordCount": 229,
          "title": "New comment by atoav in \"Grayjay Desktop App\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42474981",
          "author": "bisby",
          "description": "Launching the Linux release and noticed in the logs:\nDirectories:User Directory: /home/bisby/Grayjay\nAnd there is a directory there now. I absolutely hate having stuff automatically create anything in my home directory like this. Ideally, this should be following XDG directory guidelines on linux: https://specifications.freedesktop.org/basedir-spec/latest/",
          "link": "https://news.ycombinator.com/item?id=42474981",
          "publishedOn": "2024-12-20T21:02:00.000Z",
          "wordCount": 3228,
          "title": "New comment by bisby in \"Grayjay Desktop App\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42474214",
          "author": "Balgair",
          "description": "Complete aside here: I used to do work with amputees and prosthetics. There is a standardized test (and I just cannot remember the name) that fits in a briefcase. It's used for measuring the level of damage to the upper limbs and for prosthetic grading.\nBasically, it's got the dumbest and simplest things in it. Stuff like a lock and key, a glass of water and jug, common units of currency, a zipper, etc. It tests if you can do any of those common human tasks. Like pouring a glass of water, picking up coins from a flat surface (I chew off my nails so even an able person like me fails that), zip up a jacket, lock your own door, put on lipstick, etc.\nWe had hand prosthetics that could play Mozart at 5x speed on a baby grand, but could not pick up a silver dollar or zip a jacket even a little bit. To the patients, the hands were therefore about as useful as a metal hook (a common solution with amputees today, not just pirates!).\nAgain, a total aside here, but your comment just reminded me of that brown briefcase. Life, it turns out, is a lot more complex than we give it credit for. Even pouring the OJ can be, in rare cases, transcendent.",
          "link": "https://news.ycombinator.com/item?id=42474214",
          "publishedOn": "2024-12-20T19:38:27.000Z",
          "wordCount": 4363,
          "title": "New comment by Balgair in \"OpenAI O3 breakthrough high score on ARC-AGI-PUB\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42474017",
          "author": "vouaobrasil",
          "description": "I wonder if the new drug of choice is actually technology. In some ways I think that the addiction to technology has some similar mellowing effects as drugs. Some research indicates that smartphone addiction is also related to low self-esteem and avoidant attachment [1] and that smartphones can become an object of attachment [2]. The replacement of drugs by technology is not surprising as it significantly strengthens technological development especially as it is already well past the point of diminishing returns for improving every day life.\n1. https://www.sciencedirect.com/science/article/abs/pii/S07475...\n2. https://www.sciencedirect.com/science/article/abs/pii/S07475...",
          "link": "https://news.ycombinator.com/item?id=42474017",
          "publishedOn": "2024-12-20T19:19:48.000Z",
          "wordCount": 16009,
          "title": "New comment by vouaobrasil in \"Decline in teen drug use continues, surprising experts\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42473876",
          "author": "bluecoconut",
          "description": "Efficiency is now key.\n~=$3400 per single task to meet human performance on this benchmark is a lot. Also it shows the bullets as \"ARC-AGI-TUNED\", which makes me think they did some undisclosed amount of fine-tuning (eg. via the API they showed off last week), so even more compute went into this task.\nWe can compare this roughly to a human doing ARC-AGI puzzles, where a human will take (high variance in my subjective experience) between 5 second and 5 minutes to solve the task.\n(So i'd argue a human is at 0.03USD - 1.67USD per puzzle at 20USD/hr, and they include in their document an average mechancal turker at $2 USD task in their document)\nGoing the other direction: I am interpreting this result as human level reasoning now costs (approximately) 41k/hr to 2.5M/hr with current compute.\nSuper exciting that OpenAI pushed the compute out this far so we could see he O-series scaling continue and intersect humans on ARC, now we get to work towards making this economical!",
          "link": "https://news.ycombinator.com/item?id=42473876",
          "publishedOn": "2024-12-20T19:07:34.000Z",
          "wordCount": null,
          "title": "New comment by bluecoconut in \"OpenAI O3 breakthrough high score on ARC-AGI-PUB\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42473419",
          "author": "modeless",
          "description": "Congratulations to Francois Chollet on making the most interesting and challenging LLM benchmark so far.\nA lot of people have criticized ARC as not being relevant or indicative of true reasoning, but I think it was exactly the right thing. The fact that scaled reasoning models are finally showing progress on ARC proves that what it measures really is relevant and important for reasoning.\nIt's obvious to everyone that these models can't perform as well as humans on everyday tasks despite blowout scores on the hardest tests we give to humans. Yet nobody could quantify exactly the ways the models were deficient. ARC is the best effort in that direction so far.\nWe don't need more \"hard\" benchmarks. What we need right now are \"easy\" benchmarks that these models nevertheless fail. I hope Francois has something good cooked up for ARC 2!",
          "link": "https://news.ycombinator.com/item?id=42473419",
          "publishedOn": "2024-12-20T18:22:41.000Z",
          "wordCount": null,
          "title": "New comment by modeless in \"OpenAI O3 breakthrough high score on ARC-AGI-PUB\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42471600",
          "author": "thebruce87m",
          "description": "> I knew this was impossible, because…\nThere’s an easier tell. It’s impossible because you can’t to get Google to help you at all about any account issues, never mind them being as proactive as to call you.\nIn other words if Google call you, it’s not Google.\nIt’s slightly depressing that there are probably more fake Google support staff than real ones.",
          "link": "https://news.ycombinator.com/item?id=42471600",
          "publishedOn": "2024-12-20T14:58:40.000Z",
          "wordCount": null,
          "title": "New comment by thebruce87m in \"How to lose a fortune with one bad click\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42466978",
          "author": "legitster",
          "description": "This article is fascinating. But what's on display here is less of a nefarious plan from Spotify to replace famous Katy Perry with AI - instead we get to see something much more specific: a behind-the-scenes of how those endless chill/lo-fi/ambient playlists get created.\nWhich is something I've always wondered! How does the Lofi Girl channel on Youtube always have so much new music from artists I have never heard from?\nThe answer is surprising: real people and real instruments! (At least at the time of writing). Third-party stock music (\"muzak\") companies hiring underemployed jazz musicians to crank out a few dozen derivative songs every day to hack the algorithm.\n> “Honestly, for most of this stuff, I just write out charts while lying on my back on the couch,” he explained. “And then once we have a critical mass, they organize a session and we play them. And it’s usually just like, one take, one take, one take, one take. You knock out like fifteen in an hour or two.” With the jazz musician’s particular group, the session typically includes a pianist, a bassist, and a drummer. An engineer from the studio will be there, and usually someone from the PFC partner company will come along, too—acting as a producer, giving light feedback, at times inching the musicians in a more playlist-friendly direction.”\nI think there's an easy and obvious thing we can do - stop listening to playlists! Seek out named jazz artists. Listen to your local jazz station. Go to jazz shows.",
          "link": "https://news.ycombinator.com/item?id=42466978",
          "publishedOn": "2024-12-19T23:49:48.000Z",
          "wordCount": 5581,
          "title": "New comment by legitster in \"Ghost artists on Spotify\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42465757",
          "author": "dinartem",
          "description": "Good times. I was the developer at Microsoft who designed the Xbox 360 hardware security, wrote all the boot loaders, and the hypervisor code.\nNote to self: you should have added random delays before and after making the POST code visible on the external pins.",
          "link": "https://news.ycombinator.com/item?id=42465757",
          "publishedOn": "2024-12-19T21:18:38.000Z",
          "wordCount": 6526,
          "title": "New comment by dinartem in \"Hardware Security Exploit Research – Xbox 360\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42465202",
          "author": "encoderer",
          "description": "There exists a small percentage of men who will go absolutely savage on somebody for stealing from them, and the existence of those people is probably a bigger crime deterrent than the police.\nSo I say, shine on you crazy air tag tracking vigilante diamonds.",
          "link": "https://news.ycombinator.com/item?id=42465202",
          "publishedOn": "2024-12-19T20:06:57.000Z",
          "wordCount": null,
          "title": "New comment by encoderer in \"A 10-Year Battery for AirTag\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42456567",
          "author": "0086b416f103",
          "description": "> We cannot find qualified applicants.\nYour company is incompetent. I've applied to hundreds of companies like yours within Huntsville, AL in the past year, rejected or ghosted all the time.\nDefense morons will talk about how hard their work is and how they can't find anyone to do it. Completely skip over how prevalent affirmative action is in their hiring process; who were you guys interviewing in 2020? Why is the defense small business base completely dominated by veterans who stack 10% disability ratings and minorities with a preferred SBA sticker on their website?\nComplete joke of an industry.",
          "link": "https://news.ycombinator.com/item?id=42456567",
          "publishedOn": "2024-12-18T23:15:51.000Z",
          "wordCount": 3877,
          "title": "New comment by 0086b416f103 in \"Updates to H-1B\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42456549",
          "author": "ponector",
          "description": "So many contradictions!\nYou pay well, but not so much.\nYou search for qualified applicants but can hire a student.\nYou require linear algebra but ok with technical writer.\nLooks like your managers don't know who they need to hire or don't want to really hire.",
          "link": "https://news.ycombinator.com/item?id=42456549",
          "publishedOn": "2024-12-18T23:13:11.000Z",
          "wordCount": 1455,
          "title": "New comment by ponector in \"Updates to H-1B\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42455743",
          "author": "snakeyjake",
          "description": "My employer cannot hire H-1Bs.\nYou must be a US citizen to work for my company. No \"US Persons\" (visa holders) or foreigners allowed.\nYou have to be eligible for a Secret security clearance. You don't have to get one if you don't want to as there is usually plenty of uncleared work to go around, but you have to be eligible in case that goes away and we need to put you in for a clearance.\nWe cannot find qualified applicants.\nI've had this conversation many times on HN so here are some preemptive responses:\nNo, we don't make weapons for the military. Well, we do but not my part of the company. The most harmful thing the products I build do is quantify in precise detail how climate change is dooming us all.\nNo, our positions aren't ghost positions.\nYes, we are willing to train someone who is motivated. We won't re-teach linear algebra to a developer applicant but we will pay a tech writer to go to school nights/weekends to get a degree in engineering (me, I did that).\nYes, we have extensive high school and college work-study/internships and participants make $72k/yr. with full benefits for the duration of the program. That pipeline is actually successful.\nNo, you can't work remotely. You (even programmers!) have to touch the things we build in order to build them and nobody has an ISO certified clean room in their house.\nYes, we pay well.\nNo, we don't pay as much as Meta. We build components for satellites that have been sold to space agencies and purchased by various departments/ministries of the environment, not your personal information to advertisers-- one party has more money to spend than the other.\nWe have shortages in mech/EE/Aero, shortages in software, and critical shortages in engineering technicians.\nOne issue is that we expect programmers to remember linear algebra and have more than the ability to shovel frameworks on top of each other until a phone app comes out the other side.",
          "link": "https://news.ycombinator.com/item?id=42455743",
          "publishedOn": "2024-12-18T21:47:48.000Z",
          "wordCount": null,
          "title": "New comment by snakeyjake in \"Updates to H-1B\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42455232",
          "author": "loufe",
          "description": "I've had an MX Master mouse (the \"2\" for maybe 8-9 years then the \"3\" for 2-3 years now) and love it. Great performance, great battery life, fantastic design and feel. On Windows I definitely do not love the 150Mb program to manage it (surely sending a torrent of unnecessary telemetry data back to Logitech.\nI found Solaar a couple months ago after getting repeatedly frustrated with bluetooth connection issues. It really is exactly what it needs to be. Better interface than Logitech's, simple, lightweight. Devs have my thanks; what a great show of the goodness of open source software.",
          "link": "https://news.ycombinator.com/item?id=42455232",
          "publishedOn": "2024-12-18T21:09:07.000Z",
          "wordCount": null,
          "title": "New comment by loufe in \"Solaar is a Linux manager for many Logitech keyboards, mice, and other devices\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42454351",
          "author": "HarHarVeryFunny",
          "description": "A supposed shortage of qualified US applicants for tech jobs, especially software developers, doesn't jibe with the huge numbers of US developers currently looking for work, including highly experienced older workers suffering from age discrimination.\nI'd be surprised if more than 5-10% of H-1B positions are ones where the hiring company has even looked for US applicants.",
          "link": "https://news.ycombinator.com/item?id=42454351",
          "publishedOn": "2024-12-18T19:57:03.000Z",
          "wordCount": null,
          "title": "New comment by HarHarVeryFunny in \"Updates to H-1B\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42452044",
          "author": "patrickhogan1",
          "description": "Ah, classic regulatory theater. The administration, after 4 years of not introducing these changes, is now suddenly scrambling to roll them out. They’re dropping them right before a major transition, with an implementation timeline conveniently set for after the transition.\nIt’s a clever little maneuver. When the inevitable reversal happens, they can show up at fundraising galas telling donors, “We tried! We were so close! It’s just those baddies who always come along and pull the rug.”",
          "link": "https://news.ycombinator.com/item?id=42452044",
          "publishedOn": "2024-12-18T16:37:37.000Z",
          "wordCount": null,
          "title": "New comment by patrickhogan1 in \"Updates to H-1B\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42451177",
          "author": "tsimionescu",
          "description": "It seems very odd that the article seems to be measuring the information content of specific tasks that the brain is doing or specific objects that it is perceiving. But the brain is a general-purpose computer, not a speed-card computer, or English text computer, or binary digit computer, or Rubik's cube computer.\nWhen you look at a Rubik's cube, you don't just pick out specific positions of colored squares relative to each other. You also pick up the fact that it's a Rubik's cube and not a bird or a series of binary digits or English text. If an orange cat lunged at your Rubik's cube while you were studying it, you wouldn't process it as \"face 3 has 4 red squares on the first row, then an orange diagonal with sharp claws\", you'd process it as \"fast moving sharp clawed orange cat attacking cube\". Which implies that every time you loom at the cube you also notice that it's still a cube and not any of the millions of other objects you can recognize, adding many more bits of information.\nSimilarly, when you're typing English text, you're not just encoding information from your brain into English text, you're also deciding that this is the most relevant activity to keep doing at the moment, instead of doing math or going out for a walk. Not to mention the precise mechanical control of your muscles to achieve the requisite movements, which we're having significant trouble programming into a robot.",
          "link": "https://news.ycombinator.com/item?id=42451177",
          "publishedOn": "2024-12-18T15:24:00.000Z",
          "wordCount": 7511,
          "title": "New comment by tsimionescu in \"The unbearable slowness of being: Why do we live at 10 bits/s?\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/Binding-Treaty-Civil-society-decries-corporate-influence-at-the-UN",
          "author": "CADTM Switzerland , Collective, Les Amis de la Terre",
          "description": "The historic 10th session of negotiations for a UN treaty to hold transnational corporations (TNCs) accountable for their human rights violations (Binding Treaty) has just started in Geneva, Switzerland. Although originally intended to be held in October 2024, a unilateral and undemocratic decision by the Chair of the negotiations to change the dates just a month before has taken a toll on civil society's physical presence. \nEnglish\n\n/ \nSocial movements, \nInternational Institutions, \nMultinational corporation",
          "link": "https://www.cadtm.org/Binding-Treaty-Civil-society-decries-corporate-influence-at-the-UN",
          "publishedOn": "2024-12-20T08:27:39.000Z",
          "wordCount": 1457,
          "title": "Binding Treaty: Civil society decries corporate influence at the UN",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/7733b30663a7685e58650d6f902a58-2629c.jpg"
        },
        {
          "id": "https://www.cadtm.org/US-economy-an-exceptional-boom-or-a-bubble-to-burst",
          "author": "Michael Roberts",
          "description": "Recently, there has been a spate of articles and commentary about ‘US exceptionalism', namely that the US economy is bounding forward in terms of economic growth, hi-tech investment and productivity, leaving the rest of the world behind. And so no wonder that the US dollar is riding high and its stock markets are booming. This success is put down to less regulation, an entrepreneurial spirit, lower taxes on investment etc – in other words, none of this government interference that Europe, (...)\nEnglish\n\n/ \nUnited States of America (USA), \nCapitalism, \nDebt in Northern countries",
          "link": "https://www.cadtm.org/US-economy-an-exceptional-boom-or-a-bubble-to-burst",
          "publishedOn": "2024-12-18T10:39:53.000Z",
          "wordCount": 3376,
          "title": "US economy: an exceptional boom or a bubble to burst?",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L500xH263/3be6373418eeea6a03485a9d78dcd3-51681.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=8983",
          "author": "disassociated.com",
          "description": "Let’s flashback a year. Australian telecommunications company Telstra might have hit the right note with its Christmas theme advertising in 2023, by way of this ninety second commercial. The song excerpted in the ad is Oh Christmas, by Brisbane based duo Zefereli. Listen to the full length version here. It may not happen often, but […]",
          "link": "https://disassociated.com/telstras-2023-christmas-advert/",
          "publishedOn": "2024-12-22T20:00:28.000Z",
          "wordCount": 164,
          "title": "I’ll just be asking for you… Telstra’s 2023 Christmas advert",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8988",
          "author": "disassociated.com",
          "description": "Weather that is fine and not too warm seems to the Christmas Day weather forecast for most of Australia. But the days either side will be a different matter, writes Tom Saunders for the ABC: The tumultuous week of variability will commence with a wintry Monday for the south-east, even cold enough for brief snow […]",
          "link": "https://disassociated.com/snow-heatwaves-christmas-australia/",
          "publishedOn": "2024-12-22T19:30:22.000Z",
          "wordCount": 235,
          "title": "Snow and heatwaves: this is Christmas in Australia",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8977",
          "author": "disassociated.com",
          "description": "Hamburg, Germany, based web developer and long distance triathlete, Tim Teege is super keen to run a marathon the Moon. So much so, he wants you to ask any space agency worker type acquaintances you may have, to help him achieve his goal. Ask, and you shall receive, and the like. Not to put a […]",
          "link": "https://disassociated.com/shoot-for-the-stars-tim-teege-wants-to-run-a-marathon-on-the-moon/",
          "publishedOn": "2024-12-19T20:00:28.000Z",
          "wordCount": 367,
          "title": "Shoot for the stars: Tim Teege wants to run a marathon on the Moon",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8973",
          "author": "disassociated.com",
          "description": "A statement of twelve guiding principles for an ethical web, recently published by the World Wide Web Consortium (W3C). The web is a fundamental part of our lives, shaping how we work, connect, and learn. We understand that with this profound impact comes the responsibility to ensure that the web serves as a platform that […]",
          "link": "https://disassociated.com/w3c-ethical-web-principles-web-standards-mature-web/",
          "publishedOn": "2024-12-18T20:00:21.000Z",
          "wordCount": 275,
          "title": "W3C ethical web principles: web standards for a mature web",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": []
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/saving-democacy",
          "author": null,
          "description": "On South Korea.",
          "link": "https://newleftreview.org/sidecar/posts/saving-democacy",
          "publishedOn": "2024-12-19T10:34:42.000Z",
          "wordCount": 2353,
          "title": "Jason Barker <em>&amp;</em> Hoduk Hwang: &ldquo;Saving Democracy?&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/12/korea.webp"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/the-balkan-scenario",
          "author": null,
          "description": "Syrian futures.",
          "link": "https://newleftreview.org/sidecar/posts/the-balkan-scenario",
          "publishedOn": "2024-12-18T17:25:32.000Z",
          "wordCount": 1919,
          "title": "Matt Broomfield: &ldquo;The Balkan Scenario&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/12/64ad360e7aa6d993366708-scaled.jpg"
        }
      ]
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    },
    {
      "title": "News Minimalist",
      "feedUrl": "https://rss.beehiiv.com/feeds/4aF2pGVAEN.xml",
      "siteUrl": "https://newsletter.newsminimalist.com/",
      "articles": [
        {
          "id": "https://newsletter.newsminimalist.com/p/china-launches-first-batch-of-internet-satellites-2-more-stories",
          "author": null,
          "description": "China launches first 10 Guowang satellites for internet access; NASA's Webb telescope challenges planet formation theories; NATO takes over coordination of Ukraine military aid.",
          "link": "https://newsletter.newsminimalist.com/p/china-launches-first-batch-of-internet-satellites-2-more-stories",
          "publishedOn": "2024-12-18T16:44:00.000Z",
          "wordCount": 6593,
          "title": "China launches first batch of internet satellites + 2 more stories",
          "imageUrl": "https://beehiiv-images-production.s3.amazonaws.com/uploads/publication/thumbnail/d0318cb6-0493-4e34-b055-76456e6c0f76/landscape_template__3_.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}