{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "33de3473228bf0a8001c1a2fab34dcc5d6379d50",
          "author": "Sébastien Stormacq",
          "description": "I counted only 21 AWS news since last Monday, most of them being Regional expansions of existing services and capabilities. I hope you enjoyed a relatively quiet week, because this one will be busier. This week, we’re welcoming our customers and partners at the Jacob Javits Convention Center for the AWS Summit New York on […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-s3-access-grants-aws-lambda-european-sovereign-cloud-region-and-more-july-8-2024/",
          "publishedOn": "2024-07-08T16:47:04.000Z",
          "wordCount": 1660,
          "title": "AWS Weekly Roundup: Amazon S3 Access Grants, AWS Lambda, European Sovereign Cloud Region, and more (July 8, 2024).",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/06/10/AWS-WIR-default-1.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": []
    },
    {
      "title": "The GitHub Blog: Engineering News and Updates",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/category/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": [
        {
          "id": "0b8bd15cb28746b280e7ed11144ffd013485b5aa",
          "author": "Sindhu Pillai",
          "description": "Refactor serverless apps by swapping application code with cloud automation: reduce costs, decouple logic from architecture, and leverage managed services' native capabilities.",
          "link": "https://aws.amazon.com/blogs/devops/refactoring-to-serverless-from-application-to-automation/",
          "publishedOn": "2024-07-03T20:41:32.000Z",
          "wordCount": 2664,
          "title": "Refactoring to Serverless: From Application to Automation",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/06/19/Refactoring-to-Serverless-1145x630.png"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": []
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=327578",
          "author": "Richard Falk",
          "description": "It appears that even Biden is reluctant to claim credit in national settings for US support of Israel and Ukraine, and prefers to speak in generalities about the greatness of America as a country whose future is bright except to the extent dimmed by the threat advent of Trump and Trumpism. This tendency to ignore the world should be more troubling to American voters than even Biden’s refusal to leave the presidential stage in light of his thinly deniable disabilities of age and mental health that have put his 2024 candidacy in peril. More\nThe post Critiquing Biden’s Worldview, Democratic Party Tactics and America’s Destiny appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/09/critiquing-bidens-worldview-democratic-party-tactics-and-americas-destiny/",
          "publishedOn": "2024-07-09T06:05:21.000Z",
          "wordCount": null,
          "title": "Critiquing Biden’s Worldview, Democratic Party Tactics and America’s Destiny",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327465",
          "author": "Michael Barker",
          "description": "Nigel Farage has always been a bigoted posh boy with the gift of the gab. Raised in the rolling hills of Downe on the outskirts of London -- a village most famous for its association with Charles Darwin -- Farage attended Eden Park Preparatory School in the 1970s. His wealthy parents then paid for his attendance at one of South London’s most prestigious old boys’ clubs, Dulwich College. Farage’s germinal racism was public even at this early age, and in 1981, his fascist mannerisms were played down as ordinary “naughtiness” by his college’s “Master” when he chose to make him a prefect More\nThe post Racism in the Life of Farage: From Enoch Powell to Reform UK appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/09/racism-in-the-life-of-farage-from-enoch-powell-to-reform-uk/",
          "publishedOn": "2024-07-09T06:00:13.000Z",
          "wordCount": null,
          "title": "Racism in the Life of Farage: From Enoch Powell to Reform UK",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327647",
          "author": "Robin Scher",
          "description": "In 1948, the Universal Declaration of Human Rights (UDHR) was signed, marking a milestone in human rights history. It established the fundamental rights to be universally protected, with Article 1 proclaiming: “All human beings are born free and equal in dignity and rights.” In the following decades, however, specific events and policies revealed a critical oversight  More\nThe post How a Twentieth-Century Family Planning Strategy Fueled the Climate Crisis appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/09/how-a-twentieth-century-family-planning-strategy-fueled-the-climate-crisis/",
          "publishedOn": "2024-07-09T05:55:51.000Z",
          "wordCount": null,
          "title": "How a Twentieth-Century Family Planning Strategy Fueled the Climate Crisis",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327512",
          "author": "Patrick Mazza",
          "description": "It was a warm, humid summer night, just the kind of night I remember my parents taking us kids to see the Lincoln Memorial.  I wanted Erika to have as her first memory of this place that same stunning vista of Lincoln looking at the brightly lit obelisk of the Washington Monument and illuminated dome  More\nThe post Dreaming of a Great World appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/09/dreaming-of-a-great-world/",
          "publishedOn": "2024-07-09T05:55:47.000Z",
          "wordCount": null,
          "title": "Dreaming of a Great World",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327676",
          "author": "Ralph Nader",
          "description": "The six “corporate state” U.S. Supreme Court Justices, occupying unaccountable lifetime unelected positions, handed over dictatorial power for presidents and corporations that disassembled our Founders’ Constitution and the centerpiece of the American Revolution. In one week! Led by the notorious Trump v. United States case these interwoven and dictatorial commands will live in infamy unless  More\nThe post The Dictatorial Trump Court Has Put Our Democracy’s Rule of Law on Quicksand appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/09/the-dictatorial-trump-court-has-put-our-democracys-rule-of-law-on-quicksand/",
          "publishedOn": "2024-07-09T05:55:23.000Z",
          "wordCount": null,
          "title": "The Dictatorial Trump Court Has Put Our Democracy’s Rule of Law on Quicksand",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327646",
          "author": "Thomas Knapp",
          "description": "“Who runs the country?” I’ve been hearing variants of that question a lot over the last  few weeks, mainly in forms like “given Joe Biden’s age and apparent mental decline, can we trust him to run the country for another four years?” For the last eight or nine years, I’ve also heard it a lot,  More\nThe post Who “Runs The Country?” We Do! appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/09/who-runs-the-country-we-do/",
          "publishedOn": "2024-07-09T05:55:12.000Z",
          "wordCount": null,
          "title": "Who “Runs The Country?” We Do!",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327441",
          "author": "Rory Ellison",
          "description": "Describing Australia as “the lucky country” has long been a metaphor for how “well” Australia has been doing economically. Unfortunately, for many Australians, things haven’t been going “well” for quite some time. Australia’s past prosperity had precious little to do with luck. Years ago, many analysts saw Australia’s luck as a product of its abundant  More\nThe post Is Australia’s Luck Running Out? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/09/is-australias-luck-running-out/",
          "publishedOn": "2024-07-09T05:44:50.000Z",
          "wordCount": null,
          "title": "Is Australia’s Luck Running Out?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327500",
          "author": "Kevin A. Young",
          "description": "Signed into law 60 years ago, the Civil Rights Act of 1964 outlawed discrimination in the U.S. based on “race, color, sex, religion, or national origin.” Yet, as a historian who studies social movements and political change, I think the law’s most important lesson for today’s movements is not its content but rather how it  More\nThe post Black Economic Boycotts of the Civil Rights Era Still Offer Lessons on How to Achieve a Just Society appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/09/black-economic-boycotts-of-the-civil-rights-era-still-offer-lessons-on-how-to-achieve-a-just-society/",
          "publishedOn": "2024-07-09T05:37:49.000Z",
          "wordCount": null,
          "title": "Black Economic Boycotts of the Civil Rights Era Still Offer Lessons on How to Achieve a Just Society",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327498",
          "author": "Dean Baker",
          "description": "Low-wage workers have seen large real wage gains since the pandemic, so naturally as we come to the July 4th holiday the New York Times gives us a piece telling us how they are hurting. The piece is headlined, “America’s divided summer economy is coming to an airport or hotel near you.” If there is  More\nThe post The NYT and the Low-Wage Worker appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/09/the-nyt-and-the-low-wage-worker/",
          "publishedOn": "2024-07-09T05:30:21.000Z",
          "wordCount": null,
          "title": "The NYT and the Low-Wage Worker",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327674",
          "author": "Dan Perell - Heba Aly",
          "description": "The fundamental problem we face today in world affairs is our failure to adjust our international institutions to the imperative needs of a rapidly evolving age. The UN Secretary-General said as much last September when in a speech before the General Assembly he noted: “We cannot effectively address problems as they are if institutions don’t  More\nThe post Breathing New Life into the UN Charter appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/09/breathing-new-life-into-the-un-charter/",
          "publishedOn": "2024-07-09T05:17:11.000Z",
          "wordCount": null,
          "title": "Breathing New Life into the UN Charter",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327577",
          "author": "Ed Grystar",
          "description": "Donald Trump is scheduled to visit Butler County (Pa) for another campaign rally in a few days. By the time this article is published, it may have already happened. He will probably be greeted with a large crowd as nature abhors a vacuum. Donald’s message in 2024 is not much different than that of former  More\nThe post Trump to Visit Western Pa.: a Contrast with VP Bush’s Visit in 1982 appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/09/trump-to-visit-western-pa-a-contrast-with-vp-bushs-visit-in-1982/",
          "publishedOn": "2024-07-09T04:44:44.000Z",
          "wordCount": null,
          "title": "Trump to Visit Western Pa.: a Contrast with VP Bush’s Visit in 1982",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327678",
          "author": "Cesar Chelala",
          "description": "We will teach you, human animals who don’t value human life as we do, never to do this again to us, to our families, to our women and children, as you did on October 7. We will destroy your houses, your sewage systems, your hospitals, your schools, your crops and herds. We will ravage your  More\nThe post Teaching a Lesson to the Palestinians appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/09/teaching-a-lesson-to-the-palestinians/",
          "publishedOn": "2024-07-09T04:01:51.000Z",
          "wordCount": null,
          "title": "Teaching a Lesson to the Palestinians",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327436",
          "author": "L. Michael Hager",
          "description": "Given the recent pro-Palestinian protests around the world and on many university campuses, it seems strange if not surprising that neither genocide nor the continuing flow of U.S. weapons to Israel were mentioned during the first (and maybe only) 2024 presidential debate. Nor did the New York Times Editorial Board see fit to cite complicity in genocide while calling for Biden to step down after his poor debate performance. Instead, it declared that Biden has been \"an admirable president.\" More\nThe post The Gaza Genocide: Who’s Complicit? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/the-gaza-genocide-whos-complicit/",
          "publishedOn": "2024-07-08T06:00:22.000Z",
          "wordCount": null,
          "title": "The Gaza Genocide: Who’s Complicit?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327479",
          "author": "Binoy Kampmark",
          "description": "The most staggering feature of these elections, leaving aside the ritualistic savaging of the Tories, was the wholly lopsided nature of the share of votes relative to the winning of seats.  “This election,” the Electoral Reform Society solemnly declared, “saw Labour and the Conservatives receive their joint lowest vote share on record, with a combined 57.4%.” That did not prevent the two major parties from snaring the lion’s share.  Labour received 33.7% of the vote yet obtained 63.2% (411 seats) of the 650 on offer, making it the most disproportionate on record.  The Tories, despite the bloodbath, could still count on 121 MPs with 23.7% of votes winning 18.6% of seats in the House of Commons. More\nThe post Massacre at the Ballot: The Punishing of the Tories appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/massacre-at-the-ballot-the-punishing-of-the-tories/",
          "publishedOn": "2024-07-08T05:59:50.000Z",
          "wordCount": null,
          "title": "Massacre at the Ballot: The Punishing of the Tories",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327556",
          "author": "Andrea Mazzarino",
          "description": "Many war stories end with hunger wreaking havoc on significant portions of a population. In Christian theology, the Biblical “four horses of the apocalypse,” believed by many in early modern Europe to presage the end of the world, symbolized invasion, armed conflict, and famine followed by death. They suggest the degree to which people have long recognized  More\nThe post War and Famine appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/war-and-famine/",
          "publishedOn": "2024-07-08T05:58:06.000Z",
          "wordCount": null,
          "title": "War and Famine",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327509",
          "author": "Andrew Moss",
          "description": "This November, voters will choose between two radically different paths of immigration policy. Should Donald Trump be re-elected president, the nation will embark on a path of deportation, or the attempted deportation, of millions of people living in the U.S. Should Joe Biden or another Democrat occupy the White House next year, the country will  More\nThe post Three Paths Forward in Immigration Policy appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/three-paths-forward-in-immigration-policy/",
          "publishedOn": "2024-07-08T05:56:57.000Z",
          "wordCount": null,
          "title": "Three Paths Forward in Immigration Policy",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327548",
          "author": "Jonah Raskin",
          "description": "Yeah, yeah, I know the Tories are out, Labour won big time and Keir Starmer is the new PM and at home at 10 Downing Street. Starmer called for “Change.” That’s what voters clearly wanted after years and years of disastrous Conservative Party rule that saw a widening gap between haves and have nots and  More\nThe post The 2024 British Election: Big Change Ain’t Gonna Come appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/the-2024-british-election-big-change-aint-gonna-come/",
          "publishedOn": "2024-07-08T05:55:55.000Z",
          "wordCount": null,
          "title": "The 2024 British Election: Big Change Ain’t Gonna Come",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327543",
          "author": "Sonali Kolhatkar",
          "description": "The New York Times, long considered the “newspaper of record” in the United States, has in recent weeks made no secret about its chief concern: President Joe Biden’s ability to defeat Donald Trump in November 2024. And, it has done everything it can to promote the idea that the Democratic Party ticket needs a new  More\nThe post Why is the NY Times Calling for Biden’s Ouster? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/why-is-the-ny-times-calling-for-bidens-ouster/",
          "publishedOn": "2024-07-08T05:55:52.000Z",
          "wordCount": null,
          "title": "Why is the NY Times Calling for Biden’s Ouster?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327544",
          "author": "Linda Farthing - Thomas Grisaffi",
          "description": "Remigia Ferrel Vallejos, a Bolivian union executive from Chimoré, in the coca-grower Chapare region, isn’t nostalgic for the old days. “Before there was a lot of fatalism. Many times, in meetings I was told, ‘women don’t count, the man has to come,” she explains. “That’s how it was; we didn’t even have the right to  More\nThe post Breaking Barriers: The Political Empowerment of Bolivia’s Indigenous Women appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/breaking-barriers-the-political-empowerment-of-bolivias-indigenous-women/",
          "publishedOn": "2024-07-08T05:55:05.000Z",
          "wordCount": null,
          "title": "Breaking Barriers: The Political Empowerment of Bolivia’s Indigenous Women",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327537",
          "author": "Michael Hudson",
          "description": "The July 4 landslide defeat of the neoliberal pro-war British Conservatives by the neoliberal pro-war Labour Party poses the question of just what the media mean when they describe the elections and political alignments throughout Europe in terms of center-right and center-left traditional parties challenged by nationalist neo-fascists. Political differences between Europe’s centrist parties are  More\nThe post We Need a New Political Vocabulary appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/we-need-a-new-political-vocabulary/",
          "publishedOn": "2024-07-08T05:53:40.000Z",
          "wordCount": null,
          "title": "We Need a New Political Vocabulary",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327433",
          "author": "Michael Zoosman",
          "description": "Between stimulus and response there is a space. In that space is our power to choose our response. In our response lies our growth and our freedom. – Viktor E. Frankl Content warning: This essay briefly describes a suicide attempt. If you or someone you know are/is struggling with thoughts of suicide or self-harm, please  More\nThe post Why the Spirit of the Law Should Prevail: A Cautionary Tale of Extremism From an Ex-Scrupulous Chaplain appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/why-the-spirit-of-the-law-should-prevail-a-cautionary-tale-of-extremism-from-an-ex-scrupulous-chaplain/",
          "publishedOn": "2024-07-08T05:50:09.000Z",
          "wordCount": null,
          "title": "Why the Spirit of the Law Should Prevail: A Cautionary Tale of Extremism From an Ex-Scrupulous Chaplain",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327437",
          "author": "Jeff Cohen - Norman Solomon",
          "description": "When Joe Biden’s ABC News interview aired on Friday night, it made clear that he should not be running for re-election. Rather than reduce the concerns sparked by his abysmal debate performance eight days earlier, the interview underscored that the president is in denial about his current political standing and unable to offer reassurance that  More\nThe post More Than Ever, Trump’s Most Effective Campaign Ally is Joe Biden appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/more-than-ever-trumps-most-effective-campaign-ally-is-joe-biden/",
          "publishedOn": "2024-07-08T05:45:38.000Z",
          "wordCount": null,
          "title": "More Than Ever, Trump’s Most Effective Campaign Ally is Joe Biden",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327439",
          "author": "Mike Garrity",
          "description": "The great news is the Ashley National Forest has been saved from a “landscape scale” deforestation plan in which the Forest Service planned to bulldoze in skid trails to log and burn up to 147,000 acres (230 square miles!) of Inventoried Roadless Areas. But when faced with the lawsuit brought by the Alliance for the  More\nThe post Environmental Groups Save Ashley National Forest Roadless Areas from Bulldozers and Chainsaws appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/08/environmental-groups-save-ashley-national-forest-roadless-areas-from-bulldozers-and-chainsaws/",
          "publishedOn": "2024-07-08T05:22:53.000Z",
          "wordCount": null,
          "title": "Environmental Groups Save Ashley National Forest Roadless Areas from Bulldozers and Chainsaws",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327237",
          "author": "Susie Day",
          "description": "The New York Times has been justifiably criticized, as you probably know, for its anti-Palestine bias in covering Israel’s war on Gaza. But you may not know that the Times building is located near Manhattan’s theater district. This is why a lot of show people tend to walk past the Times, and why my friend, […]\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Genocide Then and Now appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/07/genocide-then-and-now/",
          "publishedOn": "2024-07-07T05:57:38.000Z",
          "wordCount": null,
          "title": "Genocide Then and Now",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327186",
          "author": "Michael Slager",
          "description": "Jocelyn Nungaray, a 12-year-old from Texas, was recently found dead in a creek near her home. Video footage from a convenience store and interviews with neighborhood residents led police to two men whom they later arrested. Both suspects are undocumented migrants from Venezuela. Her murder immediately became a narrative about the savagery of illegal aliens […]\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Migration is Not a Crime appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/07/migration-is-not-a-crime/",
          "publishedOn": "2024-07-07T05:50:17.000Z",
          "wordCount": null,
          "title": "Migration is Not a Crime",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327368",
          "author": "Jeffrey St. Clair",
          "description": "+ This week’s Israeli seizure of nearly five square miles of land in the Jordan Valley of the occupied West Bank is the largest land grab in the more than three decades since the signing of the Oslo Accords. First, the lands were declared “closed military zones,” then the Netanyahu government reassigned them as “state […]\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Moving Human Targets appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/06/moving-human-targets/",
          "publishedOn": "2024-07-06T14:37:31.000Z",
          "wordCount": null,
          "title": "Moving Human Targets",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327205",
          "author": "Melvin Goodman",
          "description": "Last week’s Biden-Trump debate harmed U.S. foreign policy, and the international community was left to debate what was said and what was left unsaid.  In view of the harmful potential for wider wars in East Europe and the Middle East in addition to the potential for China’s increased military pressure on Taiwan, it is shocking that only ten minutes of the 90-minute debate was devoted to national security policy.  The inept CNN moderators—Jake Tapper and Dana Bash—were partly responsible because of the dearth of questions on foreign policy.  Nevertheless, the answers provided by President Joe Biden and former president Donald Trump were shocking for their misinformation and their polemics.   More\nThe post How the Presidential Debate Harmed US Foreign Policy appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/how-the-presidential-debate-harmed-us-foreign-policy/",
          "publishedOn": "2024-07-05T06:00:58.000Z",
          "wordCount": null,
          "title": "How the Presidential Debate Harmed US Foreign Policy",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327256",
          "author": "Jeffrey St. Clair",
          "description": "I grew up south of Indianapolis on the glacier-smoothed plains of central Indiana. My grandparents owned a small farm, whittled down over the years to about 40 acres of bottomland, in some of the most productive agricultural land in America. Like many of their neighbors they mostly grew field corn (and later soybeans), raised a few cows and bred a few horses.\nMore\nThe post Animal Factories: On the Killing Floor appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/animal-factories-on-the-killing-floor/",
          "publishedOn": "2024-07-05T06:00:46.000Z",
          "wordCount": null,
          "title": "Animal Factories: On the Killing Floor",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327179",
          "author": "Matthew Stevenson",
          "description": "On screen, Biden looked and sounded like a somnambulist whose only connection to politics was a haphazard, recited laundry list of federal programs that have saved everyone from unwed mothers to homeless veterans, but at least the president came to the debate with malice toward none (Gazans might have been the exception), while from the other lectern Trump was little more than a fountain of bile. More\nThe post Say It Ain’t So, Joe appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/say-it-aint-so-joe/",
          "publishedOn": "2024-07-05T05:59:42.000Z",
          "wordCount": null,
          "title": "Say It Ain’t So, Joe",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=327322",
          "author": "Ramzy Baroud",
          "description": "Israel never learns from its mistakes. What Israeli Prime Minister Benjamin Netanyahu is trying to implement in Gaza is but a poor copy of previous strategies that were used in the past by other Israeli leaders. If these strategies had succeeded, Israel would not be in this position in the first place. The main reason  More\nThe post Sharon Revisited: Netanyahu’s Ultimate Aim in Gaza and Why It Will Fail  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/05/sharon-revisited-netanyahus-ultimate-aim-in-gaza-and-why-it-will-fail/",
          "publishedOn": "2024-07-05T05:58:56.000Z",
          "wordCount": null,
          "title": "Sharon Revisited: Netanyahu’s Ultimate Aim in Gaza and Why It Will Fail",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": [
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=30686",
          "author": "Marco Del Negro, Keshav Dogra, Pranay Gundam, Donggyu Lee, and Brian Pacula",
          "description": "This post discusses the distributional consequences of an aggressive policy response to inflation using a Heterogeneous Agent New Keynesian (HANK) model. We find that, when facing demand shocks, stabilizing inflation and real activity go hand in hand, with very large benefits for households at the bottom of the wealth distribution. The converse is true however when facing supply shocks: stabilizing inflation makes real outcomes more volatile, especially for poorer households. We conclude that distributional considerations make it much more important for policy to take into account the tradeoffs between stabilizing inflation and economic activity. This is because the optimal policy response depends very strongly on whether these tradeoffs are present (that is, when the economy is facing supply shocks) or absent (when the economy is facing demand shocks).",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/07/on-the-distributional-consequences-of-responding-aggressively-to-inflation/",
          "publishedOn": "2024-07-03T11:00:00.000Z",
          "wordCount": 4595,
          "title": "On the Distributional Consequences of Responding Aggressively to Inflation",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/07/LSE_2024_HANK-aggressive-inflation_delnegro_460.jpg"
        }
      ]
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45465",
          "author": "peterradford",
          "description": "from Peter Radford “Economics has become irrelevant.” PART ONE Oh my.  Apparently Brad DeLong and I have the same problem.  He, of course, is part of the elite club.  I am decidedly not.  So it is quite a shock to share something. What? He set out to write an 800 word review of Dan Davies’ […]",
          "link": "https://rwer.wordpress.com/2024/07/08/on-janeways-mesoeconomics/",
          "publishedOn": "2024-07-08T17:36:49.000Z",
          "wordCount": 8986,
          "title": "On Janeway’s Mesoeconomics",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45462",
          "author": "Editor",
          "description": "from Lars Syll So, certainly, both non-theorists and some theorists have little patience for research that displays mathematical ingenuity but has no value as social science. But defining this work exactly is impossible. This sort of work is like pornography quite simple to recognize when one sees it. Jeffrey Ely As researchers, we (mostly) want […]",
          "link": "https://rwer.wordpress.com/2024/07/04/weekend-read-theory-and-reality-in-economics/",
          "publishedOn": "2024-07-04T11:06:52.000Z",
          "wordCount": 7577,
          "title": "Weekend read: Theory and reality in economics",
          "imageUrl": "https://larspsyll.wordpress.com/wp-content/uploads/2013/12/math15.gif"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=274694",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics; New Covid charts (no good news at all); Biden on Morning Joe; open processes to replacing Biden; the Enneagram ~",
          "link": "https://www.nakedcapitalism.com/2024/07/200pm-water-cooler-7-9-2024.html",
          "publishedOn": "2024-07-09T18:00:53.000Z",
          "wordCount": 7111,
          "title": "2:00PM Water Cooler 7/9/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/rcp_2024-07-05.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274685",
          "author": "Yves Smith",
          "description": "Big donors and Biden are duking it out as to whether he goes or stays. How much does it matter that voters are visibly disenfranchised?",
          "link": "https://www.nakedcapitalism.com/2024/07/the-biden-donor-convention.html",
          "publishedOn": "2024-07-09T13:46:43.000Z",
          "wordCount": 6969,
          "title": "The Biden Donor Convention",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274656",
          "author": "Yves Smith",
          "description": "Our expansive daily links: Ozempic vision risk, zero Covid community, EV battery BK? EU-China chip row, France left surprise win, UK budget crunch, Netanyahu v. ceasefire, Ukraine lack of air defenses, GPS foes, Biden defiant, misreading of Supremes on immunity, Goldman doubts AI, Bloomberg gives John Hopkins free tuition $",
          "link": "https://www.nakedcapitalism.com/2024/07/links-7-9-2024.html",
          "publishedOn": "2024-07-09T10:55:09.000Z",
          "wordCount": 17190,
          "title": "Links 7/9/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/00-bird-on-nest.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274646",
          "author": "Nick Corbishley",
          "description": "To treat the NHS's ills, Keir Starmer's government is talking about bringing back Tony Blair’s health secretary, Alan Milburn, who is now in the pay of corporations with interests in the UK's healthcare sector.",
          "link": "https://www.nakedcapitalism.com/2024/07/under-new-labour-government-the-privatisation-of-uks-national-health-service-is-if-anything-likely-to-intensify-including-in-scotland.html",
          "publishedOn": "2024-07-09T10:45:58.000Z",
          "wordCount": 5659,
          "title": "It Is Now Labour’s Turn to Expand the Piecemeal Privatisation of the UK’s National Health Service",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274675",
          "author": "Yves Smith",
          "description": "How Israel uses inhumane, experimental surveillance technology against Palestinians. Will this become that new normal?",
          "link": "https://www.nakedcapitalism.com/2024/07/how-do-we-control-palestinians-we-make-them-feel-like-we-are-everywhere.html",
          "publishedOn": "2024-07-09T09:59:02.000Z",
          "wordCount": 4451,
          "title": "‘How Do We Control Palestinians? We Make Them Feel Like We Are Everywhere’",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274671",
          "author": "Yves Smith",
          "description": "EU inability to meaningful increase 155mm shell production show the high cost of giving private arms-makers free rein.",
          "link": "https://www.nakedcapitalism.com/2024/07/eu-undershoots-155mm-shell-capacity-target-by-more-than-half-blames-all-sorts-of-things-besides-lack-of-operational-capability.html",
          "publishedOn": "2024-07-09T09:55:47.000Z",
          "wordCount": 10427,
          "title": "EU Undershoots 155MM Shell Capacity Target by More Than Half, Blames All Sorts of Things Besides Lack of Operational Capability",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274587",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Open Thread ~",
          "link": "https://www.nakedcapitalism.com/2024/07/200pm-water-cooler-7-8-2024.html",
          "publishedOn": "2024-07-08T18:00:10.000Z",
          "wordCount": 8494,
          "title": "2:00PM Water Cooler 7/8/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/fritillary.jpeg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274585",
          "author": "Yves Smith",
          "description": "Russia has some thorny and apparently not resolved questions about its end game in Ukraine.",
          "link": "https://www.nakedcapitalism.com/2024/07/what-would-a-russian-victory-in-ukraine-look-like.html",
          "publishedOn": "2024-07-08T13:55:49.000Z",
          "wordCount": 22342,
          "title": "What Would a Russian Victory in Ukraine Look Like?",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2025/07/00-Ukraine_disputed_regions.svg_.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274612",
          "author": "Conor Gallagher",
          "description": "",
          "link": "https://www.nakedcapitalism.com/2024/07/links-7-8-2024.html",
          "publishedOn": "2024-07-08T10:55:34.000Z",
          "wordCount": 17547,
          "title": "Links 7/8/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/Screenshot-2024-07-08-at-9.08.32 AM-1024x768.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=274599",
          "author": "Lambert Strether",
          "description": "Permaculture is a sustainable alternative to conventional agriculture.",
          "link": "https://www.nakedcapitalism.com/2024/07/nature-communications-permaculture-as-a-better-alternative-to-conventional-agriculture.html",
          "publishedOn": "2024-07-08T10:50:23.000Z",
          "wordCount": 10758,
          "title": "Nature Communications: Permaculture as a Better Alternative to Conventional Agriculture?",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/ego_system.jpeg"
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "668d0d554f58a9000ada4e20",
          "author": "Omer Yoachimik",
          "description": "Welcome to the 18th edition of the Cloudflare DDoS Threat Report. Released quarterly, these reports provide an in-depth analysis of the DDoS threat landscape as observed across the Cloudflare network. This edition focuses on the second quarter of 2024",
          "link": "https://blog.cloudflare.com/ddos-threat-report-for-2024-q2",
          "publishedOn": "2024-07-09T13:00:32.000Z",
          "wordCount": 2365,
          "title": "DDoS threat report for 2024 Q2",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/DDoS-threat-report-for-2024-Q2-OG-1.png"
        },
        {
          "id": "6687c6e3a4598c000bd7103d",
          "author": "Sharon Goldberg",
          "description": "The RADIUS protocol is commonly used to control administrative access to networking gear. Despite its importance, RADIUS hasn’t changed much in decades. We discuss an attack on RADIUS as a case study for why it’s important for legacy protocols to keep up with advancements in cryptography",
          "link": "https://blog.cloudflare.com/radius-udp-vulnerable-md5-attack",
          "publishedOn": "2024-07-09T12:00:59.000Z",
          "wordCount": 4722,
          "title": "RADIUS/UDP vulnerable to improved MD5 collision attack",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/RADIUS-UDP-vulnerable-to-improved-MD5-collision-attack-OG-1.png"
        },
        {
          "id": "668c06d24f58a9000ada4845",
          "author": "João Tomé",
          "description": "Check the dynamics of the 2024 French legislative elections, the surprising election results’ impact on Internet traffic changes, and the cyber attacks targeting political parties",
          "link": "https://blog.cloudflare.com/2024-french-elections-political-cyber-attacks-and-internet-traffic-shifts",
          "publishedOn": "2024-07-08T15:52:38.000Z",
          "wordCount": 1737,
          "title": "French elections: political cyber attacks and Internet traffic shifts",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/French-elections--political-cyber-attacks-and-Internet-traffic-shifts-OG-1.png"
        },
        {
          "id": "6687ef98a4598c000bd710d0",
          "author": "João Tomé",
          "description": "Here, we explore the dynamics of Internet traffic and cybersecurity during the UK’s 2024 general election, highlighting late-day traffic changes and a post-vote attack on a political party",
          "link": "https://blog.cloudflare.com/uk-election-day-2024-traffic-trends-and-attacks-on-political-parties",
          "publishedOn": "2024-07-05T13:24:49.000Z",
          "wordCount": 1569,
          "title": "UK election day 2024: traffic trends and attacks on political parties",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/UK-election-day-2024--traffic-trends-and-attacks-on-political-parties-OG-1.png"
        },
        {
          "id": "668519cda4598c000bd709a9",
          "author": "Bryton Herdes",
          "description": "On June 27, 2024, a small number of users globally may have noticed that 1.1.1.1 was unreachable or degraded. The root cause was a mix of BGP (Border Gateway Protocol) hijacking and a route leak",
          "link": "https://blog.cloudflare.com/cloudflare-1111-incident-on-june-27-2024",
          "publishedOn": "2024-07-04T13:00:50.000Z",
          "wordCount": 3907,
          "title": "Cloudflare 1.1.1.1 incident on June 27, 2024",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/Cloudflare-1.1.1.1-incident-on-June-27--2024-OG-1.png"
        },
        {
          "id": "66853348a4598c000bd709b9",
          "author": "João Tomé",
          "description": "How Cloudflare mitigated DDoS attacks targeting French political parties during the 2024 legislative elections, as detailed in our ongoing election coverage",
          "link": "https://blog.cloudflare.com/first-round-of-french-election-2024-party-attacks-and-a-modest-traffic-dip",
          "publishedOn": "2024-07-03T13:00:34.000Z",
          "wordCount": 1006,
          "title": "First round of French election: party attacks and a modest traffic dip",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/First-round-of-French-election--party-attacks-and-a-modest-traffic-dip-OG-1.png"
        },
        {
          "id": "668274eea4598c000bd707cf",
          "author": "Alex Bocharov",
          "description": "To help preserve a safe Internet for content creators, we’ve just launched a brand new “easy button” to block all AI bots. It’s available for all customers, including those on our free tier",
          "link": "https://blog.cloudflare.com/declaring-your-aindependence-block-ai-bots-scrapers-and-crawlers-with-a-single-click",
          "publishedOn": "2024-07-03T13:00:26.000Z",
          "wordCount": 1941,
          "title": "Declare your AIndependence: block AI bots, scrapers and crawlers with a single click",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/Declareyour-AIndependence--block-AI-bots--scrapers-and-crawlers-with-a-single-click-OG-1.jpg"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": []
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": [
        {
          "id": "https://code.visualstudio.com/updates/v1_91",
          "author": null,
          "description": "Learn what is new in the Visual Studio Code June 2024 Release (1.91)\nRead the full article",
          "link": "https://code.visualstudio.com/updates/v1_91",
          "publishedOn": "2024-07-03T17:00:00.000Z",
          "wordCount": 3698,
          "title": "Visual Studio Code June 2024",
          "imageUrl": "https://code.visualstudio.com/assets/updates/1_91/release-highlights.png"
        }
      ]
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": []
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=40911245",
          "author": "deamanto",
          "description": "I'd also like to highlight another bad practice by Ticketmaster.\nWhen you purchase a ticket from them and resell it on their marketplace, once someone purchases it, they(Ticketmaster) hold your funds and only give you the money ~7-14 business days after the event is over. They say this is to verify the validity of the ticket.\nOn the buyer side, you purchase the ticket from the marketplace and it gets added to your account immediately. (I think) You get the barcode some time ~1 week before the actual event begins.\nThe confusion for me? Ticketmaster owned the ticket and all logic relating to the validity of it. The logic to validate this shouldn't be complex at all. They OWN the ticket. They KNOW it's legitimate because it never left their database. Yet they double dip and hold both buyer and seller funds. Events can be close to a year in the future but the seller won't see that until after that event ends.",
          "link": "https://news.ycombinator.com/item?id=40911245",
          "publishedOn": "2024-07-09T00:15:47.000Z",
          "wordCount": 2760,
          "title": "New comment by deamanto in \"Reverse engineering Ticketmaster's rotating barcodes\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40909611",
          "author": "yjftsjthsd-h",
          "description": "If I'm understanding correctly, it might help to point out that in spite of the title they are proposing a bootloader, which can still let you modify the cmdline, boot to other OSs, etc. It's just that the bootloader is itself using the Linux kernel so it can do things like read all Linux filesystems for \"free\" without having to rewrite filesystem drivers.",
          "link": "https://news.ycombinator.com/item?id=40909611",
          "publishedOn": "2024-07-08T20:57:40.000Z",
          "wordCount": 2298,
          "title": "New comment by yjftsjthsd-h in \"No more boot loader: Please use the kernel instead\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40909068",
          "author": "lqet",
          "description": "You really shouldn't start a PhD without doing the PhD simulator first [0]. Sadly, people who haven't yet been through the PhD experience think that this game is exaggerating for comic effect. It really isn't.\n[0] https://research.wmz.ninja/projects/phd/index.html",
          "link": "https://news.ycombinator.com/item?id=40909068",
          "publishedOn": "2024-07-08T20:07:37.000Z",
          "wordCount": 2364,
          "title": "New comment by lqet in \"How I turned seemingly 'failed' experiments into a successful PhD\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40908918",
          "author": "alerighi",
          "description": "It's something you can do since a lot of years. I used to do so 10 years ago, when I've got the first motherboard with UEFI. But is it useful? It saves a minimal time in the boot sequence, but at what cost?\nThe bootloader (being it grub, or something more simple as systemd-boot) is useful to me for a couple of reasons:\n- it allows to dual-boot with Windows easily: motherboard boot menu is often not easy to access, you need to perform some key combination in a short window, also modern bootloader save the last boot option such that if Windows reboots for an update Linux does not start\n- it allows to edit the cmdline of the kernel to recover a system that does not boot, e.g. start in single user mode. That can really save your day if you don't have on hand an USB stick and another PC to flash it\n- it allows you to choose between multiple kernels and initrd images easily, again for recovery purposes\n- it has a voice for entering the UEFI setup menu: in most modern systems again entering the UEFI with a keyboard combination is unnecessarily difficult and has a too short timeout\n- it allows you to boot any other EFI application, such as memtest, or efi shell. Most UEFI firmwares doesn't have a menu to do so.",
          "link": "https://news.ycombinator.com/item?id=40908918",
          "publishedOn": "2024-07-08T19:55:27.000Z",
          "wordCount": 8130,
          "title": "New comment by alerighi in \"No more boot loader: Please use the kernel instead\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40908837",
          "author": "artninja1988",
          "description": "If operating z library is their only \"crime\" I wish the couple luck and thank them for their service. Hard to say what the money laundering charges are about though",
          "link": "https://news.ycombinator.com/item?id=40908837",
          "publishedOn": "2024-07-08T19:48:52.000Z",
          "wordCount": 2365,
          "title": "New comment by artninja1988 in \"Z-Library admins \"escape house arrest\" after judge approves U.S. extradition\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40907022",
          "author": "RScholar",
          "description": "> Software developers are the wizards and shamans of the modern age. We ought to use our powers with the austerity and integrity such power implies.\nThis is one of the most powerful truths underlying the world we currently inhabit. The sooner we can agree to behave accordingly, the better our prospects for ripping the reigns of society from the hands of those whose only animating principles are avarice and exploitation.",
          "link": "https://news.ycombinator.com/item?id=40907022",
          "publishedOn": "2024-07-08T16:50:49.000Z",
          "wordCount": 5066,
          "title": "New comment by RScholar in \"Reverse engineering Ticketmaster's rotating barcodes\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40906688",
          "author": "ikesau",
          "description": "Really good post! I also found this quote which distilled their position in the 404media coverage of the situation.\n> “What I can say for sure is that TicketMaster and AXS have had every opportunity to support scam-free third party ticket resale and delivery platforms if they wished: By documenting their ticket QR code cryptography, and by exposing apps and APIs which would allow verification and rotation of ticket secrets,” Conduition told me in an email. “But they intentionally choose not to do so, and then they act all surprised-pikachu when 3rd party resale scams proliferate. They're opting to play legal whack-a-mole with scammers instead of fixing the problem directly with better technology, because they make more money as a resale monopoly than as an open and secure ecosystem.”\nfrom https://www.404media.co/scalpers-are-working-with-hackers-to...",
          "link": "https://news.ycombinator.com/item?id=40906688",
          "publishedOn": "2024-07-08T16:16:57.000Z",
          "wordCount": 745,
          "title": "New comment by ikesau in \"Reverse engineering Ticketmaster's rotating barcodes\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40905437",
          "author": "deeth_starr_v",
          "description": "From the article: Paul Cassell, a lawyer for victims’ family members, said he plans to ask the federal judge on the case to reject the deal and “simply set the matter for a public trial, so that all the facts surrounding the case will be aired in a fair and open forum before a jury.”\nHard to disagree",
          "link": "https://news.ycombinator.com/item?id=40905437",
          "publishedOn": "2024-07-08T13:50:48.000Z",
          "wordCount": null,
          "title": "New comment by deeth_starr_v in \"Boeing to plead guilty to criminal fraud charge stemming from 737 MAX crashes\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40903239",
          "author": "supernova87a",
          "description": "Our governmental methods of punishment for corporations strike me as lacking.  This seems similar to Wells Fargo, where ok, the company was fined, sued, made to pay restitution (somewhat) to victims.  But underlying it all, the culture and incentives at the company that produced the situation didn't get fundamentally changed.   Which often perpetuates across specific leaders, boards, and is a part of what a company is -- and doesn't just get replaced by removing one or two people.\nWhat does it take?   You have to dismantle a company before it changes these kinds of deep-rooted issues?    Or can a government penalty call for that?  That is hard to achieve.  Who's going to change the evaluation procedures that HR has in place to measure what rating or bonus you get this year?  That seems to me as important as who is CEO.\nNone of the penalties courts mete out (short of dissolution/fined into bankruptcy) seem to be able to achieve this level of change needed.",
          "link": "https://news.ycombinator.com/item?id=40903239",
          "publishedOn": "2024-07-08T07:11:04.000Z",
          "wordCount": null,
          "title": "New comment by supernova87a in \"Boeing to plead guilty to criminal fraud charge stemming from 737 MAX crashes\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40898727",
          "author": "__turbobrew__",
          "description": "I was on the board of directors for a local Linux Users Group and can echo the difficulties in finding a venue. In a city full of empty office spaces on a weekday night it was virtually impossible to find a stable meeting location. Without a stable meeting location you are much less likely to establish a core group since people do not like to have to learn how to get to different venues.\nMozilla hosted us at one point but the political tides changed there and we got kicked out. I think having strong buy in from someone in the C-suite of a company is the only real way to do it. Otherwise you are beholden to the changing winds of the company.\nIn the end we are now in a stable location in the local library, but only because we had someone on the inside. Previously when we approached the library we were stone walled without someone to grease the wheels.\nI do believe that it should be a mandate for the municipality to provide meeting space for local non-profit and special interest groups. In many locations you can no longer pool some money with your buddies to buy a piece of land to build your clubhouse on. In my city there are many such clubs which were formed 50 years ago — the sailing club, the badminton club, the lawn bowling club, etc — but land is too scarce in many places now and we need the municipalities to pick up the slack.",
          "link": "https://news.ycombinator.com/item?id=40898727",
          "publishedOn": "2024-07-07T16:45:45.000Z",
          "wordCount": null,
          "title": "New comment by __turbobrew__ in \"A reawakening of systems programming meetups\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40897897",
          "author": "Aurornis",
          "description": "> I used to attend a bunch of meetups before the pandemic. But I quickly got disillusioned. Almost every meetup was varying degrees of startups pitching their product. The last straw for me was sitting through a talk at a JavaScript meetup that was by a devrel employee of a startup who literally gave a tutorial for their product.\nMy favorite local meetups fell to problems like this.\nIt was easy to filter out the DevRel people trying to advertise. The hard problem was filtering out people who were only interested in presenting something so they could show another presentation on their resume or personal brand website, with no interest in engaging with the meetup.\nThese people would want to only show up for the one meetup where they got to present. They’d present some simple content designed to make them look good, with little regard to educating or discussing things. They’d often have some excuse for needing to leave quickly after presenting, some times before any QA time.\nAnd they always needed a video recording of themselves speaking. For a while we had these to stream to remote viewers, but if the camera gear wasn’t available they’d panic and spend a lot of time improvising a way to record it with their phone even if delayed the presentation. Getting the recording of themselves speaking was the primary goal, not actually speaking to the group.\nAfter this happens enough times, the core members realize they’re being used as audience props for someone’s career advancement and they stop coming. The meetup collapses.\nI hope my local meetup groups can have a little resurgence like this where people are primarily interested in the meetup, not the self promotion opportunity.",
          "link": "https://news.ycombinator.com/item?id=40897897",
          "publishedOn": "2024-07-07T14:16:03.000Z",
          "wordCount": 1493,
          "title": "New comment by Aurornis in \"A reawakening of systems programming meetups\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40897715",
          "author": "charrondev",
          "description": "I work on a community forum platform and we detect YouTube embeds and replace them proxied thumbnails that don’t load until clicked.\nJust because one person in a thread shares a YouTube video doesn’t mean everyone else loading that page should have to download 1MB+ of YouTube’s JavaScript bloat and have their IPs tracked by google.",
          "link": "https://news.ycombinator.com/item?id=40897715",
          "publishedOn": "2024-07-07T13:48:45.000Z",
          "wordCount": null,
          "title": "New comment by charrondev in \"YouTube embeds are heavy and it’s fixable\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40897658",
          "author": "jitl",
          "description": "Hi, I’m the author of the underlying quickjs-emscripten runtime library. I like your ergonomic kind of “standard library” for quickjs-emscripten :)\nDid you try running in the browser or with a bundler? I think accepting the variant name as a string you pass to import(variantName) dynamically may not play well with Webpack et al.\nEDIT: SECURITY WARNING: this library exposes the ability for the guest (untrusted) code to `fetch` with the same cookies as the host `fetch` function. You must not run untrusted code if enabling `fetch`. Library should come with a big blinking warning about what is safe and unsafe to enable when running untrusted code. It’s not a “sandbox” if the sandboxed code can call arbitrary HTTP APIs authenticated as the host context!\nThe reason quickjs-emscripten  is low-level and avoids magic is so I can confidently claim that the APIs it does provide are secure. I generally reject feature requests for magical serialization or easy network/filesystem access because that kind of code is a rich area for security mistakes. When you run untrusted code, you should carefully audit the sandbox itself, but also audit all the code you write to expose APIs to the sandbox.\nIn this case a comment from an other HN user asking about Fetch cookies tipped me off to the potential security issue.\nMore reading:\nFigma blog posts on plugin sandbox security:\n- https://www.figma.com/blog/how-we-built-the-figma-plugin-sys...\n- https://www.figma.com/blog/an-update-on-plugin-security/\nQuickjs-emscripten README: https://github.com/justjake/quickjs-emscripten",
          "link": "https://news.ycombinator.com/item?id=40897658",
          "publishedOn": "2024-07-07T13:40:56.000Z",
          "wordCount": null,
          "title": "New comment by jitl in \"Show HN: Execute JavaScript in a WebAssembly QuickJS sandbox\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40895904",
          "author": "curl-up",
          "description": "> In 1544, physician and botanist Pietro Andrea Mattioli described the leaves as smelling like bed bugs or stink bugs...\nIncredible that neither this, nor the other linked article, even mention the fact that this stink-bug/soap taste is genetically predetermined for some people [1], so above quote can by no means be taken as an argument that cilantro \"became unfashionable\" so authors started describing it negatively.\nInstead, the real story is probably much more interesting, as the changes in cilantro popularity could probably be connected to waves of migrations and general genetic pool changes in a particular place.\n[1] https://en.wikipedia.org/wiki/OR6A2",
          "link": "https://news.ycombinator.com/item?id=40895904",
          "publishedOn": "2024-07-07T07:44:35.000Z",
          "wordCount": null,
          "title": "New comment by curl-up in \"Why Italy Fell Out of Love with Cilantro\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40894595",
          "author": "LeFantome",
          "description": "[Edit: apologies for the wall of text. A lot of pent up emotion around Creo.]\nBest place I ever worked.\nThis was “the Creo Philosophy”:\nOur priority is to provide unique and sustainable value to our customers.\n1. All decisions must be based on sound economics.\n2. Key decisions are made in consensus, with full team agreement to accept and implement the decision.\n3. We believe that people are most effective when self-managed.\n4. Compensation is based on contribution, gauged largely by an annual peer review.\n5. All employees share the wealth created by their hard work and innovation.\nCreo was extremely proud of how “flat” the organization was but my primary take-away from there as an ex-employee is actually how important management is.\nFirst and foremost, management created a shared vision of…",
          "link": "https://news.ycombinator.com/item?id=40894595",
          "publishedOn": "2024-07-07T01:33:23.000Z",
          "wordCount": null,
          "title": "New comment by LeFantome in \"Advantages of incompetent management\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40894363",
          "author": "netcoyote",
          "description": "As a data point, the Blizzard sales team’s projections were that we would sell 4,000 copies of StarCraft in a year in South Korea, so there was no reason to in localize the game.\nFirst year sales were on the order of 100x that amount, quite the surprise for everyone at Blizzard!",
          "link": "https://news.ycombinator.com/item?id=40894363",
          "publishedOn": "2024-07-07T00:34:23.000Z",
          "wordCount": null,
          "title": "New comment by netcoyote in \"Starcraft (A History in Two Acts)\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40892151",
          "author": "tonyarkles",
          "description": "One of the most interesting discussions I've had around this was at a small company who mass-hired a bunch of people from a big company. We went round and round in circles for a while because of issues similar to what you're describing. I ran a small 4-6 person hardware team (softly blurry on the edges) and the new people wanted significant amounts of design and documentation review as well as financial oversight. We needed $40 worth of solder and connectors and had to wait a week for PO approval as well as demonstrate that we had gotten multiple quotes... even though there was just a store down the block that sold exactly what we needed.\nAnyway, after a month or two of this I started catching significant flak because my team was nowhere near as productive as it used to be. Complaining about slow POs was met with \"maybe you should plan better\". Complaining about design reviews for one-off boards that would go from idea-to-problem solved was met with \"you're engineers, you need to document your work\". It was painful and I came very close to resigning.\nWhat ultimately worked, though, was figuring out a catch phrase that spoke the language of the new people: \"accountability without authority\". This ruffled some feathers but once I repeated \"you are trying to hold me accountable for delivering a $500,000 project on time but are not giving me authority to buy $40 worth of stuff to execute on that\" enough times it finally got through and the system started to change. But man did it suck for a while.",
          "link": "https://news.ycombinator.com/item?id=40892151",
          "publishedOn": "2024-07-06T18:22:18.000Z",
          "wordCount": null,
          "title": "New comment by tonyarkles in \"The magic of small engineering teams\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40891799",
          "author": "throwup238",
          "description": "The difference in their geochemistry is substantial so even if chromium isn't technically that much more abundant, it's significantly easier to mine.\nThe Gibbs free energy of formation for chromium oxides and chromite is much more negative than for lithium-bearing minerals so Cr compounds are thermodynamically favored to precipitate out of melts and solutions, forming minerals with high concentrations that then get pushed up by other processes. Li+, with its lone valence electron, just doesn't form strong bonds or highly stable mineral phases in comparison. On top of that the diffusion coefficients for Cr species in magmas and rocks are generally orders of magnitude lower than for Li. Cr gets locked into crystal structures early and stays put, while Li keeps migrating and diffusing in the form of water soluble minerals. There's also a whole biogeochemical cycle for Cr involving microbes that can concentrate it in sediments.",
          "link": "https://news.ycombinator.com/item?id=40891799",
          "publishedOn": "2024-07-06T17:25:15.000Z",
          "wordCount": null,
          "title": "New comment by throwup238 in \"First anode-free sodium solid-state battery\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40891415",
          "author": "thrtythreeforty",
          "description": "They are refunding for them. But in my opinion, you only get a couple of these un-launches before you get a reputation like Google has.\nAmazon has cancelled lots of consumer stuff in the past (the Alexa buttons or whatever they were) but cancelling business-facing things is new. Businesses are much more cancellation averse than forgetful consumers have proven to be.",
          "link": "https://news.ycombinator.com/item?id=40891415",
          "publishedOn": "2024-07-06T16:23:22.000Z",
          "wordCount": null,
          "title": "New comment by thrtythreeforty in \"Amazon is bricking $2,350 Astro robots 10 months after release\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40888774",
          "author": "supermatt",
          "description": "That third party app stores are subject to review by apple is a problem in itself.",
          "link": "https://news.ycombinator.com/item?id=40888774",
          "publishedOn": "2024-07-06T07:31:32.000Z",
          "wordCount": null,
          "title": "New comment by supermatt in \"Apple okays Epic Games marketplace app in Europe\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40886120",
          "author": "kelnos",
          "description": "I guess it's good that there's a new solution to this problem, but I wish it just wasn't a problem in the first place.  It's ridiculous that someone can't just walk around outside, making a video of what they're doing, and post it, without having to worry that some copyrighted music is playing in the background for some portion of it.\nThat sort of situation should be considered fair use, and copyright owners who attempt to make trouble for people caught up in this situation should be slapped down, hard, and fined.",
          "link": "https://news.ycombinator.com/item?id=40886120",
          "publishedOn": "2024-07-05T21:21:34.000Z",
          "wordCount": null,
          "title": "New comment by kelnos in \"YouTube's eraser tool removes copyrighted music without impacting other audio\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40884673",
          "author": "gcp123",
          "description": "Author makes a good point. \"1700s\" is both more intuitive and more concise than \"18th century\". \nThe very first episode of Alex Trebeck's Jeopardy in 1984 illustrates how confusing this can be:\nhttps://www.youtube.com/watch?v=KDTxS9_CwZA\nThe \"Final Jeopardy\" question simply asked on what date did the 20th century begin, and all three contestants got it wrong, leading to a 3-way tie.",
          "link": "https://news.ycombinator.com/item?id=40884673",
          "publishedOn": "2024-07-05T17:52:42.000Z",
          "wordCount": null,
          "title": "New comment by gcp123 in \"Let's stop counting centuries\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40882247",
          "author": "wavemode",
          "description": "Always obligatory https://mikelui.io/img/c++_init_forest.gif",
          "link": "https://news.ycombinator.com/item?id=40882247",
          "publishedOn": "2024-07-05T12:47:36.000Z",
          "wordCount": null,
          "title": "New comment by wavemode in \"I have no constructor, and I must initialize\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40877710",
          "author": "duffpkg",
          "description": "Lifepo4 (lithium iron phosphate) batteries for the home are pretty cheap as of today. Power storage for residential use in a 48v metal rackable linkable system with battery management system (BMS) is $89/kwh shipped/duty paid from reputable chinese suppliers CATL/Seplos etc. You have to wait for sea shipping, add $30/kwh if you want to buy it in the US today.\nFrom the same suppliers sodium batteries are currently $130/kwh and about 26% less efficient in the same form factor. I look forward to this changing.\nDue to rising power costs I moved one of my homes completely to solar and battery (lifepo4) and haven't had any problems. I can't imagine ever going back to the power company. Panels have gotten to the point of being ridiculously cheap. I have a lot of space. I purchased pallets of used panels for more or less the cost of transportation ($34 per panel 270w). They produce about 85% of their nominal rating.\nI mention this because other comments mention costs that are much much higher.",
          "link": "https://news.ycombinator.com/item?id=40877710",
          "publishedOn": "2024-07-04T20:15:06.000Z",
          "wordCount": null,
          "title": "New comment by duffpkg in \"Batteries: How cheap can they get?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40877288",
          "author": "Schiphol",
          "description": "The paper [here](https://bhi.co.uk/wp-content/uploads/2024/06/07-HJJuly24-AOT...) makes it clear that these researchers (whose main topic is gravitational waves) have used Bayesian analyses to estimate how likely different counts for holes present in the full calendar ring are. This is cool, but the bit about \"techniques developed to analyse the ripples in spacetime\" is, well, making reference to Bayesian analysis.",
          "link": "https://news.ycombinator.com/item?id=40877288",
          "publishedOn": "2024-07-04T19:12:43.000Z",
          "wordCount": null,
          "title": "New comment by Schiphol in \"Gravitational wave researchers cast new light on Antikythera mechanism mystery\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40874156",
          "author": "adamgordonbell",
          "description": "Host here, thanks for sharing.\nPowerShell faced extreme opposition at Microsoft, and its creator Jeffrey Snover was demoted for pursuing it.\nJeffrey was originally brought into Microsoft to help MS learn how to compete in the data center, but culturally they were so tied to the personal computer model of the world, that they fought him every step of the way.\nEdit: Another interesting thing, is how Powershell exists because Windows isn't file based. Jeffrey's goal was server administration, but on Windows you can't just edit files to administer things, you need to call various APIs and get structured data back forth. The rich object model fell out of that. It was the only way.\n( Also, apologies if the transcript has errors. I've gone from professional transcriptions to Descript and then a pass of GPT4 trying to find the right punctation breaks and then me doing a quick read through. I don't think its coming out as high quality as I'd like. )",
          "link": "https://news.ycombinator.com/item?id=40874156",
          "publishedOn": "2024-07-04T11:55:08.000Z",
          "wordCount": null,
          "title": "New comment by adamgordonbell in \"Jeffrey Snover and the Making of PowerShell\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40873472",
          "author": "febeling",
          "description": "I had similar thoughts. But let's not overlook the information asymmetry, which contributed to the dissatisfaction. I don't want to live in a world which is controlled unilaterally, and intransparently by a group of people who assume they have a full picture of the situation and assume they understand moral completely, and also don't think it necessary to explain how they think so highly of themselves.",
          "link": "https://news.ycombinator.com/item?id=40873472",
          "publishedOn": "2024-07-04T09:09:18.000Z",
          "wordCount": null,
          "title": "New comment by febeling in \"Shipt’s algorithm squeezed gig workers, who fought back\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40872836",
          "author": "vouwfietsman",
          "description": "> It's worth repeating: Unless you have a stake in the company, it is NOT your job to make sure the company is the most profitable it can be. Your job is to create great software\nThis is a terrible take, and one I generally see as a signal of lack of seniority in a software dev. It is absolutely everybody's job in the company to make sure it is profitable, unless you work for a non-profit.\nThe thing is though, that profitable is not the same as \"just ship it\". If you're in a company where those things are conflated frequently, that's a sign of lack of seniority in management.\n> Your job is to create great software\nIt really isn't, your job is to make a great product. Making a great product often, but not always, requires great software. Many great products have terrible software behind them. The tension between product, sales and development should result in a compromise that creates the most value short, middle and long term. It is 100% your job as a developer to understand what can and cannot be hacked, what priorities the company has beside delivering great software, and finally: when great software must be made, because compromise is unwise.\nJust like the boy who cried wolf, the developer who can never compromise on software quality is powerless when there is an actual reason to not compromise on software quality, and rightfully so.",
          "link": "https://news.ycombinator.com/item?id=40872836",
          "publishedOn": "2024-07-04T06:38:52.000Z",
          "wordCount": null,
          "title": "New comment by vouwfietsman in \"The saddest \"Just Ship It\" story ever (2020)\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40869863",
          "author": "LarsDu88",
          "description": "According to Jensen it takes about 8000 H100s running for 90 days to train a 1.8 Trillion param MoE GPT-4 scale model.\nMeta has about 350,000 of these GPUs and a whole bunch of A100s. This means the ability to train 50 GPT-4 scale models every 90 days or 200 such models per year.\nThis level of overkill suggests to me that the core models will be commoditized to oblivion, making the actual profit margins from AI-centric companies close to 0, especially if Microsoft and Meta keep giving away these models for free.\nThis is actually terrible for investors, but amazing for builders (ironically).\nThe real value methinks is actually over the control of proprietary data used for training which is the single most important factor for model output quality. And this is actually as much an issue for copyright lawyers rather than software engineers once the big regulatory hammers start dropping to protect American workers.",
          "link": "https://news.ycombinator.com/item?id=40869863",
          "publishedOn": "2024-07-03T20:51:30.000Z",
          "wordCount": null,
          "title": "New comment by LarsDu88 in \"AI's $600B Question\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40868676",
          "author": "iforgotpassword",
          "description": "My secret protip: old Fujitsu desktop/nuc PCs. At least in Germany (Europe?) they are cheap on ebay since a lot of businesses use them and upgrade on a regular schedule.\nIf you care about power consumption like I do, you can Google \"$model energy consumption white paper\" which contains very accurate data about idle usage, for example https://sp.ts.fujitsu.com/dmsp/Publications/public/wp-energy...\nIn one case I had a nuc where on Linux after enabling power saving features for the sata controller, idle usage even fell to 5W when the pdf claimed 9.\nHaving an actual pc instead of a random sbc ensures best connectivity, expandability, and software support forever. With almost all sbcs you're stuck with a random-ass kernel from when the damn thing was released, and you basically have to frankenstein together your own up-to-date distro with the old kernel because the vendor certainly doesn't care about updating the random armbian fork they created for that thing.",
          "link": "https://news.ycombinator.com/item?id=40868676",
          "publishedOn": "2024-07-03T18:23:56.000Z",
          "wordCount": null,
          "title": "New comment by iforgotpassword in \"The Cheapest NAS\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=52856",
          "author": "Chris Bertram",
          "description": "I’ve spent many hours trying to take pictures of these over the past three years and have a large collection of indistinct blurs as a result. But I went back to basics, studied the camera setting, watched a bunch of “how to” videos on YouTube and actually managed this one:",
          "link": "https://crookedtimber.org/2024/07/07/sunday-photoblogging-swift-3/",
          "publishedOn": "2024-07-07T07:45:41.000Z",
          "wordCount": 1769,
          "title": "Sunday photoblogging: Swift",
          "imageUrl": "https://live.staticflickr.com/65535/53825059791_9146a056b1.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52851",
          "author": "Chris Armstrong",
          "description": "In the UK, we’re all waking up to the prospect of a new government. The election was an oddity: Labour has converted a modest 35% vote share into a whopping Parliamentary majority; the Tories did somewhat better than suggested, on around 24%, but have lost more than two-thirds of their MPs. (The final figures were […]",
          "link": "https://crookedtimber.org/2024/07/05/bye-bye-tories-hello-what/",
          "publishedOn": "2024-07-05T09:53:40.000Z",
          "wordCount": 11453,
          "title": "Bye bye, Tories, hello what?",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52847",
          "author": "Kevin Munger",
          "description": "In the 18 months since I quit Twitter, I can feel the atrophy of my vibe detector. I’m reading more than ever, on Substack and the FT, Discord and group chats — much of the same “content” I would’ve encountered on Twitter, in fact, but without the ever-present spiderweb of the social graph, the network […]",
          "link": "https://crookedtimber.org/2024/07/03/does-social-media-cause-anything/",
          "publishedOn": "2024-07-03T17:34:39.000Z",
          "wordCount": 8231,
          "title": "Does Social Media Cause Anything?",
          "imageUrl": "https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F400487e4-3d8d-4e00-b637-462496a892f1_493x302.png"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/End-Austerity-A-Global-Report-on-Budget-Cuts-and-Harmful-Social-Reforms-in-2022",
          "author": "Isabel Ortiz, Matthew Cummins",
          "description": "This report exposes the dangers of a post-pandemic austerity shock, far more premature and severe than the one that followed the global financial crisis. It finds that 85 percent of the world's population is living in the grip of austerity, more than 6.3 billion people. Governments must urgently identify alternative financing options to support their populations that are coping with multiple and compounding crises - from health, energy, finance and climate shocks to unaffordable living (...)\nEnglish\n\n/ \nPoverty, \nAusterity/Structural Adjustment, \nIMF",
          "link": "https://www.cadtm.org/End-Austerity-A-Global-Report-on-Budget-Cuts-and-Harmful-Social-Reforms-in-2022",
          "publishedOn": "2024-07-08T17:14:28.000Z",
          "wordCount": 1904,
          "title": "End Austerity: A Global Report on Budget Cuts and Harmful Social Reforms in 2022-25",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1200xH630/b96f942523c71fab5dd5c2a6b3610f-c3e99.jpg"
        },
        {
          "id": "https://www.cadtm.org/Broken-Britain",
          "author": "Michael Roberts",
          "description": "UK citizens vote in a general election on 4 July. The opinion polls currently forecast that the incumbent Conservative party will be heavily defeated after 14 years in government. The opposition Labour party is expected to gain a majority of over 250 seats, a record landslide, with the Conservatives getting less than 100 seats. \nEnglish\n\n/ \nUnited Kingdom, \nCapitalism, \nInequality, \nInflation",
          "link": "https://www.cadtm.org/Broken-Britain",
          "publishedOn": "2024-07-04T11:02:43.000Z",
          "wordCount": 4259,
          "title": "Broken Britain",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1061xH558/6d7e96c9a2bd611e28a7418b709dd2-22c23.jpg"
        },
        {
          "id": "https://www.cadtm.org/Structural-Adjustment-and-the-Washington-Consensus-Are-Not-Abandoned-in-2000",
          "author": "Eric Toussaint",
          "description": "In July 2024, the World Bank and the IMF will be 80 years old. 80 years of financial neo-colonialism and the imposition of austerity policies in the name of debt repayment. 80 years is enough! The Bretton Woods institutions must be abolished and replaced by democratic institutions serving an ecological, feminist and anti-racist bifurcation. To mark these 80 years, we are republishing a series of articles every Wednesday until July, looking in detail at the history and damage caused by these (...)\nEnglish\n\n/ \nAusterity/Structural Adjustment, \nIMF, \nWorld Bank, \nFinance against people, \n80 ans BM FMI EN",
          "link": "https://www.cadtm.org/Structural-Adjustment-and-the-Washington-Consensus-Are-Not-Abandoned-in-2000",
          "publishedOn": "2024-07-03T09:36:55.000Z",
          "wordCount": 5828,
          "title": "Structural Adjustment and the Washington Consensus Are Not Abandoned in 2000",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/71d4d4e0c2ffc7444e2bf3a93e276f-a4794.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=7973",
          "author": "disassociated.com",
          "description": "Apparently red wines made in Australia — and quite possibly elsewhere, I imagine — have been increasing in alcoholic strength over recent decades. This seems like a mystery of the times, because the go-to culprit, global warming, may not be responsible. Rather, the way grapes are grown, and changes in fermenting methods — which apparently […]",
          "link": "https://disassociated.com/climate-change-increasing-strength-australian-red-wine/",
          "publishedOn": "2024-07-08T21:00:45.000Z",
          "wordCount": 249,
          "title": "Is climate change increasing the strength of Australian red wine?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7967",
          "author": "disassociated.com",
          "description": "Rhett Allain, writing for Wired, looks at the physics of this important question. If humanity is ever to establish bases on the Moon, ways of keeping occupants fit in the low lunar gravity need to be worked out. A wall of death sort of gizmo, that’s a little like a stationary hamster-wheel, but turned on […]",
          "link": "https://disassociated.com/physics-running-keeping-fit-moon/",
          "publishedOn": "2024-07-07T21:00:30.000Z",
          "wordCount": 308,
          "title": "The physics of running and keeping fit on the Moon",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7958",
          "author": "disassociated.com",
          "description": "Break out the coffee and the cake: a celebration is on the cards. Tomorrow, Threads, Meta’s answer — and much needed foil — to X/Twitter, notches up its first birthday. I was there as the platform began rolling out, and managed to score (just) a relatively low (five-figure) badge number. 98,522 for the record. These […]",
          "link": "https://disassociated.com/threads-first-birthday-gift-users-advertising/",
          "publishedOn": "2024-07-04T21:00:29.000Z",
          "wordCount": 679,
          "title": "Threads first birthday gift to users: advertising?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7951",
          "author": "disassociated.com",
          "description": "That’s the good news. Tory Shepherd, writing for The Guardian, says the recently discovered exoplanet, dubbed Gliese 12b, might be able to host liquid water. We all know what that means. If there’s water, there may be life. Gliese 12b is so named because it orbits a star called Gliese. Now for the bad news. […]",
          "link": "https://disassociated.com/potentially-habitable-earth-size-planet-forty-light-years-away/",
          "publishedOn": "2024-07-03T21:00:53.000Z",
          "wordCount": 441,
          "title": "Potentially habitable Earth size planet forty light years away",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20240704",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20240704",
          "publishedOn": "2024-07-04T15:20:00.000Z",
          "wordCount": 533,
          "title": "Week Ending June 30, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/damage-control",
          "author": null,
          "description": "Iran’s ‘reformist’ president.",
          "link": "https://newleftreview.org/sidecar/posts/damage-control",
          "publishedOn": "2024-07-09T16:42:00.000Z",
          "wordCount": 2831,
          "title": "Eskandar Sadeghi-Boroujerdi: &ldquo;Damage Control&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/gettyimages-2158433025-scaled.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/gaucho-lepenism",
          "author": null,
          "description": "On France’s far-right vote.",
          "link": "https://newleftreview.org/sidecar/posts/gaucho-lepenism",
          "publishedOn": "2024-07-05T18:02:45.000Z",
          "wordCount": 2867,
          "title": "Martin Barnay: &ldquo;Gaucho-Lepénisme?&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/4bddt-n08024-425-e1720371743736.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/majority-without-a-mandate",
          "author": null,
          "description": "Elections in the UK.",
          "link": "https://newleftreview.org/sidecar/posts/majority-without-a-mandate",
          "publishedOn": "2024-07-05T16:24:18.000Z",
          "wordCount": 1710,
          "title": "Richard Seymour: &ldquo;Majority Without a Mandate&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/9549ca10-3ad9-11ef-9d6c-7960f16c54d6.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/familiar-faces",
          "author": null,
          "description": "The photography of Johny Pitts.",
          "link": "https://newleftreview.org/sidecar/posts/familiar-faces",
          "publishedOn": "2024-07-05T13:16:23.000Z",
          "wordCount": 2140,
          "title": "Owen Hatherley: &ldquo;Familiar Faces&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/junglist-massive.jpg"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://notes.jeddacp.com/a-reminder-to-take-a-walk-and-breathe/",
          "author": null,
          "description": "A non-stressful day at work is hard to come by. I am constantly straddling the fine line between being burnt out, and just flipping a table and walking away. At the end of the day, those two feelings are basically the same side of a coin.\nI work remotely full-time, for the most part. Sometimes I travel for workshops, but that’s mostly just at the beginning of kicking off a new product that I’ve been asked to build. Any other time, I’m mostly working in my home office, which has become my favorite place in the house, yet the place where I stress out the most.\nI spend a lot of time in front of a computer. I’m in meetings probably 5-6 hours a day. With a majority of my current team in Central and Eastern time zones (2-3 hours ahead of me), sometimes I also forget to take a break and eat. It’s easy to lose track of time when I’m focused on solving this problem or that.\nI also forget to breathe.\nThe weather finally cooled down yesterday, and a little bit today before we hit another heat wave. LSC constantly encourages me, and at times pushes me to go for a walk. Take a walk around the block, and just breathe. We practice breathing together, inhaling and exhaling. Inhale the fresh air slowly, keep it in for a few seconds, exhale slowly. Then we go back in the house, and I feel a tiny bit better.\nSometimes we get into what we’re doing so deeply that we forget the essentials. We forget to breathe. We don’t notice it until we’re drowning, and it’s even harder to get back to the surface. Sometimes all it takes is a reminder to stop what you’re doing, take a walk if you can, and breathe.\nSo hey, let this be a reminder.\nGo for a walk. Inhale that fresh air. Hold it in. Exhale.\n7/100\nReply by email",
          "link": "https://notes.jeddacp.com/a-reminder-to-take-a-walk-and-breathe/",
          "publishedOn": "2024-07-09T17:24:00.000Z",
          "wordCount": 1034,
          "title": "A Reminder to Take a Walk and Breathe",
          "imageUrl": "https://live.staticflickr.com/65535/53782563411_08bc0b1e71_c.jpg"
        },
        {
          "id": "https://notes.jeddacp.com/how-i-edit-my-photos/",
          "author": null,
          "description": "During National Camera Day , I wrote about my non-exhaustive list of cameras I’ve owned. A lot of great discussions came out of this, both via Mastodon and email. One of those things is in regard to my post-processing workflow.\n\nAs you can see in my respose to Lou, I currently do very little when it comes to post-processing photos. It wasn’t always like this, but I think that’s a story for another post. This one will focus specifically on what I do now (which isn’t much).\nBoth of my primary cameras (Fujifilm X100V and Ricoh GRIIIx) have some sort of film simulation that I can set up in-camera and I rely on that to do a majority of my edits.\nIn my Fujifilm X100V, I primarily use the Reggie’s Portra film sim\nClassic Chrome\nDynamic Range: DR-Auto\nHighlight: -1\nShadow: -1\nColor: +2\nNoise Reduc…",
          "link": "https://notes.jeddacp.com/how-i-edit-my-photos/",
          "publishedOn": "2024-07-08T15:47:04.262Z",
          "wordCount": 1181,
          "title": "How I Edit My Photos",
          "imageUrl": "https://live.staticflickr.com/65535/53343625084_67cc9a1c96_c.jpg"
        },
        {
          "id": "https://dostoynikov.com/the-emotional-disconnect-with-ai-made-works/",
          "author": null,
          "description": "I'm definitely not against the usage of AI. It's a very helpful and powerful tool for many things. It's being used for web designs, graphical elements, illustrations, articles, videos, stories, etc.\nHowever, I think we might be missing one thing. For me, one of the reasons I love certain content, designs, and articles is because they are human-made. Human made things are not perfect. Imperfection makes the whole story/concept/design better. The beauty and charm lie in the imperfections and the fact that I know it's done by another living being like me. Thanks to this fact, I form connections to the things I consume.\nPersonally, I can not feel emotional connection to AI-made products. It does not matter if it is perfect or not. As soon as I know that it is AI-made, I start to dislike it suddenly. It's definitely not a rational way of thinking and is completely emotional, I know. But that's where AI might have difficulties understanding human behavior. Humans are unpredictable and imperfect. Stories — the whole process of creating something from beginning to end — are really important for humans, and knowing that there is a human in the process makes it more valuable.\nSo I think that, in the future, AI-made things might start to be something that people might try to avoid on purpose, and value non-AI-made/human-made things much more just because they are human-made, imperfect and have a story in it. People might start to demand non-AI works. \\ AI might lose it's popularity just because of being AI.",
          "link": "https://dostoynikov.com/the-emotional-disconnect-with-ai-made-works/",
          "publishedOn": "2024-07-07T18:24:00.000Z",
          "wordCount": 922,
          "title": "The emotional disconnect with AI made works",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://tiramisu.bearblog.dev/slapping-watermelons/",
          "author": null,
          "description": "One of my favorite childhood memories is eating watermelons in the summer. Not just the carnal joy of eating them — crunching the sweetness between my teeth and feeling the wetness run down my chin — but the rest of the process too. Watching my dad slap and thump the melons in the supermarket to pick a good one while my brother and I clowned around and mimicked him. Crowding around the cutting board to seeing if we split open a good one. And of course, the best part: spooning the first bite of dark red flesh from the center and watching the juice pour into the crater left behind.\nA crate of watermelons greeted me at the supermarket last week and I decided I wanted to buy one for the first time, just to try it. After slapping a few cluelessly (are they supposed to talk back to you or something?) I pushed my cart to a corner and looked up how to pick a good watermelon. I ended up coming across this helpful graphic:\n\nI don't know what my dad was listening for when he tapped and slapped all those watermelons. Like with most things, I'm sure I asked him about it and promptly forgot his answer. In hindsight, I don't think he was that good at choosing them, despite growing up on a farm, because he took home a number of watermelons that were pale and watery inside. And I've been thinking about that as I sprinkle tajín on my watermelon slices and drip pink juice on the counter, how he was probably winging it too, along with the rest of adult- and parenthood, the same way I was slapping watermelons at the market last week and feeling like a fool waiting to be found out.",
          "link": "https://tiramisu.bearblog.dev/slapping-watermelons/",
          "publishedOn": "2024-07-07T17:52:00.000Z",
          "wordCount": 730,
          "title": "slapping watermelons",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://yordi.me/re-reading-indie-blogs-right/",
          "author": null,
          "description": "Hi Loren,\nThe story of how I found your blog is an interesting one. It fits perfectly with why I'm writing this to you (and any other reader who stumbles upon it). I came across a post by Chris on Uncountable about the magic of reading blog posts on the original website. He linked to your post with the same title. This is how the IndieWeb is supposed to work: you visit someone's website via a link and then embark on an adventure through the indie jungle, arriving somewhere you didn't expect.\nThese moments are magical. Adventures like these lead you from one scenic website to another. It's like walking through an ancient forest that seems straight out of The Lord of the Rings, only to find a light at the end where you enter a place as stunning as Rivendell.\nThis post could have been a Fw: (forward) instead of a Re: (reply). I couldn't agree more with your statement:\n\"These bloggers put time and effort into making their websites – the design, the 'About Me' page, the Archives. In an app, all that disappears, replaced by a sterile, uniform layout.\"\nThe real magic is in this effort, the years of tears and sweat that people put into creating their websites. It's something you completely miss out on when reading everything in the blandness of an RSS reader. It's like watching Mad Max on the tiny screen of your phone instead of the magnificent and overwhelming IMAX cinema experience.\nThere is so much enchantment in taking that little extra effort to open a post on someone's website.\nThis is where the real IndieWeb comes to life.\nWith love,\nYordi",
          "link": "https://yordi.me/re-reading-indie-blogs-right/",
          "publishedOn": "2024-07-07T09:53:00.000Z",
          "wordCount": 1501,
          "title": "Re: Reading Indie Blogs Right",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/yordi-1720345894.webp"
        },
        {
          "id": "https://birming.com/trash-treasure/",
          "author": null,
          "description": "I had dinner with a close friend yesterday.\nAfterward, I sent a photo I took of her. She wrote back that she thought it looked awful. I replied that I thought it was beautiful, which I honestly did. I wrote that maybe it's like hearing your voice; it always feels a little strange and \"ugly.\"\nThe thought lingered while I sat on the subway home…\nPerhaps it's the same phenomenon that happens when we're dissatisfied with our writing. The observer and the observed are too close to each other to make a fair judgment. It's like looking at a painting up close and thinking it looks terrible. It's like a trial where the judge and the defendant are the same person.\nWe are in a constant state of bias when it comes to judging our work.\nAnyone who's been blogging for a while has experienced this: You post something you almost threw away because you thought it was garbage, and it turns out to be one of your most popular posts.\nBias.\nNext time you find yourself with your index finger resting on the delete button, move it to publish. Your trash might be someone else’s treasure.",
          "link": "https://birming.com/trash-treasure/",
          "publishedOn": "2024-07-07T09:27:00.000Z",
          "wordCount": 787,
          "title": "Your trash might be someone else’s treasure",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1717834500-0.jpeg"
        },
        {
          "id": "https://jbrr.dev/long-awaited-bear-media-center/",
          "author": null,
          "description": "I hope I'm not telling any tales out of school. If I am, bring the lifetime ban hammer down on me hard, Herman.\nA recent update has exposed an experimental media library in your Bear dashboard. It was committed two weeks ago, so this might be old news, but this is a considerable improvement for general ease of use.\nThe URL is https://bearblog.dev/<subdomain>/dashboard/media/ and should look like this.\n\nPro Tip: Use the Customize Dashboard functionality to add a link in your footer for easy access.\nExcellent work, Herman, as always!",
          "link": "https://jbrr.dev/long-awaited-bear-media-center/",
          "publishedOn": "2024-07-07T06:55:00.000Z",
          "wordCount": 1052,
          "title": "Long Awaited Bear Media Center",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jbrr-1719724355.jpg"
        },
        {
          "id": "https://alexandrawolfe.ca/youve-got-mail/",
          "author": null,
          "description": "I was reading Veronique's post this afternoon, Just A Small Town Girl, and smiled at her lovely doodles. But there was one that caught my eye and then, brought a lump to my throat. It featured a stamp and the words, Post Air Mail. And it hit me. I hadn't had any real mail from anyone (not including birthday or Christmas cards) not since my mum passed back in 1999.\nIt sent a shiver down my spine not just because that was over 20 years ago, but because, the last handwritten letter I ever got, was from a dead woman: my mother.\nWhere ever I was in the world, travelling and or working, my mother almost religiously took time out of her day to write an aerogramme to me. Do you remember those? You buy them at any post office, singularly or in packs. I think my mother had a draw full of them—after …",
          "link": "https://alexandrawolfe.ca/youve-got-mail/",
          "publishedOn": "2024-07-06T17:44:04.350Z",
          "wordCount": 1015,
          "title": "You've Got Mail",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/awolfe-1720287818.jpg"
        },
        {
          "id": "https://birming.com/why-so-serious/",
          "author": null,
          "description": "I recently did work in the Swedish archipelago. So beautiful! On days like that, it's hard to believe you're at work.\nThis time, the sky opened up, and the rain poured down for a short while. The sky looked amazingly powerful as I stood on the shore and looked out over the ocean.\nIt's stunning how small you feel at times like this. Not only that, but your worries and problems also feel small. Things that you otherwise attach great importance to suddenly don’t feel all that important there and then. You just stand there with your smallness somewhere in the vastness of the universe and marvel — everything stops.\nA few hours later, I stepped ashore, jumped on my bike, and felt how everyday life was slowly but surely making its way back…\n\"I have to stop at the grocery store on the way home. Oh, I almost forgot; I have to do laundry today. I wonder if I can make it to the gym. On the last day of the month, I have to remember to report my working hours. Oh yeah, I have to log and send in my expenses for the month.”\nThings that need to be done. They don’t get done by standing and staring straight up at the sky in an attempt to make them small enough to disappear.\nBut now and then, we can try to remind ourselves of the emptiness that surrounds all these little musts and problems. Our inner, limitless space can teach us not to take everything so seriously.",
          "link": "https://birming.com/why-so-serious/",
          "publishedOn": "2024-07-05T15:49:00.000Z",
          "wordCount": 829,
          "title": "Why so serious?",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1717834500-0.jpeg"
        },
        {
          "id": "https://grubz.blog/the-indie-web-is-saving-my-sanity/",
          "author": null,
          "description": "A lot of my posts have covered stuff I don't ever have the time of day to talk about. I work too much and almost all of my coworkers are conservative boomers. I don't talk to most of them  much but every once in a while I'll have to share a store with some of them. Sometimes they give me random phone calls. Luckily I have the option of just not picking up the phone.\nI just don't relate with the people I have to interact with on the regular. I mean we aren't having heavy political conversations 24/7 but it just doesn't feel comfortable being around people who you know are the polar opposite of who you are.\nI feel like being able to write about the stuff I never get to talk about is a healthy counterweight to that. I'm not a great writer, I know a lot of the stuff I write won't be read for weeks, or possibly ever. Some of it might be boring or come across cheesy. Sometimes I cover really broad, uninteresting things.\nBut it has had the unexpected effect of making me feel more valid as a person. It feels odd saying that, but it's true.\nMaybe it's because I haven't had a hobby I can get lost in for too long. Making the rounds in different indie web neighborhoods, learning little bits of CSS and bringing my vision to life one piece at a time does a pretty good job at keeping me from getting bored and letting my mind wander to stress. Then when I'm done with that for a while I can write some more. Sometimes I'm proud of it, sometimes I delete it after a couple hours.\nIt feels... healthier than doomscrolling. I prefer this over traditional social media because of the ownership and freedom, and the fact that I sort of get to whisper what I'm saying rather than blasting it over a megaphone and putting myself on stage in front of an audience riding algorithmic dopamine waves.",
          "link": "https://grubz.blog/the-indie-web-is-saving-my-sanity/",
          "publishedOn": "2024-07-04T04:13:14.001Z",
          "wordCount": 990,
          "title": "The indie web is saving my sanity",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://kylevallans.bearblog.dev/market-to-me/",
          "author": null,
          "description": "*** Add your email below if you’d like to get access to our overnight momentum trading chat! Free for a month, then $6/month.\nIn it, you’ll find both retail and proprietary traders. Guys who work(ed) for SMB, KTG, Avatar, Chimera & Seven Points that you can network and trade alongside with.\nSubscribe to my blog\nOver the last 7 years, I have exclusively focused on trading. Well, to be fair, it's more so the last 5 years. The first 2 years as a retail trader, I had one of those so called \"well-rounded lives\". I traded, went out often, hung out after the close with friends & fam, enjoyed snowboarding, camping, and mountain biking more than most.\nBut, over the last 5 years as a professional trader living in NY and ATX and working out of both offices, I gave up everything, one by one to focus e…",
          "link": "https://kylevallans.bearblog.dev/market-to-me/",
          "publishedOn": "2024-07-03T17:20:00.000Z",
          "wordCount": 1508,
          "title": "Finding Myself Beyond the Trading Floor",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://birming.com/bear-blog-tips/",
          "author": null,
          "description": "If you've been here before, you may have visited the Blog Inspiration page. It contains a lot of good and useful resources when it comes to blogging: writing, design, blog challenges, webrings, shortcuts...\nNow there's one more: Bear Blog.\nIt's the blogging platform I use and love. It's also used by many of my favorite bloggers and some of my readers. In other words, it deserves its own Bear section.\nThese are currently on the list (those marked with * requires an upgraded account):\nConvert bear blog CSV exports to markdown files\nRandom link (external)\nRandom link (internal) *\nAdd external link markers\nAdd a search feature *\nEstimated reading time *\nCustomizing the upvote button\nCount your posts\nAdding a \"reply via email\" button\nAdding a private feedback box *\nDo you have suggestions for things to include? Or maybe you have an idea for a \"hack\" you would like someone to put together?\nContact me and I will add it to this post.\nHappy Bear blogging! 🐻\nPS. For official changes and feature suggestions, see the changelog and roadmap.",
          "link": "https://birming.com/bear-blog-tips/",
          "publishedOn": "2024-07-03T17:19:00.000Z",
          "wordCount": 763,
          "title": "Bear Blog Tips & Tricks Collection",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1717834500-0.jpeg"
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/sascha-engel-primitive-anarchy-and-the-anti-alphabet?v=1720450402",
          "author": null,
          "description": "Author: Sascha Engel\nTitle: Primitive anarchy and the anti-alphabet\nDate: Summer 2024\nSource: Plastic in Utero issue #3\n\n The way I see it, primitive anarchy is a total challenge to the pacified social field. This means that it is multi-faceted and at once constructive and destructive. Sabotaging the horrors of deep sea mining or “artificial intelligence” requires a different approach than the rewilding of everyday life. Inasmuch as the anti-alphabet is a part of primitive anarchy, it belongs with efforts to rewild everyday life. From this perspective, I think what it does can be summarized in three theses, on which I’ll expand below: \n 1) The terms of the pacified social field – the nouns, verbs, and adjectives of everyday language – are not actually words. Language abolition is only a se…",
          "link": "https://theanarchistlibrary.org/library/sascha-engel-primitive-anarchy-and-the-anti-alphabet?v=1720450402",
          "publishedOn": "2024-07-08T14:53:22.000Z",
          "wordCount": 2357,
          "title": "Sascha Engel - Primitive anarchy and the anti-alphabet",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "9052",
            "url": "https://theanarchistlibrary.org/library/sascha-engel-primitive-anarchy-and-the-anti-alphabet.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/william-gillis-what-s-in-a-slogan-kylr-and-militant-anarcha-feminism?v=1720111778",
          "author": null,
          "description": "Author: William Gillis\nTitle: What’s In A Slogan? “KYLR” and Militant Anarcha-feminism\nDate: June 25, 2024\nNotes: William Gillis: https://twitter.com/rechelon\nSource: Retrieved on July 4, 2024 from https://c4ss.org/content/59691\n\n An anarchist walks out of a punk show to smoke. On her vest are anarchist patches with various standard slogans, “No Gods No Masters,” “Death To Transphobes,” “Kill Your Local Rapist,” “All Cops Are Bastards,” “Punch Nazis,” “From The River To The Sea Palestine Will Be Free,” “Make Total Destroy,” “The Only Good Cop Is A Dead Cop,” “Eat The Rich,” “Death Before Detransition” and… “Fire To The Prisons.” \n A suddenly red-faced bystander trots up to her to argue. \n“Oh so you’re saying you support a blanket social policy of allowing anyone to burn anything they accus…",
          "link": "https://theanarchistlibrary.org/library/william-gillis-what-s-in-a-slogan-kylr-and-militant-anarcha-feminism?v=1720111778",
          "publishedOn": "2024-07-04T16:49:38.000Z",
          "wordCount": 18894,
          "title": "William Gillis - What’s In A Slogan? “KYLR” and Militant Anarcha-feminism",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "59309",
            "url": "https://theanarchistlibrary.org/library/william-gillis-what-s-in-a-slogan-kylr-and-militant-anarcha-feminism.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/mb-sundjata-how-and-why-the-us-left-betrayed-tigray?v=1720081541",
          "author": null,
          "description": "Author: MB Sundjata\nTitle: How and Why the US Left Betrayed Tigray\nSubtitle: US organizations like PSL and Black Alliance for Peace cannot be trusted to advocate for Palestine’s liberation after they condemned nearly a million Tigrayans to genocide.\nDate: June 18, 2024\nSource: Retrieved from <redvoice.news/how-and-why-the-us-left-betrayed-tigray> on July 3, 2024\n\n I thought further and said: “Why do men lie over problems of such great importance, even to the point of destroying themselves?” and they seemed to do so because although they pretend to know all, they know nothing. Convinced they know all, they do not attempt to investigate the truth. — Zara Yacob of Aksum (Tigray), 17th-century philosopher, in The Hatata Inquiries\n (Content Warning: this article describes acts of genocide and w…",
          "link": "https://theanarchistlibrary.org/library/mb-sundjata-how-and-why-the-us-left-betrayed-tigray?v=1720081541",
          "publishedOn": "2024-07-04T08:25:41.000Z",
          "wordCount": 8853,
          "title": "MB Sundjata - How and Why the US Left Betrayed Tigray",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "636010",
            "url": "https://theanarchistlibrary.org/library/mb-sundjata-how-and-why-the-us-left-betrayed-tigray.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/the-di-fraye-arbeter-shtime-editorial-board-an-anonymous-group-of-polish-anarchists-yiddish-ana?v=1720078025",
          "author": null,
          "description": "Author: The Di fraye arbeter shtime Editorial Board, An Anonymous Group of Polish Anarchists, Eyshe Beirich\nTitle: Yiddish Anarchists’ Break Over Palestine\nDate: 1929\nNotes: An exchange in the anarchist newspaper Di fraye arbeter shtime after the 1929 Hebron massacre offers a case study in Jewish discourse and political reaction after immense violence. \n Introduced and translated from the Yiddish by Eyshe Beirich\nSource: Retrieved on 04/07/2024 from https://jewishcurrents.org/yiddish-anarchists-break-over-palestine-1929\n\nOn Friday, August 23rd, 1929, exaggerated rumors about the extent of Jewish violence against Palestinians and the desecration of holy sites in Jerusalem reached the Palestinian community of Hebron (Al-Khalil, in Arabic). What started as incensed Palestinians throwing stone…",
          "link": "https://theanarchistlibrary.org/library/the-di-fraye-arbeter-shtime-editorial-board-an-anonymous-group-of-polish-anarchists-yiddish-ana?v=1720078025",
          "publishedOn": "2024-07-04T07:27:05.000Z",
          "wordCount": 3547,
          "title": "The Di fraye arbeter shtime Editorial Board, An Anonymous Group of Polish Anarchists, Eyshe Beirich - Yiddish Anarchists’ Break Over Palestine",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "14982",
            "url": "https://theanarchistlibrary.org/library/the-di-fraye-arbeter-shtime-editorial-board-an-anonymous-group-of-polish-anarchists-yiddish-ana.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anarhija-info-horror-vacui?v=1720049426",
          "author": null,
          "description": "Author: anarhija.info\nTitle: Horror Vacui\nDate: February 10, 2018\nSource: <actforfree.nostate.net/?p=29728>. Retrieved on 03/07/2024 from lib.anarhija.net.\n\n There are anarchists who run after uprisings on other continents wherever the spotlights of the media fall. There are anarchists who talk about “fortress Europe” and they don’t even know which States are part of the EU. There are anarchists who struggle against the borders and they don’t even know where the Schengen frontier runs. There are anarchists who, like “good white men”, see in the “dark-skinned” non-EU people potential comrades, and they don’t even notice that there are European non-EU people. \n There are anarchists who talk about internationalism and they don’t even know (or don’t give a fuck) what happens on their own conti…",
          "link": "https://theanarchistlibrary.org/library/anarhija-info-horror-vacui?v=1720049426",
          "publishedOn": "2024-07-03T23:30:26.000Z",
          "wordCount": 1105,
          "title": "anarhija.info - Horror Vacui",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6291",
            "url": "https://theanarchistlibrary.org/library/anarhija-info-horror-vacui.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anarhija-info-aut-aut?v=1720049269",
          "author": null,
          "description": "Author: anarhija.info\nTitle: Aut Aut\nDate: 2016\nSource: <anarhija.info/library/anarhija-info-aut-aut-en>. Retrieved on 03/07/2024 from lib.anarhija.net.\n\n When I translated and published the pamphlet \"Individuality and the anarchist group\", signed by one of the CCF cells, Guerilla Urbana Cell, I added in a note that I didn’t do it because I agree with the content, but to make public how much this project, in my opinion, has turned away from its original form of tension to propose (or re-propose) an anarchist individualism which, in some ways, can be found in the pages of a different insurrectionist theory, but in this case approaching or even in some points leading to formal ideas, that is the formal organization. \n Similar proposals (informal platform, structured and specific organization…",
          "link": "https://theanarchistlibrary.org/library/anarhija-info-aut-aut?v=1720049269",
          "publishedOn": "2024-07-03T23:27:49.000Z",
          "wordCount": 2980,
          "title": "anarhija.info - Aut Aut",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "10764",
            "url": "https://theanarchistlibrary.org/library/anarhija-info-aut-aut.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/adriano-communique-from-prison?v=1720049064",
          "author": null,
          "description": "Author: Adriano\nTitle: Communiqué from prison\nDate: April 9, 2014\nSource: <actforfree.nostate.net/?p=16535>. Retrieved on 03/07/2024 from lib.anarhija.net.\n\n Violence generates violence. Regardless of what is right or wrong, no matter how abstruse is the boundary between opposites and how easily they can converge. The word violence and the concept it expresses present deep mystifications to those who have the monopoly on it. All expressions of dissent are being disproportionately repressed… no surprise… ‘go and tell them that it’s springtime’ [rough translation of ‘vagli a spiegare che è primavera’, a verse by the late anarchist singer and song-writer Fabrizio De Andrè]. \n The modus operandi of cops and politicians is infamous enough, with their artistic architecture made of inexistent cas…",
          "link": "https://theanarchistlibrary.org/library/adriano-communique-from-prison?v=1720049064",
          "publishedOn": "2024-07-03T23:24:24.000Z",
          "wordCount": 1777,
          "title": "Adriano - Communiqué from prison",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "8602",
            "url": "https://theanarchistlibrary.org/library/adriano-communique-from-prison.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}