{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": []
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": [
        {
          "id": "c6ac364a9cbf15333381e44f406fe89ede26cc9d",
          "author": "Vijay Shekhar Rao",
          "description": "This post was co-written with Shyam Narayan, a leader in the Accenture AWS Business Group, and Hui Yee Leong, a DevOps and platform engineer, both based in Australia. Hui and Shyam specialize in designing and implementing complex AWS transformation programs across a wide range of industries. Enterprises that operate out of multiple locations such as […]",
          "link": "https://aws.amazon.com/blogs/architecture/simplify-and-automate-bill-processing-with-amazon-bedrock/",
          "publishedOn": "2024-07-19T15:42:48.000Z",
          "wordCount": 1807,
          "title": "Simplify and automate bill processing with Amazon Bedrock",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fc074d501302eb2b93e2554793fcaf50b3bf7291/2024/07/10/fig1-automate-billing-bedrock-1260x601.png"
        }
      ]
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/category/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": []
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "910ef3a53d9d7fb2e0aa32c2b41b897b162560a8",
          "author": "Alicia Plotnikov",
          "description": "AppsFlyer is a global leader in mobile attribution and marketing analytics. AppsFlyer helps businesses understand the impact and their marketing efforts across every channel and device, through a comprehensive measurement platform and privacy cloud that fosters ecosystem collaboration while preserving customers’ privacy. Within AppsFlyer, data is the core, it gives the ability to expose detailed […]",
          "link": "https://aws.amazon.com/blogs/containers/harnessing-karpenter-transitioning-kafka-to-amazon-eks-with-aws-solutions/",
          "publishedOn": "2024-07-17T17:28:07.000Z",
          "wordCount": 2900,
          "title": "Harnessing Karpenter: Transitioning Kafka to Amazon EKS with AWS solutions",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/07/10/Featured-images-for-Containers-Blog-2-1260x630.jpg"
        },
        {
          "id": "cb24bb84b9abe4d08c13bcea2f3f6bb640f40ccf",
          "author": "Henry Yan",
          "description": "Introduction In today’s dynamic business landscape, operational efficiency and cost optimization are two critical ingredients for a successful business outcome. This is especially true for companies navigating through digital transformation. In 2020, Thomson Reuters (TR), a leader at the intersection of content and technology with trusted data, committed to a cloud-first strategy with Amazon Web […]",
          "link": "https://aws.amazon.com/blogs/containers/how-thomson-reuters-achieved-5x-operational-efficiency-and-30-cost-optimization-with-plexus-on-amazon-eks/",
          "publishedOn": "2024-07-17T16:31:57.000Z",
          "wordCount": 2630,
          "title": "How Thomson Reuters achieved 5X operational efficiency and 30% cost optimization with Plexus on Amazon EKS",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/07/17/Featured-images-for-Containers-Blog-3-1260x630.jpg"
        },
        {
          "id": "ce26d458d598d4737adde02742504651c450ef09",
          "author": "Tom Wright",
          "description": "Introduction Culture Amp is an employee experience platform that provides the insights into employee engagement, performance, and development that organizations need to build a category-defining culture. Culture Amp’s mission is to create a better world of work. Developer feedback loops An efficient developer feedback loop is a critical part of an effective development process – […]",
          "link": "https://aws.amazon.com/blogs/containers/accelerating-development-feedback-loops-with-aws-cdk-hotswap-deployments-for-amazon-ecs/",
          "publishedOn": "2024-07-16T04:43:25.000Z",
          "wordCount": 2406,
          "title": "Accelerating development feedback loops with AWS CDK hotswap deployments for Amazon ECS",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/07/04/Featured-images-for-Containers-Blog-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=328674",
          "author": "Vijay Prashad",
          "description": "NATO’s Washington Declaration contains a section that is puzzling. It says that China “has become a decisive enabler of Russia’s war against Ukraine.” The term “decisive enabler” has attracted significant attention within China, where the government immediately condemned NATO’s characterization of the war in Ukraine. China’s Foreign Ministry spokesperson Lin Jian said that NATO’s statement “is ill-motivated and makes no sense.” Shortly after Russian troops entered Ukraine, China’s Wang Wenbin of the Foreign Ministry said that “all countries’ sovereignty and territorial integrity should be respected and upheld.” This is precisely the opposite of cheerleading for the war. More\nThe post NATO Accelerates Its Conflict With China appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/22/nato-accelerates-its-conflict-with-china/",
          "publishedOn": "2024-07-22T06:01:55.000Z",
          "wordCount": null,
          "title": "NATO Accelerates Its Conflict With China",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328751",
          "author": "Binoy Kampmark",
          "description": "Bring out the bon bons, the bubbles, and the praise-filled memoranda for that old alliance.  At the three-quarter century mark of its existence, the North Atlantic Treaty Organisation is showing itself to be a greater nuisance than ever, gossiping, meddling, and dreaming of greater acts of mischief under the umbrella of manufactured insecurity.  It is also being coquettish to certain countries (Ukraine, figures prominently in the wooing stakes) making promises it can never make good. More\nThe post NATO: 75 and Still Threatening appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/22/nato-75-and-still-threatening/",
          "publishedOn": "2024-07-22T06:00:18.000Z",
          "wordCount": null,
          "title": "NATO: 75 and Still Threatening",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328768",
          "author": "Henry Giroux",
          "description": "An ideology of hardness and cruelty runs through American culture like an electric current, sapping the strength of social relations and individual character, moral compassion and collective action. Crimes against humanity now become fodder for video games and the Hollywood disimagination machine.  All of which creates an ecology of cruelty and sadism that promotes a “symbiosis of suffering and spectacle.” More\nThe post Welcome to the Mass Psychology of Violence American Style appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/22/welcome-to-the-mass-psychology-of-violence-american-style/",
          "publishedOn": "2024-07-22T05:59:32.000Z",
          "wordCount": null,
          "title": "Welcome to the Mass Psychology of Violence American Style",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328891",
          "author": "Stephen F. Eisenman",
          "description": "Alas, there is no evidence that Biden ended his run for re-election because of student protestors who have called him ‘Genocide Joe.” He quit reluctantly, without contrition or self-understanding. He sees himself as head of the “indispensable nation” and as acknowledged leader of the free world. He believes, sincerely it seems, that he’s the best candidate to defeat Trump and fend off the American bend toward fascism. In both respects he’s as delusional as Trump, if not as narcissistic. More\nThe post Biden Should Say a Lot More appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/22/328891/",
          "publishedOn": "2024-07-22T05:58:48.000Z",
          "wordCount": null,
          "title": "Biden Should Say a Lot More",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328848",
          "author": "Ron Jacobs",
          "description": "I try to avoid watching the Republican and Democratic conventions, not because I don’t care about US electoral politics but because the coverage tends to be worse than the spectacle itself. In the case of the Republican party and Donald Trump, the whole cursed thing is not only fiction, it’s cheesily produced fiction. Cheesy and  More\nThe post Biden Out, Trump Raging: The Shitshow Continues appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/22/biden-out-trump-raging-the-shitshow-continues/",
          "publishedOn": "2024-07-22T05:58:31.000Z",
          "wordCount": null,
          "title": "Biden Out, Trump Raging: The Shitshow Continues",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328884",
          "author": "John P. Ruehl",
          "description": "Recently appointed British Prime Minister Keir Starmer pledged his loyalty to British King Charles III on July 6, 2024, continuing a tradition that dates back centuries. However, since the leadership role taken by Prime Minister David Lloyd George in World War I, the monarchy’s political influence has become progressively ceremonial and even more precarious since the death of the  More\nThe post How Powerful Are the Remaining Royals? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/22/how-powerful-are-the-remaining-royals/",
          "publishedOn": "2024-07-22T05:55:57.000Z",
          "wordCount": null,
          "title": "How Powerful Are the Remaining Royals?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328875",
          "author": "David McCall",
          "description": "Kumho Tire herded workers into anti-union brainwashing sessions, fired union supporters, including a mother of seven who was eight months pregnant, and plastered the plant with anti-labor literature during the workers’ drive to join the United Steelworkers (USW). “They even had caps that said, ‘Vote No,’” recalled Christopher Burks, who helped to lead the union organizing effort.  More\nThe post How Conservatives Are Plotting to Gut Americans’ Labor Rights appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/22/how-conservatives-are-plotting-to-gut-americans-labor-rights/",
          "publishedOn": "2024-07-22T05:55:46.000Z",
          "wordCount": null,
          "title": "How Conservatives Are Plotting to Gut Americans’ Labor Rights",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328837",
          "author": "Paul Street",
          "description": "Stephen Hahn, Illiberal America: A History (W.W. Norton, 2024) A Joe Biden executive order issued seven weeks ago significantly rolled back the classic liberal right to asylum in the United Stated for masses of Latin Americans desperate to escape miserable conditions imposed by US capitalism-imperialism.  The order “would,” the American Civil Liberties Union (ACLU) noted, “rush  More\nThe post Trumpism is Worse Than Merely “Illiberal” appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/22/trumpism-is-worse-than-merely-illiberal/",
          "publishedOn": "2024-07-22T05:55:35.000Z",
          "wordCount": null,
          "title": "Trumpism is Worse Than Merely “Illiberal”",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328880",
          "author": "Maria Paez Victor",
          "description": "Joseph Conrad insightfully wrote in his book Lord Jim: “You shall judge of a man by his foes as well as by his friends“. The same can be said about a nation. So, it should be a clue to any observant person, that the forces of the extreme right, and those who are hoodwinked by them,  More\nThe post Venezuela Contra Mundum appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/22/venezuela-contra-mundum/",
          "publishedOn": "2024-07-22T05:55:16.000Z",
          "wordCount": null,
          "title": "Venezuela Contra Mundum",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328840",
          "author": "Ralph Nader",
          "description": "Unless the GOP in Congress has a last-minute rethinking, P.M. Netanyahu of Israel will enjoy his record-setting fourth address to a Joint Session of Congress on July 24, 2024. Scores of Democrats are boycotting the event. Meanwhile, in Gaza, Netanyahu is committing mass murders/war crimes and killing hundreds of thousands of Palestinian civilians, most of  More\nThe post Congressional Day of Infamy – July 24, 2024! appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/22/congressional-day-of-infamy-july-24-2024/",
          "publishedOn": "2024-07-22T05:50:48.000Z",
          "wordCount": null,
          "title": "Congressional Day of Infamy – July 24, 2024!",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328820",
          "author": "Dean Baker",
          "description": "Leading media outlets like The New York Times, The Atlantic, and The New Yorker have about as much concern for intellectual consistency as TikTok videos. In very serious and somber tones they will warn the rest of us about a major problem and then in the next issue, or the next article, present a story  More\nThe post AI, Guaranteed Income, and the “Which Way Is Up?” Problem Afflicting Our Elites appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/22/ai-guaranteed-income-and-the-which-way-is-up-problem-afflicting-our-elites/",
          "publishedOn": "2024-07-22T05:44:15.000Z",
          "wordCount": null,
          "title": "AI, Guaranteed Income, and the “Which Way Is Up?” Problem Afflicting Our Elites",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328835",
          "author": "Mel Gurtov",
          "description": "The Criminals Former FBI director James Comey once compared Donald Trump’s gang of loyalists to the Mafia. “Holy crap, they are trying to make each of us an amica nostra—friend of ours. To draw us in.” And draw in people Trump did: cabinet members and other officials, campaign workers, lawyers, talking heads at Fox. The very  More\nThe post Gathering of the Clan: The Trump Criminal Enterprise at the RNC appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/22/gathering-of-the-clan-the-trump-criminal-enterprise-at-the-rnc/",
          "publishedOn": "2024-07-22T05:41:28.000Z",
          "wordCount": null,
          "title": "Gathering of the Clan: The Trump Criminal Enterprise at the RNC",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328842",
          "author": "Rivera Sun",
          "description": "Learn how political nonviolence can rehumanize us to one another and defend democracy in the U.S. and around the world. After the shooting at former President Trump’s campaign rally, many people rushed to say that “political violence has no place in our democracy.” Let’s go even further and boldly say: political nonviolence is essential for democracy. The  More\nThe post We Need Political Nonviolence Now More Than Ever appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/22/we-need-political-nonviolence-now-more-than-ever/",
          "publishedOn": "2024-07-22T04:20:52.000Z",
          "wordCount": null,
          "title": "We Need Political Nonviolence Now More Than Ever",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328753",
          "author": "Gerald Sussman",
          "description": "Sewage-flooded street in Gaza City. Photo: UNRWA.\nThe failure of Israel’s two most important allies, the US and UK, to put an end to the slaughter of the civilian population in Gaza in 2023-2024 and the American and British mainstream media’s refusal to contextualize the 7 October attack raises questions about their status as democratic states. What many independent journalists and academics have described as Israel’s genocidal policy in Gaza has a parallel in America’s “Indian removal” policies in the 19th century and British colonialism in India, where violent imperial rule brought about tens of millions of excess deaths between 1880 and 1920 (Sullivan & Hickel, 2022). The racist underpinnings of settler colonialism have thus been present in Western, specifically Judeo-Christian, political culture since Europeans first explored continents beyond their own. Modern day Zionism is a retrograde form of colonialism and imperialism that is rooted in 19th-century nationalist, militarist, capital-expansionist, and racist practices and outlooks of Western Europe from which it sprung.\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post The US-Israeli Regime of Despair appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/21/the-us-israeli-regime-of-despair/",
          "publishedOn": "2024-07-21T05:55:39.000Z",
          "wordCount": null,
          "title": "The US-Israeli Regime of Despair",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328675",
          "author": "Jeffrey St. Clair",
          "description": "Palestinian children running towards the Israeli Apartheid Wall in the West Bank.  Photo: Justin McIntosh, CC BY 2.0.\nThe International Court of Justice has made definitive what has been obvious for decades: It’s about the apartheid, stupid. In a sweeping ruling announced on Friday at the Hague, the Court ruled that Israel’s occupation of the Palestinian territories violates international law and should be ended. It determined that the occupation amounts to “annexation” of Palestinian lands and that all Israeli settlements should be evacuated and the land returned to Palestinians. It said that all Palestinians who had been forced into exile should be granted the right to return and that Israel must pay them reparations for its destructive actions. The court described Israel’s treatment of Palestinians in the occupied territories as a form of racial segregation and apartheid and called for the dismantling of the apartheid wall, checkpoints and other barriers to travel.\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post It’s the Apartheid, Stupid! appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/20/328675/",
          "publishedOn": "2024-07-20T14:05:00.000Z",
          "wordCount": null,
          "title": "It’s the Apartheid, Stupid!",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328366",
          "author": "Jeffrey St. Clair",
          "description": "Trump's would-be assassin, Crooks didn’t seem overtly political. His politics were the politics of the gun. He searched for the names of Biden and Trump, equally, it seemed and was likely to have pulled the trigger on the first one who entered the sights of his AR-15. There was just a dime’s worth of difference between them as far as he was concerned. Crooks is the next variation on Kyle Rittenhouse, a fucked up white kid, working a dead-end job in a shabbily run nursing home, who ventured forth bound for glory with a semi-automatic rifle in the Republic of the Shooter. More\nThe post Politics on the Verge of Nervous Breakdown appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/19/politics-on-the-verge-of-nervous-breakdown/",
          "publishedOn": "2024-07-19T06:03:16.000Z",
          "wordCount": null,
          "title": "Politics on the Verge of Nervous Breakdown",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328341",
          "author": "Fawzia Afzal-Khan",
          "description": "In this essay, I will describe my activism on behalf of Palestinians' human rights and their right to self-determination, from my graduate student days on a US campus, to the present in my position as a tenured full professor, and the ways in which I’ve experienced attempts at silencing and censorship. These attempts today are more blatant and worrisome than ever before on anyone speaking up for Palestine in the USA More\nThe post US Academia and the Censoring of an Anti-Zionist Professor appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/19/us-academia-and-the-censoring-of-an-anti-zionist-professor/",
          "publishedOn": "2024-07-19T06:00:52.000Z",
          "wordCount": null,
          "title": "US Academia and the Censoring of an Anti-Zionist Professor",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328511",
          "author": "Matthew Stevenson",
          "description": "Trump might well owe his next presidency to his would-be assassin, so perhaps, as it becomes clear that Crooks was in lockstep with Trumpism, a revived Warren Commission might be pressed into service to explain how the gunman himself was a victim of Deep State transgenderism and to attribute his rooftop violence to hormone blockers that robbed him of him of his manhood. More\nThe post Trump’s Day of the Jackal appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/19/trumps-day-of-the-jackal/",
          "publishedOn": "2024-07-19T06:00:42.000Z",
          "wordCount": null,
          "title": "Trump’s Day of the Jackal",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328513",
          "author": "Robert Hunziker",
          "description": "Fukushima Daiichi Nuclear Power Plant is the world’s leading epicenter of toxic radioactive water released into the ocean. Yet, these activities are no longer closely monitored by mainstream media. As it happens, Tokyo Electric Power Company is the electric utility that manages the decommissioning of the collapsed nuclear reactors. This controversial ongoing release of radioactive  More\nThe post Fukushima Toxic Dumping appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/19/fukushima-toxic-dumping/",
          "publishedOn": "2024-07-19T05:59:04.000Z",
          "wordCount": null,
          "title": "Fukushima Toxic Dumping",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328521",
          "author": "Bill Hatch",
          "description": "Tales of infants and young children dying because they can’t get enough to eat and distraught parents robbed of their dignity because they can do nothing for their kids (or themselves) are too numerous and ghastly to detail here. But just for a moment imagine that all of this was happening to your loved ones.  More\nThe post To a Starving Orphan Who Died Alone in Rubble  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/19/to-a-starving-orphan-who-died-alone-in-rubble/",
          "publishedOn": "2024-07-19T05:58:00.000Z",
          "wordCount": null,
          "title": "To a Starving Orphan Who Died Alone in Rubble",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328515",
          "author": "Ramzy Baroud",
          "description": "Much has been written about the political earthquakes in Britain and France, the first resulting in the crushing defeat of the Conservative Party and the latter in the overpowering of the far right, by a largely leftist coalition. But these were not the only important outcomes of the July 4 and July 7 general elections  More\nThe post When Supporting Israel is a Liability: Is Gaza Changing the West?  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/19/when-supporting-israel-is-a-liability-is-gaza-changing-the-west/",
          "publishedOn": "2024-07-19T05:57:59.000Z",
          "wordCount": null,
          "title": "When Supporting Israel is a Liability: Is Gaza Changing the West?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328547",
          "author": "Joseph Mangano",
          "description": "Forty U.S. nuclear power reactors have shut permanently. But for the first time, an attempt is being made to re-start a closed reactor – the Palisades reactor in southwest Michigan. The American experience with nuclear power began as Cold War fears of nuclear war and health hazards from bomb test fallout were widespread. President Eisenhower’s  More\nThe post Re-Opening a Permanently Shut Nuclear Reactor is a Dangerous Gamble appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/19/re-opening-a-permanently-shut-nuclear-reactor-is-a-dangerous-gamble/",
          "publishedOn": "2024-07-19T05:57:47.000Z",
          "wordCount": null,
          "title": "Re-Opening a Permanently Shut Nuclear Reactor is a Dangerous Gamble",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328468",
          "author": "Richard E. Rubenstein",
          "description": "One of the oddest arguments made by self-declared friends of Israel is that anti-Zionism is a form of antisemitism.  That assertion is comprehensible if the person making it believes that God Himself gave the Jews property rights from the river to the sea – but  Theodore Herzl and the founders of modern Zionism embraced no such belief.  On the contrary, that movement’s largely secularized leadership defined Zionism from the outset as a form of ethnic nationalism – a claim to the same “right of self-determination” as that asserted, say, by the Irish or the Serbs.  More\nThe post Zionism: the End of an Illusion appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/19/zionism-the-end-of-an-illusion/",
          "publishedOn": "2024-07-19T05:57:22.000Z",
          "wordCount": null,
          "title": "Zionism: the End of an Illusion",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328553",
          "author": "Yoav Litvin",
          "description": "Recently, real estate events in synagogues in Toronto, Los Angeles, and New Jersey, among other locations, have promoted property sales in Israel and the Occupied West Bank. In response, Palestinian communities have protested the sales and engaged in legal action. Marketing property assets in “Anglo neighborhoods,” events of this nature target Zionist Jews from the  More\nThe post Israel: Where Genocide Meets Real Estate appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/19/israel-where-genocide-meets-real-estate/",
          "publishedOn": "2024-07-19T05:56:20.000Z",
          "wordCount": null,
          "title": "Israel: Where Genocide Meets Real Estate",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328528",
          "author": "Ashley Smith",
          "description": "The United States was already headed for one of the most acute political crises in recent memory. Then former president and convicted felon Donald Trump was nearly assassinated at a rally in Pennsylvania. Having survived, Trump has consolidated his base and cornered the Democrats by blaming them for the attack. Trump will now position himself  More\nThe post The U.S. Hurtles Toward Political Crisis appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/19/the-u-s-hurtles-toward-political-crisis/",
          "publishedOn": "2024-07-19T05:56:01.000Z",
          "wordCount": null,
          "title": "The U.S. Hurtles Toward Political Crisis",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328647",
          "author": "David Yearsley",
          "description": "The country singer Lee Greenwood was born three weeks before Joe Biden. A self-styled evangelical Christian Republican, Greenwood is a wiry octogenarian, well-spoken and exuding a fiery intelligence. At 81, he pursues a performing schedule that would exhaust many a crooner or candidate half his age. It his piercing tenor voice, aided by electronic amplification  More\nThe post Hymn from Hell:  Greenwood Burns for Trump appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/19/hymn-from-hell-greenwood-burns-for-trump/",
          "publishedOn": "2024-07-19T05:55:53.000Z",
          "wordCount": null,
          "title": "Hymn from Hell:  Greenwood Burns for Trump",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328539",
          "author": "Binoy Kampmark",
          "description": "Politics and facts are not necessarily good dinner companions.  Both often stray from the same table, taking up with other, more suitable company.  The Australian opposition leader, Peter Dutton, has never been discomforted by facts, preferring the chimera-like qualities demagoguery offers.  His vision for Australia is admirably simple and simplistic. In foreign policy, he supports US interventions in  More\nThe post Nuclear Lunacy Down Under appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/19/nuclear-lunacy-down-under/",
          "publishedOn": "2024-07-19T05:55:18.000Z",
          "wordCount": null,
          "title": "Nuclear Lunacy Down Under",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328632",
          "author": "Eve Ottenberg",
          "description": "Americans hate the military draft. They revolted against it in stupendously high numbers in the 1960s and ‘70s, but the intellectual heavyweights in the House of Representatives idiotically brushed off that bit of relevant history with their odious vote June 14 to facilitate reinstatement of conscription. With any luck, they’ll reap the whirlwind they deserve.  More\nThe post Congressional Fiasco: The House Votes to Bring Back the Draft appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/19/congressional-fiasco-the-house-votes-to-bring-back-the-draft/",
          "publishedOn": "2024-07-19T05:55:17.000Z",
          "wordCount": null,
          "title": "Congressional Fiasco: The House Votes to Bring Back the Draft",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328567",
          "author": "Ed Sanders",
          "description": "1961 was a remarkable year, in which the USA was first being led by a young idealistic president, John F. Kennedy.  It was also the year of the Freedom Rides, when busloads of Freedom Riders had their buses attacked and burned when proceeding through the South, attempting to integrate restrooms and eating places. And it  More\nThe post A Tribute to Happy Traum appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/19/a-tribute-to-happy-traum/",
          "publishedOn": "2024-07-19T05:55:13.000Z",
          "wordCount": null,
          "title": "A Tribute to Happy Traum",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=328544",
          "author": "Stephen F. Eisenman – W.J.T. Mitchell",
          "description": "A Modest Proposal for Improving American Democracy The far-right ideologues celebrate With the Supreme Court’s recent decisions disempowering federal regulatory agencies (the “Chevron deference”) and granting the President criminal immunity for “official acts” in office, American democracy – long infirm – is nearly moribund. The far-right ideologues of the Claremont Institute, Foundation for Government Accountability,  More\nThe post Biden to Justices Alito and Thomas: “You’re Fired” appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/07/19/biden-to-justices-alito-and-thomas-youre-fired/",
          "publishedOn": "2024-07-19T05:55:04.000Z",
          "wordCount": null,
          "title": "Biden to Justices Alito and Thomas: “You’re Fired”",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": [
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=30761",
          "author": "Ben Hyman, Brian Kovak, and Adam Leive",
          "description": "Despite the existing safety net, worker displacement continues to have severe consequences that motivate the consideration of new social insurance programs. Wage insurance is a novel policy that temporarily provides additional income to workers who lose their job and become re-employed at a lower wage. In this post, we draw on evidence from our recent working paper analyzing the effects of a U.S. wage insurance program on worker earnings and employment outcomes. Among workers displaced by international trade, we find that eligibility for wage insurance increased the probability of employment in the first two years following job loss and led to higher long-term earnings. The program resulted in net savings to the government because workers collected fewer benefits and paid taxes on their increased earnings. Together, these findings suggest that wage insurance could support displaced workers more effectively than traditional social insurance programs.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/07/wage-insurance-a-potential-policy-for-displaced-workers/",
          "publishedOn": "2024-07-17T11:00:00.000Z",
          "wordCount": 4389,
          "title": "Wage Insurance: A Potential Policy for Displaced Workers",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/07/LSE_2024_wage-insurance_hyman_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=30757",
          "author": "Thomas Klitgaard",
          "description": "The consumer price index for groceries has risen more than the overall price index since the start of the pandemic, with a particularly large jump in 2022. In looking for explanations, a starting place is the behavior of raw commodity prices, which surged from early 2021 to mid-2022. In addition, wages for low-paid grocery workers have gone up faster than wages for the workforce as a whole. Finally, even though profit margins for grocery stores have gone up, the increase appears to be only a small contributor to the rise in food prices relative to the increase in their operating costs. This analysis suggests that the significant moderation in food inflation since the start of 2023 is due to still-high wage inflation for grocery workers being offset by the retreat in commodity prices.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/07/what-was-up-with-grocery-prices/",
          "publishedOn": "2024-07-16T11:00:00.000Z",
          "wordCount": 4263,
          "title": "What Was Up with Grocery Prices?",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/07/LSE_2024_grocery-store-prices_klitgaard_460.jpg"
        }
      ]
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45483",
          "author": "Editor",
          "description": "from Asad Zaman and WEA Pedagogy Blog In this sequence of posts, I will present the contents of the video podcast entitled “Michael Hudson: Why the US has a unique place in the history of imperialism? ” For me, Hudson’s book Super Imperialism: The Economic Strategy of the American Empire was an amazing eye-opener, essential reading […]",
          "link": "https://rwer.wordpress.com/2024/07/18/hudson-on-super-imperialism-1/",
          "publishedOn": "2024-07-18T17:22:07.000Z",
          "wordCount": 5043,
          "title": "Hudson on Super Imperialism 1",
          "imageUrl": "http://img.youtube.com/vi/K9nbj4X556A/0.jpg"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=275388",
          "author": "Conor Gallagher",
          "description": "The race to succeed Biden as nominee begins, Europe panics over Ukraine, and why do people keep driving into the water of a Hawaiian harbor?",
          "link": "https://www.nakedcapitalism.com/2024/07/links-7-22-2024.html",
          "publishedOn": "2024-07-22T10:55:43.000Z",
          "wordCount": 5129,
          "title": "Links 7/22/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/Screenshot-2024-07-21-at-9.08.33 PM-1024x768.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275397",
          "author": "Yves Smith",
          "description": "The Journal gives a largely sympathetic account of why fewer are having children, even as it may be going easy on cost pressures.",
          "link": "https://www.nakedcapitalism.com/2024/07/wall-street-journal-on-americans-being-less-willing-to-have-children.html",
          "publishedOn": "2024-07-22T10:54:26.000Z",
          "wordCount": 6239,
          "title": "Wall Street Journal on Americans Being Less Willing to Have Children",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275426",
          "author": "Yves Smith",
          "description": "How Obama rejecting Harris by calling for nominee selection assures not just more infighting but also serious donor fund wastage.",
          "link": "https://www.nakedcapitalism.com/2024/07/obama-call-for-open-convention-after-biden-withdrawal-assures-party-damaging-all-pay-auction-process.html",
          "publishedOn": "2024-07-22T10:53:09.000Z",
          "wordCount": 4530,
          "title": "Obama Call for Open Nomination After Biden Withdrawal Assures Party Damaging “All Pay Auction” Process",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/00-auction.jpeg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275407",
          "author": "Conor Gallagher",
          "description": "Biden's \"decline\" and withdrawal from the race is already being blamed on voters and used as an argument to return the candidate-selection process to an elite group of party insiders.",
          "link": "https://www.nakedcapitalism.com/2024/07/until-1968-presidential-candidates-were-picked-by-party-conventions-a-process-revived-by-bidens-withdrawal-from-race.html",
          "publishedOn": "2024-07-22T09:05:32.000Z",
          "wordCount": 6361,
          "title": "Until 1968, Presidential Candidates Were Picked by Party Conventions – A Process Revived by Biden’s Withdrawal From Race",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/Screenshot-2024-07-22-at-10.45.00 AM-790x1024.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275325",
          "author": "Conor Gallagher",
          "description": "",
          "link": "https://www.nakedcapitalism.com/2024/07/links-7-21-2024.html",
          "publishedOn": "2024-07-21T10:56:56.000Z",
          "wordCount": 28098,
          "title": "Links 7/21/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/Screenshot-2024-07-20-at-1.53.16 PM-841x1024.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275337",
          "author": "Conor Gallagher",
          "description": "Alternative for Germany and Sahra Wagenknecht are likely to perform well as government doubles down on failed policies and castigates voters.",
          "link": "https://www.nakedcapitalism.com/2024/07/the-us-vassal-state-of-germany-unravels.html",
          "publishedOn": "2024-07-21T10:00:46.000Z",
          "wordCount": 11439,
          "title": "The US Vassal State of Germany Comes Apart",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/Crisis-Constituencies-by-EU-Country-1024x527.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275360",
          "author": "Conor Gallagher",
          "description": "Knowing the true human toll resulting from soaring temperatures might help jolt the nation into action on climate change sooner and lessen the mitigation and resilience we will need.",
          "link": "https://www.nakedcapitalism.com/2024/07/wheres-the-death-data-on-heat-wildfire-smoke-and-other-climate-extremes.html",
          "publishedOn": "2024-07-21T09:00:04.000Z",
          "wordCount": 5662,
          "title": "Where’s the Death Data on Heat, Wildfire Smoke, and Other Climate Extremes?",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275331",
          "author": "Yves Smith",
          "description": "An initiative in the Southwestern US demonstrates that health care for the homeless can be financially viable.",
          "link": "https://www.nakedcapitalism.com/2024/07/a-california-medical-group-treats-only-homeless-patients-and-makes-money-doing-it.html",
          "publishedOn": "2024-07-20T13:05:01.000Z",
          "wordCount": 5897,
          "title": "A California Medical Group Treats Only Homeless Patients — And Makes Money Doing It",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/00-homeless-.webp"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275229",
          "author": "Yves Smith",
          "description": "Our truculent daily link: lab meat for pets, nasty fungus, moar Covid, floods. Starmer Brexit retreat, ICJ slams Israel for occupation, USPS data leak, US worries re Russia helping Houthis, Biden in the wind, moar Trump assassination skull-duggery, Crowdstrike 404, AI",
          "link": "https://www.nakedcapitalism.com/2024/07/links-7-20-2024.html",
          "publishedOn": "2024-07-20T10:55:32.000Z",
          "wordCount": 27916,
          "title": "Links 7/20/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/07/00-indie.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=275321",
          "author": "Yves Smith",
          "description": "China has apparently made a big nuclear fusion breakthrough. If true, how long would it take to commercialize it?",
          "link": "https://www.nakedcapitalism.com/2024/07/china-has-just-gained-first-mover-advantage-in-nuclear-fusion.html",
          "publishedOn": "2024-07-20T07:58:50.000Z",
          "wordCount": 8367,
          "title": "China Has Just Gained First-Mover Advantage In Nuclear Fusion",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "669a608f58eb3b000a368a2e",
          "author": "João Tomé",
          "description": "This week, the Republican National Convention was hosted in Milwaukee, Wisconsin from July 15 to 18, 2024. We examined traffic shifts and cyberattacks since June 2024 to see how these events have impacted the Internet",
          "link": "https://blog.cloudflare.com/exploring-internet-traffic-during-the-2024-us-republican-national-convention",
          "publishedOn": "2024-07-19T15:07:04.000Z",
          "wordCount": 1398,
          "title": "Exploring Internet traffic during the 2024 U.S. Republican National Convention",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/Exploring-Internet-traffic-during-the-2024-U.S.-Republican-National-Convention-OG-1.png"
        },
        {
          "id": "6690757a58eb3b000a367f33",
          "author": "Noah Crouch",
          "description": "Cloudflare is adding support for end-to-end private traffic flows to our local traffic management (LTM) load balancing solution, and allowing for the replacement of hardware load balancers",
          "link": "https://blog.cloudflare.com/eliminating-hardware-with-load-balancing-and-cloudflare-one",
          "publishedOn": "2024-07-16T13:02:00.000Z",
          "wordCount": 2024,
          "title": "Eliminating hardware with Load Balancing and Cloudflare One",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/Eliminating-hardware-with-Load-Balancing-and-Cloudflare-One-OG-1.png"
        },
        {
          "id": "6694b67558eb3b000a368051",
          "author": "David Belson",
          "description": "Government directed shutdowns and cable cuts were both significant sources of Internet outages in Q2 2024. This post explores these disruptions, as well as others caused by power outages, maintenance, technical problems, military action, and unknown causes",
          "link": "https://blog.cloudflare.com/q2-2024-internet-disruption-summary",
          "publishedOn": "2024-07-16T13:00:01.000Z",
          "wordCount": 4307,
          "title": "Q2 2024 Internet disruption summary",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/07/Q2-2024-Internet-disruption-summary-OG-1.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": [
        {
          "id": "https://kubernetes.io/blog/2024/07/19/kubernetes-1-31-upcoming-changes/",
          "author": null,
          "description": "As Kubernetes develops and matures, features may be deprecated, removed, or replaced with better ones for the project's overall health.\nThis article outlines some planned changes for the Kubernetes v1.31 release that the release team feels you should be aware of for the continued maintenance of your Kubernetes environment.\nThe information listed below is based on the current status of the v1.31 release.\nIt may change before the actual release date.\nThe Kubernetes API removal and deprecation process\nThe Kubernetes project has a well-documented deprecation policy for features.\nThis policy states that stable APIs may only be deprecated when a newer, stable version of that API is available and that APIs have a minimum lifetime for each stability level.\nA deprecated API has been marked for remo…",
          "link": "https://kubernetes.io/blog/2024/07/19/kubernetes-1-31-upcoming-changes/",
          "publishedOn": "2024-07-19T00:00:00.000Z",
          "wordCount": 4873,
          "title": "Kubernetes Removals and Major Changes In v1.31",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=21495",
          "author": null,
          "description": "What happens when a team of mechanical engineers get tired of looking at flat images of 3D models over Zoom? Meet the team behind Caddy, a new CAD app for mixed reality. They join Pascal Hartig (@passy) on the Meta Tech Podcast to talk about teaching themselves to code, disrupting the CAD software space, how [...]\nRead More...\nThe post Meet Caddy – Meta’s next-gen mixed reality CAD software appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/07/18/virtual-reality/caddy-cad-mixed-reality-mr-meta/",
          "publishedOn": "2024-07-18T13:00:26.000Z",
          "wordCount": 1578,
          "title": "Meet Caddy – Meta’s next-gen mixed reality CAD software",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/07/Meta-Tech-Podcast-Caddy.webp"
        },
        {
          "id": "https://engineering.fb.com/?p=21470",
          "author": null,
          "description": "The key to developer velocity across AI lies in minimizing time to first batch (TTFB) for machine learning (ML) engineers. AI Lab is a pre-production framework used internally at Meta. It allows us to continuously A/B test common ML workflows – enabling proactive improvements and automatically preventing regressions on TTFB.  AI Lab prevents TTFB regressions [...]\nRead More...\nThe post AI Lab: The secrets to keeping machine learning engineers moving fast appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/07/16/developer-tools/ai-lab-secrets-machine-learning-engineers-moving-fast/",
          "publishedOn": "2024-07-16T16:00:51.000Z",
          "wordCount": 2865,
          "title": "AI Lab: The secrets to keeping machine learning engineers moving fast",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/07/AI-Lab-Hero2.png"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": []
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=52870",
          "author": "Chris Bertram",
          "description": "Visit the post for more.",
          "link": "https://crookedtimber.org/2024/07/21/sunday-photoblogging-pigeon/",
          "publishedOn": "2024-07-21T12:31:51.000Z",
          "wordCount": 1715,
          "title": "Sunday photoblogging: pigeon",
          "imageUrl": "https://live.staticflickr.com/65535/53870840121_6c92159c62.jpg"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/Corporate-Corruption-of-South-African-Politics-and-Economics",
          "author": "Patrick Bond",
          "description": "‘Accumulation by Dispossession' as a Structural Process, beyond ‘State Capture' \nEnglish\n\n/ \nCorruption / financial criminality, \nSouthern Africa, \nCorporate",
          "link": "https://www.cadtm.org/Corporate-Corruption-of-South-African-Politics-and-Economics",
          "publishedOn": "2024-07-22T08:25:32.000Z",
          "wordCount": 14267,
          "title": "Corporate Corruption of South African Politics and Economics",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/33232c44a4b2586ed559437bfa7b5b-869b4.jpg"
        },
        {
          "id": "https://www.cadtm.org/Crowd-strikes-out",
          "author": "Michael Roberts",
          "description": "The massive tech failure that caused chaos around the world raises important questions about the ownership and control of our digital world. The relatively unknown, cyber-security firm CrowdStrike admitted that the problem was caused by an update to its antivirus software, which was designed to protect Microsoft Windows devices from malicious attacks. \n The outage was caused by just a tiny software update from CrowdStrike put into Microsoft programs bringing them down globally My ‘techie' (...)\nEnglish\n\n/ \nCapitalism, \nMultinational corporation",
          "link": "https://www.cadtm.org/Crowd-strikes-out",
          "publishedOn": "2024-07-22T06:09:23.000Z",
          "wordCount": 2269,
          "title": "Crowd strikes out",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1023xH538/b61234b1ba5752eea3b217a2e86d1b-fac3b.jpg"
        },
        {
          "id": "https://www.cadtm.org/CADTM-STATEMENT-ON-REPRESSION-IN-BANGLADESH",
          "author": "CADTM International",
          "description": "The CADTM denounces the brutality and violent crackdown against student demonstrators protesting against the government job quotas imposed by the government of Bangladesh. More than 150 deaths have been reported, while thousands of demonstrators have been injured. In a country where nearly 40% of young people lack employment and have limited access to education, the student movement is out in force on the streets, demonstrating against the decision that permits admission quotas into civil (...)\nPress releases\n\n/ \nSocial movements, \nBangladesh",
          "link": "https://www.cadtm.org/CADTM-STATEMENT-ON-REPRESSION-IN-BANGLADESH",
          "publishedOn": "2024-07-21T14:05:25.000Z",
          "wordCount": 1679,
          "title": "CADTM statement on repression in Bangladesh",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L429xH226/463e7ee7d036ac0d2bb484260d8a2b-ac442.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=8047",
          "author": "disassociated.com",
          "description": "If you enjoyed the novels of late British author Douglas Adams, you may enjoy this in-depth article about his later life, by Jimmy Maher. Adams, it seems, did not restrict his particular brand of humour to the written word. A regular customer at a coffee shop I used to go to, told me about an […]",
          "link": "https://disassociated.com/douglas-adams-unofficially-signed-copies-books-sydney-australia/",
          "publishedOn": "2024-07-21T21:00:03.000Z",
          "wordCount": 344,
          "title": "That time Douglas Adams unofficially signed copies of his books in Sydney, Australia",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8044",
          "author": "disassociated.com",
          "description": "Back in 2008, I had a brief tweet exchange with another Twitter member, about the merits of LinkedIn*. At that point, I was a member, but really didn’t like the platform. I thought having a personal website, showcasing your abilities, was a better idea. #IndieWeb me was thinking — all of sixteen years ago — […]",
          "link": "https://disassociated.com/linkedin-professional-network-blogging-platform/",
          "publishedOn": "2024-07-18T21:00:01.000Z",
          "wordCount": 439,
          "title": "LinkedIn, a professional network, or a blogging platform?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8032",
          "author": "disassociated.com",
          "description": "JTR, writing at The Art Of Not Asking Why: Indie blogs are like good spots in town. Sure, they’re on the map, but you need to ask the locals to point them out. In terms of indie blogs, this means other bloggers. Word of mouth is sure a great way to spread the news about […]",
          "link": "https://disassociated.com/to-find-indieweb-more-people-need-know-exists/",
          "publishedOn": "2024-07-17T21:00:08.000Z",
          "wordCount": 397,
          "title": "To find #IndieWeb, more people need to know it exists",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8020",
          "author": "disassociated.com",
          "description": "Stefan Bohacek writing on his Mastodon page: The problem with redesigning your personal website is that it looks great for about a week, and then you start to hate it. This is a problem of the ages. In the late 1990’s I’d redesign my websites (I had several back then) every few weeks. Or what […]",
          "link": "https://disassociated.com/my-personal-website-looks-like-bad-photo-me/",
          "publishedOn": "2024-07-16T21:00:43.000Z",
          "wordCount": 448,
          "title": "Sometimes my personal website looks like a bad photo of me",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20240717",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20240717",
          "publishedOn": "2024-07-17T22:00:00.000Z",
          "wordCount": 628,
          "title": "Week Ending July 14, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/remainders",
          "author": null,
          "description": "Thomas Heise (1955-2024).",
          "link": "https://newleftreview.org/sidecar/posts/remainders",
          "publishedOn": "2024-07-19T15:58:55.000Z",
          "wordCount": 2064,
          "title": "Julia Hertäg: &ldquo;Remainders&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/Heise.jpeg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/mutiny-in-bolivia",
          "author": null,
          "description": "The crisis of the MAS.",
          "link": "https://newleftreview.org/sidecar/posts/mutiny-in-bolivia",
          "publishedOn": "2024-07-18T17:23:06.000Z",
          "wordCount": 2882,
          "title": "Sinclair Thomson: &ldquo;Mutiny in Bolivia&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/maria-luisa-pacheco-montanas-1979-trivium-art-history.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/same-blade",
          "author": null,
          "description": "Palestine and Labourism.",
          "link": "https://newleftreview.org/sidecar/posts/same-blade",
          "publishedOn": "2024-07-16T16:03:33.000Z",
          "wordCount": 2523,
          "title": "Daniel Finn: &ldquo;Same Blade&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/07/GazaProtest-scaled.jpg"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://iamyourboon.com/anti-resume/",
          "author": null,
          "description": "For everything I did not get to experience.\nI'm boon. I wanted to be an astronaut. Instead, New York City's skyscrapers are the closest I will ever be to the stars. Unfortunately, the designers of NYC's skyline forgot to include them.\nBefore College\nI offered to produce a website for our local cinema; someone else won and produced this instead. Yes, it's still like that today.\n\nI self-studied 8 AP courses in a year; I didn't actually study. I still sat through them. A single teacher supervised all of them; I told her I'm sorry I wasted her time.\nI took the SAT once. Apparently you're allowed to retake it. I bombed the PSAT the year prior. You get free scholarship money from that. I missed applying to scholarships too: sorry mom and dad.\nI built a website and Point of Sale software for my p…",
          "link": "https://iamyourboon.com/anti-resume/",
          "publishedOn": "2024-07-21T18:08:00.000Z",
          "wordCount": 1105,
          "title": "Anti-Resume*",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://forkingmad.bearblog.dev/adding-comments-to-bear/",
          "author": null,
          "description": "I love reading blog posts, and I also enjoy responding to them.  I enjoy writing blog posts, and getting replies.  It makes it more interesting.\nHowever, comments are not for everyone, or every post.  Also, comments have traditionally opened up your blog to spammers.  It's a balancing act.\nIntroducing Komments.cloud\nFull disclosure -- I developed Komments to serve my own purposes but a few people then asked if they could use it, so I have opened it up to everyone.\nKomments.cloud is an entirely separate website, but let's call it a side-app 😏  It sounds nicer.\nHow does it work?  Simple:\nWrite your blog post as normal in Bear\nCreate an page in Komments.cloud for user comments\nAdd a link on your blog post to the unique address in Komments\nDone\nIf anyone leaves a comment you must approve it before it is live.  Approving takes a few seconds.\nThere's more detail here, and you can see it in action by clicking the comments link at the end of this blog post.\nWorks everywhere\nYou can use Komments anywhere, on any blogging/website that allows links (which is all of them basically).  Depending on what access you have to the blogging page code, you can even add buttons, or insert the Komments directing on the page.\nBear uses a simple link.  You can see how to do it at the bottom of the About page.\nFancy trying it?  Have any thoughts?  Want to test it?\nOh, and it's completely FREE.  No adverts, no tracking.  Just plain and simple good clean honest coding to help us all enjoy the web.\nComments welcome",
          "link": "https://forkingmad.bearblog.dev/adding-comments-to-bear/",
          "publishedOn": "2024-07-20T21:43:00.000Z",
          "wordCount": 709,
          "title": "Adding Comments to Bear",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://tiramisu.bearblog.dev/cauliflowers/",
          "author": null,
          "description": "I got my commuter card in the mail this week from work, and today I used it for the first time! I was so excited about it I even texted my friend. It's a silly thing to be excited about, considering that it's literally just a Visa prepaid debit card with my own money on it, the only benefit being I'm not taxed for money put on that debit card. But it still makes me happy, for reasons besides the few hundred dollars it'll save me in taxes that I cannot explain. (Maybe it makes me feel like the Responsible Independent Adult in the city that I always wanted to be.)\nBack in college my friends and I would do things like leave amusement parks early to grocery shop and make healthy dinners together back at home. We're turning into our parents, we'd say, laughing, the irony of a bunch of teenagers…",
          "link": "https://tiramisu.bearblog.dev/cauliflowers/",
          "publishedOn": "2024-07-20T21:09:00.000Z",
          "wordCount": 874,
          "title": "cauliflowers and other tiny beautiful things",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://lebacafables.bearblog.dev/les-campagnes-qui-mont-decu/",
          "author": null,
          "description": "Pour bien commencer ce blog, je vais faire un article égocentrique.\nJ'espère que parmi celles et ceux qui le liront,\nil y aura quand même 2-3 \"pélo\" qui arriveront à s'identifier à mon ressenti.\nCes dernières années, j'ai mené de nombreuses campagnes de jeu de rôle.\nMais j'ai souvent été déçu.\nElles n'avaient pourtant pas de problèmes intrinsèques.\nJ'entends par là qu'a priori, je crois que les joueurs s'amusaient.\nJe pense d'ailleurs que je m'amusais aussi durant la partie.\nBien sûr, tout n'était pas mémorable, tout ne se valait pas,\nil y a eu des bonnes et des mauvaises rencontres,\nmais j'estime que ces parties n'étaient pas \"mauvaises\".\nLa déception dont je parle est plus personnelle.\nEt elle va plus loin que la partie en tant que telle.\nPour comprendre cela, il faut se pencher sur la r…",
          "link": "https://lebacafables.bearblog.dev/les-campagnes-qui-mont-decu/",
          "publishedOn": "2024-07-20T17:17:00.000Z",
          "wordCount": 2545,
          "title": "Les campagnes qui m'ont déçu",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://kylevallans.bearblog.dev/consistency-over-perfection/",
          "author": null,
          "description": "Enter your email to get 1 free month to our overnight momentum trading chat. Please check your promotions and spam for the confirmation email.\nYou NEED a Framework and there is no way around it!\nWithout one, you will remain stagnant at best!\nYou see, I finally figured out my health and fitness after many years. Over the years, I have jumped from one fad to the next, trying keto, intermittent fasting, low fat, high fat, you name it!\nAdditionally, I have found myself committing to a workout program for a few weeks only to switch it up on myself and try something else that seemed more exciting in the moment. Because of this constant change, very little progress was being made. In fact, I was simply maintaining at best!\nFinally, I made a change to my way of thinking!\nI now buy into the idea of…",
          "link": "https://kylevallans.bearblog.dev/consistency-over-perfection/",
          "publishedOn": "2024-07-19T16:30:00.000Z",
          "wordCount": 1317,
          "title": "Consistency Over Perfection: Why A Framework Matters",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://herman.bearblog.dev/discovery-feed-changes/",
          "author": null,
          "description": "The Bear community is awesome. The discovery feed is vibrant with slices of life, letter circles, the sharing of tips on how to trick out your blog, and so much more. It's a special corner of the internet that needs to be nourished and protected.\nBut as with any growing community, this hasn't been without its own set of challenges. These challenges can be broadly categorised into 2 groups:\n1. Spam blogs\nFighting spam is an ongoing battle, but mostly a solved problem. A combination of The Frustration Loop and the review process has taken care of it. However, due to a sharp increase in the number of signups recently (both legitimate and spam blogs), I've co-opted the help of Pam and Shraddha from Bonsai Digital to get through the never-ending stack of new blogs.\n2. Unsuitable content\nThe dis…",
          "link": "https://herman.bearblog.dev/discovery-feed-changes/",
          "publishedOn": "2024-07-19T06:00:00.000Z",
          "wordCount": 1100,
          "title": "Upcoming changes to the discovery feed",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://notes.jeddacp.com/a-blog-directory/",
          "author": null,
          "description": "Earlier this month, I wrote a blog post titled “To Blogroll, or to not?” With my thought process of not adding a Blogroll to my page, but opting to add a Postroll instead. Since that post went live, I have gotten replies from both ends of the spectrum agreeing and (respectfully) disagreeing with my thought process. I’ve highlighted some of those responses at the bottom of the post under the 💬 Community Echoes, if you were curious.\nAnyways, this got me really thinking about Discovery and Community, especially since I’m seeing a few articles written ranging from “WTF Happened to Blogs” to “indie blogs are doing OK: here’s how to find them”. I wanted a way to contribute to the blogging community, which has made me feel immensely welcomed since I rejoined at the end of March.\nSo here we go…\nE…",
          "link": "https://notes.jeddacp.com/a-blog-directory/",
          "publishedOn": "2024-07-18T22:09:00.000Z",
          "wordCount": 1299,
          "title": "A Project of Sorts: A Blog Directory",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1721372330.png"
        },
        {
          "id": "https://anotherjournal.bearblog.dev/a-leap-of-faith/",
          "author": null,
          "description": "u know that feeling when it's nearly impossible to achieve something..\neither because you're too late\nor you didn't prepare enough and it has high competition\nyour mind and logic says: there is no way\nbut your brain (or soul?) says: f*ck it we do it anyway.\nand somehow (most of the time) it works out!\nand even if it doesn't -- u don't feel thaaat bad..\nu say gg and move on.\nthat leap of faith is real!\ni hope such happy ending occurs again in my upcoming move inshallah.\nif u reading this: wish me luck homie -- will need it fr.",
          "link": "https://anotherjournal.bearblog.dev/a-leap-of-faith/",
          "publishedOn": "2024-07-18T21:17:00.000Z",
          "wordCount": 566,
          "title": "a leap of faith",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://pj.bearblog.dev/on-being-unemployed-at-26/",
          "author": null,
          "description": "this is the first time i'm revealing my age on bear, something i kept hidden for privacy's sake. \n\ni'm quitting my part-time job next week. \n\nis it okay to be unemployed at 26? \n\ni think it's mainly because i don't like where i am right now. \n\nwhen i was a kid i picked up on things very quickly. \n\ni know (i hope) i won't be stuck here forever. \n\ni'm still struggling, and even if i tell myself and others that there is no such thing as being behind, i can't help but feel dissatisfied with my current situation. \n\ni'm trying to have faith in myself but i'm not so good on my own, so please put your faith in me as well. \nand hope with me that this too shall pass.",
          "link": "https://pj.bearblog.dev/on-being-unemployed-at-26/",
          "publishedOn": "2024-07-18T18:06:17.766Z",
          "wordCount": 1019,
          "title": "on being unemployed at 26",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://veronique.ink/loose-thoughts/",
          "author": null,
          "description": "-Women are not allowed to be women. We're expected to look like teenagers for the rest of our lives, and it's exhausting.\n-One of my favorite hobbies used to be reading books. Now, it feels impossible to read one page without having to backtrack and read that page again (and sometimes...again) because I have no idea what I just read. My mind is unable to keep focus. I buy a lot of books, but I don't read them. I'm a collector of nightstand-books.\n-I started eating Kimchi for the first time ever this week and...I'm in love.\n-A part of me wants to remove my blog archives page from the navigation, create a new page, and showcase only the posts I want to keep sharing. idk.\n-Dating someone new is hard. Constantly making sure you're shaved, smelling wonderful, hair at its best, face presentable, worried about farting in front of them or taking a shit in your own bathroom, making sure you're wearing sexy underwear, not eating too much in front of them...honestly, it's like I'm afraid of being human. I just want to be a slob on my couch sometimes.\n-Do you use Are.na? I want to, but it looks awful. I downloaded Cosmos, and I do like it so far. I wonder if there are any other apps similar to Are.na (not Pinterest).\n-I sent out my weekly letter yesterday. Did you read it? I love writing these tiny missives through email. Are people reading it though? I don't know. But I shall keep writing and sharing, and hopefully, it will help someone out there feel a little less alone.",
          "link": "https://veronique.ink/loose-thoughts/",
          "publishedOn": "2024-07-18T15:15:00.000Z",
          "wordCount": 791,
          "title": "loose thoughts",
          "imageUrl": "![13BDA3F7-C535-4B26-9C55-A1C97937EE6B](https://bear-images.sfo2.cdn.digitaloceanspaces.com/veronique-1721606707.jpeg)"
        },
        {
          "id": "https://jeddacp.me/throwback-thursday-004-finding-nemo/",
          "author": null,
          "description": "Today's Throwback Thursday post brings us to the Philippines during that one time I finally found Nemo. He was just as surprised to see me as I was him -- although I think he was absolutely ready for his close up.\nTaken while snorkeling on one of the islands (I think El Nido, Palawan).\n\nAugust 2014, Philippines, GoPro Hero 3",
          "link": "https://jeddacp.me/throwback-thursday-004-finding-nemo/",
          "publishedOn": "2024-07-18T15:02:00.000Z",
          "wordCount": 715,
          "title": "Throwback Thursday 004 - Finding Nemo",
          "imageUrl": "https://live.staticflickr.com/86/31432368982_d15362d6e4_c.jpg"
        },
        {
          "id": "https://binarydigit.dev/dev-blog/",
          "author": null,
          "description": "It all started with a post on my main blog where I still have the urge to revisit the art of learning software and web tools. Even if they are small things, I want to learn basics again other than simply editing templates or static site generators. I'll keep my main blog for everything else I want to share, but I had to buy-yet-another-domain as a nudge to see if I can seperate this tech space online. I also hope to actually put it on a resume one day.\nI want to focus on fun projects that I might use, such as learning how to create a discord bot, a Twitch bot or overlay, or other tools that I'll use for my current hobbies. I think a to do list of sorts that I come back to now and again is a good start.\n Send a message",
          "link": "https://binarydigit.dev/dev-blog/",
          "publishedOn": "2024-07-18T13:00:00.000Z",
          "wordCount": 720,
          "title": "Hello! A Dev Blog",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/bdev-1721189856.png"
        },
        {
          "id": "https://therat.bearblog.dev/re-a-life-lived-diligently/",
          "author": null,
          "description": "Hi Misha!\nI've read your post a life lived diligently, and it made me want to write to you.\nWhen I was younger, I dreamed every day of becoming a product designer. I had convinced myself I was going to go study abroad, become self-employed, and the riches and fame would be mine.\npoor, depressed artist aesthetic, after which I would be discovered and prove everyone wrong about not chasing your dreams. My peers would see me on TV and gawk. Grand finale: let the curtain fall; everyone applauds.\nI'm happy to say none of that came true.\nThe truth is, your 20s are a little bit of a bitch. These are the years someone can either be going steady with a child on each hip or they can be partying 'til the sun goes down. Comparison is hard to keep at bay since everyone is going at a different pace and …",
          "link": "https://therat.bearblog.dev/re-a-life-lived-diligently/",
          "publishedOn": "2024-07-17T11:11:15.518Z",
          "wordCount": 1164,
          "title": "Re: a life lived diligently",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://usamainsights.com/morning-shower-incident/",
          "author": null,
          "description": "⏱️ Takes about 3 minutes to read \n \n\n___________\n\nYesterday, when I woke up to go for work. I always take a shower & change cloths.\nI was half sleep ironing my pant & shirt while yawning . Then, I went to bathroom to put my cloth on the hooks.\nThe bathroom door look like this ( I kinda trying my hand at pixel art)\n\nThen I remember, I forgot to bring my towel. I went to get my towel and as I was putting the towel on the hook. I saw Grasshopper sitting on that hook .\nMy half sleep state was gone. My brain got in a panic mood, I cant move a muscle or scream. I knew if I did that it will fly and I dont want it to sit on me or near me. I slowly move one step at a time. Then, I slowly put my cloth and swiftly run from the bathroom after opening my door.\nMy grandma saw me shooting like a meteoroid from a bathroom. She worriedly inquired: is everything ok?\nI told her that I saw grasshopper sitting on the door hook. My brother over heard my story as he was ironing cloth from a different room. I asked should I let it flew away or kill it by hitting with besom. He said smash the grasshopper with the besom.\nI cant even say to my bro do it for me. :( Then with a bit of courage, I take a besom in my hand and went to a fight a ferocious battle for a noble cause  of disturbing my morning bath (hahha).\nI was successful in my first strike but he was alive. He start to move that scared the shit out of me. After some more awful hitting it besom he died.\nI felt both awful for killing it but cant have it flying it over my head or in my cloth. I even shudder just thinking about this event.\nReply via email",
          "link": "https://usamainsights.com/morning-shower-incident/",
          "publishedOn": "2024-07-16T17:21:00.000Z",
          "wordCount": 2271,
          "title": "Morning Shower Incident 🦗🦗🦗",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/usamainsights-1721147751.png"
        },
        {
          "id": "https://tiramisu.bearblog.dev/lost-dreams/",
          "author": null,
          "description": "This post is inspired by Misha’s post a life lived diligently.\nI started playing the piano when I was five. My first dream was to be a concert pianist like Lang Lang. I was drawn to the glitz and glamor of playing in cavernous concert halls to people in suits sitting on red velvet chairs. I let go of that dream a few years later when it became painfully apparent that I lacked both the talent and the dedication to fulfill it.\nFor a brief period after, I settled on a more realistic goal — playing the viola in a symphony orchestra. There were more orchestras than world-famous concert pianists, after all, and less violists than pianists to go around. I thought it a nice compromise between my childhood fantasies and reality.\nMom pulled the plug on my private lessons when I was seventeen, after …",
          "link": "https://tiramisu.bearblog.dev/lost-dreams/",
          "publishedOn": "2024-07-16T10:02:00.000Z",
          "wordCount": 1341,
          "title": "⭐️ i know love as a fading thing",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://bowlofmisua.bearblog.dev/a-life-lived-diligently/",
          "author": null,
          "description": "two weeks ago, i had an existential crisis so bad, i had to take a leave from work. it was my first ever leave since joining the company in late february. i spent the evening rolling my thoughts around in the darkness of my room.\ni started doing a lot of new things recently.\ngetting back into kpop\nusing actives in my skincare routine to curb my adult acne\nmat pilates at home (i’ve been trying to do them daily, but it’s hard. some days just feel harder than others)\ntrying to lose weight healthily (a point proven difficult by my bulimia that’s graduated to restrictive eating (i barely have any full meals))\nwatching new kdrama to fill up my empty days\nabout the last point: i recently watched because this is my first life. in the show, we meet ji-ho, a 30 something who gave up on her dream to …",
          "link": "https://bowlofmisua.bearblog.dev/a-life-lived-diligently/",
          "publishedOn": "2024-07-16T07:08:00.000Z",
          "wordCount": 1071,
          "title": "a life lived diligently",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/2022-towards-an-especifista-feminism-in-north-america?v=1721210769",
          "author": null,
          "description": "Author: Various Authors\nTitle: Towards an Especifista Feminism in North America\nDate: 2022\nSource: Scanned from a zine.\n\nIntroduction\nTO BEGIN...\n “We recognize that the feminist camp has made great efforts, by revealing the mechanisms that oppress women and dissidence, and by naming issues that used to be invisible. However, this does not mean that the concepts and categories, and therefore the theoretical frameworks, are all equally valid. As especifist anarchists we task ourselves with taking from these theoretical productions, the concepts and categories that are consistent with our own ideology. Referring to the guiding principles of other currents will not only lead us down a different ideological path but also have concrete effects on the militancy, on the political level as on the …",
          "link": "https://theanarchistlibrary.org/library/2022-towards-an-especifista-feminism-in-north-america?v=1721210769",
          "publishedOn": "2024-07-17T10:06:09.000Z",
          "wordCount": 3145,
          "title": "Various Authors - Towards an Especifista Feminism in North America",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "14864",
            "url": "https://theanarchistlibrary.org/library/2022-towards-an-especifista-feminism-in-north-america.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/leo-tolstoy-three-deaths-bain-translation?v=1721203105",
          "author": null,
          "description": "Author: Leo Tolstoy\nTitle: Three Deaths\nDate: 1859\nNotes: Translated by Robert Nisbet Bain and published in 1902.\nSource: <revoltlib.com/anarchism/three-deaths-bain-translation-tolstoy-leo>\n\nI.\n It was Autumn. A carriage and a calesche were proceeding at a sharp trot along the high-road. In the carriage sat two women. One of them was the mistress, thin and pale. The other was the maid, smug, florid, and buxom. Her short dry tresses peeped forth from under her faded bonnet, her pretty hand in her torn glove readjusted them from time to time; her swelling bosom, covered by a rug, was full of the breath of health; her quick black eyes glanced at one moment out of the window at the scurrying fields, at another stared boldly at her mistress, or glanced uneasily at the corners of the carriage. B…",
          "link": "https://theanarchistlibrary.org/library/leo-tolstoy-three-deaths-bain-translation?v=1721203105",
          "publishedOn": "2024-07-17T07:58:25.000Z",
          "wordCount": 5930,
          "title": "Leo Tolstoy - Three Deaths",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "19529",
            "url": "https://theanarchistlibrary.org/library/leo-tolstoy-three-deaths-bain-translation.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anonymous-words-and-history-mean-things-a-response-to-addicted-to-losing?v=1721164918",
          "author": null,
          "description": "Author: Anonymous\nTitle: Words and History Mean Things\nSubtitle: A Response to “Addicted to Losing”\nDate: 2024-05-02\nSource: Retrieved on 2024-07-16 from https://bbnews.noblogs.org/post/2024/05/02/words-and-history-mean-things-a-response-to-addicted-to-losing/\n\n Most of what comes out in the text “Addicted to Losing” is not new. Black anarchists and anti-authoritarians have been critiquing black non-profits, Black academics, Black activists and black authoritarians for years before the 2020 uprising. Black anarchists who have been active PRIOR to 2020 have been deeply aware of these critiques, mainly based on their experiences. We are unsure how connected the author is to Black anti-authoritarians but, best believe Black anarchists been having these conversations. There has been so much ta…",
          "link": "https://theanarchistlibrary.org/library/anonymous-words-and-history-mean-things-a-response-to-addicted-to-losing?v=1721164918",
          "publishedOn": "2024-07-16T21:21:58.000Z",
          "wordCount": 2168,
          "title": "Anonymous - Words and History Mean Things",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "68487",
            "url": "https://theanarchistlibrary.org/library/anonymous-words-and-history-mean-things-a-response-to-addicted-to-losing.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/special/index?v=1721150856",
          "author": null,
          "description": "Are you in and/or from South Asia and literate in a South Asian language? \n Check out the Initiative for a South Asian Anarchist Library and contact us in our chatrooms. \n Also check out our guide on how to add a new language library. \n There are also initiatives for an Arabic, Farsi, and Hungarian anarchist libraries. \n Please contact us to get in touch with these initiatives.",
          "link": "https://theanarchistlibrary.org/special/index?v=1721150856",
          "publishedOn": "2024-07-16T17:27:36.000Z",
          "wordCount": 371,
          "title": "The Anarchist Library",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "4209",
            "url": "https://theanarchistlibrary.org/special/index.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/tony-parker-jane-e-ferrie-health-and-welfare?v=1721112342",
          "author": null,
          "description": "Author: Tony Parker, Jane E Ferrie\nTitle: Health and welfare\nSubtitle: rejecting the state in the status quo — examples of an Anarchist approach\nDate: December 2016\nSource: International Journal of Epidemiology, Volume 45, Issue 6, December 2016, Pages 1754–1758, DOI: 10.1093/ije/dyx001\n\n For most of the 20th century, all mainstream political parties in Western Europe coalesced around the idea that, ultimately, the state should be the chief provider of social welfare and instrument of social reform. Although Feminist, Anti-Racist, Neo-Marxist, Green and other left-leaning critiques were put forward, particularly in the 1970s,[1] criticism of the welfare state has come predominantly from the free-market right. This has culminated in attacks on the direct provision of welfare by the state in…",
          "link": "https://theanarchistlibrary.org/library/tony-parker-jane-e-ferrie-health-and-welfare?v=1721112342",
          "publishedOn": "2024-07-16T06:45:42.000Z",
          "wordCount": 4803,
          "title": "Tony Parker, Jane E Ferrie - Health and welfare",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "56166",
            "url": "https://theanarchistlibrary.org/library/tony-parker-jane-e-ferrie-health-and-welfare.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anonymous-stop-block-cop-city?v=1721110116",
          "author": null,
          "description": "Author: Anonymous\nTitle: Stop Block Cop City!\nDate: 10/25/23\nSource: https://berkmananarchy.noblogs.org/post/2023/10/26/stop-block-cop-city/\n\nTire fire barricade at the AirBnBs!\n Throw a molotov at the PowerPoint Presentations! Dump a smelly bucket of shrimp on the peaceful protest! We’re going to Stop Block Cop City!! \n Why? \n Because I’m mad that they wasted my time with their awful presentation/book-report/thinly-veiled-business-management-double-speak that tried to sell me and a bunch of other anarchists a program of non-violent civil disobedience to stop the police training facility from being constructed in the Old Prison Farm. \nI had to sit through:\n Being told about the history of the movement in a few awful slides \n …know your fucking audience. \n Being told not only about affinity…",
          "link": "https://theanarchistlibrary.org/library/anonymous-stop-block-cop-city?v=1721110116",
          "publishedOn": "2024-07-16T06:08:36.000Z",
          "wordCount": 1367,
          "title": "Anonymous - Stop Block Cop City!",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "82471",
            "url": "https://theanarchistlibrary.org/library/anonymous-stop-block-cop-city.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/uploads/en/thumbnails/a-s-anonymous-stop-block-cop-city-1.jpg.large.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/nim-thorn-traveler-s-guide-to-the-acronym-wasteland?v=1721109436",
          "author": null,
          "description": "Author: Nim Thorn\nTitle: Traveler’s Guide to the Acronym Wasteland\nSubtitle: Tankies and Authoritarian Entryist Groups in Philadelphia\nDate: July 10, 2024\nNotes: From the original post: A general, group-by-group overview of some tankie and authoritarian entryist Left orgs in Philly (though partly relevant to other contexts; many are national groups), to help more autonomous, uncontrollable rebels better understand and defend against their manipulations. Includes some reflections and propositions at the end (‘Anti-Social Social War?’). pdf for reading pdf for printing\nSource: Retrieved on July 15, 2024 from Reeking Thickets Press\n\nFreedom from money, jobs, and education!\nPSL (Party for Socialism and Liberation) and WWP (Workers World Party) and ANSWER Coalition (Act Now to Stop War and End …",
          "link": "https://theanarchistlibrary.org/library/nim-thorn-traveler-s-guide-to-the-acronym-wasteland?v=1721109436",
          "publishedOn": "2024-07-16T05:57:16.000Z",
          "wordCount": 17494,
          "title": "Nim Thorn - Traveler’s Guide to the Acronym Wasteland",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "63081",
            "url": "https://theanarchistlibrary.org/library/nim-thorn-traveler-s-guide-to-the-acronym-wasteland.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/zoe-baker-what-is-the-proletariat?v=1721098268",
          "author": null,
          "description": "Author: Zoe Baker\nTitle: What is the Proletariat?\nDate: 2024/05/10\nSource: Retrieved on 2024-07-16 from <anarchopac.com/2024/05/10/what-is-the-proletariat>\n\n In 1848 Karl Marx and Friedrich Engels published the Manifesto of the Communist Party. It famously ends by declaring, “let the ruling classes tremble at a communist revolution. Proletarians have nothing to lose in it but their chains. They have a world to win. Proletarians of all countries unite!” (Marx and Engels 1996, 30). The word proletariat continues to be used by socialists and communists today. This does not mean that the word is widely understood. Some people use it as a meaningless adjective whereby their ideas, attitudes, and activities are proletarian. Those of people they dislike are bourgeois. Others equate the proletaria…",
          "link": "https://theanarchistlibrary.org/library/zoe-baker-what-is-the-proletariat?v=1721098268",
          "publishedOn": "2024-07-16T02:51:08.000Z",
          "wordCount": 19022,
          "title": "Zoe Baker - What is the Proletariat?",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "55612",
            "url": "https://theanarchistlibrary.org/library/zoe-baker-what-is-the-proletariat.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}