{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "a2b797c1aff33d1760b7816ad576286f2d84123f",
          "author": "Matheus Guimaraes",
          "description": "The vast majority of applications don’t run run the CPU flat-out at 100% utilization continuously. Take a web application, for instance. It typically fluctuates between periods of high and low demand, but hardly ever uses a server’s compute at full capacity. CPU utilization for many common workloads that customers run in the AWS Cloud today. […]",
          "link": "https://aws.amazon.com/blogs/aws/new-compute-optimized-c7i-flex-amazon-ec2-flex-instances/",
          "publishedOn": "2024-05-14T16:56:23.000Z",
          "wordCount": 1482,
          "title": "New compute-optimized (C7i-flex) Amazon EC2 Flex instances",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/05/01/Site-Merch_EC2-Instance-Generic_Blog.png"
        },
        {
          "id": "fbfc12083190a0beba131b64489794f4257a17d2",
          "author": "Abhishek Gupta",
          "description": "AWS Summit is in full swing around the world, with the most recent one being AWS Summit Singapore! Here is a sneak peek of the AWS staff and ASEAN community members at the Developer Lounge booth. It featured AWS Community speakers giving lightning talks on serverless, Amazon Elastic Kubernetes Service (Amazon EKS), security, generative AI, […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-new-capabilities-in-amazon-bedrock-aws-amplify-gen-2-amazon-rds-and-more-may-13-2024/",
          "publishedOn": "2024-05-13T17:40:52.000Z",
          "wordCount": 1919,
          "title": "AWS Weekly Roundup: New capabilities in Amazon Bedrock, AWS Amplify Gen 2, Amazon RDS and more (May 13, 2024)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/08/13/AWS-WIR-default.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": [
        {
          "id": "dcd98043e309fb462fb16c1c99293fceecad41fd",
          "author": "Wang Rui",
          "description": "Introduction ComfyUI is an open-source node-based workflow solution for Stable Diffusion. It offers the following advantages: Significant performance optimization for SDXL model inference High customizability, allowing users granular control Portable workflows that can be shared easily Developer-friendly Due to these advantages, ComfyUI is increasingly being used by artistic creators. In this post, we will introduce […]",
          "link": "https://aws.amazon.com/blogs/architecture/deploy-stable-diffusion-comfyui-on-aws-elastically-and-efficiently/",
          "publishedOn": "2024-05-16T15:25:06.000Z",
          "wordCount": 2619,
          "title": "Deploy Stable Diffusion ComfyUI on AWS elastically and efficiently",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fc074d501302eb2b93e2554793fcaf50b3bf7291/2024/05/15/fig1-comfyui-stable-diffusion.png"
        }
      ]
    },
    {
      "title": "The GitHub Blog: Engineering News and Updates",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/category/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": []
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": [
        {
          "id": "https://engineering.atspotify.com/?p=7083",
          "author": "Spotify Engineering",
          "description": "TL;DR Sometimes we cannot estimate the required sample size needed to power an experiment before starting it. To alleviate this [...]\nThe post Fixed-Power Designs: It’s Not IF You Peek, It’s WHAT You Peek at appeared first on Spotify Engineering.",
          "link": "https://engineering.atspotify.com/2024/05/fixed-power-designs-its-not-if-you-peek-its-what-you-peek-at/",
          "publishedOn": "2024-05-15T15:07:37.000Z",
          "wordCount": 3012,
          "title": "Fixed-Power Designs: It’s Not IF You Peek, It’s WHAT You Peek at",
          "imageUrl": "https://storage.googleapis.com/production-eng/1/2024/05/EN218-Fixed-Power-Designs-Its-Not-If-You-Peek.WHITE-1200-x-630-1-1.png"
        }
      ]
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "f2c6d73c0a99a5e7cc62d68bc9a22528e5bead29",
          "author": "Mirash Gjolaj",
          "description": "Containers have become the dominant method for deploying and managing applications in recent years. Their widespread adoption is attributed to numerous advantages, such as isolation, efficient hardware use, scalability, and portability. In situations where resource isolation is critical for system security, many users are forced to rely on virtual machines (VMs) to mitigate the impact […]",
          "link": "https://aws.amazon.com/blogs/containers/enhancing-kubernetes-workload-isolation-and-security-using-kata-containers/",
          "publishedOn": "2024-05-16T22:47:06.000Z",
          "wordCount": 3432,
          "title": "Enhancing Kubernetes workload isolation and security using Kata Containers",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/05/09/Featured-images-for-Containers-Blog-4-1260x630.jpg"
        },
        {
          "id": "ef56de61f8631e9846e056ddafcc46ba422f73dd",
          "author": "Bentzi Lifshitz",
          "description": "Mobileye (Nasdaq: MBLY), a global leader in advanced driver-assistance systems (ADAS), is at the forefront of the autonomous driving revolution. Founded in 1999, they have pioneered groundbreaking technologies such as REM™ crowdsourced mapping, True-Redundancy™ sensing, and Responsibility-Sensitive Safety (RSS). These innovations are paving the way for a future filled with self-driving vehicles and advanced mobility […]",
          "link": "https://aws.amazon.com/blogs/containers/mobileye-revolutionizing-hd-map-creation-for-autonomous-vehicles-with-spark-on-amazon-eks/",
          "publishedOn": "2024-05-16T22:45:40.000Z",
          "wordCount": 4165,
          "title": "Mobileye: Revolutionizing HD map creation for autonomous vehicles with Spark on Amazon EKS",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/05/16/Featured-images-for-Containers-Blog-6-1260x630.jpg"
        },
        {
          "id": "83cc88ad2930181e507d8b8c610c04c011bc627f",
          "author": "Purvi Goyal",
          "description": "We launched AWS Fargate support for Windows Server containers on Amazon Elastic Container Service (ECS) in October 2021 to remove the undifferentiated heavy lifting of managing the underlying host operating system (OS). This has enabled customers to run Windows containers without having to patch, scale, and harden the Windows OS, using the serverless, pay-as-you-go compute […]",
          "link": "https://aws.amazon.com/blogs/containers/windows-containers-on-aws-fargate-launch-time-improvements/",
          "publishedOn": "2024-05-13T18:17:20.000Z",
          "wordCount": 2332,
          "title": "Windows Containers on AWS Fargate: Launch time improvements",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/05/10/Featured-images-for-Containers-Blog.pptx_-1260x630.jpg"
        },
        {
          "id": "2c010b11840f18936f90d7128e55a72e9f424e56",
          "author": "Santosh Vallurupalli",
          "description": "Amazon Elastic Container Service (ECS) is a fully managed container orchestration service that helps you deploy, manage, and scale containerized applications. Within Amazon ECS there is a concept known as Capacity, which is the infrastructure where your containers run. Amazon ECS provides multiple options: Amazon Elastic Compute Cloud (EC2) instances in the AWS Cloud, AWS […]",
          "link": "https://aws.amazon.com/blogs/containers/use-ansible-to-bootstrap-external-container-instances-with-amazon-ecs-anywhere/",
          "publishedOn": "2024-05-13T16:15:41.000Z",
          "wordCount": 2418,
          "title": "Use Ansible to bootstrap external container instances with Amazon ECS Anywhere",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/05/13/Featured-images-for-Containers-Blog.pptx_-1-1260x630.jpg"
        },
        {
          "id": "1bb6bef186e39209315ed15cfd5a7524cb20d7fd",
          "author": "Samir Khan",
          "description": "Users often need to host their Kubernetes workloads in specific locations, geographies, or on-premises to meet data locality or low-latency requirements. Amazon Elastic Kubernetes Service (EKS) has a broad range of deployments options from in the cloud to on-premises on customer-managed hardware with Amazon EKS Anywhere. To extend AWS infrastructure and APIs to users on-premises, […]",
          "link": "https://aws.amazon.com/blogs/containers/disaster-recovery-on-aws-outposts-to-aws-local-zones-with-a-gitops-approach-for-amazon-eks/",
          "publishedOn": "2024-05-13T16:08:13.000Z",
          "wordCount": 3685,
          "title": "Disaster Recovery on AWS Outposts to AWS Local Zones with a GitOps approach for Amazon EKS",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/05/10/Featured-images-for-Containers-Blog-5-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=322714",
          "author": "Stephen F. Eisenman",
          "description": "For many people, the question is inflammatory. The crimes of the German Nazis were of such magnitude that comparison with any other historical violence is invidious. The genocide of the Jews was deliberate and methodical and intended to eliminate every last one. The goal was the same with the Romani and Sinti people. By comparison, the Israelis – currently accused of genocide -- are rank amateurs. They have so far killed some 35,000 Palestinians in Gaza out of a population of 2.3 million. More\nThe post Can Jews be Nazis? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/can-jews-be-nazis/",
          "publishedOn": "2024-05-17T06:00:50.000Z",
          "wordCount": null,
          "title": "Can Jews be Nazis?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322850",
          "author": "Jeffrey St. Clair",
          "description": "Since October 7, the Biden administration has approved more than 100 Foreign Military Sales arms transfers to Israel. Two of the shipments used an emergency authority to circumvent Congressional review. The surge of weapons transfers to Israel began in early October and so much material was being shipped that the Pentagon had a difficult time finding enough cargo aircraft to deliver them. More\nThe post Follow the Missiles appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/follow-the-missiles/",
          "publishedOn": "2024-05-17T06:00:15.000Z",
          "wordCount": null,
          "title": "Follow the Missiles",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322963",
          "author": "Raihan Alam",
          "description": "“Do you think ‘sit-ins’ at lunch counters, ‘Freedom Buses’ and other demonstrations by Negroes will hurt or help the Negro's chances of being integrated in the South?” This question was posed by Gallup, a leading polling organization, back in 1961, during the heyday of the Civil Rights Movement. A majority of Americans at the time, 57%, believed that the sit-ins would “hurt” the movement. They were wrong. Today, we credit the Civil Rights Movement with ending racial segregation in the United States, but we cannot disconnect its success from its tactics. Martin Luther King Jr. was no advocate of passive resistance, but a firm believer in “militant nonviolence”– a consistent torrent of protests in the form of boycotts, mass marches, sit-ins, and strikes. These are similar tactics to those that students across the world are using to spread awareness of the over 30,000 Palestinians killed in Gaza and to push their universities to dissociate from the Israeli State. More\nThe post Thinking Clearly About the Protesters appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/thinking-clearly-about-the-protesters/",
          "publishedOn": "2024-05-17T06:00:02.000Z",
          "wordCount": null,
          "title": "Thinking Clearly About the Protesters",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322855",
          "author": "Robert Hunziker",
          "description": "From the Arctic to Antarctica the planet is sagging, dripping, slouching, changing the face of 10,000 years of nature coexisting with humanity side-by-side until only recently as it transforms into an adversarial relationship. Permafrost ranks alongside the Arctic, Antarctica, Greenland, The Great Barrier Reef, and the world’s three largest rainforests as the most important determinates of this changing future. Within permafrost’s confines exist thousands of years of latent ingredients that have the potential to set the world on fire. Its impact could be transcendent. More\nThe post Permafrost Showdown appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/permafrost-showdown/",
          "publishedOn": "2024-05-17T05:59:54.000Z",
          "wordCount": null,
          "title": "Permafrost Showdown",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322596",
          "author": "Melvin Goodman",
          "description": "In a long oped on Sunday titled “Biden’s Error in Pausing Military Aid,” Thomas Friedman buys into Israeli propaganda that describes Iran as an “existential threat,” and harshly denigrates President Joe Biden for announcing a pause in U.S. weapons sales to Israel. Friedman is critical of Biden for announcing the pause in the transfer of 3,500 bombs to Israel in an “off-the-cuff-exchange with CNN’s Erin Burnett during a campaign stop in Wisconsin. More\nThe post Friedman, Biden and US Weapons Sales to Israel appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/friedman-biden-and-us-weapons-sales-to-israel/",
          "publishedOn": "2024-05-17T05:58:12.000Z",
          "wordCount": null,
          "title": "Friedman, Biden and US Weapons Sales to Israel",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322868",
          "author": "Nathaniel St. Clair",
          "description": "Please, if you can, chip in this Spring Fund Drive, we have almost reached our goal.\nThe post A Humble Request appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/a-humble-request/",
          "publishedOn": "2024-05-17T05:57:19.000Z",
          "wordCount": null,
          "title": "A Humble Request",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323045",
          "author": "David Yearsley",
          "description": "The Eurovision Song Contest cannot be neutral. There is just one winner. That winner is chosen by combining the popular cellphone votes of millions of viewers with the tallies of the five-member juries in each country. There is just one contestant—whether a soloist or an entire band—from each nation that makes it into the finals.  More\nThe post No One’s Neutral Come Eurovision Time appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/no-ones-neutral-come-eurovision-time/",
          "publishedOn": "2024-05-17T05:56:42.000Z",
          "wordCount": null,
          "title": "No One’s Neutral Come Eurovision Time",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322838",
          "author": "Binoy Kampmark",
          "description": "Sometimes, it’s best not to leave the issue of justice to the judges.  They do what they must: consult the statutes, test the rivers of power, and hope that their ruling will not be subject to appeal.  David McBride, the man who revealed that Australia’s special forces in Afghanistan had dimmed and muddied before exhaustion,  More\nThe post A Brutal Punishment: The Sentencing of David McBride appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/a-brutal-punishment-the-sentencing-of-david-mcbride/",
          "publishedOn": "2024-05-17T05:56:39.000Z",
          "wordCount": null,
          "title": "A Brutal Punishment: The Sentencing of David McBride",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322908",
          "author": "Daniel Warner",
          "description": "“Judaism cannot be separated from Israel. Zionism is, simply put, the manifestation of that belief,” stated a recent message from Jewish students at Columbia University. Israel’s politics are closely intertwined with its religious beliefs. Since 2018, Israel legally considers itself a Jewish nation-state with no separation between religion and politics. That explains why Israelis consider  More\nThe post Israel as a Jewish Nation-State and Antisemitism appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/israel-as-a-jewish-nation-state-and-antisemitism/",
          "publishedOn": "2024-05-17T05:55:58.000Z",
          "wordCount": null,
          "title": "Israel as a Jewish Nation-State and Antisemitism",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322917",
          "author": "Thomas Knapp",
          "description": "Will Robert F. Kennedy, Jr. participate in either of the two presidential election debates thus far announced by the Joe Biden and Donald Trump campaigns? How about independents Cornel West and Afroman, Green party candidate Jill Stein, Constitution Party candidate Randall Terry, and whoever receives the Libertarian Party’s nomination over Memorial Day weekend? The answer,  More\nThe post Hey, Rube! Why No Room for Others at the Biden/Trump Debate Circus? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/hey-rube-why-no-room-for-others-at-the-biden-trump-debate-circus/",
          "publishedOn": "2024-05-17T05:55:58.000Z",
          "wordCount": null,
          "title": "Hey, Rube! Why No Room for Others at the Biden/Trump Debate Circus?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322941",
          "author": "Howie Wolke",
          "description": "On September 3, 1964, humanity’s unrelenting quest to tame, civilize, industrialize, and obliterate wild nature crashed into the Wilderness Act, signed into law by President Johnson on that momentous day. This visionary legislation—written primarily by the late Howard Zahniser of the Wilderness Society—created a federal policy to secure for the American people “an enduring resource  More\nThe post The Wilderness Act at 60: A Brief Overview appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/the-wilderness-act-at-60-a-brief-overview/",
          "publishedOn": "2024-05-17T05:55:43.000Z",
          "wordCount": null,
          "title": "The Wilderness Act at 60: A Brief Overview",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322902",
          "author": "Michael Hudson",
          "description": "There are multiple differences between antiquity’s economic practices and those of the modern world, and these should be borne in mind when considering the changing context for enterprise through the centuries. Whereas modern business largely operates on credit, in archaic and classical times handicraft workshops were located on basically self-sufficient landed estates, including those of  More\nThe post Seven Features of Ancient Enterprise appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/seven-features-of-ancient-enterprise/",
          "publishedOn": "2024-05-17T05:55:42.000Z",
          "wordCount": null,
          "title": "Seven Features of Ancient Enterprise",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322899",
          "author": "Caroline Cox",
          "description": "California regulators were stunned by their air monitor results in April 1990. Concentrations of a cancer-causing pesticide at schools in Merced County were so high that regulators immediately stopped any use of that pesticide in California. It’s a chemical with an unwieldy name, 1,3-dichloropropene, that you may have never heard about. But there are many reasons why you should be  More\nThe post 1,3-Dichloropropene: The Dangerous, Sweet-Smelling Pesticide You’ve Never Heard Of appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/13-dichloropropene-the-dangerous-sweet-smelling-pesticide-youve-never-heard-of/",
          "publishedOn": "2024-05-17T05:55:17.000Z",
          "wordCount": null,
          "title": "1,3-Dichloropropene: The Dangerous, Sweet-Smelling Pesticide You’ve Never Heard Of",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322914",
          "author": "Stewart Lawrence",
          "description": "“Let them eat cake,” Marie Antoinette once famously said, disdaining the immiseration of peasants in pre-revolutionary France.  Joe Biden didn’t use those exact words last week during his interview with CNN’s Erin Burnett, but his tone-deafness about the suffering of millions of Americans grappling with high food and gas prices and unaffordable rents was palpable. Burnett  More\nThe post Stuck on Stupid, Biden and the Democrats Face Disaster in November appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/stuck-on-stupid-biden-and-the-democrats-face-disaster-in-november/",
          "publishedOn": "2024-05-17T05:55:11.000Z",
          "wordCount": null,
          "title": "Stuck on Stupid, Biden and the Democrats Face Disaster in November",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322831",
          "author": "Matthew Stevenson",
          "description": "“Silence of the Lambs. Has anyone ever seen The Silence of the Lambs? The late, great Hannibal Lecter is a wonderful man. He oftentimes would have a friend for dinner. Remember the last scene? “Excuse me. I’m about to have a friend for dinner,” as this poor doctor walked by. “I’m about to have a  More\nThe post Dr. Lecter and Mr. Trump appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/dr-lecter-and-mr-trump/",
          "publishedOn": "2024-05-17T05:55:08.000Z",
          "wordCount": null,
          "title": "Dr. Lecter and Mr. Trump",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322926",
          "author": "John P. Ruehl",
          "description": "Following the reapproval of the Foreign Intelligence Surveillance Act (FISA) on April 20, 2024, Senate Majority Leader Chuck Schumer proudly declared that “bipartisanship has prevailed here in the Senate.” Despite the increasing rarity of bipartisanship in recent years, support for government surveillance continues to unite large majorities across party lines. Established in 1978, FISA allows government surveillance  More\nThe post Defending Privacy in the Surveillance State and Fragmenting Internet appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/defending-privacy-in-the-surveillance-state-and-fragmenting-internet/",
          "publishedOn": "2024-05-17T05:55:07.000Z",
          "wordCount": null,
          "title": "Defending Privacy in the Surveillance State and Fragmenting Internet",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322906",
          "author": "Jeffrey Sterling",
          "description": "I had a palpable sense of nerves approaching the day I was to travel to Perugia for the International Journalism Festival. I was invited by Kathleen McClellan and Jesselyn Radack of WHISPeR who were invited to present on the impact of leak prosecutions on the free press. I was certainly honored to be asked, but those emotions of  More\nThe post A Whistleblower’s Return to the World appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/a-whistleblowers-return-to-the-world/",
          "publishedOn": "2024-05-17T05:55:03.000Z",
          "wordCount": null,
          "title": "A Whistleblower’s Return to the World",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322537",
          "author": "Dean Baker",
          "description": "For the last quarter century, those of us hoping we could slow global warming were anxious to see a quick conversion to electric vehicles (EVs). If we could get most people using electric vehicles, and have the energy coming from clean sources, we could radically reduce greenhouse gas emissions. The problem was that EVs were  More\nThe post The Problem With Electric Vehicles appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/the-problem-with-electric-vehicles/",
          "publishedOn": "2024-05-17T05:54:34.000Z",
          "wordCount": null,
          "title": "The Problem With Electric Vehicles",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322957",
          "author": "Ramzy Baroud",
          "description": "Throughout history, fringe religious Zionist parties have had limited success in achieving the kind of electoral victories that would allow them an actual share in the country’s political decision-making. The impressive number of 17 seats won by Israel’s extremist religious party, Shas, in the 1999 elections, was a watershed moment in the history of these  More\nThe post The Ideological Coup: How Disciples of Kahane Became the New Face of Israel   appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/the-ideological-coup-how-disciples-of-kahane-became-the-new-face-of-israel/",
          "publishedOn": "2024-05-17T05:53:59.000Z",
          "wordCount": null,
          "title": "The Ideological Coup: How Disciples of Kahane Became the New Face of Israel",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322925",
          "author": "L. Michael Hager",
          "description": "The ongoing pro-Palestinian protests at American universities are more than just youthful expressions of speech freedom. Rather they exemplify the informed views of students repulsed by the genocide in Gaza, which they see every day on television and in the social media.  They are motivated by a desire to end the continuing complicity of their  More\nThe post Some Reflections on the Campus Protests appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/some-reflections-on-the-campus-protests/",
          "publishedOn": "2024-05-17T05:53:38.000Z",
          "wordCount": null,
          "title": "Some Reflections on the Campus Protests",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322918",
          "author": "Andrea Mazzarino",
          "description": "An acquaintance who hails from the same New Jersey town as I do spends his free weekends crawling through the woods on his stomach as part of a firearms training course, green camouflage paint on his face and a revolver in his hand. He considers this both a way to have fun in his free  More\nThe post Shooting Alone: America’s Social Priorities Shaped by Decades of War appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/shooting-alone-americas-social-priorities-shaped-by-decades-of-war/",
          "publishedOn": "2024-05-17T05:53:23.000Z",
          "wordCount": null,
          "title": "Shooting Alone: America’s Social Priorities Shaped by Decades of War",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322541",
          "author": "Alfred de Zayas",
          "description": "Civilization is a process that progressively codifies the rules and regulations necessary for living together in peace, the process that continually engenders associations and commissions, mechanisms for monitoring and implementation of the norms. The United Nations Charter is the best rules-based order we have, a kind of world constitution that all peoples should recognize and  More\nThe post A Rebellion Against Law and Civilization: Genocide and Its Accomplices appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/a-rebellion-against-law-and-civilization-genocide-and-its-accomplices/",
          "publishedOn": "2024-05-17T05:53:15.000Z",
          "wordCount": null,
          "title": "A Rebellion Against Law and Civilization: Genocide and Its Accomplices",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322533",
          "author": "Patrick Mazza",
          "description": "In a world of so much bad news, when so many trends seem to be rolling down the wrong track, it can be hard for people who care about the future to keep our heads above water. We’re drowning in it. In the midst of all this, a light shines through, a moral awakening of  More\nThe post On the Campuses and Around the World, a Revolution of Empathy appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/on-the-campuses-and-around-the-world-a-revolution-of-empathy/",
          "publishedOn": "2024-05-17T05:51:25.000Z",
          "wordCount": null,
          "title": "On the Campuses and Around the World, a Revolution of Empathy",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323008",
          "author": "Douglas Lummis",
          "description": "Japanese Prime Minister Kishida Fumio’s April 10 speech to the US Congress, following the American custom, began with a joke. The speaker introduced him, the audience gave him a friendly applause, and he said, “Thank you. I never get such nice applause from the Japanese Diet.” The joke was a success: it got a big  More\nThe post A Masterpiece of Sycophancy: Kishida Goes to Washington appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/a-masterpiece-of-sycophancy-kishida-goes-to-washington/",
          "publishedOn": "2024-05-17T05:50:09.000Z",
          "wordCount": null,
          "title": "A Masterpiece of Sycophancy: Kishida Goes to Washington",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322555",
          "author": "Eve Ottenberg",
          "description": "It’s now been about four weeks since Iranian missiles filled Israeli skies, as humanity held its breath for nuclear war and possible extinction. If that strikes you as hyperbole, consider this: Had Israel suffered great damage, the war could have gone nuclear, and don’t think for a minute that Russia and China would allow their  More\nThe post Iran and Israel Need to Talk appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/iran-and-israel-need-to-talk/",
          "publishedOn": "2024-05-17T05:48:19.000Z",
          "wordCount": null,
          "title": "Iran and Israel Need to Talk",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322865",
          "author": "Nicky Reid",
          "description": "“Modernity is one of the most delicate and vital issues confronting us, the people of non-European countries and Islamic Societies. A more important issue is the relationship between an imposed modernization and genuine civilization. We must discover if modernity as is claimed is a synonym for being civilized, or if it is an altogether different  More\nThe post The Road to a Stateless Axis of Resistance appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/the-road-to-a-stateless-axis-of-resistance/",
          "publishedOn": "2024-05-17T05:45:25.000Z",
          "wordCount": null,
          "title": "The Road to a Stateless Axis of Resistance",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322862",
          "author": "Evaggelos Vallianatos",
          "description": "Prologue On May 10, 2024, my friend Jay Jones, emeritus professor of biology at La Verne University, invited me to see a documentary he was presenting to his students and colleagues. The documentary, The Oil Machine, was done in 2022 by BBC. It is one of the best films I have watched on the origins  More\nThe post Big Oil and Civilization Don’t Mix appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/big-oil-and-civilization-dont-mix/",
          "publishedOn": "2024-05-17T05:45:18.000Z",
          "wordCount": null,
          "title": "Big Oil and Civilization Don’t Mix",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322544",
          "author": "Ron Jacobs",
          "description": "Silky Shah, the author of a new book on how many immigrants to the United States are treated by the US government, has worked with the group Detention Watch Network (DWN) for over twenty years.  During that time, the United States has seen five men occupy the White House.  Upon reading Shah’s book, titled Unbuild  More\nThe post US Immigration Policy: The More It Changes, the More It Doesn’t appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/us-immigration-policy-the-more-it-changes-the-more-it-doesnt/",
          "publishedOn": "2024-05-17T05:45:10.000Z",
          "wordCount": null,
          "title": "US Immigration Policy: The More It Changes, the More It Doesn’t",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322843",
          "author": "Susan Block",
          "description": "The following is a little piece of hate mail dropped like a psychological dumb bomb into my inbox the other day… Dr. Block — When did you start becoming a self-hating Jew like Larry David, Joy Behar and decades before, Woody Allen? Your CounterPunch commentary reflects self-denial of facts, mostly one most liberal/progressives love to  More\nThe post Reply to a Zionist Troll appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/reply-to-a-zionist-troll/",
          "publishedOn": "2024-05-17T05:44:49.000Z",
          "wordCount": null,
          "title": "Reply to a Zionist Troll",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322950",
          "author": "Rivera Sun",
          "description": "Local news has its finger on the pulse of our communities. When city council acts (or acts up), when disaster strikes, when corruption or scandal needs to be scrutinized, local news steps up. From our kids’ sporting events to small town heroes, road construction detours to storm preparedness, they cover stories of interest and importance  More\nThe post Local News Is Vital: Can We Survive the Climate Crisis Without It? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/17/local-news-is-vital-can-we-survive-the-climate-crisis-without-it/",
          "publishedOn": "2024-05-17T05:42:58.000Z",
          "wordCount": null,
          "title": "Local News Is Vital: Can We Survive the Climate Crisis Without It?",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": [
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=29961",
          "author": "Martín Almuzara, Babur Kocaoglu, and Argia Sbordone",
          "description": "In the aftermath of the COVID-19 pandemic, inflation rose almost simultaneously in most economies around the world. After peaking in mid-2022, inflation then went into decline—a fall that was just as universal as the initial rise. In this post, we explore the interrelation of inflation dynamics across OECD countries by constructing a measure of the persistence of global inflation. We then study the extent to which the persistence of global inflation reflects broad-based swings, as opposed to idiosyncratic country-level movements. Our main finding is that the spike and subsequent moderation in global inflation in the post-pandemic period were driven by persistent movements. When we look at measures of inflation that include food and energy prices, most of the persistence appears to be broad-based, suggesting that international oil and commodity prices played an important role in global inflation dynamics. Excluding food and energy prices in the analysis still shows a broad-based persistence, although with a substantial increase in the role of country-specific factors.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/05/is-the-recent-inflationary-spike-a-global-phenomenon/",
          "publishedOn": "2024-05-16T11:00:00.000Z",
          "wordCount": 4430,
          "title": "Is the Recent Inflationary Spike a Global Phenomenon?",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/05/LSE_2024_global-inflation_almuzara_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=29398",
          "author": "Jacob Weber",
          "description": "The past year’s steady decline in nominal wage growth now appears in danger of stalling. Given ongoing uncertainty in Ukraine and the Middle East, this seems an opportune moment to revisit the conventional wisdom about the relationship between inflation and wages: if an unexpected increase in energy costs drives up the cost of living, will workers demand higher wages, reversing the recent moderation in wage growth? In new work with Justin Bloesch and Seung Joo Lee examining those concerns, our analysis shows that the pass-through of such inflationary shocks to wages is weak.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/05/do-unexpected-inflationary-shocks-raise-workers-wages/",
          "publishedOn": "2024-05-15T11:00:00.000Z",
          "wordCount": 3912,
          "title": "Do Unexpected Inflationary Shocks Raise Workers’ Wages?",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/05/LSE_2024_cost-of-living_weber_460_77acaf.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=29844",
          "author": "Andrew F. Haughwout, Donghoon Lee, Daniel Mangrum, Joelle Scally, Wilbert van der Klaauw, and Crystal Wang",
          "description": "This morning, the New York Fed’s Center for Microeconomic Data released the Quarterly Report on Household Debt and Credit for the first quarter of 2024. Household debt balances grew by $184 billion over the previous quarter, slightly less than the moderate growth seen in the fourth quarter of 2023. Housing debt balances grew by $206 billion. Auto loans saw a $9 billion increase, continuing their steady growth since the second quarter of 2020, while balances on other non-housing debts fell. Credit card balances fell by $14 billion, which is typical for the first quarter. However, an increasing number of borrowers are behind on credit card payments. In this post, we explore the relationship between credit card delinquency and changes in credit card “utilization rates.”",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/05/delinquency-is-increasingly-in-the-cards-for-maxed-out-borrowers/",
          "publishedOn": "2024-05-14T15:00:00.000Z",
          "wordCount": 4706,
          "title": "Delinquency Is Increasingly in the Cards for Maxed‑Out Borrowers",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/05/LSE_2024_utilization-blog_scally_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=29775",
          "author": "Gara Afonso, Gonzalo Cisternas, and Will Riordan",
          "description": "A recent Liberty Street Economics post discussed who is borrowing and lending in the federal funds (fed funds) market. This post explores activity in two other markets for short-term bank liabilities that are often perceived as close substitutes for fed funds—the markets for Eurodollars and “selected deposits.”",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/05/who-is-borrowing-and-lending-in-the-eurodollar-and-selected-deposit-markets/",
          "publishedOn": "2024-05-13T11:00:00.000Z",
          "wordCount": 4191,
          "title": "Who Is Borrowing and Lending in the Eurodollar and Selected Deposit Markets?",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/05/LSE_2024_eurodollar-deposits_cisternas_460.jpg"
        }
      ]
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45372",
          "author": "peterradford",
          "description": "from Peter Radford A pile of bricks is not a house.  A group of individuals is not an economy. A lot has to happen between the one and the other.  Which is why writing theories about economies as if it were simply an accumulation of individuals and their associated capital base misses the mark.  Nor […]",
          "link": "https://rwer.wordpress.com/2024/05/16/lost-opportunities/",
          "publishedOn": "2024-05-16T19:49:14.000Z",
          "wordCount": 5098,
          "title": "Lost opportunities?",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45369",
          "author": "deanbaker1",
          "description": "from Dean Baker For the last quarter century, those of us hoping we could slow global warming were anxious to see a quick conversion to electric vehicles (EVs). If we could get most people using electric vehicles, and have the energy coming from clean sources, we could radically reduce greenhouse gas emissions. The problem was […]",
          "link": "https://rwer.wordpress.com/2024/05/15/the-problem-with-electric-vehicles/",
          "publishedOn": "2024-05-15T04:25:00.000Z",
          "wordCount": 4822,
          "title": "The problem with electric vehicles",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45365",
          "author": "deanbaker1",
          "description": "from Dean Baker The New York Times reported that Jim Simons, the founder of Medallion hedge fund, died this week. As a result of his fund, according to the article, he accumulated more than $20 billion over his lifetime. Simons was a math genius who had made many important breakthroughs in various areas of math. Back in […]",
          "link": "https://rwer.wordpress.com/2024/05/13/with-a-modest-financial-transactions-tax-jim-simons-would-not-have-been-superrich/",
          "publishedOn": "2024-05-13T16:10:11.000Z",
          "wordCount": 4761,
          "title": "With a modest financial transactions tax, Jim Simons would not have been superrich",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "The Money Illusion",
      "feedUrl": "https://feeds.feedblitz.com/themoneyillusion",
      "siteUrl": "https://www.themoneyillusion.com",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=271792",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, pandemics; NC pulls the anti-mask bill for revisions;Trump lawyer trips up Cohen, jeopardizing conviction; another CDC atrocity; Noonan  interviews a Wildwood, NY attendee. ~",
          "link": "https://www.nakedcapitalism.com/2024/05/200pm-water-cooler-5-17-2024.html",
          "publishedOn": "2024-05-17T18:00:31.000Z",
          "wordCount": 7224,
          "title": "2:00PM Water Cooler 5/17/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/rcp_05-10-2024.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=271785",
          "author": "Yves Smith",
          "description": "Governments and private entities are eroding privacy on the internet. Is it possible to safeguard both openness and security in cyberspace?",
          "link": "https://www.nakedcapitalism.com/2024/05/defending-privacy-in-the-surveillance-state-and-fragmenting-internet.html",
          "publishedOn": "2024-05-17T13:56:37.000Z",
          "wordCount": 6567,
          "title": "Defending Privacy in the Surveillance State and Fragmenting Internet",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=271760",
          "author": "Lambert Strether",
          "description": "Our bubbly daily links",
          "link": "https://www.nakedcapitalism.com/2024/05/links-5-17-2024.html",
          "publishedOn": "2024-05-17T10:58:49.000Z",
          "wordCount": 13960,
          "title": "Links 5/17/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/dolphin.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=271670",
          "author": "Nick Corbishley",
          "description": "Surely just a coincidence!",
          "link": "https://www.nakedcapitalism.com/2024/05/eu-commission-strips-funding-from-european-public-prosecutors-investigating-commission-president-ursula-von-der-leyen-over-pfizergate.html",
          "publishedOn": "2024-05-17T10:45:16.000Z",
          "wordCount": 5344,
          "title": "EU Commission Plans to Strip Funding From Public Prosecutors Investigating Ursula von der Leyen’s Pfizergate Scandal",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=271755",
          "author": "Yves Smith",
          "description": "The infamous Gaza humanitarian aid pier is a construction and logistical nightmare.",
          "link": "https://www.nakedcapitalism.com/2024/05/why-did-the-us-spend-320-million-on-a-rube-goldberg-pier-for-gaza.html",
          "publishedOn": "2024-05-17T09:40:15.000Z",
          "wordCount": 6592,
          "title": "Why Did the US Spend $320 Million on a Rube Goldberg Pier For Gaza?",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/00-loopy-pier-302x1024.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=271738",
          "author": "Yves Smith",
          "description": "In a political system whose primary currency is not the vote but the dollar, McConnell’s role as leader has been well-earned.",
          "link": "https://www.nakedcapitalism.com/2024/05/the-long-goodbye-mitch-mcconnell-and-big-money-politics.html",
          "publishedOn": "2024-05-17T08:14:29.000Z",
          "wordCount": 7402,
          "title": "The Long Goodbye? Mitch McConnell and Big Money Politics",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/00-McConnell--scaled.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=271706",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, pandemics, Cohen's testimony in the Bragg trial plus theories of the case, Biden and Trump debate, the NC legislature bails for the weekend without passing the anti-masking bill, the Impressionists and the Paris Commune. ~",
          "link": "https://www.nakedcapitalism.com/2024/05/200pm-water-cooler-5-16-2024.html",
          "publishedOn": "2024-05-16T18:00:49.000Z",
          "wordCount": 15674,
          "title": "2:00PM Water Cooler 5/16/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/rcp_05-10-2024.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=271697",
          "author": "Yves Smith",
          "description": "A new salvo against designated enemies, aka Palestinian rights advocates, which fortunately is more bark than bite.",
          "link": "https://www.nakedcapitalism.com/2024/05/new-palestine-protest-free-speech-threat-house-oversight-committee-targets-20-pro-palestinian-organizations-such-as-bill-melinda-gates-foundation-demanding-treasury-produce-suspicious-activity-r.html",
          "publishedOn": "2024-05-16T15:08:15.000Z",
          "wordCount": 6921,
          "title": "New Palestine Protest/Free Speech Threat: House Oversight Committee Targets 20 Pro-Palestinian Organizations,  Such as Bill & Melinda Gates Foundation, Demanding Treasury Produce Suspicious Activity Reports, Including on Employeees",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=271674",
          "author": "Lambert Strether",
          "description": "Our effervescent daily links",
          "link": "https://www.nakedcapitalism.com/2024/05/links-5-16-2024.html",
          "publishedOn": "2024-05-16T10:58:19.000Z",
          "wordCount": 19701,
          "title": "Links 5/16/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/the_quiet_part.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=271669",
          "author": "Yves Smith",
          "description": "The  Tier 3 Plaintiffs in the long-running public pension case, Kentucky Retirement Systems,  are fast off their marks with a blockbuster filing.",
          "link": "https://www.nakedcapitalism.com/2024/05/kentucky-retirement-systems-plaintiffs-seek-repayment-from-kkr-entities-of-misappropriated-137-million-plus-interest-and-punitive-damages-totaling-771-million-oh-and-an-accounting-too.html",
          "publishedOn": "2024-05-16T10:57:34.000Z",
          "wordCount": 4428,
          "title": "Kentucky Retirement Systems Plaintiffs Seek Repayment from KKR Entities of Misappropriated $137 Million Plus Interest and Punitive Damages, Totaling $771 Million….Oh, and An Accounting Too",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "664272e7abf9e2000aee82a0",
          "author": "Yo'av Moshe",
          "description": "Zaraz Consent Management now supports Google Consent Mode v2 and is compliant with the IAB Europe Transparency and Consent Framework. Zaraz also added Bot Management support for keeping your analytics data clean",
          "link": "https://blog.cloudflare.com/new-consent-and-bot-management-features-for-cloudflare-zaraz",
          "publishedOn": "2024-05-15T13:00:50.000Z",
          "wordCount": 1137,
          "title": "New Consent and Bot Management features for Cloudflare Zaraz",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/05/BLOG-2415-1.png"
        },
        {
          "id": "6642fc97abf9e2000aee82eb",
          "author": "Brian Batraski",
          "description": "Cloudflare is transitioning traffic that comes to our public IPFS gateway to Interplanetary Shipyard’s IPFS gateway. The transition is expected to be complete by August 14th, 2024",
          "link": "https://blog.cloudflare.com/cloudflares-public-ipfs-gateways-and-supporting-interplanetary-shipyard",
          "publishedOn": "2024-05-14T13:00:36.000Z",
          "wordCount": 993,
          "title": "Cloudflare’s public IPFS gateways and supporting Interplanetary Shipyard",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/05/Cloudflare-s-public-IPFS-gateways-and-supporting-Interplanetary-Shipyard-OG-1.png"
        },
        {
          "id": "663cf36120f20e000a888047",
          "author": "Colin Douch",
          "description": "Golang 1.20 introduced support for Profile Guided Optimization (PGO) to the go compiler. This post covers the process we created for experimenting with PGO at Cloudflare, and measuring the CPU savings",
          "link": "https://blog.cloudflare.com/reclaiming-cpu-for-free-with-pgo",
          "publishedOn": "2024-05-14T13:00:32.000Z",
          "wordCount": 1698,
          "title": "Reclaiming CPU for free with Go's Profile Guided Optimization",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/05/Reclaiming-CPU-for-free-with-Go-s-Profile-Guided-Optimization-OG-1.png"
        },
        {
          "id": "66429493abf9e2000aee82af",
          "author": "David Belson",
          "description": "On Sunday, May 12, issues with the EASSy and Seacom submarine cables again disrupted connectivity to East Africa, impacting a number of countries previously affected by a set of cable cuts that occurred nearly three months earlier",
          "link": "https://blog.cloudflare.com/east-african-internet-connectivity-again-impacted-by-submarine-cable-cuts",
          "publishedOn": "2024-05-13T22:37:25.000Z",
          "wordCount": 1257,
          "title": "East African Internet connectivity again impacted by submarine cable cuts",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/05/BLOG-2420-1.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": [
        {
          "id": "https://medium.com/p/5ad22603cb4f",
          "author": "Capital One Tech",
          "description": "A conversation with AI product leader, Aparna Sinha, about her expertise in building and enabling enterprise AI/ML capabilities.",
          "link": "https://medium.com/capital-one-tech/introducing-aparna-sinha-capital-ones-head-of-ai-product-5ad22603cb4f?source=rss----3db3a67cb648---4",
          "publishedOn": "2024-05-14T15:03:30.000Z",
          "wordCount": 3741,
          "title": "Introducing Aparna Sinha, Capital One’s Head of AI Product",
          "imageUrl": "https://miro.medium.com/v2/resize:fit:1200/0*CtMnX_q1Q2yCLU8Q.jpg"
        },
        {
          "id": "https://medium.com/p/b5abbea70c45",
          "author": "Capital One Tech",
          "description": "How IAM can help you to leverage the advanced capabilities of LLMs while securing sensitive data and assets.",
          "link": "https://medium.com/capital-one-tech/iam-done-right-for-llm-augmented-applications-b5abbea70c45?source=rss----3db3a67cb648---4",
          "publishedOn": "2024-05-14T14:45:43.000Z",
          "wordCount": 4027,
          "title": "IAM done right for LLM-augmented applications",
          "imageUrl": "https://miro.medium.com/v2/resize:fit:1200/0*N8BjmDutP2mg6DIj.png"
        }
      ]
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": [
        {
          "id": "https://kubernetes.io/blog/2024/05/16/contribute-as-sig-docs-reviewer/",
          "author": null,
          "description": "You've likely heard the adage, \"Contributing isn't just about writing code\",\nwhispered in forums or seen etched into the digital walls of open source communities.\nBut what depth of truth lies within this ancient wisdom, especially in the vast,\nevolving world of Kubernetes?\nToday, contributing to open source extends far beyond the realm of coding.\nIt's an inclusive journey that welcomes the diverse skills of all who wish\nto be a part of it. Whether you're a seasoned developer or someone whose strengths\nlie outside traditional programming, your contributions hold immense value.\nImagine yourself embarking on a journey that leverages your expertise and love\nfor free software to enhance your capabilities and strengthen the very foundation\nof the Kubernetes ecosystem. This is a real opportunity …",
          "link": "https://kubernetes.io/blog/2024/05/16/contribute-as-sig-docs-reviewer/",
          "publishedOn": "2024-05-16T00:00:00.000Z",
          "wordCount": 4545,
          "title": "From Code to Quill: Embark on a Legendary Kubernetes Quest with SIG Docs",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=21199",
          "author": null,
          "description": "When Threads first launched one of the top feature requests was for a web client. In this episode of the Meta Tech Podcast, Pascal Hartig (@passy) sits down with Ally C. and Kevin C., two engineers on the Threads Web Team that delivered the basic version of Threads for web in just under three months. [...]\nRead More...\nThe post Behind the scenes of Threads for web appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/05/14/web/threads-for-web-behind-the-scenes/",
          "publishedOn": "2024-05-14T16:33:34.000Z",
          "wordCount": 1598,
          "title": "Behind the scenes of Threads for web",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/05/Meta-Tech-Podcast-Threads-for-Web.png"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=40385318",
          "author": "derefr",
          "description": "> And that typed text is way, way cleaner than any typewriter I’ve seen.\nPedantic point: electric typewriters (which have existed since the 1960s) do type in a way that looks exactly like this.\n(In fact, note that the text on the real employee ID card, shown later in the article, doesn't look any less clean! It's just set in a different, narrower font.)\nThe smudginess of mechanical typewriters comes from 1. them striking (and especially, releasing) at the same speed you're depressing the key, and 2. having many of the keys necessarily approach the ribbon from an angle.\nThe keys being swung weakly by your fingers, also has the additional implication that the ink ribbons used in mechanical typewriters have to be soft and squishy (so: made of cloth), and use thin inks. These properties ensure a transfer from even a low-velocity impact. But the trade-off is that cloth ink ribbons transfer only a rough outline of what's struck; and thin inks are high-bleed inks.\nAn electric typewriter, playing out a pre-buffered line with a crisp, predictable report, using linear actuators and a rotating-ball type-head to bang a tape ribbon loaded with high-viscosity ink onto the page, can create text indistinguishable from books/newspapers of the same period, or from modern laser-printer reproductions of the same font faces. They're essentially character-at-a-time letterpresses!\n(Also, ignoring electric typewriters for a sec: inks bleed more on thin, cheap paper. But this is [a forgery of] an employee ID card — where, for durability, a nice heavyweight paper or cardstock would have been used. You're always going to get a better-looking result inking such paper.)",
          "link": "https://news.ycombinator.com/item?id=40385318",
          "publishedOn": "2024-05-17T01:14:14.000Z",
          "wordCount": 5156,
          "title": "New comment by derefr in \"A forged Apple employee badge\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40384975",
          "author": "zmmmmm",
          "description": "> For any model that will be used broadly across all of our customers, we do not build or train these models in such a way that they could learn, memorise, or be able to reproduce some part of Customer Data\nThis feels so full of subtle qualifiers and weasel words that it generates far more distrust than trust.\nIt only refers to models used \"broadly across all\" customers - so if it's (a) not used \"broadly\" or (b) only used for some subset of customers, the whole statement doesn't apply. Which actually sounds really bad because the logical implication is that data CAN leak outside those circumstances.\nThey need to reword this. Whoever wrote it is a liability.",
          "link": "https://news.ycombinator.com/item?id=40384975",
          "publishedOn": "2024-05-17T00:18:28.000Z",
          "wordCount": 3013,
          "title": "New comment by zmmmmm in \"Slack AI Training with Customer Data\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40376523",
          "author": "leashless",
          "description": "Remember: if VCs believed in what they were doing they would not take a 2% annual management fee and 20% of the upside.\nThey’d take 40% of the upside and live on ramen noodles.\nVCs make money by raising money from LPs.\nThey spend this money on investments which don’t look too bad if they fail, because nearly all of them fail. Looking good while losing all of your investors money on companies which go broke is the key VC skill.\nOnce in a while you get a huge hit. That’s a lottery win, there is no formula for finding that hit. Broad bets helps but that’s about it. The “VC thesis” is a fundraising tool, a pitch instrument, it makes no measurable difference to success. It’s a shtick.\nSympathy, however, for the VC: car dealership sized transactions paired with the diligence burdens of real finance. It’s a terrible job.\nOnce you understand that VC is one of the worst jobs in finance and they don’t believe most of their own story — it’s fundraising flimflam for their LPs - it’s a lot easier to negotiate.\n1) we are a sound bet not to get you in trouble if we fail (good schools and track records)\n2) we will work hard on things which your LPs and their lawyers understand, leaving evidence of a good effort on failure\n3) we know how the game works and will play by the unwritten rules: keep up appearances\nThe kind of lunatics who actually stand to make money with a higher probability than average - the “Think Different” category - usually violate all of these rules.\n1) they have no track record\n2) they work on esoteric nonsense\n3) they look weird in public\nAnd they’re structurally uninvestable.\nOnce you get this it’s all a lot easier: the job of a VC is not to invest in winners, that’s a bonus.\nThe job of a VC is to look respectable while losing other people’s money at the roulette wheel, and taking a margin for doing so.\nI hope that helps.",
          "link": "https://news.ycombinator.com/item?id=40376523",
          "publishedOn": "2024-05-16T09:20:36.000Z",
          "wordCount": 5389,
          "title": "New comment by leashless in \"VCs aren’t your friends\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40373016",
          "author": "paxys",
          "description": "Everyone replying with \"what's the big deal?\" is showing their tech privilege. You may not have to deal with intrusive monitoring, but warehouse workers are increasingly being made to wear ankle bracelets so every movement of theirs can be monitored and stack ranked. Workers in WFH \"gig\" jobs are made to install always-on keyloggers and other monitoring software on their personal computers and phones (which are required for the job). Companies take photos/videos of them in their homes every few minutes throughout the day. Plenty of jobs require you to hand your social media passwords to your employer. There is an entire class of companies that specialize in all of this.\nNot everyone is able to say \"no\" to all this and still make rent next month. I'm happy the government is finally stepping in.",
          "link": "https://news.ycombinator.com/item?id=40373016",
          "publishedOn": "2024-05-15T22:10:05.000Z",
          "wordCount": 4214,
          "title": "New comment by paxys in \"Bossware is a big legal risk\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40372977",
          "author": "yreg",
          "description": "Accessibility is for everyone, including you, if you live long enough. And the alternative is worse. So your choice is death or you are going to use accessibility features. – Siracusa",
          "link": "https://news.ycombinator.com/item?id=40372977",
          "publishedOn": "2024-05-15T22:06:00.000Z",
          "wordCount": null,
          "title": "New comment by yreg in \"Apple announces new accessibility features, including eye tracking\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40371337",
          "author": "pmcjones",
          "description": "In the aughts I worked at Adobe and spent time trying to archive the source code for Photoshop, Illustrator, PostScript, and other apps. Thomas Knoll's original Mac floppy disk backups were available, so I brought in my Mac Plus, with a serial cable to transfer the files to a laptop via Kermit. The first version was 0.54, dated 6 July 1988. The files on the floppies were in various ancient compressed archive formats, but most were readable. I created an archive on a special Perforce server of all the code that I found. Sadly, the earliest Illustrator backups were on a single external disk drive that had gone bad.",
          "link": "https://news.ycombinator.com/item?id=40371337",
          "publishedOn": "2024-05-15T19:34:00.000Z",
          "wordCount": null,
          "title": "New comment by pmcjones in \"Adobe Photoshop Source Code (2013)\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40371147",
          "author": "ein0p",
          "description": "It’s like $100 per board now once you add a power supply and a case. More if you also add storage. Cheapest Intel system on Amazon is $139. The whole point of the entire thing was its affordability. That was kind of lost along the way.",
          "link": "https://news.ycombinator.com/item?id=40371147",
          "publishedOn": "2024-05-15T19:17:03.000Z",
          "wordCount": null,
          "title": "New comment by ein0p in \"Raspberry Pi Ltd is considering an IPO\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40369965",
          "author": "xnx",
          "description": "I love accessibility features because they might be the last features developed solely with the benefit of the user in mind. So many other app/os features are designed to steal your attention or gradually nerf usefulness.",
          "link": "https://news.ycombinator.com/item?id=40369965",
          "publishedOn": "2024-05-15T17:34:27.000Z",
          "wordCount": null,
          "title": "New comment by xnx in \"Apple announces new accessibility features, including eye tracking\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40363512",
          "author": "purple-leafy",
          "description": "Narrator:\nA new car built by my company leaves somewhere traveling at 60 mph. The rear differential locks up. The car crashes and burns with everyone trapped inside. Now, should we initiate a recall? Take the number of vehicles in the field, A, multiply by the probable rate of failure, B, multiply by the average out-of-court settlement, C. A times B times C equals X. If X is less than the cost of a recall, we don't do one.\nBusiness woman on plane:\nAre there a lot of these kinds of accidents?\nNarrator:\nYou wouldn't believe.\nBusiness woman on plane:\nWhich car company do you work for?\nNarrator:\nA major one.",
          "link": "https://news.ycombinator.com/item?id=40363512",
          "publishedOn": "2024-05-15T05:49:41.000Z",
          "wordCount": 6884,
          "title": "New comment by purple-leafy in \"Department of Justice says Boeing may be criminally liable in 737 MAX crashes\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40363218",
          "author": "zoogeny",
          "description": "Interesting, both Karpathy and Sutskever are gone from OpenAI now. Looks like it is now the Sam Altman and Greg Brockman show.\nI have to admit, of the four, Karpathy and Sutskever were the two I was most impressed with. I hope he goes on to do something great.",
          "link": "https://news.ycombinator.com/item?id=40363218",
          "publishedOn": "2024-05-15T04:50:43.000Z",
          "wordCount": 14804,
          "title": "New comment by zoogeny in \"Ilya Sutskever to leave OpenAI\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40362935",
          "author": "snvzz",
          "description": "Every eINK controller sucks. This person took upon themselves to fix that, and released the result, which is now the state of the art, as open source hardware.\nI love people and projects like this.",
          "link": "https://news.ycombinator.com/item?id=40362935",
          "publishedOn": "2024-05-15T03:54:24.000Z",
          "wordCount": null,
          "title": "New comment by snvzz in \"Glider – open-source eInk monitor with an emphasis on low latency\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40358903",
          "author": "typpo",
          "description": "The amount of negativity in these comments is astounding.  Congrats to the teams at Google on what they have built, and hoping for more competition and progress in this space.",
          "link": "https://news.ycombinator.com/item?id=40358903",
          "publishedOn": "2024-05-14T19:08:44.000Z",
          "wordCount": null,
          "title": "New comment by typpo in \"Veo\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40354079",
          "author": "AnonC",
          "description": "I skimmed through the article but didn’t find mention of one glaring deficiency in iPadOS — it still doesn’t support multiple users and multiuser switching, even though the hardware is capable of it (and exceeds the capacity of many Macs before it). I decided several years ago that I’m not buying another iPad until this is sorted out by iPadOS.\nI think of iPhones as personal devices, where each person may have their own. But iPads are more likely to be shared for personal use in families. The fact that each person using it cannot have their own user profiles, app data, etc., is a huge drawback. Apple has supported this for a long time (though probably not in the best way) for education, but it’s not available to others. Even tvOS supports switching between user profiles quickly.\nApple enforcing the idea that iPad (with iPadOS) should also be a personal device — one device per person — makes the user experience quite poor.",
          "link": "https://news.ycombinator.com/item?id=40354079",
          "publishedOn": "2024-05-14T11:39:50.000Z",
          "wordCount": null,
          "title": "New comment by AnonC in \"Not an iPad Pro Review: Why iPadOS Still Doesn't Get the Basics Right\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40351912",
          "author": "jdietrich",
          "description": "A Google search for practically any long-tail keywords will reveal that LLMs have already had a very significant impact. DuckDuckGo has suffered even more. Social media is absolutely lousy with AI-powered fraud of varying degrees of sophistication.\nIt's glib to dismiss safety concerns because we haven't all turned into paperclips yet. LLMs and image gen models are having real effects now.\nWe're already at a point where AI can generate text and images that will fool a lot of people a lot of the time. For every college-educated young person smugly pointing out that they aren't fooled by an image with six-fingered hands, there are far more people who had marginal media literacy to begin with and are now almost defenceless against a tidal wave of hyper-scaleable deception.\nWe're already at a point where we're counselling elders to ignore late-night messages from people claiming to be a relative in need of an urgent wire transfer. What defences do we have when an LLM will be able to have a completely fluent, natural-sounding conversation in someone else's voice? I'm not confident that I'd be able to distinguish GPT-4o from a human speaker in the best of circumstances and I'm almost certain that I could be fooled if I'm hurried, distracted, sleep deprived or otherwise impaired.\nRegardless of any future impacts on the labour market or any hypothesised X-risks, I think we should be very worried about the immediate risks to trust and social cohesion. An awful lot of people are turning into paranoid weirdos at the moment and I don't particularly blame them, but I can see things getting seriously ugly if we can't abate that trend.",
          "link": "https://news.ycombinator.com/item?id=40351912",
          "publishedOn": "2024-05-14T05:28:18.000Z",
          "wordCount": 8880,
          "title": "New comment by jdietrich in \"GPT-4o\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40351622",
          "author": "anon373839",
          "description": "> We’re moving toward a world where every job will be modeled\nAfter an OpenAI launch, I think it's important to take one's feelings about the future impact of the technology with a HUGE grain of salt. OpenAI are masters of hype. They have been generating hype for years now, yet the real-world impacts remain modest so far.\nDo you remember when they teased GPT-2 as \"too dangerous\" for public access? I do. Yet we now have Llama 3 in the wild, which even at the smaller 8B size is about as powerful as the [edit: 6/13/23] GPT-4 release.\nAs someone pointed out elsewhere in the comments, a logistic curve looks exponential in the beginning, before it approaches saturation. Yet, logistic curves are more common, especially in ML. I think it's interesting that GPT-4o doesn't show much of an improvement in \"reasoning\" strength.",
          "link": "https://news.ycombinator.com/item?id=40351622",
          "publishedOn": "2024-05-14T04:30:11.000Z",
          "wordCount": null,
          "title": "New comment by anon373839 in \"GPT-4o\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40351436",
          "author": "plaidfuji",
          "description": "This is a very cool demo - if you dig deeper there’s a clip of them having a “blind” AI talk to another AI with live camera input to ask it to explain what it’s seeing. Then they, together, sing a song about what they’re looking at, alternating each line, and rhyming with one another. Given all of the isolated capabilities of AI, this isn’t particularly surprising, but seeing it all work together in real time is pretty incredible.\nBut it’s not scary. It’s… marvelous, cringey, uncomfortable, awe-inspiring. What’s scary is not what AI can currently do, but what we expect from it. Can it do math yet? Can it play chess? Can it write entire apps from scratch? Can it just do my entire job for me?\nWe’re moving toward a world where every job will be modeled, and you’ll either be an AI owner, a model architect, an agent/hardware engineer, a technician, or just.. training data.",
          "link": "https://news.ycombinator.com/item?id=40351436",
          "publishedOn": "2024-05-14T03:41:23.000Z",
          "wordCount": null,
          "title": "New comment by plaidfuji in \"GPT-4o\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40348664",
          "author": "cal85",
          "description": "We've had voice input and voice output with computers for a long time, but it's never felt like spoken conversation. At best it's a series of separate voice notes. It feels more like texting than talking.\nThese demos show people talking to artificial intelligence. This is new. Humans are more partial to talking than writing. When people talk to each other (in person or over low-latency audio) there's a rich metadata channel of tone and timing, subtext, inexplicit knowledge. These videos seem to show the AI using this kind of metadata, in both input and output, and the conversation even flows reasonably well at times. I think this changes things a lot.",
          "link": "https://news.ycombinator.com/item?id=40348664",
          "publishedOn": "2024-05-13T21:25:11.000Z",
          "wordCount": null,
          "title": "New comment by cal85 in \"GPT-4o\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40346779",
          "author": "jsheard",
          "description": "The system works! Just raise your concerns and they'll get around to it in [checks notes] 18 years\nhttps://twitter.com/cperciva/status/1785402732976992417",
          "link": "https://news.ycombinator.com/item?id=40346779",
          "publishedOn": "2024-05-13T18:46:02.000Z",
          "wordCount": null,
          "title": "New comment by jsheard in \"Amazon S3 will no longer charge for several HTTP error codes\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40346531",
          "author": "dragonwriter",
          "description": "> This stuff feels magical. Magical.\nBecause its capacities are focused on exactly the right place to feel magical. Which isn’t to say that there isn’t real utility, but language (written, and even moreso spoken) has an enormous emotional resonance for humans, so this is laser-targeted in an area where every advance is going to “feel magical” whether or not it moves the needle much on practical utility; it’s not unlike the effect of TV news making you feel informed, even though time spent watching it negatively correlates with understanding of current events.",
          "link": "https://news.ycombinator.com/item?id=40346531",
          "publishedOn": "2024-05-13T18:24:22.000Z",
          "wordCount": 3089,
          "title": "New comment by dragonwriter in \"GPT-4o\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40346318",
          "author": "hn_throwaway_99",
          "description": "I'm ceaselessly amazed at people's capacity for impatience. I mean, when GPT 4 came out, I was like \"holy f, this is magic!!\" How quickly we get used to that magic and demand more.\nEspecially since this demo is extremely impressive given the voice capabilities, yet still the reaction is, essentially, \"But what about AGI??!!\" Seriously, take a breather. Never before in my entire career have I seen technology advance at such a breakneck speed - don't forget transformers were only invented 7 years ago. So yes, there will be some ups and downs, but I couldn't help but laugh at the thought that \"14 months\" is seen as a long time...",
          "link": "https://news.ycombinator.com/item?id=40346318",
          "publishedOn": "2024-05-13T18:05:36.000Z",
          "wordCount": null,
          "title": "New comment by hn_throwaway_99 in \"GPT-4o\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40346283",
          "author": "baq",
          "description": "> (I work at OpenAI.)\nWinner of the 'understatement of the week' award (and it's only Monday).\nAlso top contender in the 'technically correct' category.",
          "link": "https://news.ycombinator.com/item?id=40346283",
          "publishedOn": "2024-05-13T18:03:04.000Z",
          "wordCount": null,
          "title": "New comment by baq in \"GPT-4o\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40346200",
          "author": "Negitivefrags",
          "description": "I found these videos quite hard to watch. There is a level of cringe that I found a bit unpleasant.\nIt’s like some kind of uncanny valley of human interaction that I don’t get on nearly the same level with the text version.",
          "link": "https://news.ycombinator.com/item?id=40346200",
          "publishedOn": "2024-05-13T17:57:12.000Z",
          "wordCount": null,
          "title": "New comment by Negitivefrags in \"GPT-4o\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40346080",
          "author": "cs702",
          "description": "The usual critics will quickly point out that LLMs like GPT-4o still have a lot of failure modes and suffer from issues that remain unresolved. They will point out that we're reaping diminishing returns from Transformers. They will question the absence of a \"GPT-5\" model. And so on -- blah, blah, blah, stochastic parrots, blah, blah, blah.\nIgnore the critics. Watch the demos. Play with it.\nThis stuff feels magical. Magical. It makes the movie \"Her\" look like it's no longer in the realm of science fiction but in the realm of incremental product development. HAL's unemotional monotone in Kubrick's movie, \"Space Odyssey,\" feels... oddly primitive by comparison. I'm impressed at how well this works.\nWell-deserved congratulations to everyone at OpenAI!",
          "link": "https://news.ycombinator.com/item?id=40346080",
          "publishedOn": "2024-05-13T17:50:00.000Z",
          "wordCount": null,
          "title": "New comment by cs702 in \"GPT-4o\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40345866",
          "author": "gdb",
          "description": "(I work at OpenAI.)\nIt's really how it works.",
          "link": "https://news.ycombinator.com/item?id=40345866",
          "publishedOn": "2024-05-13T17:35:03.000Z",
          "wordCount": null,
          "title": "New comment by gdb in \"GPT-4o\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40345812",
          "author": "Jensson",
          "description": "The most impressive part is that the voice uses the right feelings and tonal language during the presentation. I'm not sure how much of that was that they had tested this over and over, but it is really hard to get that right so if they didn't fake it in some way I'd say that is revolutionary.",
          "link": "https://news.ycombinator.com/item?id=40345812",
          "publishedOn": "2024-05-13T17:31:16.000Z",
          "wordCount": null,
          "title": "New comment by Jensson in \"GPT-4o\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40344557",
          "author": "simonw",
          "description": "The license is not good: https://falconllm-staging.tii.ae/falcon-2-terms-and-conditio...\nIt's a modified Apache 2 license with extra clauses that include a requirement to abide by their acceptable use policy, hosted here: https://falconllm-staging.tii.ae/falcon-2-acceptable-use-pol...\nBut... that modified Apache 2 license says the following:\n\"The Acceptable Use Policy may be updated from time to time. You should monitor the web address at which the Acceptable Use Policy is hosted to ensure that your use of the Work or any Derivative Work complies with the updated Acceptable Use Policy.\"\nSo no matter what you think of their current AUP they reserve the right to update it to anything they like in the future, and you'll have to abide by the new one!\nGreat example of why I don't like the trend of calling licenses like this \"open source\" when they aren't compatible with the OSI definition.",
          "link": "https://news.ycombinator.com/item?id=40344557",
          "publishedOn": "2024-05-13T15:40:05.000Z",
          "wordCount": null,
          "title": "New comment by simonw in \"Falcon 2\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40342976",
          "author": "ertgbnm",
          "description": "More than anything else, I think the modern American super market would blow the minds of anyone born before 1900 more than any other marvel that exists.\nYou have blueberries for sale in January??? A variety box of tea from 7 different countries? A wall of spices? Pineapples? Packaging made from aluminum that is just thrown away? The bread isn't full of sand and grit? And it's sliced!!!\nAll relatively affordable and accessible to the average person.",
          "link": "https://news.ycombinator.com/item?id=40342976",
          "publishedOn": "2024-05-13T13:14:12.000Z",
          "wordCount": null,
          "title": "New comment by ertgbnm in \"It’s an age of marvels\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40342888",
          "author": "taylodl",
          "description": "There have been 3 updates to the zones in the past 50 years. Some of the updates are due to better accuracy after years of collecting data, but the 800-pound gorilla in the room is climate change. Where I live, winters are 4.5 degrees warmer. It has definitely affected my gardening.",
          "link": "https://news.ycombinator.com/item?id=40342888",
          "publishedOn": "2024-05-13T13:05:39.000Z",
          "wordCount": null,
          "title": "New comment by taylodl in \"The USDA's gardening zones shifted, this map shows you what's changed\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40339848",
          "author": "marcus_holmes",
          "description": "Years ago, over a decade ago now, I was a .Net developer. Microsoft introduced Entity Framework, their new way of handling data in .Net applications. Promises made, promises believed, we all used it. I was especially glad of Lazy Loading, where I didn't have to load data from the database into my memory structures; the system would do that automatically. I could write my code as if all my memory structures were populated and not worry about it. Except, it didn't work consistently. Every now and again a memory structure would not be populated, for no apparent reason. Digging deep into technet, I found a small note saying \"if this happens, then you can check whether the data has been loaded by checking the value of this flag and manually loading it if necessary\" [0]. So, in other words, I have to manually load all my data because I can't trust EF to do it for me. [1]\nLong analogy short, this is where I think AI for coding is now. It gets things wrong enough that I have to manually check everything it does and correct it, to the point where I might as well just do it myself in the first place. This might not always be the case, but that's where I feel it is right now.\n[0] Entity Framework has moved on a lot since then, and apparently now can be trusted to lazily load data. I don't know because...\n[1] I spat the dummy, replaced Windows with Linux, and started learning Go. Which does exactly what it says it does, with no magic. Exactly what I needed, and I still love Go for this.",
          "link": "https://news.ycombinator.com/item?id=40339848",
          "publishedOn": "2024-05-13T04:43:08.000Z",
          "wordCount": null,
          "title": "New comment by marcus_holmes in \"Did GitHub Copilot increase my productivity?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40336344",
          "author": "eig",
          "description": "A few months ago there were articles going around about how Samsung galaxy phones were upscaling images of the Moon using AI [0]. Essentially, the model was artificially adding landmarks and details based on its training set when the real image quality was too poor to make out details.\nNeedless to say, AI upscaling as described in this article would be a nightmare for radiologists. 90% of radiology is confirming the absence of disease when image quality is high, and asking for complementary studies when image quality is low. With AI enhanced images that look \"normal\", how can the radiologist ever say \"I can confirm there is no brain bleed\" when the computer might be incorrectly adding \"normal\" details when compensating for poor image quality?\n[0] - https://news.ycombinator.com/item?id=35136167",
          "link": "https://news.ycombinator.com/item?id=40336344",
          "publishedOn": "2024-05-12T18:16:23.000Z",
          "wordCount": null,
          "title": "New comment by eig in \"Whole-body magnetic resonance imaging at 0.05 Tesla\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=52696",
          "author": "John Holbo",
          "description": "After a couple days to think on it, I think this post is right on. I just stumbled on a paper that stumbles, badly, over one of my two obvious thoughts about originalism. So let me point that out. Quick review. My first obvious thought is it’s weird, if you think about it, that one […]",
          "link": "https://crookedtimber.org/2024/05/15/i-found-a-paper-that-denies-one-of-my-two-obvious-thoughts-about-originalism-so-stating-the-obvious-turns-out-to-be-useful/",
          "publishedOn": "2024-05-15T07:13:51.000Z",
          "wordCount": 3416,
          "title": "I found a paper that denies one of my two obvious thoughts about originalism, so stating the obvious turns out to be useful!",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52684",
          "author": "John Holbo",
          "description": "Looks like I haven’t posted for a couple years. Probably time to fix that! This one kicks off from a tweet I fired off, off-handedly, that led somewhere useful. “If you were wanting a paradigm case-in-point to illustrate the plausibility of legal realism, the history of legal originalism would be hard to improve on.” A […]",
          "link": "https://crookedtimber.org/2024/05/12/originalism-for-realists-two-obvious-thoughts/",
          "publishedOn": "2024-05-12T07:21:48.000Z",
          "wordCount": 7861,
          "title": "Originalism For Realists: Two Obvious Thoughts",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52680",
          "author": "Chris Bertram",
          "description": "Visit the post for more.",
          "link": "https://crookedtimber.org/2024/05/12/sunday-photoblogging-abandoned-restaurant-complex-near-meze-france/",
          "publishedOn": "2024-05-12T06:27:27.000Z",
          "wordCount": 1896,
          "title": "Sunday photoblogging: Abandoned restaurant complex near Mèze, France",
          "imageUrl": "https://live.staticflickr.com/65535/53667511615_76de17afb8.jpg"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/The-Bank-of-the-South-s-abandoned-experiment-in-Latin-America-and-the",
          "author": "Eric Toussaint",
          "description": "In 2007–2008, I helped to prepare the creation of the “Bank of the South” after being requested to assist in framing Ecuador's position on the issue by Argentine and Ecuadorian economists, as well as Ricardo Patiño, Minister of Economy and Finance in the administration of President Rafael Correa of Ecuador. I did so with commitment and without remuneration. In April 2007, in Quito, we drafted a proposal outlining Ecuador's position on the statutes, operating model, and objectives of the future (...)\nEnglish\n\n/ \nWorld Bank, \nBank of the South, \nSouth",
          "link": "https://www.cadtm.org/The-Bank-of-the-South-s-abandoned-experiment-in-Latin-America-and-the",
          "publishedOn": "2024-05-15T17:55:33.000Z",
          "wordCount": 4908,
          "title": "The aborted experiment of the Bank of the South in Latin America and the alternative policies that could have been adopted at the continental level",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/bc2041cde80bc40394dbdf3fee3107-e98a4.jpg"
        },
        {
          "id": "https://www.cadtm.org/A-World-of-Inequality",
          "author": "Maxime Perriot",
          "description": "A central feature of neo-liberal capitalism, which has ruled the global economy since the 1990s, is to deepen and widen inequalities. It makes a tiny minority indecently richer while leaving the majority in the lurch. Women and minorities such as indigenous peoples, LGBTQIA+ or racialized people are badly hit by those inequalities. In a situation in which famine and extreme poverty keep increasing, the withdrawal of the State further feeds the vicious circle of poverty and inequality. (...)\nEnglish\n\n/ \nPoverty, \nAusterity/Structural Adjustment, \nCapitalism, \nNorth, \nInegalites 2024 EN",
          "link": "https://www.cadtm.org/A-World-of-Inequality",
          "publishedOn": "2024-05-15T16:10:24.000Z",
          "wordCount": 2806,
          "title": "A World of Inequality",
          "enclosure": {
            "url": "https://www.cadtm.org/IMG/png/sans_titre-21.png",
            "length": "141507",
            "type": "image/png"
          },
          "imageUrl": "https://www.cadtm.org/IMG/png/sans_titre-21.png"
        },
        {
          "id": "https://www.cadtm.org/Presidents-Barber-Conable-and-Lewis-Preston-1986-1995",
          "author": "Eric Toussaint",
          "description": "In July 2024, the World Bank and the IMF will be 80 years old. 80 years of financial neo-colonialism and the imposition of austerity policies in the name of debt repayment. 80 years is enough! The Bretton Woods institutions must be abolished and replaced by democratic institutions serving an ecological, feminist and anti-racist bifurcation. To mark these 80 years, we are republishing a series of articles every Wednesday until July, looking in detail at the history and damage caused by these (...)\nEnglish\n\n/ \nWorld Bank, \nDebt in History, \nFinance against people, \n80 ans BM FMI EN",
          "link": "https://www.cadtm.org/Presidents-Barber-Conable-and-Lewis-Preston-1986-1995",
          "publishedOn": "2024-05-15T07:00:00.000Z",
          "wordCount": 4337,
          "title": "Presidents Barber Conable and Lewis Preston (1986-1995)",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L710xH373/833cfe7c2f034e142e95ddc716bf3e-a190b.jpg"
        },
        {
          "id": "https://www.cadtm.org/The-student-movement-for-Palestine-is-now-spreading-everywhere-inspiring",
          "author": "Yorgos Mitralias",
          "description": "As the student movement in solidarity with the Palestinians and denunciation of their genocide by Israel intensifies in the United States and now spreads across the planet, there are growing indications that it is succeeding in influencing the central balance of forces while it is being recognized as a major factor in international developments of decisive importance! Thus, Washington's “sudden” distancing of itself from the Netanyahu government, which followed (or perhaps...preceded) Hamas' (...)\nEnglish\n\n/ \nPalestine, \nNorth",
          "link": "https://www.cadtm.org/The-student-movement-for-Palestine-is-now-spreading-everywhere-inspiring",
          "publishedOn": "2024-05-14T15:02:22.000Z",
          "wordCount": 1929,
          "title": "The student movement for Palestine is now spreading everywhere, inspiring resistance to the barbarism of our times…",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/3856fc3252ad74c07a7f02f5a38039-614ee.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=7606",
          "author": "J",
          "description": "Chris, writing at uncountable thoughts: RSS is a pervasive, but little known, web technology that allows you aggregate all your content into one place for easy reading. There are very few websites without an RSS feed, although many don’t advertise the link (or, even realise they have it). When you put an RSS feed link […]",
          "link": "https://disassociated.com/rss-really-simple-why-complicated/",
          "publishedOn": "2024-05-16T21:00:08.000Z",
          "wordCount": 780,
          "title": "RSS is really simple, why do so many find it complicated?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7591",
          "author": "J",
          "description": "The 2024 Australian Book Industry Awards (ABIAs) were held last week, on Thursday 9 May. The ABIAs are considered the Australian book publishing industry’s night of nights. A book-ish version of the Oscars, if you will. Award winners include Pip Williams, with her novel The Bookbinder of Jericho, in the General Fiction Book of the […]",
          "link": "https://disassociated.com/2024-australian-book-industry-awards-abias-winners/",
          "publishedOn": "2024-05-15T21:00:41.000Z",
          "wordCount": 233,
          "title": "2024 Australian Book Industry Awards (ABIAs) winners",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7593",
          "author": "J",
          "description": "A breakdown of how people, Americans in this case, spend their time, by each decade of their life. Things like sleeping, eating, working, caring for others, and socialising. The crunch is definitely on in our thirties, forties, and fifties, when time for sleep and socialising, for instance, is reduced. Kurzgesagt also did a presentation a […]",
          "link": "https://disassociated.com/minute-hours-hours-days-how-you-spend-your-time/",
          "publishedOn": "2024-05-15T20:30:55.000Z",
          "wordCount": 255,
          "title": "Minutes to hours, hours to days, this is how you spend your time",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7596",
          "author": "J",
          "description": "Well this is exciting, the longlist for the 2024 Miles Franklin literary award for Australian novel writing, has been published. Not sure how I missed the official announcement, but I went searching for a date the longlist would be unveiled, and instead found the longlist itself: Only Sound Remains, by Hossein Asgari Wall, by Jen […]",
          "link": "https://disassociated.com/2024-miles-franklin-longlist-australian-novel-writing/",
          "publishedOn": "2024-05-15T20:00:58.000Z",
          "wordCount": 321,
          "title": "The 2024 Miles Franklin longlist for Australian novel writing",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7584",
          "author": "J",
          "description": "Web designers and bloggers have been able to use alternative text, often referred to as “alt-text”, to describe images and photos, for decades. Alt-text helps people with little or no vision comprehend a website image, so long as the description is reasonably accurate. In recent years social media has caught up, and most channels, Instagram, […]",
          "link": "https://disassociated.com/like-describing-photo-friend-write-alt-text/",
          "publishedOn": "2024-05-14T21:00:48.000Z",
          "wordCount": 404,
          "title": "Like describing a photo to a friend, how to write alt-text",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7582",
          "author": "J",
          "description": "A text editor without the bells and whistles, called Tine. A nice name for a text editor. The main goal of this editor is to keep the focus on the text editing and not be distracted too much by buttons, tabs, menus, and animations.",
          "link": "https://disassociated.com/simple-text-editor-tine-martin-dorazil/",
          "publishedOn": "2024-05-14T20:30:41.000Z",
          "wordCount": 145,
          "title": "A simple text editor named Tine, by Martin Dorazil",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7572",
          "author": "J",
          "description": "A scene from Angel Baby, a film by Michael Rymer, depicting stars Jacqueline McKenzie and John Lynch. Angel Baby, trailer, is the 1995 debut feature of Australian filmmaker Michael Rymer. You may have seen some of his other work: Battlestar Galactica, Hannibal, both TV series, and/or his 2012 feature, Face to Face, but likely you’ve […]",
          "link": "https://disassociated.com/angel-baby-story-doomed-loved-changing-australian-accents/",
          "publishedOn": "2024-05-13T21:00:03.000Z",
          "wordCount": 778,
          "title": "Angel Baby, a story of doomed loved, and changing Australian accents",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7579",
          "author": "J",
          "description": "Seen at Simon Willison’s Weblog: Not all promotional content is spam, and not all AI-generated content is slop. But if it’s mindlessly generated and thrust upon someone who didn’t ask for it, slop is the perfect term for it. Spam and slop. Now there’s a diet guaranteed to be bad for your health and mental […]",
          "link": "https://disassociated.com/unwanted-ai-generated-content-name-slop/",
          "publishedOn": "2024-05-13T20:30:04.000Z",
          "wordCount": 152,
          "title": "Unwanted AI-generated content has a name: slop",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7568",
          "author": "J",
          "description": "Wing Pang is studying Design in Visual Communications at the University of Technology, Sydney, in Australia. As part of the degree course, she’s doing an assignment looking at IndieWeb, and decentralised social media, such as Mastodon. She’s interested in hearing the views of people on the subject, and if you’re interested in offering your thoughts, […]",
          "link": "https://disassociated.com/australian-study-indieweb-decentralised-social-media/",
          "publishedOn": "2024-05-13T03:57:25.000Z",
          "wordCount": 203,
          "title": "An Australian study on IndieWeb, decentralised social media",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7564",
          "author": "J",
          "description": "Matthias Ott, writing at Own Your Web: Today, social media sites have made it seductively convenient to quickly post links that will immediately be rewarded with views, likes, and reposts. As a result, many of us seem to instinctively drop most of the interesting links we find right into the timelines of the many — […]",
          "link": "https://disassociated.com/share-links-personal-website-like-socials-channel/",
          "publishedOn": "2024-05-12T21:00:15.000Z",
          "wordCount": 462,
          "title": "Share links on your personal website like it was a socials channel",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20240516",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20240516",
          "publishedOn": "2024-05-16T05:00:00.000Z",
          "wordCount": 551,
          "title": "Week Ending May 12, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/crosshairs",
          "author": null,
          "description": "The shooting of Robert Fico.",
          "link": "https://newleftreview.org/sidecar/posts/crosshairs",
          "publishedOn": "2024-05-16T22:52:12.000Z",
          "wordCount": 1227,
          "title": "Lily Lynch: &ldquo;Crosshairs&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/05/GettyImages-1700884950-scaled-ezgif.com-webp-to-jpg-converter.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/a-bronx-tale",
          "author": null,
          "description": "Cooperativism in New York.",
          "link": "https://newleftreview.org/sidecar/posts/a-bronx-tale",
          "publishedOn": "2024-05-16T10:47:57.000Z",
          "wordCount": 3448,
          "title": "Michael Casper: &ldquo;A Bronx Tale&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/05/0631-ezgif.com-webp-to-jpg-converter.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/radio-waves",
          "author": null,
          "description": "On Ernst Schoen.",
          "link": "https://newleftreview.org/sidecar/posts/radio-waves",
          "publishedOn": "2024-05-14T13:48:17.000Z",
          "wordCount": 3353,
          "title": "Owen Hatherley: &ldquo;Radio Waves&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/05/moholy.jpg"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://tiramisu.bearblog.dev/fear-expectations/",
          "author": null,
          "description": "(This open letter is inspired by a post I read yesterday by Gabby of woolgathering fame.)\nDear Gabby,\nIt’s not just you: getting over the fear of expectations is hard. I still struggle with it, after 300 something posts. I have a feeling I’ll never get completely over it, but here’s what’s helped me so far.\nPosting a lot helps. I’ve posted so much nonsense on this blog that these days there’s not much I can do that will be worse than something I’ve written before. Somehow, I still have regular readers. Realizing that there are people out there still interested in what I have to say after all the good and not so good is a great comfort. From what you write, you seem to have discovered as much.\nAnother perk of having a large body of work is that each new piece you create becomes a smaller and smaller part of your entire oeuvre. When you’re first starting out, it feels like each creation you put out defines you. After all, if you only have one post, it’s the only thing people can judge you on. If you have a hundred, a wayward post is a drop in the bucket.\nThat said, wouldn’t you still want to see the creations your friends or favorite creators aren’t proud of? Or see their art even if it doesn’t quite fit the niche they’ve carved out for themselves? Everybody half-asses things in their own unique way. There’s a beauty in doing things imperfectly, too.\nAll that is to say, keep up what you’re doing. Creative inertia is a very real thing. You’re doing the right thing by posting, even if you feel like you’re just posting to break the streak of inactivity. Writing in any form begets more writing.\nAnyway, welcome back to Bear! It’s good to have you back.\nYours,\nmisu",
          "link": "https://tiramisu.bearblog.dev/fear-expectations/",
          "publishedOn": "2024-05-17T06:07:27.208Z",
          "wordCount": 771,
          "title": "re: the fear of audience expectations, by gabby",
          "imageUrl": null
        },
        {
          "id": "https://exponixio.bearblog.dev/compounding-heartbreaks-and-unsent-love-letters-new/",
          "author": null,
          "description": "I think one of the biggest reasons why I was utterly pissed off at the dude for ditching me was all of that  built-up anticipation, only to be disappointed at the very end. I had this really big expectation, but I think I really shouldn't count on people too much. In my mind, I hadn't had a little trip in a while, and having that cool rendezvous experience with a cute guy? I was so keen.\nI can't believe that I made plans with someone, looked forward to our weekend getaway, only to find out he's changed his plans without a word and flew off somewhere instead. It completely left me feeling confused and downright pissed off. I didn't think I deserved to be left hanging like that and to not have an in-person apology. I haven't even seen him ever since we went to the museum together 1 2.\n\nI sai…",
          "link": "https://exponixio.bearblog.dev/compounding-heartbreaks-and-unsent-love-letters-new/",
          "publishedOn": "2024-05-16T17:23:05.119Z",
          "wordCount": 1438,
          "title": "158. Compounding heartbreaks and unsent love letters",
          "imageUrl": null
        },
        {
          "id": "https://tiramisu.bearblog.dev/public-bathhouse/",
          "author": null,
          "description": "Grandpa’s been trying to get my brother V and I to go to the public bathhouse with him for as long as I can remember. He asked us last time we were both here back when we were both still in elementary school. He asked us every day this past week too.\nNaturally, since we don’t come from a culture where public nudity is the norm, my brother and I aren’t so keen on the idea of stripping butt-naked in front of our grandpa and his octogenarian friends. Grandpa’s tried everything to change our Nos to Yeses: at first he asked us nicely, then he tried urging us and bullying us into agreeing.\nI finally caved today, more to shut him up than anything. In the wake of my uncle’s death, I’m aware that this might very well be the last time I get to spend time with my grandpa, so I figured I could lock my…",
          "link": "https://tiramisu.bearblog.dev/public-bathhouse/",
          "publishedOn": "2024-05-16T12:33:37.270Z",
          "wordCount": 937,
          "title": "skinny dipping with the elderly",
          "imageUrl": null
        },
        {
          "id": "https://exponixio.bearblog.dev/the-fairy-gaymothers-malacca-day-2/",
          "author": null,
          "description": "[This is a continuation of Day 1 of Malacca]\nI woke up the next day around 8:30AM. Malacca wholeheartedly welcomed me, but I haven't had a chance to savor it much. I decided to have a lie-in and play on my phone for a little bit before taking on the day. Most businesses open around 10 AM and I just needed some rest.\nI laid in bed, tapping away on Instagram messages and WhatsApp chats. I looked back at the photos and videos in my photo album that I haphazardly took while I was in the club and giggled. Throughout the early morning, I was updating my friends in the morning about my adventures. A bunch of them were laughing at me because it seemed like I replaced one French person with another French. However, this time- she's way more fun and she commits to the plans that we make.\nOk, I was s…",
          "link": "https://exponixio.bearblog.dev/the-fairy-gaymothers-malacca-day-2/",
          "publishedOn": "2024-05-16T12:24:53.946Z",
          "wordCount": 2235,
          "title": "157. The fairy gaymothers (Malacca Day 2)",
          "imageUrl": null
        },
        {
          "id": "https://woolgathering.bearblog.dev/catching-up/",
          "author": null,
          "description": "woah, hello bear! it sure has been a while since i've last written.\na little bit after my last post, i went on some back-to-back trips around asia. i spent a few days in seoul and about a week in bali. i did actually write about both of those trips with the intention of sharing them with all of you on here but for some reason i couldn't quite bring myself to publish it. i've never really written on any sort of platform before this, but i'm assuming that just like visual art, some writing is just meant to be kept to yourself.\nwith the only things i had written in that span of 4 weeks being private, i didn't really have much else to post. and the longer i went without posting, the harder it was to come back. this always happens to me. it was the exact same mindset i had with my art account o…",
          "link": "https://woolgathering.bearblog.dev/catching-up/",
          "publishedOn": "2024-05-16T07:28:05.926Z",
          "wordCount": 1502,
          "title": "catching up",
          "imageUrl": null
        },
        {
          "id": "https://kartikay.bearblog.dev/big-tech/",
          "author": null,
          "description": "For the longest time, I wanted to work in big tech. I got placed in one such company from campus placements. It was mostly due to my c programming skills and research work.\nI am grateful for the role. I get to work on something I like. The people I work with are smart and kind. But it is just a job. Both to me and to the people I work with. One of the major perks that the HR department keeps repeating is a great work-life balance. You get time for yourself. That is very true.\nIsn't that great? You get paid well. Get enough time for a good social life and side projects. You can also fund these side projects with your salary.\nYes, but what about working in a startup? A place where a lot of super passionate people are going ham at what they do. To them, it is not a job but a mission. A sort of crazy cult. Filled with kind passionate nerds. Some place where you own part of the dream. Have equity.\nIt sounds nice. But such places are very rare. The startup scene in India is pretty horrible. I have heard some really bad stories. So many of the startups look cool on the outside. Have great pay even. But are horrible to work for. I have had friends experience this.\nI also feel like I am not good enough for those truly cracked places yet. So I am happy where I am for now and just Skill maxxing. I want to feel like a really capable engineer. I see so many of them at my org. All are really kind and happy to guide me.\nSometimes these essays help me put my life in context and clear my thinking a lot. This was one of those.",
          "link": "https://kartikay.bearblog.dev/big-tech/",
          "publishedOn": "2024-05-15T13:10:26.460Z",
          "wordCount": 744,
          "title": "Big Tech",
          "imageUrl": null
        },
        {
          "id": "https://that-bloke.com/how-many-genders-are-there/",
          "author": null,
          "description": "There's 2 genders, right? We all know that.\nOf course there is. You're either a bloke, who has the dangly bits between their legs, or you're a woman without said dangly bits.\nBut maybe there's more. Maybe you have the dangly bits, but it doesn't feel right to call yourself a man? Maybe it's the opposite? Or something in between?\nHonestly, I don't give a fuck. For all I care, you could identify as a potato and I'll still respect your wishes. But getting pissed off at me if I mis-identify you is not cool.\nLook, it's a fucking minefield out there when it comes to people identifying as non-binary. We've been mincing about this planet for hundreds of thousands of years, and for most that time there's been 2 genders. Male and female.\nBut in the last few decades there's been a number of other genders that have sprung up. So if I think you look like a man, and I refer to you as \"him\" don't get up on your high horse and start screaming \"YOU ASSUMED MY GENDER! NAZI!\"\nI assumed your gender because you look like a fucking man. If you identify as something else, that's fine. Tell me politely and I'll happily respect your wishes. Live and let live, and all that. Makes no difference to me.\nIrony is, if you're not a dick about the whole thing, you're far more likely to get people on-side. You're always gonna get bigoted wankers, that's par for the course. But just because someone makes a mistake, it doesn't make them a bigot, or a transphobe, or a TERF, or a Nazi.\nIt just makes them human.\nPeace ✌🏻\nReply by email",
          "link": "https://that-bloke.com/how-many-genders-are-there/",
          "publishedOn": "2024-05-14T16:45:06.631Z",
          "wordCount": 929,
          "title": "How Many Genders Are There?",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/thatbloke-1713812790-0.webp"
        },
        {
          "id": "https://mei.bearblog.dev/i-can-quit-any-time-i-wont/",
          "author": null,
          "description": "I'm currently writing this post as a break from working on the comic I have due at the end of the month. It's an eighteen-page oneshot and my very first contribution to an anthology, which is honestly very exciting. Intimidating, too, which is why I ended up putting off most of the work until the last minute.\nWorking on it has, as I anticipated, brought to light a number of my artistic weaknesses: I don't like inking, I half-ass shapes I don't understand rather than look for a reference, my faces are inconsistent... the list goes on. Seeing all the ways I fall short of my expectations is what I was afraid of happening, why I put it off for so long – but I don't really have the time anymore to sit and nitpick at my work, which is kind of a blessing. Stuff is getting done!\nIt's frustrating t…",
          "link": "https://mei.bearblog.dev/i-can-quit-any-time-i-wont/",
          "publishedOn": "2024-05-14T14:09:15.529Z",
          "wordCount": 1524,
          "title": "i can quit any time (i won't)",
          "imageUrl": null
        },
        {
          "id": "https://tiramisu.bearblog.dev/hard-swallow/",
          "author": null,
          "description": "My throat hurts a little. I don’t know if this is because of the air quality here or because I’m actually getting sick, but I’m desperately hoping it’s not the latter. I stopped taking my immunosuppressants today and started drinking lots of juices high in vitamin C, despite research proving chugging OJ a rather ineffective method for warding off illness. (Something about all the sugar in it makes it hard for your body to absorb the Vitamin C, if I remember correctly.)\nTraveling and getting sick go hand in hand for me. It’s as if arriving somewhere new triggers my immune system to self-immolate. When I visited New York in 2021 I lost my voice after a few days. I spent my first week in Latin America making chicken noodle soup and nursing myself back to health. My immune system’s never been …",
          "link": "https://tiramisu.bearblog.dev/hard-swallow/",
          "publishedOn": "2024-05-14T13:56:55.178Z",
          "wordCount": 1736,
          "title": "hard pills to swallow",
          "imageUrl": null
        },
        {
          "id": "https://itapun.bearblog.dev/english-is-a-very-religious-language/",
          "author": null,
          "description": "I never really thought about it while growing up because I was raised in a religious family anyway and it's just how I was used to people talking, but at this point I've been living in Japan for several years and I often notice that very normal phrases take on a religious persona when translated to English. For example we have this word yokatta which literally translates as \"it was good\", but if you were to translate it normally to English as it's used than it would come out as \"thank God\". Or we have this other word kotoka which would be translated as \"God knows\" like \"God only knows how bored I am\" (なんて暇なことか). Also a lot of words in English are shortened versions of old phrases with religious significance like \"Goodbye\" coming from \"God be with ye\", and a lot of set phrases or common expressions in English that people use all the time come straight from the Bible like \"a drop in the bucket\", \"go the extra mile\", \"by the skin of your teeth\", \"the root of the matter\", \"a labor of love\", \"scapegoat\", \"broken heart\", \"eye for an eye\", \"rise and shine\", \"fall by the wayside\", or \"a wolf in sheep's clothing\"\nI'm not suggesting that it's a bad thing (and I don't think it is), and Japanese has a lot of similar words or phrases which come from a religious origin too. It's just kinda weird to notice in retrospect how in English-speaking countries everything is experienced through a Judeo-Christian lens, even if you're an atheist.\nMaybe that's why Western society and Japanese society are so different. Or partly why, anyway.",
          "link": "https://itapun.bearblog.dev/english-is-a-very-religious-language/",
          "publishedOn": "2024-05-14T13:18:05.300Z",
          "wordCount": 793,
          "title": "English is a very religious language",
          "imageUrl": null
        },
        {
          "id": "https://savetooru.bearblog.dev/you-want-a-revelation/",
          "author": null,
          "description": "my supposed last term in college, i ended up failing a class and falling into academic purgatory for months. \n\ni try not to dredge up the past but looking back, it's not that the issue was a matter of effort. sudden losses in the family and a general fear anyone else i cared about would fall ill aggravated a condition i was largely unaware of into rearing its big, ugly head. those days i'd lived not knowing 120 bpm was my resting average. and then the waitlists. and the forced leaves. and the absurd changes to curriculum. \n\nhard not to fault myself for ignoring my health. i mean, i was and still am obsessed with seeming invincible. who else was supposed to notice something was wrong? but at the very least, i probably would have graduated on time had the world not been actively folding in o…",
          "link": "https://savetooru.bearblog.dev/you-want-a-revelation/",
          "publishedOn": "2024-05-14T10:12:02.449Z",
          "wordCount": 996,
          "title": "you want a revelation",
          "imageUrl": null
        },
        {
          "id": "https://kartikay.bearblog.dev/talking-to-computers/",
          "author": null,
          "description": "Open AI released a new update. You can now talk to your computers just like a human. Low latency. More responsive. It got me thinking about how I talk to computers.\nThe way I do it is more intimate. I am a low-level programmer. I write firmware code in c mostly. I think about the hardware that runs my code more than the average programmer. Yet if it was the 1980's I would be a very high-level programmer. The assembly lang bros will look at me with contempt the same way I look at the python bros. The thought alone makes me shiver.\nHow we talk to computers has evolved. So many great engineers built the infrastructure that I use today to turn my c code into machine code. From the libraries, the operating system, and the compiler. There is a sort of deterministic heuristic-based intelligence b…",
          "link": "https://kartikay.bearblog.dev/talking-to-computers/",
          "publishedOn": "2024-05-13T17:44:20.298Z",
          "wordCount": 829,
          "title": "Talking to Computers",
          "imageUrl": null
        },
        {
          "id": "https://pj.bearblog.dev/a-rant-on-americas-youth/",
          "author": null,
          "description": "i know, kind of random. \n\nthese days, kids in the region where i live get chromebooks at school. \n\nmany of my students, including the ones who are now in middle school, are not efficient typers, and in fact many of them are slamming their pointer fingers down on keys one by one, the younger ones not even remembering where any of the letters are even after countless repetitions of the same words. \n\nand don't even get me started on their spelling skills. \nchoice, import, and scissors, although i'll cut some of the younger ones slack on scissors. \n\nsomething else i find pretty funny is that occasionally they'll try to touch the screen on the desktop to navigate. \n\nand this is all coming from an area where many of the school districts are top in the nation. \n\ndid you also know that kids nowadays are more susceptible to online scams and malware? \n\nand overall, kids throughout the nation are reading at a significantly lower level than they should be, even with schooling. \n\nthat's it from me, thanks for reading my rant:)",
          "link": "https://pj.bearblog.dev/a-rant-on-americas-youth/",
          "publishedOn": "2024-05-13T15:53:23.747Z",
          "wordCount": 1035,
          "title": "a rant? on america's youth",
          "imageUrl": null
        },
        {
          "id": "https://mgx.me/crawfish-update/",
          "author": null,
          "description": "▶︎ Listen to my voice note\n\nAlmost two weeks ago, I wrote about catching a crawfish in the pond near Jiaozi Park, not far from where I live. My wife and I weren't sure what to do - whether we should put it back or keep it. Ultimately, we decided to keep it and see how it fared.\nI'm happy to report that the crawfish seems to be doing very well. We've noticed that it is molting. My wife even bought special food for it. It's no longer afraid of us, either. Before, it would stop eating if we approached it, but now it continues eating even when we're nearby. It comes quickly to the surface whenever we feed it, too.\nWe're trying to make the crawfish feel comfortable in its new home. So far, it seems to be adjusting well. I'll provide more updates as things progress.",
          "link": "https://mgx.me/crawfish-update/",
          "publishedOn": "2024-05-13T10:15:41.850Z",
          "wordCount": 1195,
          "title": "crawfish update",
          "imageUrl": "https://orma.zip/img/AgACAgUAAxkBAAPyZjudSN2V_XhSXop-Rxoz716shGUAAq2_MRvc4-FV0SUOZCPAs0sBAAMCAAN5AAM1BA.jpg"
        },
        {
          "id": "https://tiramisu.bearblog.dev/dust-bowl/",
          "author": null,
          "description": "Grandpa picks up my spiral notebook filled with loopy scribbles, and I don’t stop him because I know he can’t read what I write anyway. He compliments my handwriting, which makes me feel a pang of guilt. Am I being ungrateful, spoiled when I write about my experience like this?\nThere is not a whole lot to do here. With my uncle gone there’s no one to take us out; while healthy, my grandparents can’t walk for very long and neither can my mom. My brother and I are useless on our own. We don’t have a data plan, can’t pay for anything because we don’t have WeChat pay set up (I think you need a Chinese bank account), and can’t even download an offline map to help us get around. If we do go out on our own we’ll have to retrace our steps by memory.\nThe streets are covered with a yellowish dust, w…",
          "link": "https://tiramisu.bearblog.dev/dust-bowl/",
          "publishedOn": "2024-05-11T22:34:34.535Z",
          "wordCount": 1059,
          "title": "the dust bowl",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/robert-p-helms-how-to-find-your-local-wobbly-history?v=1715806685",
          "author": null,
          "description": "Author: Robert P. Helms\nTitle: How to find Your Local Wobbly History\nDate: 2000\nNotes: Published in Anarcho-Syndicalist Review #28, Spring 2000.\nSource: Retrieved on 15th May 2024 from www.katesharpleylibrary.net\n\n One can find the forgotten Wobbly names and faces, strike stories, union halls and martyrs’ graves in any city where the IWW earned its legendary reputation. It is easy to find thorough information on the luminaries, such as Tresca, Flynn and Giovanitti, but what about those local organizers who invited these major figures to town, and then kept working after they were gone, pouring the wine of rebellion into workers’ hearts? It may take some time, but in all probability you’ll find syndicalist monuments and hallowed ground that you walk past every day, but never knew existed. \n…",
          "link": "https://theanarchistlibrary.org/library/robert-p-helms-how-to-find-your-local-wobbly-history?v=1715806685",
          "publishedOn": "2024-05-15T20:58:05.000Z",
          "wordCount": 993,
          "title": "Robert P. Helms - How to find Your Local Wobbly History",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "5979",
            "url": "https://theanarchistlibrary.org/library/robert-p-helms-how-to-find-your-local-wobbly-history.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/robert-p-helms-doctors-and-druggists-among-the-early-philadelphia-anarchists?v=1715805357",
          "author": null,
          "description": "Author: Robert P. Helms\nTitle: ​Doctors and Druggists Among the Early Philadelphia Anarchists\nDate: September 2006\nNotes: An earlier, much shorter version of this article, “Anarchists in Medicine and Pharmacy: Philadelphia, 1889–1930,” appeared in Clamor Magazine #6 (Dec. 2000/Jan. 2001), and had previously been posted on both the Guinea Pig Zero and Dead Anarchists websites.\nSource: Retrieved on 15th May 2024 from www.deadanarchists.org\n\n In the City of Philadelphia in the late 19th and early 20th centuries, there was a large group of professionals who practiced medicine or pharmacy as a livelihood, while committing great energies to the anarchist movement. Looking past the surface, we find a closely knit community of intellectuals who treated their comrades as patients, educated the publ…",
          "link": "https://theanarchistlibrary.org/library/robert-p-helms-doctors-and-druggists-among-the-early-philadelphia-anarchists?v=1715805357",
          "publishedOn": "2024-05-15T20:35:57.000Z",
          "wordCount": 5244,
          "title": "Robert P. Helms - ​Doctors and Druggists Among the Early Philadelphia Anarchists",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "17607",
            "url": "https://theanarchistlibrary.org/library/robert-p-helms-doctors-and-druggists-among-the-early-philadelphia-anarchists.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/voltairine-de-cleyre-on-domesticity-jealousy-and-abortion?v=1715804763",
          "author": null,
          "description": "Author: Voltairine de Cleyre\nTitle: On Domesticity, Jealousy, and Abortion\nSubtitle: A Private Letter to Samuel H. Gordon\nDate: 1897\nNotes: Edited and introduced by Robert P. Helms.\nSource: Retrieved on 15th May 2024 from www.deadanarchists.org\n\n​Introduction\n Voltairine de Cleyre, by far Philadelphia’s brightest anarchist light, was 30 years old when, during the late summer or fall of 1897, she wrote the following letter in London. The letter was never finished, nor was it signed, dated, or mailed. Yet the letter, clearly in her handwriting and style, came to rest in a large group of her letters in the papers of Joseph J. Cohen (1878–1953), de Cleyre’s longtime associate in anarchism, which are stored in the Bund Collection, YIVO Archives, in New York City. It is one of the most compellin…",
          "link": "https://theanarchistlibrary.org/library/voltairine-de-cleyre-on-domesticity-jealousy-and-abortion?v=1715804763",
          "publishedOn": "2024-05-15T20:26:03.000Z",
          "wordCount": 2929,
          "title": "Voltairine de Cleyre - On Domesticity, Jealousy, and Abortion",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "12338",
            "url": "https://theanarchistlibrary.org/library/voltairine-de-cleyre-on-domesticity-jealousy-and-abortion.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/geelong-anarchist-communists-tommy-lawson-all-eyes-on-rafah?v=1715802065",
          "author": null,
          "description": "Author: Geelong Anarchist-Communists, Tommy Lawson\nTitle: All Eyes on Rafah\nDate: May 15th, 2024\nNotes: The following article is a transcript of a speech given by Geelong Anarchist Communists member Tommy Lawson at an Independent and Peaceful Australia Network (IPAN) ‘Rally for Rafah’ held on Saturday 11th of May. Its content is supported unanimously by Geelong Anarchist Communists. We have decided to publish it today, on the 76th anniversary of the Nakba (‘catastrophe’) to declare that we stand with those resisting genocide and colonisation.\nSource: Retrieved on May 15th, 2024 from https://geelonganarchists.org/2024/05/15/all-eyes-on-rafah/.\n\nDuring al Nakba over 750,000 Palestinian people, from a total population of 1.9 million, were made refugees beyond the borders of their homeland. 53…",
          "link": "https://theanarchistlibrary.org/library/geelong-anarchist-communists-tommy-lawson-all-eyes-on-rafah?v=1715802065",
          "publishedOn": "2024-05-15T19:41:05.000Z",
          "wordCount": 1491,
          "title": "Geelong Anarchist-Communists, Tommy Lawson - All Eyes on Rafah",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7729",
            "url": "https://theanarchistlibrary.org/library/geelong-anarchist-communists-tommy-lawson-all-eyes-on-rafah.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/crimethinc-how-to-justify-workplace-theft?v=1715732383",
          "author": null,
          "description": "Author: CrimethInc.\nTitle: How To Justify Workplace Theft\nDate: 14th April 2020\nSource: Retrieved on 9th September 2020 from archive.org/details/workplacetheft-web\n\n Whether aware of it or not, your boss is stealing from you every paycheck. Employers profit off of the “excess” wealth that you, as an employee, produce. There are two ways to get paid in America: make money off the work you do, or make money off the work that other people do. Employees generate wealth, employers collect it. \n We live in a capitalist society. We all know that. Most people are okay with it, too. After all, the competition (state communism like the USSR) doesn’t have such a good reputation. \n But what exactly does capitalism mean? Our good friend the dictionary says capitalism is “an economic and political syste…",
          "link": "https://theanarchistlibrary.org/library/crimethinc-how-to-justify-workplace-theft?v=1715732383",
          "publishedOn": "2024-05-15T00:19:43.000Z",
          "wordCount": 1988,
          "title": "CrimethInc. - How To Justify Workplace Theft",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "10660",
            "url": "https://theanarchistlibrary.org/library/crimethinc-how-to-justify-workplace-theft.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anne-archet-sirventes-of-the-beast?v=1715731162",
          "author": null,
          "description": "Author: Anne Archet\nTitle: Sirventès of the Beast\nDate: 2014/06/27\nNotes: Printed in Return Fire vol.6 chap.6 (spring 2024). \n PDFs of Return Fire and related publications can be read, downloaded and printed by visiting returnfire.noblogs.org or emailing returnfire@riseup.net\n\n I am no citizen \n I am no consumer \n I am no tax-payer \n I am no employee \n I am no convict \n I am no beneficiary \n I am no person of color \n I am no lesbian \n I am no mother \n I am no wife \n I am no erotic writer \n I am no poetess \n I am no anarchist \n I am no woman \n I am surely no Human \n That vile and ethereal being \n Which has never been spotted elsewhere \n But in universal declarations \n I don't want to stay seated and raise my hand \n I don't want to wait for the teacher to tell me to speak \n I don't want to w…",
          "link": "https://theanarchistlibrary.org/library/anne-archet-sirventes-of-the-beast?v=1715731162",
          "publishedOn": "2024-05-14T23:59:22.000Z",
          "wordCount": 1095,
          "title": "Anne Archet - Sirventès of the Beast",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6036",
            "url": "https://theanarchistlibrary.org/library/anne-archet-sirventes-of-the-beast.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anonymous-return-fire-the-green-farce-everywhere-nowhere-else?v=1715730807",
          "author": null,
          "description": "Author: Anonymous, Return Fire\nTitle: The ‘Green’ Farce Everywhere & Nowhere Else\nSubtitle: towards destroying electric mobility & decarbonizing lies\nNotes: Printed in Return Fire vol.6 chap.6 (spring 2024). \n To read the articles referenced throughout this text in [square brackets], PDFs of Return Fire and related publications can be read, downloaded and printed by visiting returnfire.noblogs.org or emailing returnfire@riseup.net\n\n [ed. – Taken from the German-language website SwitchOff.noblogs.org, this translation continues our interventions in the new climate movements. There are two fronts on which we would like to extend the thrust of the author/s further, in terms of its response to the text reproduced above in this chapter of Return Fire, Targets That Do Not Exist Anywhere Else. Fi…",
          "link": "https://theanarchistlibrary.org/library/anonymous-return-fire-the-green-farce-everywhere-nowhere-else?v=1715730807",
          "publishedOn": "2024-05-14T23:53:27.000Z",
          "wordCount": 5350,
          "title": "Anonymous, Return Fire - The ‘Green’ Farce Everywhere & Nowhere Else",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "18969",
            "url": "https://theanarchistlibrary.org/library/anonymous-return-fire-the-green-farce-everywhere-nowhere-else.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/cello-latini-pfeil-bruno-latini-pfeil-an-anarchist-historical-analysis-of-body-inscriptions-in?v=1715728910",
          "author": null,
          "description": "Author: Cello Latini Pfeil, Bruno Latini Pfeil\nTitle: An Anarchist Historical Analysis of Body Inscriptions in Modern Western Society\nDate: 02.22.2024\nSource: Original translation of “Uma análise histórica anarquista das inscrições corporais na sociedade ocidental moderna”, published in Revista História em Reflexão 18(35), 2024. Retrieved on 05/07/2024 from https://doi.org/10.30612/rehr.v18i35.16476\n\nAbstract\n In this paper, we aim to analyze the processes of stigmatization and pathologization to which certain categories of body inscriptions have been subjected throughout the history of modern Western society. Body inscriptions are defined as any and all modifications made to the body's structure. While some inscriptions are exalted and praised, others are stigmatized and discriminated aga…",
          "link": "https://theanarchistlibrary.org/library/cello-latini-pfeil-bruno-latini-pfeil-an-anarchist-historical-analysis-of-body-inscriptions-in?v=1715728910",
          "publishedOn": "2024-05-14T23:21:50.000Z",
          "wordCount": 7653,
          "title": "Cello Latini Pfeil, Bruno Latini Pfeil - An Anarchist Historical Analysis of Body Inscriptions in Modern Western Society",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "27843",
            "url": "https://theanarchistlibrary.org/library/cello-latini-pfeil-bruno-latini-pfeil-an-anarchist-historical-analysis-of-body-inscriptions-in.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/agnes-henry-anarchist-communism-in-its-relation-to-state-socialism?v=1715728414",
          "author": null,
          "description": "Author: Agnes Henry\nTitle: Anarchist Communism in its Relation to State Socialism\nDate: June 1896\nNotes: Original text split between two consecutive monthly publications, with a misprint in the latter citing the first entry as having been published in July rather than June; transcribed from Liberty: A Journal of Anarchist Communism (June 1896) and Liberty: A Journal of Anarchist Communism (July 1896) on the Internet Archive.\nSource: Liberty: A Journal of Anarchist Communism\n\n The question of how for Anarchist Communism agrees exactly with State Socialism, and the exact line that divides them, has long seemed to me one that it would be well to enter into. And just now, in view of the approaching International Congress, seems a time particularly appropriate for this consideration. For surely…",
          "link": "https://theanarchistlibrary.org/library/agnes-henry-anarchist-communism-in-its-relation-to-state-socialism?v=1715728414",
          "publishedOn": "2024-05-14T23:13:34.000Z",
          "wordCount": 4942,
          "title": "Agnes Henry - Anarchist Communism in its Relation to State Socialism",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "14967",
            "url": "https://theanarchistlibrary.org/library/agnes-henry-anarchist-communism-in-its-relation-to-state-socialism.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/sophie-scott-brown-colin-ward-and-the-art-of-everyday-anarchy?v=1715727897",
          "author": null,
          "description": "Author: Sophie Scott-Brown\nTitle: Colin Ward and the Art of Everyday Anarchy\nDate: 2022\nNotes: Routledge Studies in Radical History and Politics\nSource: <doi.org/10.4324/9781003100409>\n\nColin Ward and the Art of Everyday Anarchy is the first full account of Ward’s life and work. Drawing on unseen archival sources, as well as oral interviews, it excavates the worlds and words of his anarchist thought, illuminating his methods and charting the legacies of his enduring influence. \n Colin Ward (1924—2010) was the most prominent British writer on anarchism in the 20th century. As a radical journalist, later author, he applied his distinctive anarchist principles to all aspects of community life including the built environment, education, and public policy. His thought was subtle, universal in a…",
          "link": "https://theanarchistlibrary.org/library/sophie-scott-brown-colin-ward-and-the-art-of-everyday-anarchy?v=1715727897",
          "publishedOn": "2024-05-14T23:04:57.000Z",
          "wordCount": 125132,
          "title": "Sophie Scott-Brown - Colin Ward and the Art of Everyday Anarchy",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "2531074",
            "url": "https://theanarchistlibrary.org/library/sophie-scott-brown-colin-ward-and-the-art-of-everyday-anarchy.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/uploads/en/thumbnails/s-s-sophie-scott-brown-colin-ward-and-the-art-of-e-1.jpg.large.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/boy-igor-phil-mailer-and-yet-it-moves-updated-edition?v=1715726263",
          "author": null,
          "description": "Author: Boy Igor & Phil Mailer\nTitle: And Yet It Moves (Updated Edition)\nSubtitle: The Realization and Suppression of Science and Technology\nDate: 1985\nNotes: A situationist critique of science and technology published in New York in 1985. This version is a new edition that was published on the 'Endangered Phoenix' website and credited to Phil Meyler. The Endangered Phoenix website is dead now, and I can’t find the updated version on the website through the wayback machine, so there are some footnotes and chapter heading levels which are unclear to me. Plus, I think chapter 3 & 4 were merged in the updated edition, so chapter numbers went out of sync, but chapter 8 was still called chapter 8 which makes it seem like chapter 7 is missing on the libcom website. It is all very confusing, but …",
          "link": "https://theanarchistlibrary.org/library/boy-igor-phil-mailer-and-yet-it-moves-updated-edition?v=1715726263",
          "publishedOn": "2024-05-14T22:37:43.000Z",
          "wordCount": 24785,
          "title": "Boy Igor & Phil Mailer - And Yet It Moves (Updated Edition)",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "82778",
            "url": "https://theanarchistlibrary.org/library/boy-igor-phil-mailer-and-yet-it-moves-updated-edition.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anarchynouveau-we-don-t-need-a-plethora-of-tactics-we-need-a-climate-strategy-an-anarchist-comm?v=1715726103",
          "author": null,
          "description": "Author: AnarchyNouveau\nTitle: We Don’t Need a “Plethora of Tactics”, We Need a Climate Strategy\nSubtitle: An anarchist-communist’s response to Freedom News\nDate: March 20, 2024\nSource: Retrieved on 5/10/2024 from https://freedomnews.org.uk/2024/03/23/we-dont-need-a-plethora-of-tactics-we-need-a-climate-strategy-an-anarchist-communists-response-to-freedom-news/\n\n In Freedom Anarchist Journal’s Winter 2023-2024 issue, Matthew Azoulay submitted an article introducing readers to Murray Bookchin’s ideas of the communalist assembly[1] which disturbed and surprised me for how much it was outdated. The means it proposes to achieve an ecologically revolutionary ends are lacking, stagnant, and fall back on modes of thinking that seem directly inherited from the anti-globalization and Occupy era[2] w…",
          "link": "https://theanarchistlibrary.org/library/anarchynouveau-we-don-t-need-a-plethora-of-tactics-we-need-a-climate-strategy-an-anarchist-comm?v=1715726103",
          "publishedOn": "2024-05-14T22:35:03.000Z",
          "wordCount": 2980,
          "title": "AnarchyNouveau - We Don’t Need a “Plethora of Tactics”, We Need a Climate Strategy",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "15160",
            "url": "https://theanarchistlibrary.org/library/anarchynouveau-we-don-t-need-a-plethora-of-tactics-we-need-a-climate-strategy-an-anarchist-comm.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/chen-jiongming-a-proposal-for-the-unification-of-china?v=1715723886",
          "author": null,
          "description": "Author: Chen Jiongming\nTitle: A Proposal for the Unification of China\nDate: 1927\nSource: Published in Chen Jiongming and the Federalist Movement by Leslie H. Dingyan Chen.\n\nThe Political Capability of the Chinese People\n There are some who doubt that the Chinese people are capable of creating a truly democratic state. We emphatically disagree. The political environment in any country is created by its leaders. The perceptions and habits of the people can be changed to follow those of the leadership. Furthermore, Chinese society has been traditionally rich in self-governing organizations, which can be effectively used to reconstruct [China as] a democratic state. \nThe Real Causes of the Turmoil over the Past Sixteen Years\n1. The Problem of the Provisional Constitution\n [First,] no provision…",
          "link": "https://theanarchistlibrary.org/library/chen-jiongming-a-proposal-for-the-unification-of-china?v=1715723886",
          "publishedOn": "2024-05-14T21:58:06.000Z",
          "wordCount": 3134,
          "title": "Chen Jiongming - A Proposal for the Unification of China",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "24339",
            "url": "https://theanarchistlibrary.org/library/chen-jiongming-a-proposal-for-the-unification-of-china.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/gustav-landauer-are-these-the-words-of-a-heretic?v=1715722519",
          "author": null,
          "description": "Author: Gustav Landauer\nTitle: Are These the Words of a Heretic?\nNotes: Translated from the German Daniel Wortel-London, originally entitled \"Sind das Kertzergendanken?\" (\"Are These Heretic Thoughts?\"). Originally published in Von Judentum (On Judaism) in 1911 by the Bar Kokhba League of Jewish Students.\nSource: Retrieved on May 14th, 2024 from:https://x.com/dlondonwortel/status/1787470614107763006\n\n A characteristic of our time is that much is accomplished in spirit but little is accomplished in reality. Perhaps even the lack of actual implementation corresponds to a special activity of the mind, which constantly strives to overcome its own formations without leaving the form of fantasy and doctrine. One could imagine a human society that is structured in such a way that the ideas in it h…",
          "link": "https://theanarchistlibrary.org/library/gustav-landauer-are-these-the-words-of-a-heretic?v=1715722519",
          "publishedOn": "2024-05-14T21:35:19.000Z",
          "wordCount": 3048,
          "title": "Gustav Landauer - Are These the Words of a Heretic?",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "10612",
            "url": "https://theanarchistlibrary.org/library/gustav-landauer-are-these-the-words-of-a-heretic.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/sacred-black-and-red-bonk-university-of-california-office-of-the-president-attacked?v=1715701274",
          "author": null,
          "description": "Author: sacred black and red\nTitle: Bonk\nSubtitle: University of California Office of the President Attacked\nDate: May 14, 2024\nSource: Retrieved on 14 May 2024 from indybay.org/newsitems/2024/05/14/18866217.php\n\n\n “The beginning of every revolution is an exit, an exit from the social order that power has enshrined in the name of law, stability, public interest, and the greater good.” \n - Basel al-Araj \n With the Aurora Borealis above us and the martyrs in our hearts, we attacked the UC Office of the President in solidarity with the Palestinian Resistance. Using a fire extinguisher filled with red paint we covered the facade and smashed seven windows. Then, with access to the building, we released 500 cockroaches inside and emptied a second fire exintguisher onto the interior. We finalized…",
          "link": "https://theanarchistlibrary.org/library/sacred-black-and-red-bonk-university-of-california-office-of-the-president-attacked?v=1715701274",
          "publishedOn": "2024-05-14T15:41:14.000Z",
          "wordCount": 1130,
          "title": "sacred black and red - Bonk",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "1640092",
            "url": "https://theanarchistlibrary.org/library/sacred-black-and-red-bonk-university-of-california-office-of-the-president-attacked.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/aidan-rowe-the-politics-of-voices-notes-on-gender-race-class?v=1715666454",
          "author": null,
          "description": "Author: Aidan Rowe\nTitle: The Politics of Voices: Notes on Gender, Race & Class\nDate: 2013-04-30\nSource: <wsm.ie/c/anarchism-intersecionality-gender-race-class>\n\n As class-struggle anarchists dealing with the relations between gender, race and class, we must, in theory and practice, pick a path between two pitfalls. On one side is economic reductionism – the reduction of all political questions to the social relations of production – which erases the perspectives and struggles of women, queers and people of colour; submerges their voices within an overly generalised class narrative, in which the idealised Worker is implicitly white heterosexual and male; or consigns their struggles to a secondary importance compared to the “real struggle” of (economic) class against class. On the other is …",
          "link": "https://theanarchistlibrary.org/library/aidan-rowe-the-politics-of-voices-notes-on-gender-race-class?v=1715666454",
          "publishedOn": "2024-05-14T06:00:54.000Z",
          "wordCount": 3307,
          "title": "Aidan Rowe - The Politics of Voices: Notes on Gender, Race & Class",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "16443",
            "url": "https://theanarchistlibrary.org/library/aidan-rowe-the-politics-of-voices-notes-on-gender-race-class.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/m-gouldhawke-intro-to-anarchists-fellow-travellers-on-palestine?v=1715571820",
          "author": null,
          "description": "Author: M. Gouldhawke\nTitle: Intro to Anarchists & Fellow Travellers on Palestine\nDate: 2024\nNotes: Intro to a collection of links to texts by various writers.\nSource: Retrieved on May 12, 2024 from mgouldhawke.wordpress.com\n\n Anarchists over the course of history have never had a unified stance on Palestine and Zionism. \n Some Jewish anarchists active in the late 1800s and early 1900s, such as Bernard Lazare and Hillel Solotaroff, drifted toward Zionism over time (as noted by Mina Grauer in an article from 1994). \n In 1906, Jewish anarchist Emma Goldman published an pseudonymously-authored article by a fellow Jewish anarchist which criticized Zionism, as well as nationalism more generally, and claimed that \"Prejudices are never overcome by one who shows himself equally narrow and bigoted.…",
          "link": "https://theanarchistlibrary.org/library/m-gouldhawke-intro-to-anarchists-fellow-travellers-on-palestine?v=1715571820",
          "publishedOn": "2024-05-13T03:43:40.000Z",
          "wordCount": 1091,
          "title": "M. Gouldhawke - Intro to Anarchists & Fellow Travellers on Palestine",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7521",
            "url": "https://theanarchistlibrary.org/library/m-gouldhawke-intro-to-anarchists-fellow-travellers-on-palestine.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/vernon-richards-terrorism-in-palestine-democracy-at-work?v=1715571806",
          "author": null,
          "description": "Author: Vernon Richards\nTitle: Terrorism In Palestine: “Democracy” at Work\nDate: 1937\nNotes: From ‘Spain and the World’, Vol. 1. No. 22., 27th October, 1937,London, UK\nSource: Retrieved on April 27, 2024 from mgouldhawke.wordpress.com\n\n The tragic events in Palestine have provided yet another happy hunting ground for Mussolini. \n The Press announces that Arab notabilities in Lybia have sent a message to Mussolini reaffirming their solidarity with the Arabs in Palestine. This message naturally comes as a result of Mussolini’s fine words when he called himself the “defender of Islam.” On the other hand Alfred Roke, a member of the Arab Higher Committee declared to Arthur Koestler, News Chronicle special correspondent that he was expressing the opinion of the Committee, including the Mufti, w…",
          "link": "https://theanarchistlibrary.org/library/vernon-richards-terrorism-in-palestine-democracy-at-work?v=1715571806",
          "publishedOn": "2024-05-13T03:43:26.000Z",
          "wordCount": 900,
          "title": "Vernon Richards - Terrorism In Palestine: “Democracy” at Work",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "5935",
            "url": "https://theanarchistlibrary.org/library/vernon-richards-terrorism-in-palestine-democracy-at-work.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/wu-zhihui-and-chen-jiongming-wu-zhihui-s-letter-and-chen-jiongming-s-reply?v=1715513506",
          "author": null,
          "description": "Author: Wu Zhihui and Chen Jiongming\nTitle: Wu Zhihui’s Letter and Chen Jiongming’s Reply\nDate: May 1924\nNotes: Introduced, translated, edited and annotated by Leslie H. Chen. Original Chinese versions published in Kang Baishi (1978). Chen Jiongming zhuan (A biography of Chen Jiongming). Hong Kong: Culture Book House, pp. 120–148.\nSource: Published in Chen Jiongming and the Federalist Movement by Leslie H. Dingyan Chen.\n\nWu Zhihui’s Letter\n On April 29, 1924, Wu Zhihui wrote Chen Jiongming a long letter from Shanghai, in which he argued the necessity of a Chen-Sun reconciliation to save the country from disintegration. It reveals the views held by prominent members of the Nationalist Party on national affairs, politics, and political personages in China at that crucial point in modern Chin…",
          "link": "https://theanarchistlibrary.org/library/wu-zhihui-and-chen-jiongming-wu-zhihui-s-letter-and-chen-jiongming-s-reply?v=1715513506",
          "publishedOn": "2024-05-12T11:31:46.000Z",
          "wordCount": 4955,
          "title": "Wu Zhihui and Chen Jiongming - Wu Zhihui’s Letter and Chen Jiongming’s Reply",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "16260",
            "url": "https://theanarchistlibrary.org/library/wu-zhihui-and-chen-jiongming-wu-zhihui-s-letter-and-chen-jiongming-s-reply.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/chen-jiongming-foreword-to-minxing-bao?v=1715511073",
          "author": null,
          "description": "Author: Chen Jiongming\nTitle: Foreword to Minxing bao\nDate: 1919\nNotes: Originally published in Minxing bao, in Zhangzhou, Fujian. Edited and translated by Leslie H. Chen. Excerpted from the full, original Chinese article, as printed in Wusi shiqi qikan jieshao (1959), pp. 525–529.\nSource: Published in Chen Jiongming and the Federalist Movement by Leslie H. Dingyan Chen.\n\n The happiness of full equality is not the kind of false hope that Heaven will automatically bless every single soul on earth. Rather, it gives the human spirit the opportunity for regeneration. If we want to realize this happiness of equality and the opportunity for spiritual regeneration, there is no need for us to do any more searching. What we need is a great awakening of every mind so that all may be free of the prev…",
          "link": "https://theanarchistlibrary.org/library/chen-jiongming-foreword-to-minxing-bao?v=1715511073",
          "publishedOn": "2024-05-12T10:51:13.000Z",
          "wordCount": 1317,
          "title": "Chen Jiongming - Foreword to Minxing bao",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6799",
            "url": "https://theanarchistlibrary.org/library/chen-jiongming-foreword-to-minxing-bao.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}