{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "7c92c240b5751fb505e0a2c423b6891c4fe90c69",
          "author": "Sébastien Stormacq",
          "description": "AWS CodeBuild now supports macOS, simplifying CI/CD pipelines for Apple apps, using managed M2 machines with pre-installed tools like Xcode. Auto scale capacity seamlessly while CodeBuild manages the fleet.",
          "link": "https://aws.amazon.com/blogs/aws/add-macos-to-your-continuous-integration-pipelines-with-aws-codebuild/",
          "publishedOn": "2024-08-19T21:14:31.000Z",
          "wordCount": 2455,
          "title": "Add macOS to your continuous integration pipelines with AWS CodeBuild",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/08/05/codebuild-feat-img.png"
        },
        {
          "id": "204a9127d101972ff3aeb38af0a2c2198f16f9ba",
          "author": "Prasad Rao",
          "description": "You know what I find more exciting than the Amazon Prime Day sale? Finding out how Amazon Web Services (AWS) makes it all happen. Every year, I wait eagerly for Jeff Barr’s annual post to read the chart-topping metrics. The scale never ceases to amaze me. This year, Channy Yun and Jeff Barr bring us […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-g6e-instances-karpenter-amazon-prime-day-metrics-aws-certifications-update-and-more-august-19-2024/",
          "publishedOn": "2024-08-19T20:18:23.000Z",
          "wordCount": 1944,
          "title": "AWS Weekly Roundup: G6e instances, Karpenter, Amazon Prime Day metrics, AWS Certifications update and more (August 19, 2024)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/08/13/AWS-WIR-default.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": [
        {
          "id": "663012dc40f89e066329be90a662febacc172e3c",
          "author": "Ashley DeLoach",
          "description": "As part of the re:Invent 2023 keynote, Dr. Werner Vogels introduced the Frugal Architect mindset. This mindset emphasizes the importance of continuous learning, curiosity, and regular revision of architectural choices with a focus on cost and sustainability. Cost and sustainability should be treated as critical non-functional requirements, alongside factors like security, compliance, and performance. The […]",
          "link": "https://aws.amazon.com/blogs/architecture/achieving-frugal-architecture-using-the-aws-well-architected-framework-guidance/",
          "publishedOn": "2024-08-14T19:55:53.000Z",
          "wordCount": 2906,
          "title": "Achieving Frugal Architecture using the AWS Well-Architected Framework guidance",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fc074d501302eb2b93e2554793fcaf50b3bf7291/2024/02/23/well-architected-blog-logo.png"
        }
      ]
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps & Developer Productivity Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": []
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "0f5f0175f3302ce8a81549c5099bc61006d4ac3f",
          "author": "Alex Koenig",
          "description": "WebAssembly (Wasm) is a revolutionary technology that promises to bring near-native performance to web applications. However, its potential extends far beyond the browser, enabling developers to run Wasm workloads in various environments, such as cloud-native platforms like Amazon Elastic Kubernetes Service (Amazon EKS). In this post, you can explore how AWS empowers users to harness […]",
          "link": "https://aws.amazon.com/blogs/containers/16532-2/",
          "publishedOn": "2024-08-20T14:54:00.000Z",
          "wordCount": 2379,
          "title": "How to Run WebAssembly on Amazon EKS",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/08/20/Featured-images-for-Containers-Blog-5-1260x630.jpg"
        },
        {
          "id": "3adac2c0ec9122f00dd8e58fe5412f2d5a1d5f9f",
          "author": "Alex Kestner",
          "description": "Introduction In November 2021, AWS announced the launch of v0.5 of Karpenter, “a new open source Kubernetes cluster auto scaling project.” Originally conceived as a flexible, dynamic, and high-performance alternative to the Kubernetes Cluster Autoscaler, in the nearly three years since then Karpenter has evolved substantially into a fully featured, Kubernetes native node lifecycle manager. […]",
          "link": "https://aws.amazon.com/blogs/containers/announcing-karpenter-1-0/",
          "publishedOn": "2024-08-14T20:56:15.000Z",
          "wordCount": 3120,
          "title": "Announcing Karpenter 1.0",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/08/12/Featured-images-for-Containers-Blog-1-1260x630.jpg"
        },
        {
          "id": "94c09e9e264ea0f58ded29d7f22edf19a693faf4",
          "author": "Andreas Asuja",
          "description": "Yleisradio is a Finnish broadcasting company running most of its online and mobile services – which roughly 2.1 million Finns use every day – on AWS. Like many organizations, they use IP Address Management (IPAM) systems to allocate IP addresses across their AWS environment to make sure routing works, even between AWS and their on-premises […]",
          "link": "https://aws.amazon.com/blogs/containers/yleisradio-enhances-digital-services-with-amazon-eks-and-ipv6-adoption/",
          "publishedOn": "2024-08-14T14:40:30.000Z",
          "wordCount": 1969,
          "title": "Yleisradio enhances digital services with Amazon EKS and IPv6 Adoption",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/07/30/Featured-images-for-Containers-Blog-6-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=331306",
          "author": "Eman Abdelhadi",
          "description": "Eman Abdelhadi’s speech from the “Bodies Outside of Unjust Laws” demonstration on Aug. 18 in Chicago. Chicago, we all know why we are here. We are drowning, and our hearts are broken. We are drowning in debt. In medical bills. In rising rents. In inflation. We are under attack in this country. The Right has declared war on people  More\nThe post “And Now They Want Our Votes” appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/20/and-now-they-want-our-votes/",
          "publishedOn": "2024-08-20T06:01:21.000Z",
          "wordCount": null,
          "title": "“And Now They Want Our Votes”",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331344",
          "author": "Norman Solomon",
          "description": "An observation from George Orwell -- “those who control the present, control the past and those who control the past control the future” -- is acutely relevant to how President Biden talked about Gaza during his speech at the Democratic convention Monday night. His words fit into a messaging template now in its eleventh month, depicting the U.S. government as tirelessly seeking peace, while supplying the weapons and bombs that have enabled Israel’s continual slaughter of civilians. More\nThe post Biden’s Convention Speech Made Absurd Claims About His Gaza Policy appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/20/bidens-convention-speech-made-absurd-claims-about-his-gaza-policy/",
          "publishedOn": "2024-08-20T05:58:48.000Z",
          "wordCount": null,
          "title": "Biden’s Convention Speech Made Absurd Claims About His Gaza Policy",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331179",
          "author": "Sam Pizzigati",
          "description": "Enormously rich people tend to get bored easily, especially those on the younger side. Stocks and bonds, such a yawn. Wealthy Baby Boomers certainly do still get a kick out of watching their financial portfolios fatten. But their Millennial and Generation Z counterparts have an added expectation. The fortunes they’re investing, they’re expecting, will be filling their lives up with fun. More\nThe post Today’s Young Mega-Millionaires Just Want to Have Fun appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/20/todays-young-mega-millionaires-just-want-to-have-fun/",
          "publishedOn": "2024-08-20T05:58:04.000Z",
          "wordCount": null,
          "title": "Today’s Young Mega-Millionaires Just Want to Have Fun",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331307",
          "author": "Binoy Kampmark",
          "description": "Ekecheiria, also known as the “Olympic Truce,” is a quaint notion dating to Ancient Greece, when three kings prone to warring against each other – Iphitos of Elis, Cleosthenes of Pisa and Lycurgus of Sparta – concluded a treaty permitting the safe passage of all athletes and spectators from the relevant city-states for the duration  More\nThe post The Distasteful Nonsense of Olympism appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/20/the-distasteful-nonsense-of-olympism/",
          "publishedOn": "2024-08-20T05:55:58.000Z",
          "wordCount": null,
          "title": "The Distasteful Nonsense of Olympism",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331313",
          "author": "Jonathan Woodrow Martin",
          "description": "I have a very intense relationship with water.  As a result of a long-term health condition, I am often feeling very thirsty and drained. I cannot go more than perhaps 15 minutes without having a sup of water until I start to feel uncomfortable. On average people in the UK use 149 litres of water per-day,  More\nThe post Water, Water, Everywhere, But Not for You, Palestinian appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/20/water-water-everywhere-but-not-for-you-palestinian/",
          "publishedOn": "2024-08-20T05:55:56.000Z",
          "wordCount": null,
          "title": "Water, Water, Everywhere, But Not for You, Palestinian",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331291",
          "author": "John P. Ruehl",
          "description": "Spanish officials reassuringly heralded a “new era” for the country after May 2024 elections. Catalonian pro-independence parties had lost the parliamentary majority that had enabled them to govern their region since 2015, and for the first time in decades, had failed to secure a majority of seats in regional parliament. Spain’s ruling Socialists meanwhile managed to emerge as Catalonia’s largest party. More\nThe post The Status of Europe’s Autonomous Movements appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/20/the-status-of-europes-autonomous-movements/",
          "publishedOn": "2024-08-20T05:55:21.000Z",
          "wordCount": null,
          "title": "The Status of Europe’s Autonomous Movements",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331315",
          "author": "Marcy Winograd",
          "description": "While University of California students chanted “Divest!” and erected “Free Palestine” encampments, a little-known pro-Israel faction of the California legislature introduced legislation to indoctrinate six million California public school children and stem the rising tide of college resistance to Israel’s genocide in Gaza. What’s in a name? They call themselves the California Legislative Jewish Caucus and they  More\nThe post Who Are They? The CA Legislative Jewish Caucus appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/20/who-are-they-the-ca-legislative-jewish-caucus/",
          "publishedOn": "2024-08-20T05:46:34.000Z",
          "wordCount": null,
          "title": "Who Are They? The CA Legislative Jewish Caucus",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331299",
          "author": "Tarique Niazi",
          "description": "Naheed Islam was not yet born in 1996, when prime minister Sheikh Hasina of Bangladesh began her first term in office. In 2009, when she was elected to her second term, Islam had just turned 11. On August 5, he brought an abrupt end to Hasina’s 15-year long autocracy. The 26-year-old Islam, a sociology major  More\nThe post The Economics Behind the Fall of Autocracy in Bangladesh appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/20/the-economics-behind-the-fall-of-autocracy-in-bangladesh/",
          "publishedOn": "2024-08-20T05:45:44.000Z",
          "wordCount": null,
          "title": "The Economics Behind the Fall of Autocracy in Bangladesh",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331182",
          "author": "Hatim Rahman",
          "description": "It was barely a decade ago that many of us became enamored by the “gig” economy. Booking a room, ride, or restaurant took seconds and could be done at virtually any time or place. A major factor enabling the gig economy to grow was organizations using algorithms to create these services. Organizations, such as Airbnb,  More\nThe post Speculative Algorithms are the New Invisible Cage for Workers appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/20/speculative-algorithms-are-the-new-invisible-cage-for-workers/",
          "publishedOn": "2024-08-20T05:40:52.000Z",
          "wordCount": null,
          "title": "Speculative Algorithms are the New Invisible Cage for Workers",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331180",
          "author": "Nina Mast",
          "description": "In most of the country, workers in restaurants, bars, nail salons, barber shops, and other service jobs are paid differently than workers in virtually all other occupations. For these workers, a large portion of their take-home pay comes from gratuity or “tips” provided directly from the customer. While employers of workers in other occupations must  More\nThe post Tipping Is Racist and Harms Us All, It’s Past Time to Eliminate It appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/20/tipping-is-racist-and-harms-us-all-its-past-time-to-eliminate-it/",
          "publishedOn": "2024-08-20T05:25:08.000Z",
          "wordCount": null,
          "title": "Tipping Is Racist and Harms Us All, It’s Past Time to Eliminate It",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331319",
          "author": "Naveen Reddy",
          "description": "The U.S. consumes an incredible amount of healthcare resources, spending more on healthcare than any other high-income country. Much of this spending occurs within the biotechnology sector towards the development of new healthcare technologies. As a result, the U.S. serves as the engine of innovation for the rest of world with many of our most  More\nThe post Just Because We Can Innovate In Healthcare, Doesn’t Mean We Should appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/20/just-because-we-can-innovate-in-healthcare-doesnt-mean-we-should/",
          "publishedOn": "2024-08-20T05:00:21.000Z",
          "wordCount": null,
          "title": "Just Because We Can Innovate In Healthcare, Doesn’t Mean We Should",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331268",
          "author": "Jeff Cohen",
          "description": "Phil Donahue passed away Sunday night, after a long illness. He was beloved by those who knew him and by many who didn’t. He started as a local reporter in Ohio, was a trailblazer in bringing social issues to a national audience as a daytime broadcast TV host, and then he was pretty much banished  More\nThe post Phil Donahue Changed My Life and Millions of Others appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/19/phil-donahue-changed-my-life-and-millions-of-others/",
          "publishedOn": "2024-08-19T06:10:13.000Z",
          "wordCount": null,
          "title": "Phil Donahue Changed My Life and Millions of Others",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331133",
          "author": "L. Michael Hager",
          "description": "Daily reports of Palestinians killed in Gaza focus on deaths from Israeli bombs and missiles, now exceeding 40,000.  Yet the famine stalking the Strip today threatens  the lives of many times that number. Already children in North Gaza are dying of malnutrition. Like canaries in coal mines, they signal mass starvation to come. Sadly, the major media has largely ignored the accelerating famine conditions in Gaza. More\nThe post The Starving of Gaza appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/19/the-starving-of-gaza/",
          "publishedOn": "2024-08-19T06:00:20.000Z",
          "wordCount": null,
          "title": "The Starving of Gaza",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331209",
          "author": "Nabil Salih",
          "description": "“Where is the Ummah,” Myriam François, an outspoken journalist, wrote in another absurd X post in Arabic. Does the Palestinian cause concern Muslims alone?\nNot only are the specificities of the Arab context made irrelevant, it seems that solidarity in an increasingly Right-leaning West has become an exercise in gaslighting. More\nThe post When Western Solidarity Becomes an Exercise in Gaslighting appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/19/western-solidarity-as-an-exercise-in-gaslighting/",
          "publishedOn": "2024-08-19T05:59:28.000Z",
          "wordCount": null,
          "title": "When Western Solidarity Becomes an Exercise in Gaslighting",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331184",
          "author": "Bill Julian",
          "description": "Suppose it is really hot.  You go into a store to buy a bottle of water that usually costs you a dollar.  To your shock and dismay the store charges you twenty dollars.  You feel ripped off and you want to complain.  The California Attorney General tells you to complain to him because this type of commercial behavior is an illegal unfair practice, price gouging, and profiteering.  This is so outrageous that it almost never happens. More\nThe post To California’s Energy Policy-Makers:  Control the CAISO and Give Us Electric Rate Relief appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/19/to-californias-energy-policy-makers-control-the-caiso-and-give-us-electric-rate-relief/",
          "publishedOn": "2024-08-19T05:58:39.000Z",
          "wordCount": null,
          "title": "To California’s Energy Policy-Makers:  Control the CAISO and Give Us Electric Rate Relief",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331202",
          "author": "Ramzy Baroud",
          "description": "While many are earnestly pointing at the devastation of war, the rampant human rights violations and the deliberate relegation of international and humanitarian law, there are those who see war from an entirely different perspective: profits. For the merchants of war, the collective pain and misery of whole nations is dwarfed by the lucrative deals  More\nThe post Partners in Genocide: Israel is Slaughtering Palestinians with Western Arms  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/19/partners-in-genocide-israel-is-slaughtering-palestinians-with-western-arms/",
          "publishedOn": "2024-08-19T05:58:13.000Z",
          "wordCount": null,
          "title": "Partners in Genocide: Israel is Slaughtering Palestinians with Western Arms",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331185",
          "author": "Howard Lisnoff",
          "description": "Martin Luther King, Jr. believed that consumerism was one of the major shortcomings of US society. The other issues were militarism and racism. Those were the three major themes King raised in his famous “Beyond Vietnam” speech delivered in April 1967 at Riverside Church in New York City. King spoke against the ongoing debacle of  More\nThe post The Feeding Frenzy of Consumerism and Environmental Destruction appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/19/the-feeding-frenzy-of-consumerism-and-environmental-destruction/",
          "publishedOn": "2024-08-19T05:55:09.000Z",
          "wordCount": null,
          "title": "The Feeding Frenzy of Consumerism and Environmental Destruction",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331207",
          "author": "Cesar Chelala",
          "description": "Former President Donald Trump’s attacks against Vice-President Kamala Harris continue unabated and, if anything, have increased in virulence and desperation. As her prestige increases, his goes down. He has become a joke for many late-night comedians, but this hasn’t stopped Trump from becoming even more disrespectful to his opponent, to the point of distorting and  More\nThe post Donald Trump’s Attacks on Women, and the Truth appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/19/donald-trumps-attacks-on-women-and-the-truth/",
          "publishedOn": "2024-08-19T05:50:04.000Z",
          "wordCount": null,
          "title": "Donald Trump’s Attacks on Women, and the Truth",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331178",
          "author": "Jeffrey Andrew Weinstock",
          "description": "The three witches in ‘Macbeth’ – also known as the ‘weird,’ or ‘wyrd,’ sisters – are prophetesses who often do the opposite of what’s expected of them. Royal Shakespeare Company Collection Republicans, as you’ve probably heard, are being called “weird.” In a quip that launched a million memes, Minnesota governor-turned-VP candidate Tim Walz referred to  More\nThe post In Praise of the Weird appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/19/in-praise-of-the-weird/",
          "publishedOn": "2024-08-19T05:34:59.000Z",
          "wordCount": null,
          "title": "In Praise of the Weird",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331135",
          "author": "Algernon Austin",
          "description": "The 2024 Olympic Games were inspiring and memorable. The athletes performed amazing feats that seemed like they shouldn’t be humanly possible—over and over again. Forty-seven records were broken, and five countrieswere first-time medal winners. As someone whose career is dedicated to promoting racial equity, I couldn’t help but also see the Olympics through this lens.  More\nThe post The Paris Olympics Illustrated the Power of Racial Equity and Diversity appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/19/the-paris-olympics-illustrated-the-power-of-racial-equity-and-diversity/",
          "publishedOn": "2024-08-19T05:34:07.000Z",
          "wordCount": null,
          "title": "The Paris Olympics Illustrated the Power of Racial Equity and Diversity",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331177",
          "author": "Dean Baker",
          "description": "In an effort to promote hysteria, the media have jumped on the proposals laid out by Vice-President Harris, telling their audience that they will increase the deficit by $1.7 trillion over the next decade. This estimate comes from the Committee for a Responsible Federal Budget and includes a lot of guesswork, like the cost of  More\nThe post Harris Proposes to Increase the Deficit by 0.5 Percent of GDP Over the Next Decade appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/19/harris-proposes-to-increase-the-deficit-by-0-5-percent-of-gdp-over-the-next-decade/",
          "publishedOn": "2024-08-19T05:31:52.000Z",
          "wordCount": null,
          "title": "Harris Proposes to Increase the Deficit by 0.5 Percent of GDP Over the Next Decade",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331205",
          "author": "Ron Jacobs",
          "description": "So, let me get this straight. When Kyiv sends its military into Russia, occupying territory and killing residents, it’s a defensive move. When Israel sends its military into Gaza and the West Bank, it’s also a defensive move. When the United States occupies countries around the world, sails its warships off the coast of China  More\nThe post When Offense is Defined as Defense—Kursk Version appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/19/when-offense-is-defined-as-defense-kursk-version/",
          "publishedOn": "2024-08-19T04:46:50.000Z",
          "wordCount": null,
          "title": "When Offense is Defined as Defense—Kursk Version",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331128",
          "author": "Julie Wark",
          "description": "But for the present age, which prefers the sign to the thing signified, the copy to the original, representation to reality, appearance to essence, … truth is considered profane, and only illusion is sacred. Sacredness is in fact held to be enhanced in proportion as truth decreases and illusion increases, so that the highest degree […]\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Puncak Jaya, Center of the World appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/18/puncak-jaya-center-of-the-world/",
          "publishedOn": "2024-08-18T05:59:27.000Z",
          "wordCount": null,
          "title": "Puncak Jaya, Center of the World",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330342",
          "author": "Ron Jacobs",
          "description": "Image by Evgeniy Smersh.\nAny rock music fan worthy of being considered as such knows that the Pacific Northwest was a major focal point of the music in the late 1980s and the 1990s. Indeed, a sound the industry called grunge began there. Essentially, grunge is punk rock with a lot more fuzz and a few more hooks in the melody lines. In its artistic heyday, so-called punk bands like Nirvana, Mudhoney, the Melvins and TAD played clubs, dorm rooms, basements, bars and art galleries in their quest for the fulfillment playing music brings. Somewhere along the line, the media and industry recognized the phenomenon and labeled it grunge. Some of the bands were able to make a living at it and some became incredibly wealthy—something which wasn’t necessarily the best (or the intended) outcome. Other bands brought in other sounds and styles to the music and the scene it created. Soundgarden’s Chris Cornell brought in his version of a soaring and melodic metal guitar; Bikini Kill and Mecca Normal brought in a feminist anger and a legion of female fans. The Gits did a bit of everything and, in doing so, stood alone in the scene; they weren’t grunge, metal, or riot grrl. Their singer Mia Zapata had a voice that sometimes sounded a little like Pat Benatar, sometimes a little like Patti Smith, and sometimes like that folksinger you heard one afternoon in the park. Comparisons barely help describe her singing because it remained distinctly her own. The guitar of Joe Spleen, the bass of Matt Dresdner, and the percussion section that included Bob Lee, Bruce Docheneaux and Steven Moriarty completed the sound.\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post A Punk Rock Paean appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/17/a-punk-rock-paean/",
          "publishedOn": "2024-08-17T05:55:32.000Z",
          "wordCount": null,
          "title": "A Punk Rock Paean",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331048",
          "author": "Jeffrey St. Clair",
          "description": "+ Here’s a brief recap of the last week in US/Israeli relations. The IDF shot an American citizen, Amado Sison, in the West Bank. The US announced it would continue funding the notorious IDF unit that shot the American citizen. The IDF bombed a school being used as a shelter for Palestinians who’d been bombed […]\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post The Body Bags of Gaza appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/17/the-body-bags-of-gaza/",
          "publishedOn": "2024-08-17T05:33:58.000Z",
          "wordCount": null,
          "title": "The Body Bags of Gaza",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330930",
          "author": "Stanley L. Cohen",
          "description": "As the very public face of genocide has raged throughout Palestine these past ten months, Columbia University has opened a domestic front in its own war against dissent. In the name of “public safety,” Columbia has sought to silence protest and speech be it by suspension, expulsion or arrest.  Utilizing an academic star chamber stoked by outside investigators and inside sham, by pretext and intimidation, it has invented an academic crisis and then marched to punish students and faculty who wish nothing more than to express ideas.    More\nThe post Columbia University…Where the Only Ivy is Poison appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/16/columbia-universitywhere-the-only-ivy-is-poison/",
          "publishedOn": "2024-08-16T06:02:07.000Z",
          "wordCount": null,
          "title": "Columbia University…Where the Only Ivy is Poison",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330872",
          "author": "Vijay Prashad",
          "description": "This sequence of attacks on schools came before the August 10 bombing, which shows that there is a pattern of targeting civilians who are seeking shelter in schools. The massacre at al-Taba’een is the 21st attack by Israel against a school that has been serving as a shelter since July 4. Ahmed Abed lost his brother-in-law Abdullah al-Arair in the massacre at al-Taba’een. “There is nowhere else to go,” he said. “Every place in Gaza is a target.” More\nThe post Every Place in Gaza—Including Schools—Is a Target appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/16/every-place-in-gaza-including-schools-is-a-target/",
          "publishedOn": "2024-08-16T06:00:15.000Z",
          "wordCount": null,
          "title": "Every Place in Gaza—Including Schools—Is a Target",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330689",
          "author": "Jeffrey St. Clair",
          "description": "In 2002, Robert Roberson raced his two-year-old daughter, Nikki, to a hospital emergency room in the east Texas town of Palestine.  Nikki was limp, her skin blue.  Roberson told the emergency room doctors and nurses that the two had been sleeping when he awoke and found Nikki on the floor, having fallen off the bed. The child was unresponsive. Nikki Curtis never regained consciousness and died a few days later. More\nThe post Scam Science and the Death Penalty: the Case of Robert Roberson appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/16/scam-science-and-the-death-penalty-the-case-of-robert-roberson/",
          "publishedOn": "2024-08-16T06:00:05.000Z",
          "wordCount": null,
          "title": "Scam Science and the Death Penalty: the Case of Robert Roberson",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330836",
          "author": "Bill Hatch",
          "description": "In a move triggering a new phase in the conflict between the Navajo Nation, a uranium mining company, and state and the  federal government, on July 30 a mining corporation began trucking radioactive ore 350 miles through the Navajo Nation. This violated an agreement the Navajos thought they had with Energy Fuels, Inc. (EFI), federal and state agencies that required a two-week advance notice before hauling uranium ore through the Nation. It also violated a Navajo law that denied any hauling of radioactive material through the Nation, but Arizona and the feds declared their control over the route. More\nThe post Power to the Patients: the Navajo Nation vs. the Uranium Industry appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/16/power-to-the-patients-the-navajo-nation-vs-the-uranium-industry/",
          "publishedOn": "2024-08-16T05:58:17.000Z",
          "wordCount": null,
          "title": "Power to the Patients: the Navajo Nation vs. the Uranium Industry",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=330809",
          "author": "Stephen F. Eisenman",
          "description": "Imagining the king’s death It has been just a month since Thomas Crooks, a 20-year-old loner and nerd from Bethel Park, PA near Pittsburgh, attempted to assassinate former President Donald Trump. To the relief of some and the consternation of others, Crooks missed by an inch. Disappointment at Crooks’ poor aim is the under-reported story  More\nThe post On the One-Month Anniversary of the Attempted Assassination of Trump appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/16/on-the-one-month-anniversary-of-the-attempted-assassination-of-trump/",
          "publishedOn": "2024-08-16T05:57:41.000Z",
          "wordCount": null,
          "title": "On the One-Month Anniversary of the Attempted Assassination of Trump",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": [
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=31442",
          "author": "Nina Boyarchenko and Leonardo Elias",
          "description": "Long-run trends in increased access to credit are thought to improve real activity. However, “rapid” credit expansions do not always end well and have been shown in the academic literature to predict adverse real outcomes such as lower GDP growth and an increased likelihood of crises. Given these financial stability considerations associated with rapid credit expansions, being able to distinguish in real time “good booms” from “bad booms” is of crucial interest for policymakers. While the recent literature has focused on understanding how the composition of borrowers helps distinguish good and bad booms, in this post we investigate how the composition of lending during a credit expansion matters for subsequent real outcomes.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/08/the-disparate-outcomes-of-bank-and-nonbank-financed-private-credit-expansions/",
          "publishedOn": "2024-08-20T11:00:00.000Z",
          "wordCount": 4194,
          "title": "The Disparate Outcomes of Bank‑ and Nonbank‑Financed Private Credit Expansions",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/08/LSE_2024_disparate-credit-expansions_boyarchenko_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=31414",
          "author": "Gizem Kosar, Davide Melcangi, and Sasha Thomas",
          "description": "The Federal Reserve Bank of New York’s July 2024 SCE Labor Market Survey shows a year-over-year increase in the average reservation wage—the lowest wage respondents would be willing to accept for a new job—to $81,147, but a decline from a series’ high of $81,822 in March 2024. In this post, we investigate how the recent dynamics of reservation wages differed across individuals and how reservation wages are related to individuals’ expectations about their future labor market movements.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/08/an-update-on-the-reservation-wages-in-the-sce-labor-market-survey/",
          "publishedOn": "2024-08-19T15:00:00.000Z",
          "wordCount": 4091,
          "title": "An Update on the Reservation Wages in the SCE Labor Market Survey",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/08/LSE_2024_SCE-reservation-wage_kosar_460.jpg"
        }
      ]
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45560",
          "author": "Editor",
          "description": "from Asad Zaman and current issue of RWER Our current environmental predicament is fundamentally a crisis of knowledge, rooted in the Enlightenment’s narrow conceptualization of epistemology. This shift fostered an illusion of objectivity that has since permeated our understanding of the world, particularly in the context of societal dynamics. The Enlightenment’s emphasis on objective knowledge […]",
          "link": "https://rwer.wordpress.com/2024/08/20/the-crisis-of-knowledge-and-enlightenments-imitations/",
          "publishedOn": "2024-08-20T20:55:26.000Z",
          "wordCount": 4111,
          "title": "The crisis of knowledge and enlightenment’s imitations",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45554",
          "author": "Lars Syll",
          "description": "from Lars Syll To be fair to academia, it has realized that the pure DSGE model is incapable of explaining observable phenomena so they have introduced numerous amendments, known, oddly, as “imperfections” in the model. Long-term nominal contracts, other labour market frictions, imperfection in credit markets, all these and more are prayed in aid and, […]",
          "link": "https://rwer.wordpress.com/2024/08/19/new-keynesian-dsge-models-3/",
          "publishedOn": "2024-08-19T15:33:19.000Z",
          "wordCount": 4192,
          "title": "“New Keynesian” DSGE models",
          "imageUrl": "https://payhip.com/cdn-cgi/image/format=auto/https://pe56d.s3.amazonaws.com/o_1hmdpulj11999i721qvu1h3p1dqar.png"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45543",
          "author": "Edward Fullbrook",
          "description": "from Edward Fullbrook A few years ago, I wrote a novel that was published under a pen name and titled Two American Dreams; Which is yours?  Recently its publisher realized that, although set in the Sixties (mostly in Berkeley) this novel pertains to the coming US presidential election to a remarkable degree.  With that in […]",
          "link": "https://rwer.wordpress.com/2024/08/17/amazon-blocks-advertising-of-a-novel-whose-narrator-is-an-economist/",
          "publishedOn": "2024-08-17T17:45:18.000Z",
          "wordCount": 4091,
          "title": "Amazon blocks advertising of a novel whose narrator is an economist",
          "imageUrl": "https://m.media-amazon.com/images/I/4132jYJQ03L._SY342_.jpg"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45540",
          "author": "Lars Syll",
          "description": "from Lars Syll To be fair to academia, it has realized that the pure DSGE model is incapable of explaining observable phenomena so they have introduced numerous amendments, known, oddly, as “imperfections” in the model. Long-term nominal contracts, other labour market frictions, imperfection in credit markets, all these and more are prayed in aid and, […]",
          "link": "https://rwer.wordpress.com/2024/08/15/new-keynesian-dsge-models-2/",
          "publishedOn": "2024-08-15T16:00:26.000Z",
          "wordCount": 4347,
          "title": "“New Keynesian” DSGE models",
          "imageUrl": "https://payhip.com/cdn-cgi/image/format=auto/https://pe56d.s3.amazonaws.com/o_1hmdpulj11999i721qvu1h3p1dqar.png"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=277067",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, Syndemics; Democrat National Convention vignettes; Highest Covid wave in two years; Stupid money and blood money ~",
          "link": "https://www.nakedcapitalism.com/2024/08/200pm-water-cooler-8-20-2024.html",
          "publishedOn": "2024-08-20T18:00:33.000Z",
          "wordCount": 13215,
          "title": "2:00PM Water Cooler 8/20/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/rcp_2024-08-16.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277058",
          "author": "Yves Smith",
          "description": "Do you stand your ground or seek out a climate haven? Some resources to help you decide.",
          "link": "https://www.nakedcapitalism.com/2024/08/what-should-you-do-to-prepare-for-the-climate-change-storm.html",
          "publishedOn": "2024-08-20T13:55:04.000Z",
          "wordCount": 10170,
          "title": "What Should You Do to Prepare for the Climate Change Storm?",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/00-storm.webp"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=276926",
          "author": "Yves Smith",
          "description": "Our peregrinating daily links: looks and smart? moar mpox, Long Covid, carbon scheme doubts, China boat busting, Die Welt after secret Hitlers, Netanyahu retrades peace deal, Putin nixes negotiations, cars go full Stasi? Trump v. EV subsidies, Dem convention, Phil Donahue RIP, election AI fakes",
          "link": "https://www.nakedcapitalism.com/2024/08/links-8-20-2024.html",
          "publishedOn": "2024-08-20T10:59:09.000Z",
          "wordCount": 14382,
          "title": "Links 8/20/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/00-Eric-pretty-kitty-scaled.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=276906",
          "author": "Nick Corbishley",
          "description": "For over three decades, Mexico has been a veritable paradise for global mining conglomerates, serving up some of the laxest regulations in Latin America. That is now changing.",
          "link": "https://www.nakedcapitalism.com/2024/08/in-final-month-in-office-mexicos-outgoing-president-amlo-prepares-to-ban-open-pit-mining-and-fracking-in-new-constitutional-ammendments.html",
          "publishedOn": "2024-08-20T10:45:22.000Z",
          "wordCount": 5413,
          "title": "In His Last 40 Days in Office, Mexico’s President Lopéz Obrador Pushes Ahead With Plans to Ban Open Pit Mining",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277047",
          "author": "Yves Smith",
          "description": "Quelle surprise! Introducing robots into workplaces slows wage growth, particularly among factory labor.",
          "link": "https://www.nakedcapitalism.com/2024/08/robots-and-wage-polarisation.html",
          "publishedOn": "2024-08-20T09:59:22.000Z",
          "wordCount": 3662,
          "title": "Robots and Wage Polarisation",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277043",
          "author": "Yves Smith",
          "description": "The EU leads in managing autonomous and separatist movements in its states, but non-EU countries can be more vulnerable to outside interference.",
          "link": "https://www.nakedcapitalism.com/2024/08/the-status-of-europes-autonomous-movements.html",
          "publishedOn": "2024-08-20T09:56:22.000Z",
          "wordCount": 6357,
          "title": "The Status of Europe’s Autonomous Movements",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=276972",
          "author": "Lambert Strether",
          "description": "Great news on wastewater, less great news on R0 and airborne transmission.",
          "link": "https://www.nakedcapitalism.com/2024/08/mpox-monkeypox-round-up-history-wastewater-r0-and-is-it-airborne-yes.html",
          "publishedOn": "2024-08-19T20:25:54.000Z",
          "wordCount": 8247,
          "title": "Mpox (“Monkeypox”) Round-Up: History, Wastewater, R0, and Is It Airborne? (Yes)",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/cdc_mpox_ww.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=276974",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, pandemics: Updated Covid data: First sighting of XDV.1 variant from China; a campaign scenario and the Democrat National Convention; Israel accepts US ceasefire deal, but not Hamas. Nice timing! ~",
          "link": "https://www.nakedcapitalism.com/2024/08/200pm-water-cooler-8-19-2024.html",
          "publishedOn": "2024-08-19T18:00:26.000Z",
          "wordCount": 12396,
          "title": "2:00PM Water Cooler 8/19/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/helper_olympic.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=276910",
          "author": "Conor Gallagher",
          "description": "",
          "link": "https://www.nakedcapitalism.com/2024/08/links-8-19-2024.html",
          "publishedOn": "2024-08-19T10:55:16.000Z",
          "wordCount": 17140,
          "title": "Links 8/19/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/Screenshot-2024-08-18-at-6.53.13 AM-815x1024.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=276947",
          "author": "Yves Smith",
          "description": "Trying to make sense of a Washington Post story depicting Russia as willing give up its best weapon, its electrical war, for very little.",
          "link": "https://www.nakedcapitalism.com/2024/08/washington-post-report-on-russia-ukraine-negotiation-to-end-energy-system-attacks-an-admission-of-russian-long-term-weakness-or-more-complex-calcuation.html",
          "publishedOn": "2024-08-19T10:54:30.000Z",
          "wordCount": 20049,
          "title": "Washington Post Report on Russia-Ukraine Negotiation to End Energy System Attacks: An Admission of Russian Long-Term Weakness or More Complex Calcuation?",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "66c3a5d84a25d6000ae1d9b0",
          "author": "Luke Valenta",
          "description": "NIST has published the first cryptographic standards for protecting against attacks from quantum computers. Learn what this means for you and your organization",
          "link": "https://blog.cloudflare.com/nists-first-post-quantum-standards",
          "publishedOn": "2024-08-20T13:00:39.000Z",
          "wordCount": 1899,
          "title": "NIST’s first post-quantum standards",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/08/2499-OG-1.png"
        },
        {
          "id": "66c2ca3c4a25d6000ae1d73e",
          "author": "Aaron Snell",
          "description": "This summer, Cloudflare welcomed approximately 60 interns from all around the globe, on a mission to #HelpBuildABetterInternet. Join us as we dive into what we were able to accomplish and our experiences!",
          "link": "https://blog.cloudflare.com/2024-interns",
          "publishedOn": "2024-08-19T13:00:21.000Z",
          "wordCount": 2617,
          "title": "Summer 2024 weather report: Cloudflare with a chance of Intern-ets",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/08/2494-OG-1.png"
        },
        {
          "id": "66be71ff4a25d6000ae1d4a6",
          "author": "Pete Pang",
          "description": "From the U.S. elections and geopolitical conflict to tens of millions in corporate dollars lost, phishing remains the root cause of cyber damages. Learn why a comprehensive solution is the best way to stay protected",
          "link": "https://blog.cloudflare.com/a-wild-week-in-phishing-and-what-it-means-for-you",
          "publishedOn": "2024-08-16T17:34:14.000Z",
          "wordCount": 1859,
          "title": "A wild week in phishing, and what it means for you",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/08/2504-OG-1.png"
        },
        {
          "id": "66be142d4a25d6000ae1d42b",
          "author": "Alex Huang",
          "description": "Cloudflare Stream is an end-to-end solution for video encoding, storage, delivery, and playback, focused on simplifying all aspects of video for developers. Newly uploaded or ingested portrait videos will now automatically be processed in full HD quality",
          "link": "https://blog.cloudflare.com/introducing-high-definition-portrait-video-support-for-cloudflare-stream",
          "publishedOn": "2024-08-16T13:00:53.000Z",
          "wordCount": 2146,
          "title": "Introducing high-definition portrait video support for Cloudflare Stream",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/08/Introducing-high-definition-portrait-video-support-for-Cloudflare-Stream-OG-1.png"
        },
        {
          "id": "66bcdb694a25d6000ae1d2f8",
          "author": "Nikita Cano",
          "description": "Meet Cloud Connector — a new free product to simplify your cloud routing and object storage configurations. Say goodbye to frustrating Host Header workarounds and hello to protecting your assets, accelerating applications, and routing your traffic between multiple cloud providers seamlessly",
          "link": "https://blog.cloudflare.com/cloud-connector",
          "publishedOn": "2024-08-16T13:00:18.000Z",
          "wordCount": 2011,
          "title": "Simplify cloud routing and object storage configurations with Cloud Connector",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/08/Simplify-cloud-routing-and-object-storage-configurations-with-Cloud-Connector-OG-1.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": [
        {
          "id": "https://kubernetes.io/blog/2024/08/21/cri-cgroup-driver-lookup-now-beta/",
          "author": null,
          "description": "Historically, configuring the correct cgroup driver has been a pain point for users running new\nKubernetes clusters. On Linux systems, there are two different cgroup drivers:\ncgroupfs and systemd. In the past, both the kubelet\nand CRI implementation (like CRI-O or containerd) needed to be configured to use\nthe same cgroup driver, or else the kubelet would exit with an error. This was a\nsource of headaches for many cluster admins. However, there is light at the end of the tunnel!\nAutomated cgroup driver detection\nIn v1.28.0, the SIG Node community introduced the feature gate\nKubeletCgroupDriverFromCRI, which instructs the kubelet to ask the CRI\nimplementation which cgroup driver to use. A few minor releases of Kubernetes\nhappened whilst we waited for support to land in the major two CRI implementations\n(containerd and CRI-O), but as of v1.31.0, this feature is now beta!\nIn addition to setting the feature gate, a cluster admin needs to ensure their\nCRI implementation is new enough:\ncontainerd: Support was added in v2.0.0\nCRI-O: Support was added in v1.28.0\nThen, they should ensure their CRI implementation is configured to the\ncgroup_driver they would like to use.\nFuture work\nEventually, support for the kubelet's cgroupDriver configuration field will be\ndropped, and the kubelet will fail to start if the CRI implementation isn't new\nenough to have support for this feature.",
          "link": "https://kubernetes.io/blog/2024/08/21/cri-cgroup-driver-lookup-now-beta/",
          "publishedOn": "2024-08-21T00:00:00.000Z",
          "wordCount": 4152,
          "title": "Kubernetes 1.31: Autoconfiguration For Node Cgroup Driver (beta)",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2024/08/20/websockets-transition/",
          "author": null,
          "description": "In Kubernetes 1.31, by default kubectl now uses the WebSocket protocol\ninstead of SPDY for streaming.\nThis post describes what these changes mean for you and why these streaming APIs\nmatter.\nStreaming APIs in Kubernetes\nIn Kubernetes, specific endpoints that are exposed as an HTTP or RESTful\ninterface are upgraded to streaming connections, which require a streaming\nprotocol. Unlike HTTP, which is a request-response protocol, a streaming\nprotocol provides a persistent connection that's bi-directional, low-latency,\nand lets you interact in real-time. Streaming protocols support reading and\nwriting data between your client and the server, in both directions, over the\nsame connection. This type of connection is useful, for example, when you create\na shell in a running container from your local…",
          "link": "https://kubernetes.io/blog/2024/08/20/websockets-transition/",
          "publishedOn": "2024-08-20T00:00:00.000Z",
          "wordCount": 4504,
          "title": "Kubernetes 1.31: Streaming Transitions from SPDY to WebSockets",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2024/08/19/kubernetes-1-31-pod-failure-policy-for-jobs-goes-ga/",
          "author": null,
          "description": "This post describes Pod failure policy, which graduates to stable in Kubernetes\n1.31, and how to use it in your Jobs.\nAbout Pod failure policy\nWhen you run workloads on Kubernetes, Pods might fail for a variety of reasons.\nIdeally, workloads like Jobs should be able to ignore transient, retriable\nfailures and continue running to completion.\nTo allow for these transient failures, Kubernetes Jobs include the backoffLimit\nfield, which lets you specify a number of Pod failures that you're willing to tolerate\nduring Job execution. However, if you set a large value for the backoffLimit field\nand rely solely on this field, you might notice unnecessary increases in operating\ncosts as Pods restart excessively until the backoffLimit is met.\nThis becomes particularly problematic when running large-sc…",
          "link": "https://kubernetes.io/blog/2024/08/19/kubernetes-1-31-pod-failure-policy-for-jobs-goes-ga/",
          "publishedOn": "2024-08-19T00:00:00.000Z",
          "wordCount": 4952,
          "title": "Kubernetes 1.31: Pod Failure Policy for Jobs Goes GA",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2024/08/16/matchlabelkeys-podaffinity/",
          "author": null,
          "description": "Kubernetes 1.29 introduced new fields MatchLabelKeys and MismatchLabelKeys in PodAffinity and PodAntiAffinity.\nIn Kubernetes 1.31, this feature moves to beta and the corresponding feature gate (MatchLabelKeysInPodAffinity) gets enabled by default.\nMatchLabelKeys - Enhanced scheduling for versatile rolling updates\nDuring a workload's (e.g., Deployment) rolling update, a cluster may have Pods from multiple versions at the same time.\nHowever, the scheduler cannot distinguish between old and new versions based on the LabelSelector specified in PodAffinity or PodAntiAffinity. As a result, it will co-locate or disperse Pods regardless of their versions.\nThis can lead to sub-optimal scheduling outcome, for example:\nNew version Pods are co-located with old version Pods (PodAffinity), which will ev…",
          "link": "https://kubernetes.io/blog/2024/08/16/matchlabelkeys-podaffinity/",
          "publishedOn": "2024-08-16T00:00:00.000Z",
          "wordCount": 4524,
          "title": "Kubernetes 1.31: MatchLabelKeys in PodAffinity graduates to beta",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2024/08/16/kubernetes-1-31-prevent-persistentvolume-leaks-when-deleting-out-of-order/",
          "author": null,
          "description": "PersistentVolume (or PVs for short) are\nassociated with Reclaim Policy.\nThe reclaim policy is used to determine the actions that need to be taken by the storage\nbackend on deletion of the PVC Bound to a PV.\nWhen the reclaim policy is Delete, the expectation is that the storage backend\nreleases the storage resource allocated for the PV. In essence, the reclaim\npolicy needs to be honored on PV deletion.\nWith the recent Kubernetes v1.31 release, a beta feature lets you configure your\ncluster to behave that way and honor the configured reclaim policy.\nHow did reclaim work in previous Kubernetes releases?\nPersistentVolumeClaim (or PVC for short) is\na user's request for storage. A PV and PVC are considered Bound\nif a newly created PV or a matching PV is found. The PVs themselves are\nbacked by vo…",
          "link": "https://kubernetes.io/blog/2024/08/16/kubernetes-1-31-prevent-persistentvolume-leaks-when-deleting-out-of-order/",
          "publishedOn": "2024-08-16T00:00:00.000Z",
          "wordCount": 4737,
          "title": "Kubernetes 1.31: Prevent PersistentVolume Leaks When Deleting out of Order",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2024/08/16/kubernetes-1-31-image-volume-source/",
          "author": null,
          "description": "The Kubernetes community is moving towards fulfilling more Artificial\nIntelligence (AI) and Machine Learning (ML) use cases in the future. While the\nproject has been designed to fulfill microservice architectures in the past,\nit’s now time to listen to the end users and introduce features which have a\nstronger focus on AI/ML.\nOne of these requirements is to support Open Container Initiative (OCI)\ncompatible images and artifacts (referred as OCI objects) directly as a native\nvolume source. This allows users to focus on OCI standards as well as enables\nthem to store and distribute any content using OCI registries. A feature like\nthis gives the Kubernetes project a chance to grow into use cases which go\nbeyond running particular images.\nGiven that, the Kubernetes community is proud to present…",
          "link": "https://kubernetes.io/blog/2024/08/16/kubernetes-1-31-image-volume-source/",
          "publishedOn": "2024-08-16T00:00:00.000Z",
          "wordCount": 4959,
          "title": "Kubernetes 1.31: Read Only Volumes Based On OCI Artifacts (alpha)",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2024/08/15/kubernetes-1-31-volume-attributes-class/",
          "author": null,
          "description": "Volumes in Kubernetes have been described by two attributes: their storage class, and\ntheir capacity. The storage class is an immutable property of the volume, while the\ncapacity can be changed dynamically with volume\nresize.\nThis complicates vertical scaling of workloads with volumes. While cloud providers and\nstorage vendors often offer volumes which allow specifying IO quality of service\n(Performance) parameters like IOPS or throughput and tuning them as workloads operate,\nKubernetes has no API which allows changing them.\nWe are pleased to announce that the VolumeAttributesClass\nKEP,\nalpha since Kubernetes 1.29, will be beta in 1.31. This provides a generic,\nKubernetes-native API for modifying volume parameters like provisioned IO.\nLike all new volume features in Kubernetes, this API is…",
          "link": "https://kubernetes.io/blog/2024/08/15/kubernetes-1-31-volume-attributes-class/",
          "publishedOn": "2024-08-15T00:00:00.000Z",
          "wordCount": 4301,
          "title": "Kubernetes 1.31: VolumeAttributesClass for Volume Modification Beta",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2024/08/15/consistent-read-from-cache-beta/",
          "author": null,
          "description": "Kubernetes is renowned for its robust orchestration of containerized applications,\nbut as clusters grow, the demands on the control plane can become a bottleneck.\nA key challenge has been ensuring strongly consistent reads from the etcd datastore,\nrequiring resource-intensive quorum reads.\nToday, the Kubernetes community is excited to announce a major improvement:\nconsistent reads from cache, graduating to Beta in Kubernetes v1.31.\nWhy consistent reads matter\nConsistent reads are essential for ensuring that Kubernetes components have an accurate view of the latest cluster state.\nGuaranteeing consistent reads is crucial for maintaining the accuracy and reliability of Kubernetes operations,\nenabling components to make informed decisions based on up-to-date information.\nIn large-scale cluster…",
          "link": "https://kubernetes.io/blog/2024/08/15/consistent-read-from-cache-beta/",
          "publishedOn": "2024-08-15T00:00:00.000Z",
          "wordCount": 4590,
          "title": "Kubernetes v1.31: Accelerating Cluster Performance with Consistent Reads from Cache",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=21559",
          "author": null,
          "description": "Delivering new AI technologies at scale also means rethinking every layer of our infrastructure – from silicon and software systems and even our data center designs. For the second year in a row, Meta’s engineering and infrastructure teams returned for the AI Infra @ Scale conference, where they discussed the challenges of scaling up an [...]\nRead More...\nThe post Aparna Ramani discusses the future of AI infrastructure appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/08/20/data-infrastructure/aparna-ramani-future-of-ai-infrastructure-meta/",
          "publishedOn": "2024-08-20T16:00:26.000Z",
          "wordCount": 1596,
          "title": "Aparna Ramani discusses the future of AI infrastructure",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/08/Ai_infra@Scale-YouTube-Thumbnail-Aparna_Ramani_r01.webp"
        },
        {
          "id": "https://engineering.fb.com/?p=21542",
          "author": null,
          "description": "We launched Meta AI with the goal of giving people new ways to be more productive and unlock their creativity with generative AI (GenAI). But GenAI also comes with challenges of scale. As we deploy new GenAI technologies at Meta, we also focus on delivering these services to people as quickly and efficiently as possible. [...]\nRead More...\nThe post How Meta animates AI-generated images at scale appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/08/14/production-engineering/how-meta-animates-ai-generated-images-at-scale/",
          "publishedOn": "2024-08-14T21:20:04.000Z",
          "wordCount": 3380,
          "title": "How Meta animates AI-generated images at scale",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/08/image2.gif"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": []
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=53029",
          "author": "Henry Farrell",
          "description": "“To promote open inquiry and free, market-based technological progress, you need an open society, not one founded on the enemy principle. The understandable desire to escape criticism, misunderstanding, and the frustrations of ordinary politics does not entail the radical remaking of the global geoeconomic order to confound the New York Times and its allies. The cult of […]",
          "link": "https://crookedtimber.org/2024/08/20/what-went-wrong-with-the-silicon-valley-right/",
          "publishedOn": "2024-08-20T12:57:48.000Z",
          "wordCount": 2250,
          "title": "What went wrong with the Silicon Valley right",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52980",
          "author": "Miriam Ronzoni",
          "description": "This is a midsummer short and light hearted post, but I find that Summer is often the time when I am most reminded of my bodily existence, and of how naïve us philosophers are in forgetting (de facto, if not in principle) how much our thoughts and beliefs are embedded in our bodily experience. Indeed,often […]",
          "link": "https://crookedtimber.org/2024/08/20/against-the-sleepboring-analogy/",
          "publishedOn": "2024-08-20T08:22:02.000Z",
          "wordCount": 3032,
          "title": "Against the Sleep=Boring Analogy",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53018",
          "author": "Belle Waring",
          "description": "Henry James: girl, you are so cool and smart, and well-dressed, and beautiful. And I mean this in the least-sexual, but not sassy-gay-best-friend way, exactly, but more like just, your good friend who is also gay? And do you know, that guy is the worst. The worst. I feel like someone should leave you a […]",
          "link": "https://crookedtimber.org/2024/08/19/henry-james-opposes-wildly-unlikeable-guys/",
          "publishedOn": "2024-08-19T22:19:09.000Z",
          "wordCount": 2391,
          "title": "Henry James Opposes Wildly Unlikeable Guys",
          "imageUrl": "https://img.youtube.com/vi/pB4gIRunnhM/0.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53014",
          "author": "Serene Khader",
          "description": "The value of individualism often comes up in attempts to make sense of the elusiveness of women’s empowerment. “Investing in women” has not uniformly yielded either the quick reduction in women’s poverty or the decrease in women’s adherence to sexist norms or deference to men policymakers had hoped it would. Of course, this is partly […]",
          "link": "https://crookedtimber.org/2024/08/19/new-work-on-gender-and-development-soledad-artiz-prillamans-the-patriarchal-political-order/",
          "publishedOn": "2024-08-19T20:02:07.000Z",
          "wordCount": 2738,
          "title": "New Work on Gender and Development: Soledad Artiz Prillaman’s The Patriarchal Political Order",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53009",
          "author": "Chris Bertram",
          "description": "Visit the post for more.",
          "link": "https://crookedtimber.org/2024/08/18/sunday-photoblogging-gull/",
          "publishedOn": "2024-08-18T16:00:36.000Z",
          "wordCount": 1956,
          "title": "Sunday photoblogging: gull",
          "imageUrl": "https://live.staticflickr.com/65535/53897622235_5bd50828c2.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52985",
          "author": "John Q",
          "description": "… at least in the “Anglosphere” One of the striking features of the racist riots in Britain has been the wide spread of ages among those (nearly all men) convicted so far[1]. This is unusual, since criminal violence of all kinds is most commonly associated with young men. And it’s a counter-example to what has […]",
          "link": "https://crookedtimber.org/2024/08/15/young-men-arent-shifting-right/",
          "publishedOn": "2024-08-15T01:12:33.000Z",
          "wordCount": 6320,
          "title": "Young men aren’t shifting right …",
          "imageUrl": "https://crookedtimber.org/wp-content/uploads/2024/08/Screenshot-2024-08-15-at-11.05.18?AM.png"
        },
        {
          "id": "https://crookedtimber.org/?p=52983",
          "author": "John Q",
          "description": "As requested by a couple of commenters, I’ve created a separate thread to discuss the issues raised by commenter “closet conservative” in response to my post on US academia. I’ll moderate, but not participate",
          "link": "https://crookedtimber.org/2024/08/15/side-discussion/",
          "publishedOn": "2024-08-15T00:58:46.000Z",
          "wordCount": 7090,
          "title": "Side discussion",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/Peasants-and-Politics-in-Neoliberal-India-The-2020-21-Peasant-Movement",
          "author": "Paramjit Singh",
          "description": "The persistence of peasantry in the Global South and imperialism's necessity to integrate it into its accumulation network has given birth to a new agrarian question. This question centers around policies and efforts employed by imperialist countries to pressurize countries of the Global South, through international institutions (WTO, World Bank, and IMF), to integrate their peasantry into globalized capital. A peculiar feature of recent developments in this process is the exceptional (...)\nEnglish\n\n/ \nSocial movements, \nIndia, \nAgriculture and Food Sovereignty",
          "link": "https://www.cadtm.org/Peasants-and-Politics-in-Neoliberal-India-The-2020-21-Peasant-Movement",
          "publishedOn": "2024-08-19T10:00:00.000Z",
          "wordCount": 3378,
          "title": "Peasants and Politics in Neoliberal India: The 2020-21 Peasant Movement",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1200xH630/1ada42a6e9b299b58229c78c8d17c7-59863.jpg"
        },
        {
          "id": "https://www.cadtm.org/The-worst-ever-global-debt-crisis",
          "author": "Collective, Development finance international",
          "description": "This policy briefing, based on the new Debt Service Watch database, shows that the citizens of the Global South now face the worst debt crisis since global records began. Debt service is absorbing an average 38% of budget revenue and 30% of spending across the South, rising to 54% of revenue and 40% of spending in Africa. Spread across all continents, 35 countries are paying more than half of revenue, and 54 over one third. (...)\nEnglish\n\n/ \nAusterity/Structural Adjustment, \nIllegitimate debt, \nSouth",
          "link": "https://www.cadtm.org/The-worst-ever-global-debt-crisis",
          "publishedOn": "2024-08-17T07:51:08.000Z",
          "wordCount": 865,
          "title": "The worst ever global debt crisis",
          "enclosure": {
            "url": "https://www.cadtm.org/IMG/pdf/debt_service_watch_briefing_final_word_en_0910.pdf",
            "length": "454754",
            "type": "application/pdf"
          },
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/25d245c34d7df490a34d9141fc46da-bb8d2.jpg"
        },
        {
          "id": "https://www.cadtm.org/From-the-Committee-for-the-Cancellation-of-Third-World-Debt-to-the-Committee",
          "author": "Christoph Sorg",
          "description": "Excerpts from Social Movements and the Politics of Debt: Transnational Resistance against Debt on Three Continents. \nEnglish\n\n/ \nSocial movements, \nDebt campaign, \nDebt crisis, \nCADTM",
          "link": "https://www.cadtm.org/From-the-Committee-for-the-Cancellation-of-Third-World-Debt-to-the-Committee",
          "publishedOn": "2024-08-16T16:45:29.000Z",
          "wordCount": 2937,
          "title": "From the “Committee for the Cancellation of Third World Debt” to the “Committee for the Abolition of Illegitimate Debt”",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1200xH630/dc1b79000bbb425941d2d5346ac8b3-477d3.jpg"
        },
        {
          "id": "https://www.cadtm.org/Ecuador-Resistance-against-the-policies-imposed-by-the-World-Bank-the-IMF-and",
          "author": "Eric Toussaint",
          "description": "The World Bank and the IMF are 80 years old. 80 years of financial neo-colonialism and the imposition of austerity policies in the name of debt repayment. 80 years is enough! The Bretton Woods institutions must be abolished and replaced by democratic institutions serving an ecological, feminist and anti-racist bifurcation. To mark these 80 years, we are republishing a series of articles every Wednesday until July, looking in detail at the history and damage caused by these two institutions. (...)\nEnglish\n\n/ \nEcuador, \nIMF, \nWorld Bank, \nFinance against people, \nBM-FMI-Equateur_EN",
          "link": "https://www.cadtm.org/Ecuador-Resistance-against-the-policies-imposed-by-the-World-Bank-the-IMF-and",
          "publishedOn": "2024-08-16T06:30:00.000Z",
          "wordCount": 8317,
          "title": "Ecuador: Resistance against the policies imposed by the World Bank, the IMF and other creditors between 2007 and 2011",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L710xH373/126f43b85ae140a278cc99c504a47a-c8730.jpg"
        },
        {
          "id": "https://www.cadtm.org/Social-Movements-and-the-Politics-of-Debt",
          "author": "Christoph Sorg",
          "description": "Social Movements and the Politics of Debt, Transnational Resistance against Debt on Three Continents, Christoph Sorg, Amsterdam University Press, 2022 \nEnglish\n\n/ \nDebt campaign, \nDebt crisis, \nDebt in History",
          "link": "https://www.cadtm.org/Social-Movements-and-the-Politics-of-Debt",
          "publishedOn": "2024-08-15T20:43:26.000Z",
          "wordCount": 10289,
          "title": "Social Movements and the Politics of Debt",
          "enclosure": {
            "url": "https://www.cadtm.org/IMG/pdf/social_movements_0aand_the_politics_of_debt.pdf",
            "length": "2952874",
            "type": "application/pdf"
          },
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1200xH630/e34b4947add76e7652572a6d2077db-35d33.jpg"
        },
        {
          "id": "https://www.cadtm.org/Bangladesh-the-Global-South-debt-crisis-intensifies",
          "author": "Michael Roberts",
          "description": "The overthrow of the Sheikh Hasina's dictatorial government in Bangladesh by students and the populace last week is a startling outcome of the economic nightmare. The country's average GDP growth over the past decade, according to government statistics, was around 6.6%. As late as April this year, the World Bank reckoned that Bangladesh would grow by 5.6% this year, led by its highly successful garment industry, which relies on cheap labour sweat shops to gain market share globally. It (...)\nEnglish\n\n/ \nBangladesh, \nDebt crisis, \nSouth",
          "link": "https://www.cadtm.org/Bangladesh-the-Global-South-debt-crisis-intensifies",
          "publishedOn": "2024-08-15T20:36:00.000Z",
          "wordCount": 2542,
          "title": "Bangladesh: the ‘Global South' debt crisis intensifies",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/4a1ddc8bdd91b99b0e1ebabd5f40cc-cb52c.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=8334",
          "author": "disassociated.com",
          "description": "About six years ago I decided I wasn’t reading enough novels. Books sat on the side table untouched, gathering dust, and inducing a pang of guilt whenever I took notice of them. I wondered what I could do to get more into reading. One thing I am good at is meeting deadlines, and doing things […]",
          "link": "https://disassociated.com/wanting-read-more-novels-versus-everything-else/",
          "publishedOn": "2024-08-20T21:00:18.000Z",
          "wordCount": 791,
          "title": "Wanting to read more novels, versus trying to do everything else",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8320",
          "author": "disassociated.com",
          "description": "Do Australian Prime Ministers have time to read books? They may not, but they do have a literary award for Australian publications, created in 2008, of which the 2024 shortlist was announced last week. Five titles, across the six award categories of fiction, non-fiction, Australian history, poetry, children’s, and young adult, were included. Among books […]",
          "link": "https://disassociated.com/australian-prime-ministers-literary-awards-2024-shortlist/",
          "publishedOn": "2024-08-19T21:00:29.000Z",
          "wordCount": 292,
          "title": "Australian Prime Minister’s Literary Awards 2024 shortlist",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8315",
          "author": "disassociated.com",
          "description": "The Zone of Interest, trailer, the 2023 film by British director Jonathan Glazer (Sexy Beast, Under the Skin), explores a slightly different aspect of the World War II Holocaust, which resulted in the deaths of six million European Jews at the hands of the Nazis. Rudolf Höss (Christian Friedel), the commandant of Auschwitz, a Nazi […]",
          "link": "https://disassociated.com/film-the-zone-of-interest-jonathan-glazer-christian-friedel-sandra-huller/",
          "publishedOn": "2024-08-18T21:00:38.000Z",
          "wordCount": 417,
          "title": "The Zone of Interest, a film by Jonathan Glazer, with Christian Friedel, Sandra Huller",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8327",
          "author": "disassociated.com",
          "description": "Coming soon to Threads on the website: the facility to save post drafts, and schedule posts. Post insights, similar I imagine, to those on Instagram, are also on the way, according to a recent thread by Meta CEO Mark Zuckerberg. Scheduling posts and saving drafts — at least if using Threads through the website — […]",
          "link": "https://disassociated.com/new-threads-micro-blogging-features-badge-number-easter-egg/",
          "publishedOn": "2024-08-18T20:30:36.000Z",
          "wordCount": 275,
          "title": "New Threads micro-blogging features, badge number Easter egg",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8297",
          "author": "disassociated.com",
          "description": "Marie Le Conte, writing for New Humanist, in a provocatively titled article: the introverts are winning, seems to suggest introverts and extraverts are embroiled in some sort of global conflict. A quick explainer. People generally fall into one of two personality traits: extraversion or introversion. It’s a scale. You can be close to either end, […]",
          "link": "https://disassociated.com/introverts-extraverts-war-introverts-winning-wtf/",
          "publishedOn": "2024-08-15T21:00:01.000Z",
          "wordCount": 1037,
          "title": "Introverts and extraverts are at war, and introverts are winning. WTF?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8302",
          "author": "disassociated.com",
          "description": "News sites seem to be the worst, but they’re not alone*. You want to read a news item, but are assailed by a plethora of interfering popups of some sort. But a new feature in the soon to be released iPhone operating system, iOS 18, for Apple’s Safari browser, is a step in the right […]",
          "link": "https://disassociated.com/ios-18-distraction-free-browsing-parts-web/",
          "publishedOn": "2024-08-15T20:30:19.000Z",
          "wordCount": 300,
          "title": "iOS 18 will bring distraction free browsing to parts of the web",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8288",
          "author": "disassociated.com",
          "description": "Since re-booting disassociated in May 2022, I’ve been slowly (incredibly slowly) restoring selected posts from the previous version of the blog that was online between 2007 and 2017. The restored posts are tagged legacy, and also include a few posts written prior to 2007, going back to 2003. On checking as I typed this, I […]",
          "link": "https://disassociated.com/threat-ai-demise-blogging-world-february-2015/",
          "publishedOn": "2024-08-14T21:00:55.000Z",
          "wordCount": 412,
          "title": "Threat of AI, demise of blogging, the world in February 2015",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20240814",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20240814",
          "publishedOn": "2024-08-14T21:00:00.000Z",
          "wordCount": 514,
          "title": "Week Ending August 11, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/prospects",
          "author": null,
          "description": "Forecasting Starmerism.",
          "link": "https://newleftreview.org/sidecar/posts/prospects",
          "publishedOn": "2024-08-16T10:22:07.000Z",
          "wordCount": 2391,
          "title": "Caitlín Doherty: &ldquo;Prospects&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/08/Starmer.jpeg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/into-the-void",
          "author": null,
          "description": "Explaining British pogromism.",
          "link": "https://newleftreview.org/sidecar/posts/into-the-void",
          "publishedOn": "2024-08-15T13:42:21.000Z",
          "wordCount": 1871,
          "title": "Anton Jäger: &ldquo;Into the Void&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/08/r0_0_1280_720_w1200_h678_fmax.jpg"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://birming.com/no-secret/",
          "author": null,
          "description": "\"What's the secret?\"\nI asked this question to one of my clients today. He was 85 years old, looked 60, and was as fit and agile as a 50-year-old.\nHe replied: \"There's no secret. I enjoy walking. That’s all.\"\nNo secrets. No tricks. Completely natural.\nBut that's often how it is, isn’t it; we think there's a code to crack, a secret recipe to follow to achieve success. When in reality, the answer lies in the most natural thing in the world.\nIf we want to increase our chances of being in good shape, then we need to make sure we move around a bit. If we want to become a better writer, then we need to make sure we write a lot.\nThere's no secret.",
          "link": "https://birming.com/no-secret/",
          "publishedOn": "2024-08-20T15:08:00.000Z",
          "wordCount": 1053,
          "title": "There's No Secret",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1724166275.jpg"
        },
        {
          "id": "https://zarar.dev/anatomy-of-a-mental-breakdown/",
          "author": null,
          "description": "Note: this made it on HN somehow.\nAround 2AM this morning I had a realization that this was the most stressed I have ever been. On verge of a complete breakdown.\nWhy? Because I noticed around 10PM that jumpcomedy.com was entirely broken with all HTTP POST calls made by RTK Query failing. Nothing worked and though I had deployed recent changes, none of them would cause this. I was at a complete loss as to where to look, especially as this is working locally. Posting on the usual Discords (NextJS, Vercel) is leading to dead silence. I'm alone and have to fix this issue which I didn't cause.\nThis isn't the first production defect I've introduced in my 25 years of working, but this is the first one where I had absolutely nobody to turn to in a time of crisis while customer complaints are pilin…",
          "link": "https://zarar.dev/anatomy-of-a-mental-breakdown/",
          "publishedOn": "2024-08-20T13:15:00.000Z",
          "wordCount": 1612,
          "title": "The anatomy of a 2AM mental breakdown",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://louplummer.lol/what-a-day/",
          "author": null,
          "description": "Today was the first day of classes at the university where I work in IT support. That means campus was full of people who needed help in a variety of ways. The second anyone ventured outside of their office, they's be accosted by an innocent freshman or newly hired professor who needed directions to some other building. In the technology world, there dozens of people who a) forgot their password b) did not want to click the self-service link for forgotten passwords. Later on in the year, I'll make them use the self-service link but today there was no time to convince these neo-adults to take the responsible route out of their self-created problems. I just reset their password for them and moved along to the next person. Some people would listen to the directions on what to do next and say …",
          "link": "https://louplummer.lol/what-a-day/",
          "publishedOn": "2024-08-20T11:30:00.000Z",
          "wordCount": 1224,
          "title": "What a Day",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/livingoutloud-1724113552.png"
        },
        {
          "id": "https://meadow.cafe/just-because-its-all-in-your-head-doesnt-mean-its-not-real/",
          "author": null,
          "description": "If you're anything like me, then you're frequently told by those around you something along the lines of \"Oh, don't worry about it, it's all in your head\" or perhaps the more common \"You're imagining things.\" These people usually mean well when they give such advise; they're trying to help in their own way. My parents did this all the time while I was growing up, so much so that I ended up believing it. And sometimes, it's true. It could be that \"that person\" is not being mean to me because they don't like me, but rather because they're having a bad day in general. I get that, and I agree that sometimes (most of the time), we make up our own problems out of confusion, miscommunication, or ignorance.\nBut what about deeper, more pervasive scenarios?\nWhat about depression, for instance? Peopl…",
          "link": "https://meadow.cafe/just-because-its-all-in-your-head-doesnt-mean-its-not-real/",
          "publishedOn": "2024-08-19T15:33:00.000Z",
          "wordCount": 1220,
          "title": "Just because it’s all in your head doesn’t mean it’s not real",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://notes.jeddacp.com/silent-sunday-coffee/",
          "author": null,
          "description": "Last week, I “participated” in Silent Sunday partially due to my social battery being drained. I initially thought that Silent Sunday meant posting a photo that conveys silence, tranquility, and the like. Perhaps in some ways, it still can be. However, I’d be remiss not to acknowledge it’s actual origin1 as described by mocha beanie mummy.\nSometimes I find that words can clutter a photograph. Sometimes I want to look at a photograph, and make up my own mind about it, what I think about it, rather than what others might think it should be about.\nThe rules guidelines are simple:2\nOnly one photo.\nThe photo you post must be taken by you.\nPhoto must be taken the week you post it.\nNo other words in the post. Title can be: Silent Sunday or date, nothing else.\nOf course, like everything out there, people have done their own Silent Sunday renditions. However, from what I see in the Mastodon hashtag, people are mostly keeping to its original concept.\n\n18/31 - Blaugust\nReply by email\nMany thanks to R Scott Jones for pointing me in the right direction.↩\n\n\nwording taken from the site but paraphrased.↩",
          "link": "https://notes.jeddacp.com/silent-sunday-coffee/",
          "publishedOn": "2024-08-18T18:33:00.000Z",
          "wordCount": 871,
          "title": "Silent Sunday (coffee)",
          "imageUrl": "https://live.staticflickr.com/65535/53931624629_2c349002ac_c.jpg"
        },
        {
          "id": "https://birming.com/quit-stay/",
          "author": null,
          "description": "A close friend of mine recently landed a new job and is now considering quitting.\nIt's impossible to predict whether you'll enjoy a workplace, but it usually becomes apparent soon after starting. If you consistently feel like \"this is the wrong place for me,\" I strongly believe you should quit as soon as possible. I've personally quit jobs within the first week.\nGiven that work occupies a significant portion of our lives, it's crucial that it feels right. But the very fact that work constitutes a large part of our lives can also mislead us.\nBesides work, we have relationships, hobbies, financial responsibilities, and our health to maintain. And, as we all know, life isn't always a constant joyride. Relationships can strain, health can deteriorate, and unexpected financial problems can arise.\nLife is often challenging. We feel down and want to feel better.\nWe seek solutions and try to identify what needs to change. We yearn for a quick fix, and it's easy to blame work. Considering it occupies around a third of our daily lives, it's not surprising that we hold our jobs accountable.\n\"Yes, of course, it's my workplace. There we have it. I gotta quit!\"\nBut is that really the root of the problem?\nIt might be partially, or not at all. Regardless, it's never wise to make major decisions based on fleeting, fluctuating, and undefined emotions.\nThere's usually no rush. It's worth waiting a while. The most important thing is that it's the right decision, whenever and whatever we decide.\nYou can't eliminate ripples on water with a slap. Wait, and they will eventually subside. Against this still background, the correct answer will emerge.",
          "link": "https://birming.com/quit-stay/",
          "publishedOn": "2024-08-18T12:21:00.000Z",
          "wordCount": 1197,
          "title": "Quit or Stay?",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1723983499.jpg"
        },
        {
          "id": "https://marblethoughts.bearblog.dev/curate-your-love/",
          "author": null,
          "description": "There’s a really nice quote that goes along the lines of “we’re a combination of everything we’ve ever known.” We’re just composed of things that we come across in our lives, and I find that very beautiful.\nYou are a museum.\n~evie\\\nIn essence, love is much like the art of curating a museum. We consider, assess, and most importantly choose the \"artifacts\" of most significance based on what we (uniquely) enjoy. The things we (uniquely) enjoy are informed by factors as varied and disparate as our blood-sugar levels, among other things. We carefully display our \"exhibit of love\" in beautiful frames and tags. \"This is so me.\"\nOr, to put it differently - imagine an unimaginably vast wall that contains every interest, hobby, passion, and person to ever exist. The concepts of \"self\" and \"taste\" le…",
          "link": "https://marblethoughts.bearblog.dev/curate-your-love/",
          "publishedOn": "2024-08-18T12:00:00.000Z",
          "wordCount": 1500,
          "title": "169. Curate your love",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://notes.jeddacp.com/week-notes-018/",
          "author": null,
          "description": "🗓️ // August 10 - August 16, 2024\nI am enjoying writing these Week Notes on Saturday mornings as I drink my first cup of coffee. Today’s a late start since I’m still slightly under the weather but feeling a tiny bit better.\nTook our friend CS down the coast while she was here this past weekend. Every year she visits from the east coast, we take her to a different part of the Bay (Area). Her first year, we explored the city (San Francisco), the second year we went to Point Reyes, and this year we went a little past Half Moon Bay. Pictures slowly incoming in the photo blog.\nA co-worker turned friend recently started a blog. I’ve been talking about my blogging experience the past few months, and since she was looking to start something new, figured she’d try her hand in it. She’s currently t…",
          "link": "https://notes.jeddacp.com/week-notes-018/",
          "publishedOn": "2024-08-17T18:54:00.000Z",
          "wordCount": 1380,
          "title": "Week Notes 018",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1721425535.png"
        },
        {
          "id": "https://birming.com/bearming/",
          "author": null,
          "description": "My brother said he thought my blog was broken, so I decided to give it a makeover by creating a new theme. I call it Bearming, because every theme needs a fancy name, right?\nBased on the default Bear theme, I aimed to create a clean theme with good readability. The appearance of the list of blog posts is inspired by the beautiful McLuhan theme.\nI also wanted to make it easily customizable and expandable. The solution became what I've called 'Add-ons'. These are optional additions for special tweaks. Currently, there are three, with more to come:\nPrint styles\nHighlighted tab\nUpvote button\nYou can simply delete the ones you don't want to use. If you want to use the highlighted tab part, it works best if you only have Home, Blog, and any Page in your navigation. Example code:\n<span class=\"nav…",
          "link": "https://birming.com/bearming/",
          "publishedOn": "2024-08-17T16:04:00.000Z",
          "wordCount": 1891,
          "title": "New Bear Theme: Bearming",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1723910595.jpg"
        },
        {
          "id": "https://vixiss.bearblog.dev/ebbs-and-flows/",
          "author": null,
          "description": "I've been feeling okay for the most part this month. I've been getting work done, I'm keeping up my habits, and I'm exploring my own creativity through writing. So it feels all the more terrible when I'm suddenly hit with a wave of depression.\nFor me, these waves come and go at random intervals. I could be having the best day and be hit with the most intense bouts of sadness, anxiety, and hopelessness. It might not be the most healthy thing to do, but I try to distract myself from these feelings by immersing myself in my work, hobbies, or playing video games with friends. This doesn't always help, but it does keep my mind off of it, at least for a short time.\nIt does get overwhelming sometimes dealing with all this by myself. I don't really have anyone in my life to speak about these things, so I have elected to scream these thoughts into the void that is my blog. I rarely, if at all, feel comfortable enough to talk about my feelings with friends or family because I was raised in a culture where that was not common or tolerated.\nThis might all sound hopeless, but I know that this will soon pass and that these feelings are temporary. All I have to do is ride out the waves.\n17/31",
          "link": "https://vixiss.bearblog.dev/ebbs-and-flows/",
          "publishedOn": "2024-08-17T12:00:00.000Z",
          "wordCount": 640,
          "title": "ebbs and flows",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://tala.bearblog.dev/on-depression-hope/",
          "author": null,
          "description": "I haven’t been feeling well the past few days. I have been feverishly urging myself with tasks throughout the day so I can get my mind off things. Better be productive than dwell with my thoughts, right?\nThis post isn't a vent, but a candid depiction of the reality of living with depression. (And sometimes I have this strange notion, that perhaps I am helping someone out there also battling depression.)\nRecently, I have been forcing myself to leave the house. Depression tries to trick me, to convince me: What will change if you go out? This happens every time I am stuck in the depression loop (as I like to call it). Out of bitterness, I would challenge myself to step out the house for two minutes, then I am free to hide back inside. But the moment I step out, I immediately feel better, and…",
          "link": "https://tala.bearblog.dev/on-depression-hope/",
          "publishedOn": "2024-08-15T15:51:00.000Z",
          "wordCount": 852,
          "title": "on depression & hope",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://notes.jeddacp.com/my-millennial-memories/",
          "author": null,
          "description": "I’ve been posting Throwback Thursday posts for the past few weeks on my Photoblog where I highlight some of my photos from the archive. It’s been a lot of fun so I wanted to do something similar today on here.\nThe Millennial generation is huge on nostalgia. Here are some of the highlights I remember from growing up in the 1990s.\nFashion\nButterfly hair clips.\nGel bracelets, the more the better... mostly in black and red.\nTattoo chokers -- although I think these are making a comeback amongst the Gen Zs?\nWhite eyeliner -- I'm not sure why I ever thought this looked good on me, but I tried.\nStudded belts worn sideways.\nThose milky gel pens that we'd use to draw/write on ourselves. I remember writing I <3 and the initials of that week's crush.\nMusic\nPlaying the perfect song on my stereo then re…",
          "link": "https://notes.jeddacp.com/my-millennial-memories/",
          "publishedOn": "2024-08-15T14:48:00.000Z",
          "wordCount": 1148,
          "title": "My Millennial Memories",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1723733048.png"
        },
        {
          "id": "https://louplummer.lol/our-community/",
          "author": null,
          "description": "I found out a couple of days ago that one of the people I communicate with regularly on Mastodon, a fellow by the name of Jim Mitchell (@jimmitchell@mastodon.social) was the creator of an app I used to use back in the day called YASU, Yet Another System Utility. I was fairly surprised to have my real life and my IndyWeb life collide like that. Jim and I are about the same age and have had some similar life experiences, facts we know because we've read each other's blogs.(Jim's Blog) It just felt good to have two parts of my life meet each other like that.\nTen years ago I discovered the community of Apple People who were separate from the company. A lot of them were podcasters like David Sparks and the guys from the Accidental Tech Podcast, John Siracusa, Casey Liss and Marco Arment. There …",
          "link": "https://louplummer.lol/our-community/",
          "publishedOn": "2024-08-15T11:30:00.000Z",
          "wordCount": 1184,
          "title": "Our Community",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/livingoutloud-1723682009.jpg"
        },
        {
          "id": "https://froggy.bearblog.dev/writing/",
          "author": null,
          "description": "there's lots of discourse on writing in the Bear Den (lol). the purposes of writing, who you should write for, why you should write, etc. All great discussions, and everyone should come to their own conclusions on these things. Once you find something that works, double down! shove!\nfor me writing is a tool for crystallizing thought. a snapshot of how I would describe a topic in my own words at that point in time. There are 3 ways I see this as useful:\nIt's powerful like how any picture at any point in time is. Like a picture, you can see progress (taking the delta of the snapshot and some future point). Plus, as you continue to write, you have a body of work to point to that monotonically increases1.\nDifferent from pictures, one of the biggest advantages I leverage is the ability to move …",
          "link": "https://froggy.bearblog.dev/writing/",
          "publishedOn": "2024-08-14T21:01:00.000Z",
          "wordCount": 753,
          "title": "writing thrusts me into uncharted territory",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://notes.jeddacp.com/are-blogging-challenges-worth-it/",
          "author": null,
          "description": "This was a question Loren posed in his post titled “Blogging Challenges: Are They Really Worth It?” with a reply post from Nick sharing a similar sentiment.\nLoren writes:\nI prefer reading spontaneous posts that are authentic, not those written solely to meet a daily challenge goal. As a reader, I can easily tell the difference.\nNick agrees, writing:\nRight? It's a cool idea, just not for me. I've read a ton of solid posts on that feed but I'm personally not great under pressure. Over the last couple weeks I've posted so many things I end up deleting a couple hours later because they felt rushed.\nI appreciate this perspective, but part of me also can’t help feeling slightly defensive, in my own right, for a few reasons.\nFirst, I have a somewhat strange attachment to these challenges, especia…",
          "link": "https://notes.jeddacp.com/are-blogging-challenges-worth-it/",
          "publishedOn": "2024-08-14T14:47:00.000Z",
          "wordCount": 1280,
          "title": "Are Blogging Challenges Worth It?",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1723646746.png"
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/boak-our-somrade-anarchist-internationalist-from-russia-vladislav-iurchenko-pirate-became-a-mar?v=1724165397",
          "author": null,
          "description": "Author: BOAK\nTitle: Our Сomrade, Anarchist-Internationalist from Russia, Vladislav Iurchenko (“Pirate”), Became a Martyr Defending the Peoples of Ukraine\nDate: August 19, 2024\nSource: Retrieved on 20th August 2024 from telegra.ph and t.me\n\n Another fighter became a martyr. On August 9, our comrade and anarchist-internationalist from Russia, Vladislav Iurchenko (nom de guerre “Pirate”), was killed in battle. He was 22 years old. Vladislav was part of the “Siberian Battalion” of the International Legion, and he was martyred in a fight during a landing operation on the Kinburn Spit. \n Before coming to Ukraine, Vladislav participated in actions of solidarity with anarchist and other anti-government prisoners. He fought against Russian fascism and imperialism. Knowing that anarchists in Ukraine…",
          "link": "https://theanarchistlibrary.org/library/boak-our-somrade-anarchist-internationalist-from-russia-vladislav-iurchenko-pirate-became-a-mar?v=1724165397",
          "publishedOn": "2024-08-20T14:49:57.000Z",
          "wordCount": 1326,
          "title": "BOAK - Our Сomrade, Anarchist-Internationalist from Russia, Vladislav Iurchenko (“Pirate”), Became a Martyr Defending the Peoples of Ukraine",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6978",
            "url": "https://theanarchistlibrary.org/library/boak-our-somrade-anarchist-internationalist-from-russia-vladislav-iurchenko-pirate-became-a-mar.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anarchists-the-hooligans-the-stingies-the-starved-people-and-the-bad-asses?v=1724088997",
          "author": null,
          "description": "Author: Anarchists\nTitle: The Hooligans, the Stingies, the Starved People and the Bad Asses\nDate: 1985\nNotes: This is a translation of a leaflet written in 1985 by anarchists frequenting the Chrysallida social space in Limassol, Cyprus.\nSource: https://movementsarchive.org/doku.php?id=en:leaflets:xrisalllida:kakakakathkia\n\n The football league is over; the mass rallies of July have also passed. The Cuéllar initiative froze, as usual, and everything indicated that Cypriot society would remain for about a month without mass spectacles to organize its boredom. \n And suddenly “chaos” erupts in Germasogeia. A new “fruit” for the “Cypriot reality”; and the hysteria of the occasion is analogous. The newspapers are shouting about hooligans, they are searching for the “brains” (in this place it see…",
          "link": "https://theanarchistlibrary.org/library/anarchists-the-hooligans-the-stingies-the-starved-people-and-the-bad-asses?v=1724088997",
          "publishedOn": "2024-08-19T17:36:37.000Z",
          "wordCount": 1479,
          "title": "Anarchists - The Hooligans, the Stingies, the Starved People and the Bad Asses",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7363",
            "url": "https://theanarchistlibrary.org/library/anarchists-the-hooligans-the-stingies-the-starved-people-and-the-bad-asses.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anonymous-a-friend-of-mine-or-a-friend-of-ours?v=1723997702",
          "author": null,
          "description": "Author: Anonymous\nTitle: A Friend of Mine or a Friend of Ours?\nSubtitle: An Essay On Vouching\nDate: 2024/08/15\nSource: https://unravel.noblogs.org/a-friend-of-mine-or-a-friend-of-ours-an-essay-on-vouching/\n\n Vouching means different things to different anarchists. For some, to vouch for a person means the vouchee is felt to be trustworthy and competent enough for an action. For others, vouching means that the voucher has concrete evidence of the trustworthiness and competence of the vouchee, and is willing to stake their reputation on that evidence. \n To agree on whether to vouch for someone or not, we need to be clear about what we mean by vouching. We propose three components of a vouch that might be helpful in discussing that meaning: trustworthiness, competence, and the voucher's reput…",
          "link": "https://theanarchistlibrary.org/library/anonymous-a-friend-of-mine-or-a-friend-of-ours?v=1723997702",
          "publishedOn": "2024-08-18T16:15:02.000Z",
          "wordCount": 2982,
          "title": "Anonymous - A Friend of Mine or a Friend of Ours?",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "12377",
            "url": "https://theanarchistlibrary.org/library/anonymous-a-friend-of-mine-or-a-friend-of-ours.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/margaret-killjoy-why-i-joined-the-industrial-workers-of-the-world?v=1723882411",
          "author": null,
          "description": "Author: Margaret Killjoy\nTitle: Why I Joined the Industrial Workers of the World\nDate: August 14, 2024\nSource: Retrieved on 17th August 2024 from margaretkilljoy.substack.com\n\n Back in probably 2004, maybe 2005, I was working in Portland, Oregon as a landscaper. It was a small crew, just three of us and our boss. Our boss was, for the most part, pretty cool. He didn’t work us to the bone. He was flexible about time off. He was down to call me Magpie. He paid us under the table. Sometimes he’d cancel work to go surfing. That kind of guy. \n In fact, after my first week of work, I told him: “hey I’m going to leave for about a month to go block roads in Southern Oregon to stop this old growth timber sale, maybe do some treesitting. When I come back, can I have my job back?” and he said yes, an…",
          "link": "https://theanarchistlibrary.org/library/margaret-killjoy-why-i-joined-the-industrial-workers-of-the-world?v=1723882411",
          "publishedOn": "2024-08-17T08:13:31.000Z",
          "wordCount": 2990,
          "title": "Margaret Killjoy - Why I Joined the Industrial Workers of the World",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "10542",
            "url": "https://theanarchistlibrary.org/library/margaret-killjoy-why-i-joined-the-industrial-workers-of-the-world.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/zhachev-anarchy-and-the-mythic-path?v=1723842478",
          "author": null,
          "description": "Author: Zhachev\nTitle: Anarchy and the Mythic Path\nDate: 08/09/2024\nSource: https://zhachev.substack.com/p/anarchy-and-the-mythic-path\n\n Fluctuations within a continuum can be generated from diverging narratives. Uncertain climes, alternative timelines. Chronoflipping, retroswitching, taleshifting. An alterverse created via timeforge. Terra incognita.\n Narratives serve the function of temporal modulators, unbound by the shackles of progress and linearity. Vectors of radivergence. Distorting, disrupting, and corrupting conventional chronologies, conduits to alternative realities proliferate with every shift in narrative azimuth. Each story is a potential rupture in the continuum of time, a machinic assemblage capable of bearing a plethora of parallel existences. Through an intricate tango b…",
          "link": "https://theanarchistlibrary.org/library/zhachev-anarchy-and-the-mythic-path?v=1723842478",
          "publishedOn": "2024-08-16T21:07:58.000Z",
          "wordCount": 1154,
          "title": "Zhachev - Anarchy and the Mythic Path",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6461",
            "url": "https://theanarchistlibrary.org/library/zhachev-anarchy-and-the-mythic-path.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/unsalted-red-flags-before-you-join-that-org?v=1723779932",
          "author": null,
          "description": "Author: Unsalted Counter Info\nTitle: Red Flags: Before You Join That Org…\nSubtitle: A Primer on Authoritarian & Vanguard Communist Groups & What You Can Do Instead\nDate: June 3, 2024\nSource: Retrieved on 10 August 2024 from unsalted.noblogs.org/files/2024/06/RedFlags_Web1.pdf\n\n\nIntro\n When we pay attention to the amount of injustice in the world, we find ourselves wanting to do something about it. And we don’t want to do just anything. We want to participate in what can most strategically stop those injustices. We need to organize together to confront what is killing us and the planet. \n If you go looking for others involved in this resistance work, you might stumble across some organizations that seem to have all the answers. They say they know exactly how to bring capitalism to its knees…",
          "link": "https://theanarchistlibrary.org/library/unsalted-red-flags-before-you-join-that-org?v=1723779932",
          "publishedOn": "2024-08-16T03:45:32.000Z",
          "wordCount": 5513,
          "title": "Unsalted Counter Info - Red Flags: Before You Join That Org…",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "163147",
            "url": "https://theanarchistlibrary.org/library/unsalted-red-flags-before-you-join-that-org.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/uploads/en/thumbnails/u-r-unsalted-red-flags-before-you-join-that-org-1.jpg.large.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/bill-templer-from-mutual-struggle-to-mutual-aid?v=1723779766",
          "author": null,
          "description": "Author: Bill Templer\nTitle: From Mutual Struggle to Mutual Aid\nSubtitle: Moving Beyond the Statist Impasse in Israel/Palestine\nDate: 2003\nSource: Borderlands volume 2 number 3, 2003. Retrieved from https://web.archive.org/web/20180123112424/http://www.borderlands.net.au/vol2no3_2003/templer_impasse.htm\n\nWhat about a no-state solution? Self determination for everyone, no borders, police, or soldiers. A right-of-return for both Jews and Palestinians. —Pirate Prentice (2002)\nThe regime that will succeed the nation-state will not be the fruit of preconception or social engineering, but of sociological and political imagination wielded through transformative actions. —Gustavo Esteva (2003)\nI Introduction: Reclaiming the Commons\n 1. Reinventing politics in Israel and Palestine means laying the g…",
          "link": "https://theanarchistlibrary.org/library/bill-templer-from-mutual-struggle-to-mutual-aid?v=1723779766",
          "publishedOn": "2024-08-16T03:42:46.000Z",
          "wordCount": 11897,
          "title": "Bill Templer - From Mutual Struggle to Mutual Aid",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "180281",
            "url": "https://theanarchistlibrary.org/library/bill-templer-from-mutual-struggle-to-mutual-aid.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/fury-of-a-rebel-poet?v=1723779574",
          "author": null,
          "description": "Author: David S. D’Amato\nTitle: Fury of a Rebel Poet\nSubtitle: The Anarchism of Joseph Déjacque\nDate: August 2, 2024\nSource: https://www.counterpunch.org/2024/08/02/fury-of-a-rebel-poet-the-anarchism-of-joseph-dejacque/\n\n The French firebrand Joseph Déjacque lived a short life defined by a wild and beautiful struggle against authority, a life of intense passion for freedom and genuine class war. Unlike many of the seminal figures of the anarchist movement, Déjacque was truly of the working class. Born in 1821, he was raised in Paris by a single mother, who had become a widow when he was very young, and he worked full time from the age of 12. His trade was house painting and wallpaper hanging, but as we shall see, he was an able polemicist and poet; his words were a shot of adrenaline to ra…",
          "link": "https://theanarchistlibrary.org/library/fury-of-a-rebel-poet?v=1723779574",
          "publishedOn": "2024-08-16T03:39:34.000Z",
          "wordCount": 2895,
          "title": "David S. D’Amato - Fury of a Rebel Poet",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "11448",
            "url": "https://theanarchistlibrary.org/library/fury-of-a-rebel-poet.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/antiauthoritarians-internationalists-minimal-contribution-for-communicating-to-the-turkish-cypr?v=1723779503",
          "author": null,
          "description": "Author: Antiauthoritarians-Internationalists\nTitle: Minimal Contribution for Communicating to the Turkish Cypriot Revolutionary Internationalists the Hypocrisy of The ‘Rapprochement’ Elite of the Greek Cypriot State Intellectuals and Social Patriots\nDate: 1989\nSource: https://movementsarchive.org/doku.php?id=en:leaflets:unclassified:antieksousiastes_epanaprosegisi\n\n Until today, we knew that the mechanisms of repression of the state and capital were the army, the police, the schools, the psychiatric hospitals. Now we know that along with them have been added the Greek Cypriot ‘rapprochement’ state intellectuals and social-patriots. How else could we explain the fact that these gentlemen invite representatives from all the supposedly re-reunificationist areas to such a meeting — for represe…",
          "link": "https://theanarchistlibrary.org/library/antiauthoritarians-internationalists-minimal-contribution-for-communicating-to-the-turkish-cypr?v=1723779503",
          "publishedOn": "2024-08-16T03:38:23.000Z",
          "wordCount": 1288,
          "title": "Antiauthoritarians-Internationalists - Minimal Contribution for Communicating to the Turkish Cypriot Revolutionary Internationalists the Hypocrisy of The ‘Rapprochement’ Elite of the Greek Cypriot State Intellectuals and Social Patriots",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6924",
            "url": "https://theanarchistlibrary.org/library/antiauthoritarians-internationalists-minimal-contribution-for-communicating-to-the-turkish-cypr.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/nvp-is-there-a-non-colonial-language-in-cyprus-and-if-yes-should-we-all-speak-eteo-cypriot?v=1723779471",
          "author": null,
          "description": "Author: nvp\nTitle: Is there a non-colonial language in Cyprus? And if yes, should we all speak Eteo-Cypriot?\nDate: 2017\nSource: https://movementsarchive.org/doku.php?id=en:digital:kontrasousta:kontrasousta_language_nvp\n\n No one can argue that language is not, at a certain level of analysis, a political tool. People in Cyprus intuitively know this, and that’s why I won’t go into the theory, but instead focus on the practical. \n Language is political, and we, as individuals and groups, are doing politics. Sometimes consciously, other times less so. This website was also created by a series of political decisions, some of which quite conscious (it is a website which doesn’t limit itself to one part of Cyprus, even though the default option is to segregate). It is, among other things, a spirit…",
          "link": "https://theanarchistlibrary.org/library/nvp-is-there-a-non-colonial-language-in-cyprus-and-if-yes-should-we-all-speak-eteo-cypriot?v=1723779471",
          "publishedOn": "2024-08-16T03:37:51.000Z",
          "wordCount": 2158,
          "title": "nvp - Is there a non-colonial language in Cyprus? And if yes, should we all speak Eteo-Cypriot?",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "8749",
            "url": "https://theanarchistlibrary.org/library/nvp-is-there-a-non-colonial-language-in-cyprus-and-if-yes-should-we-all-speak-eteo-cypriot.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/antifascists-on-the-expulsion-of-fascists-in-faneromeni?v=1723779406",
          "author": null,
          "description": "Author: Antifascists\nTitle: On the expulsion of fascists in Faneromeni\nDate: 2013\nSource: https://movementsarchive.org/doku.php?id=en:digital:unclassified:faneromeni_fasistes\n\n The provocative show which took place two weeks ago, by members of ELAM (who also have a 5-year temporary contract working for the Cypriot national army) wearing Golden Dawn t-shirts in a cafe in Faneromeni square in Nicosia, could only get a dynamic antifascist response. By the time they were spotted in the square, a lot of people isolated them and threw them away shouting antifascist songs and showing them efficiently that there is zero tolerance in neo-nazism expressions. Why did all this happen? Why did a group of people attacked people wearing Golden Dawn t-shirts? Isn’t it a democratic right for anyone to wear…",
          "link": "https://theanarchistlibrary.org/library/antifascists-on-the-expulsion-of-fascists-in-faneromeni?v=1723779406",
          "publishedOn": "2024-08-16T03:36:46.000Z",
          "wordCount": 965,
          "title": "Antifascists - On the expulsion of fascists in Faneromeni",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "5855",
            "url": "https://theanarchistlibrary.org/library/antifascists-on-the-expulsion-of-fascists-in-faneromeni.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/anonymous-get-a-job?v=1723779226",
          "author": null,
          "description": "Author: anonymous\nTitle: Get a Job!\nSubtitle: On the Usefulness of Jobs and Small Businessess for Illegalist Anarchists\nDate: 08/08/2024\nSource: https://unravel.noblogs.org/the-unemployment-problem/\n\n Anarchists sometimes need money: we need to pay our cell phone bills; buy bus tickets to the hopout; get enough money to buy the squat that we’re about to get evicted from. Some things are just hard to steal, like guns, or are only available online, like decent scanner radios or jamming equipment. \n Individualist and lifestyle anarchists hold their nose and do legitimate work just long enough to get what they need, aiming for enough money to comfortably hit the road, hit the hay, or hit the target. \n Socialist anarchists, on the other hand, are willing to engage in legitimate work, seeing it …",
          "link": "https://theanarchistlibrary.org/library/anonymous-get-a-job?v=1723779226",
          "publishedOn": "2024-08-16T03:33:46.000Z",
          "wordCount": 1902,
          "title": "anonymous - Get a Job!",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "11146",
            "url": "https://theanarchistlibrary.org/library/anonymous-get-a-job.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/mx-flow-buddhist-anarchism-theory-and-practice?v=1723741802",
          "author": null,
          "description": "Author: Mx. Flow\nTitle: Buddhist Anarchism: Theory and Practice\nSubtitle: A Vision for a Buddhist Anarchism\nDate: August 12, 2024\nSource: Retrieved on August 15th 2024 from dhammaflow.org\n\n “Is it possible to exercise rulership righteously: without killing and without instigating others to kill, without confiscating and without instigating others to confiscate, without sorrowing and without causing sorrow?” \n -The Buddha, SN 4.20 [1]\nIntroduction\n Buddhist Anarchism is a synthesis of Anarchism from Buddhist Religion. Buddhism is a religion over 2,500 years old that teaches people to free themselves from Dukkha (suffering, stress, unsatisfactoriness) through practicing Sila, Samadhi and Panya (Virtue, Concentration and Wisdom) and achieving nibbana (enlightenment, freedom from dukkha). Anar…",
          "link": "https://theanarchistlibrary.org/library/mx-flow-buddhist-anarchism-theory-and-practice?v=1723741802",
          "publishedOn": "2024-08-15T17:10:02.000Z",
          "wordCount": 6899,
          "title": "Mx. Flow - Buddhist Anarchism: Theory and Practice",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "26879",
            "url": "https://theanarchistlibrary.org/library/mx-flow-buddhist-anarchism-theory-and-practice.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/grandizo-munis-unions-against-revolution?v=1723704444",
          "author": null,
          "description": "Author: Grandizo Munis\nTitle: Unions Against Revolution\nDate: 1960\nNotes: Unions Against Revolution is a translation of a work by G. Munis written in 1960 and reprinted in France after the events of May 1968. The English version appearing here is from Internationalism No. 3. Black and Red, Detroit\nSource: Retrieved on August 11, 2024 from Black and Red Press PDF\n\n No contradiction can exist between the economic and the political aspects of a revolutionary conception, even supposing the clearest organic and functional demarcation between them. The same is true for any reactionary conception. Hence the present interpenetration, the agreement and collaboration between unions—economic organs —and political parties—ideological organs—gives us the key to understanding both, from whichever side o…",
          "link": "https://theanarchistlibrary.org/library/grandizo-munis-unions-against-revolution?v=1723704444",
          "publishedOn": "2024-08-15T06:47:24.000Z",
          "wordCount": 10176,
          "title": "Grandizo Munis - Unions Against Revolution",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "26900",
            "url": "https://theanarchistlibrary.org/library/grandizo-munis-unions-against-revolution.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/john-creaghe-correspondence?v=1723661187",
          "author": null,
          "description": "Author: John Creaghe\nTitle: Correspondence\nDate: November 1891\nNotes: Original Title: Creaghe, John, \"Correspondence\", in Commonweal, Vol. 7, No. 291, (London 1891) pp. 155\nSource: Retrieved on 14 August from https://www.marxists.org/history/international/social-democracy/commonweal/1890/index.htm\n\n Comrades of the 'Weal, \n I am very glad to see that you had so successful a meeting on the 11th. We had a very good one at Sheffield too though the attendance was small, it was very heartily enthusiastic, and our speakers were well received. \n It will probably be news for you that I have left Sheffield for Liverpool, where I hope to be able to settle down. The fact is, our paper dragged on but badly, we could never pay more than about the half of the cost, and we determined to stop it at least …",
          "link": "https://theanarchistlibrary.org/library/john-creaghe-correspondence?v=1723661187",
          "publishedOn": "2024-08-14T18:46:27.000Z",
          "wordCount": 1398,
          "title": "John Creaghe - Correspondence",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6795",
            "url": "https://theanarchistlibrary.org/library/john-creaghe-correspondence.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/john-creaghe-why-creaghe-won-t-pay-poor-rates?v=1723660629",
          "author": null,
          "description": "Author: John Creaghe\nTitle: Why Creaghe Won’t Pay Poor Rates!\nDate: September 1891\nNotes: Original Title: Creaghe, John, \"Why Creaghe Won’t Pay Poor Rates!\", in Commonweal, Vol. 7, No. 281, (London, 1891) pp. 113-4\nSource: Retrieved on 14 August from https://www.marxists.org/history/international/social-democracy/commonweal/1890/index.htm\n\nComrade Creaghe is doing some more practical propaganda, by refusing to pay poor rates. He has taken the opportunity to explain his views on the subject, in the Sheffield Independent. His letter is so good and interesting that we reprint the whole of it:\n To the Editor - I have been summoned to the Town Hall, to show cause why I have not paid and refuse to pay poor rate levied on me. My answer is in the first place that I do not wish to do anything that …",
          "link": "https://theanarchistlibrary.org/library/john-creaghe-why-creaghe-won-t-pay-poor-rates?v=1723660629",
          "publishedOn": "2024-08-14T18:37:09.000Z",
          "wordCount": 1675,
          "title": "John Creaghe - Why Creaghe Won’t Pay Poor Rates!",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7336",
            "url": "https://theanarchistlibrary.org/library/john-creaghe-why-creaghe-won-t-pay-poor-rates.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/john-creaghe-creaghe-s-speech-at-the-sheffield-police-court?v=1723659951",
          "author": null,
          "description": "Author: John Creaghe\nTitle: Creaghe's Speech at the Sheffield Police Court\nDate: August 1891\nNotes: Original Title: Creaghe, John, \"Creaghe’s Speech at the Sheffield Police Court\", in Commonweal, Vol. 7, No. 274, (London, 1891) pp. 85-6\nSource: Retrieved on 14 August from https://www.marxists.org/history/international/social-democracy/commonweal/1890/index.htm\n\nAs our readers may be interested in Comrade Creaghe's \"trial for libel\" at Sheffield, we quote his plucky speech in the police court, which we have taken from the report of the Sheffield Evening Telegraph and Star:\n Our Comrade said: “I wish to make a statement about the matter and leave it for you to decide whether you wish to dismiss it here. I think it was absurd that a number of people should have to come together and have to oc…",
          "link": "https://theanarchistlibrary.org/library/john-creaghe-creaghe-s-speech-at-the-sheffield-police-court?v=1723659951",
          "publishedOn": "2024-08-14T18:25:51.000Z",
          "wordCount": 2109,
          "title": "John Creaghe - Creaghe's Speech at the Sheffield Police Court",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "8468",
            "url": "https://theanarchistlibrary.org/library/john-creaghe-creaghe-s-speech-at-the-sheffield-police-court.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}