{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "86d9ddca83c600aa88d09a9cd01d58ac64149314",
          "author": "Danilo Poccia",
          "description": "Generate photorealistic images with exceptional detail. Enhance visuals effortlessly across industries with improved multi-subject prompts, stunning image quality, and impeccable typography.",
          "link": "https://aws.amazon.com/blogs/aws/stability-ais-best-image-generating-models-now-in-amazon-bedrock/",
          "publishedOn": "2024-09-04T17:01:57.000Z",
          "wordCount": 2261,
          "title": "Stability AI’s best image generating models now in Amazon Bedrock",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/09/04/StabilityAI-models-news-blog.png"
        },
        {
          "id": "31662511be8cd6f35550c899cca6ff0926eba21e",
          "author": "Taylor Jacobsen",
          "description": "The AWS Heroes program recognizes outstanding individuals who are making meaningful contributions within the AWS community. These technical experts generously share their insights, best practices, and innovative solutions to help others create efficiencies and build faster on AWS. Heroes are thought leaders who have demonstrated a commitment to empowering the broader AWS community through their […]",
          "link": "https://aws.amazon.com/blogs/aws/the-latest-aws-heroes-have-arrived-september-2024/",
          "publishedOn": "2024-09-04T16:36:23.000Z",
          "wordCount": 1502,
          "title": "The latest AWS Heroes have arrived – September 2024",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/10/AWS-Heroes-program_RGB_Social-blog.png"
        },
        {
          "id": "148be78c8c914b1e3dc764e8933faaf4e4bf8aad",
          "author": "Channy Yun (윤석찬)",
          "description": "Amazon Web Services (AWS) AI code assistant Amazon Q Developer named a Leader in Gartner's first Magic Quadrant for its Ability to Execute and Completeness of Vision, driving innovation across the software development lifecycle with enterprise-grade controls.",
          "link": "https://aws.amazon.com/blogs/aws/aws-named-as-a-leader-in-the-first-gartner-magic-quadrant-for-ai-code-assistants/",
          "publishedOn": "2024-09-03T21:48:08.000Z",
          "wordCount": 1654,
          "title": "AWS named as a Leader in the first Gartner Magic Quadrant for AI Code Assistants",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/09/03/Blog_AI_ML_Image2.png"
        },
        {
          "id": "4fb73ba1739dd770b73cc79b69696086e450955f",
          "author": "Esra Kayabali",
          "description": "With the arrival of September, AWS re:Invent 2024 is now 3 months away and I am very excited for the new upcoming services and announcements at the conference. I remember attending re:Invent 2019, just before the COVID-19 pandemic. It was the biggest in-person re:Invent with 60,000+ attendees and it was my second one. It was […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-aws-parallel-computing-service-amazon-ec2-status-checks-and-more-september-2-2024/",
          "publishedOn": "2024-09-02T17:42:42.000Z",
          "wordCount": 2169,
          "title": "AWS Weekly Roundup: AWS Parallel Computing Service, Amazon EC2 status checks, and more (September 2, 2024)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/09/02/AWS-WIR-default-AWSNEWS-2068.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": []
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps & Developer Productivity Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": []
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "ee6078e423b3fd64703d6132396bdc3f58b8887c",
          "author": "Tsahi Duek",
          "description": "Cloud native technologies empower organizations to build and run scalable applications in modern, dynamic environments. Among Cloud Native patterns, Containers, and Kubernetes are mainstream across multiple businesses. According to the Cloud Native Computing Foundation Annual Survey of 2022, 44% of respondents are already using containers for nearly all applications and business segments, and another 35% say containers are […]",
          "link": "https://aws.amazon.com/blogs/containers/optimize-log-management-for-amazon-eks-with-amazon-fsx-for-netapp-ontap/",
          "publishedOn": "2024-09-03T23:01:10.000Z",
          "wordCount": 3474,
          "title": "How to optimize log management for Amazon EKS with Amazon FSx for NetApp ONTAP",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/09/03/Featured-images-for-Containers-Blog-6-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=332696",
          "author": "Yoav Litvin",
          "description": "[caption id=\"attachment_332697\" align=\"alignnone\" width=\"680\"] Image by Emad El Byed.[/caption]\nThe most significant recent escalation in the ongoing Zionist real estate project, enabled by apartheid and genocide of the Palestinian people, occurred on October 7th, 2023, when Hamas fighters broke through Gaza’s prison fence, carrying out a bloody incursion on Israeli military installations and border towns. Since, the Israel “Defense” Forces (IDF) have engaged in the offensive flattening of Gaza, destruction of its infrastructure, extensive land seizure and elimination, torture and expulsion of its Palestinian population. More\nThe post From ‘Defense’ to Destruction: The Evolution of Zionist Aggression appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/05/from-defense-to-destruction-the-evolution-of-zionist-aggression/",
          "publishedOn": "2024-09-05T06:07:03.000Z",
          "wordCount": null,
          "title": "From ‘Defense’ to Destruction: The Evolution of Zionist Aggression",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332630",
          "author": "Ramzy Baroud",
          "description": "The Israeli war on Gaza has become a war on Palestinian children. This was as true on October 7 as it is today. More\nThe post War on Children – Gaza Kids Are Unvaccinated, Hungry and Orphaned  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/05/war-on-children-gaza-kids-are-unvaccinated-hungry-and-orphaned/",
          "publishedOn": "2024-09-05T06:00:36.000Z",
          "wordCount": null,
          "title": "War on Children – Gaza Kids Are Unvaccinated, Hungry and Orphaned",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332437",
          "author": "Bruce E. Levine",
          "description": "In the U.S. in 2022, 49,476 people died by suicide, and there were approximately 1.6 million suicide attempts. Not included in suicide statistics is the even more common U.S. “death of despair” of drug overdose death, numbering 107,941 in 2022. While most of us are not attempting to kill our pain in a manner that puts us in the emergency room or the morgue, the majority of Americans are less dramatically trying to disconnect from painful lives. More\nThe post The U.S. Disconnecting & Numbing Epidemic: The Culprit and Our Options appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/05/the-u-s-disconnecting-numbing-epidemic-the-culprit-and-our-options/",
          "publishedOn": "2024-09-05T06:00:25.000Z",
          "wordCount": null,
          "title": "The U.S. Disconnecting & Numbing Epidemic: The Culprit and Our Options",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332621",
          "author": "Victor Grossman",
          "description": "Is the AfD a fascist party? Björn Höcke, its boss in Thuringia, one of its three best-known national leaders and its main rabble-rouser, has never concealed his admiration for Germany’s days of swastika glory. He was recently fined for shouting the forbidden Nazi stormtrooper slogan “Alles für Deutschland” to a mob of tough-looking supporters. So at his next rally he shouted only ”Alles für…” and let them add the missing word. Openly racist and viciously anti-immigrant, his party pushed most other parties in a similar direction – to keep their voters. But it kept on growing, despite countless organized anti-AfD rallies and marches. More\nThe post Eastern Germany’s Election Trimmings appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/05/eastern-germanys-election-trimmings/",
          "publishedOn": "2024-09-05T05:59:38.000Z",
          "wordCount": null,
          "title": "Eastern Germany’s Election Trimmings",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332442",
          "author": "Sanford Kelson",
          "description": "I was introduced to the Gaza Flotilla by Bob Suberi, who was born in America, descended from Yemeni Jewish parents and has dual citizenship with Israel. He lives near St Louis. Bob has been on Gaza Flotillas in the past and currently is serving as a volunteer ‘observer’ in the West Bank in an effort  More\nThe post The Handala Sails the Mediterranean Sea to Breach the Illegal Israeli Siege of Gaza and to Deliver Food, Medicine and Medical Supplies appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/05/the-handala-sails-the-mediterranean-sea-to-breach-the-illegal-israeli-siege-of-gaza-and-to-deliver-food-medicine-and-medical-supplies/",
          "publishedOn": "2024-09-05T05:56:39.000Z",
          "wordCount": null,
          "title": "The Handala Sails the Mediterranean Sea to Breach the Illegal Israeli Siege of Gaza and to Deliver Food, Medicine and Medical Supplies",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332707",
          "author": "David Rosen",
          "description": "After nearly a century, the war against marijuana is ending.  Four years after the 18th Amendment was repealed and Prohibition ended in 1933, Congress adopted the Marihuana Tax Act on August 2, 1937; in the 1930s, marijuana was spelled “marihuana.”  It made the possession and sale of marijuana illegal. On September 1, 2024, former president Donald Trump came out  More\nThe post Marijuana: Not an Issue in the 2025 Election appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/05/marijuana-not-an-issue-in-the-2025-election/",
          "publishedOn": "2024-09-05T05:55:18.000Z",
          "wordCount": null,
          "title": "Marijuana: Not an Issue in the 2025 Election",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332709",
          "author": "Kenn Orphan",
          "description": "A mother sits at the bedside of her baby girl, who appears more like a skeleton than a living human child. A team of rescuers frantically dig through the rubble of a bombed home, hoping to find any sign of life from within. They find a cat meowing weakly. She is covered in dust, her  More\nThe post Witness to a Nightmare appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/05/witness-to-a-nightmare/",
          "publishedOn": "2024-09-05T05:55:05.000Z",
          "wordCount": null,
          "title": "Witness to a Nightmare",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332706",
          "author": "Thomas Knapp",
          "description": "How many times have you casually mentioned buying, say, new curtains to your spouse, then found yourself bombarded with ads for window treatments the next time you opened a new browser tab on your computer? How many times has that kind of thing left you assuming that your phone, smart speaker, etc. are listening in  More\nThe post There’s Nothing Really New About “Active Listening” appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/05/theres-nothing-really-new-about-active-listening/",
          "publishedOn": "2024-09-05T05:54:32.000Z",
          "wordCount": null,
          "title": "There’s Nothing Really New About “Active Listening”",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332537",
          "author": "John Carter",
          "description": "The Aspen Decline What will our forests in the west be like in fall without those golden yellow leaves shining in the sun? Aspen forests in the Intermountain West support levels of biodiversity only exceeded by riparian (stream) communities. In this time of Climate Breakdown, aspen have been declining due to drought and temperature stress,  More\nThe post Climate Breakdown: Losing Our Aspen Forests in the West appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/05/climate-breakdown-losing-our-aspen-forests-in-the-west/",
          "publishedOn": "2024-09-05T05:45:11.000Z",
          "wordCount": null,
          "title": "Climate Breakdown: Losing Our Aspen Forests in the West",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332530",
          "author": "Dean Baker",
          "description": "Peter Coy had a somewhat bizarre column in the New York Times this week warning us that even though we have gotten rid of most of the pandemic inflation with little rise in unemployment, “any further decline in inflation may not be as painless.” The column highlights a new paper by Gauti Eggertsson, one of  More\nThe post In the Battle Against Inflation, We’ve Already Gone the Last Mile appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/05/in-the-battle-against-inflation-weve-already-gone-the-last-mile/",
          "publishedOn": "2024-09-05T05:11:41.000Z",
          "wordCount": null,
          "title": "In the Battle Against Inflation, We’ve Already Gone the Last Mile",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332666",
          "author": "Josh Frank",
          "description": "The post  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/04/332666/",
          "publishedOn": "2024-09-04T17:36:27.000Z",
          "wordCount": null,
          "title": "Untitled",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332535",
          "author": "Brian Mier",
          "description": "Millions of Brazilians woke up on August 31 in a country without X, after the Supreme Court ordered the national telecommunications agency to block the social media platform. This move culminated over a year of X's refusal to follow Brazil's telecommunications laws, particularly those requiring deplatforming of suspects in internet crime investigations. In a single day, X lost 22 million users, while alternative platform Blue Sky gained 2 million new Brazilian users in just three days. The order to ban the platform initially came from Supreme Court Minister Alexandre de Moraes, a figure vilified by the Bolsonaros and the international far right, and was ratified by a 5-0 vote in the Supreme Court's 1st working group three days later. More\nThe post Inside Brazil’s X Ban: How Elon Musk Started–and lost–a Fight With Brazil’s Judiciary appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/04/inside-brazils-x-ban-how-elon-musk-started-and-lost-a-fight-with-brazils-judiciary/",
          "publishedOn": "2024-09-04T06:00:23.000Z",
          "wordCount": null,
          "title": "Inside Brazil’s X Ban: How Elon Musk Started–and lost–a Fight With Brazil’s Judiciary",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332379",
          "author": "Jacques R. Pauwels",
          "description": "The Eiffel Tower was unquestionably the focal point and the superstar of the recent Olympic Games in Paris. That is understandable, since Gustave Eiffel’s master piece has been the emblem of the city for a long time. However, the tower is also a symbol of the wealth and power of the bourgeoisie, the “capitalist class”, a patriciate whose exclusive ranks also happen to include the ladies and gentlemen of the International Olympic Committee (IOC). A soupcon of history may help us to understand the centrality the tower in the recent Olympic extravaganza in the “city of light”. More\nThe post Paris Olympics 2024: Celebration Capitalism Around the Eiffel Tower appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/04/paris-olympics-2024-celebration-capitalism-around-the-eiffel-tower/",
          "publishedOn": "2024-09-04T05:59:23.000Z",
          "wordCount": null,
          "title": "Paris Olympics 2024: Celebration Capitalism Around the Eiffel Tower",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332436",
          "author": "Dean Baker",
          "description": "In the last-half century, productivity has outpaced the growth of real compensation for the median worker by more than 40 percent. This means that if workers’ pay had kept pace with productivity, as it did in the three decades after World War II, it would be roughly 40 percent higher than it is today. This  More\nThe post Diverting Class Warfare Into Generational Warfare appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/04/diverting-class-warfare-into-generational-warfare/",
          "publishedOn": "2024-09-04T05:58:36.000Z",
          "wordCount": null,
          "title": "Diverting Class Warfare Into Generational Warfare",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332372",
          "author": "Kathleen Wallace",
          "description": "It’s been a pretty rough last year or so for those in the reality-based community here in the United States. I’m sure we’ve had some mental health casualties; watching the international as well as the local play out in the fashion that it has—well, that hasn’t been exactly conducive for sanity. Even the very nature  More\nThe post Lethal Joy Dances with Lethal Idiocy appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/04/lethal-joy-dances-with-lethal-idiocy/",
          "publishedOn": "2024-09-04T05:58:08.000Z",
          "wordCount": null,
          "title": "Lethal Joy Dances with Lethal Idiocy",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332563",
          "author": "Stewart Lawrence",
          "description": "Some conservatives think they’ve found a slick new way to keep straying African-American voters from returning to the Democratic fold:  Attack the Biden administration’s proposed ban on menthol cigarettes as a crackdown on African-American consumer “rights” and “freedom” – and an assault on Black “pride.” It sounds far-fetched – isn’t cigarette smoking a major public health  More\nThe post Big Tobacco Seizes Upon Biden’s Menthol Cigarette Ban to Try to Drive a Wedge Between Harris and Black Voters    appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/04/big-tobacco-seizes-upon-bidens-menthol-cigarette-ban-to-try-to-drive-a-wedge-between-harris-and-black-voters/",
          "publishedOn": "2024-09-04T05:55:55.000Z",
          "wordCount": null,
          "title": "Big Tobacco Seizes Upon Biden’s Menthol Cigarette Ban to Try to Drive a Wedge Between Harris and Black Voters",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332600",
          "author": "Yahia Lababidi",
          "description": "Habibti Tata, Much as I miss you, I’m glad that you did not live to see the latest catastrophe Palestinians are enduring. Still, I can’t help but wonder what you would have made of this latest Nakba. We discussed about many things over the years — your colorful life, wisdom you gleaned from it, insights into human  More\nThe post Letter to My Departed Palestinian Grandmother appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/04/letter-to-my-departed-palestinian-grandmother/",
          "publishedOn": "2024-09-04T05:55:38.000Z",
          "wordCount": null,
          "title": "Letter to My Departed Palestinian Grandmother",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332565",
          "author": "Nilantha Ilangamuwa",
          "description": "In this talk, Alexander Vesely, grandson of the legendary psychiatrist Viktor Frankl, provides an illuminating exploration of his grandfather’s profound legacy. Viktor Frankl, a Holocaust survivor and founder of logotherapy, is best known for his seminal work, Man’s Search for Meaning. This influential book, born from Frankl’s harrowing experiences in Auschwitz, offers a powerful testament  More\nThe post Victor Frankl’s Legacy: My Talk with Alexander Vesely appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/04/victor-frankls-legacy-my-talk-with-alexander-vesely/",
          "publishedOn": "2024-09-04T05:55:26.000Z",
          "wordCount": null,
          "title": "Victor Frankl’s Legacy: My Talk with Alexander Vesely",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332560",
          "author": "M. Reza Behnam",
          "description": "During her acceptance speech in August at the Democratic National Convention, Vice President Kamala Harris heaped praise on her mother.  She spoke proudly of a childhood full of promise, forged by a single mother who taught her to dream big. As Harris paid homage to her mother, I thought of how Israel has done everything in  More\nThe post On the Frontline of Resistance: The Women of Palestine appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/04/on-the-frontline-of-resistance-the-women-of-palestine/",
          "publishedOn": "2024-09-04T05:55:25.000Z",
          "wordCount": null,
          "title": "On the Frontline of Resistance: The Women of Palestine",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332556",
          "author": "Ralph Nader",
          "description": "No matter what his advisers caution, Donald Trump cannot resist giving negative, insulting nicknames to his opponents and critics. Nor can the mass media resist reprinting them in CAPITAL LETTERS, without giving the named persons a right of reply. He gets a free ride day after day, month after month, year after year. Trump and  More\nThe post Wrecking America and the Purpose of Nicknames for Trump appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/04/wrecking-america-and-the-purpose-of-nicknames-for-trump/",
          "publishedOn": "2024-09-04T05:55:20.000Z",
          "wordCount": null,
          "title": "Wrecking America and the Purpose of Nicknames for Trump",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332567",
          "author": "Binoy Kampmark",
          "description": "Between September 11 and 13, the Melbourne Convention and Exhibition Centre (MCEC) will play host to a bazaar of networking and deal making as part of a show that really ought to be called The Merchants of Death Down Under.  And the times for these merchants are positively bullish, given that total global military expenditure exceeded US$2.4 trillion  More\nThe post Killing Bazaars: The Land Forces Expo Down Under appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/04/killing-bazaars-the-land-forces-expo-down-under/",
          "publishedOn": "2024-09-04T05:54:51.000Z",
          "wordCount": null,
          "title": "Killing Bazaars: The Land Forces Expo Down Under",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332581",
          "author": "Judith Deutsch",
          "description": "The definition of insanity is doing the same thing over and over again and expecting a different result” Attributed to Einstein This is a short communication about a huge topic. The focus is the obvious steps to end the Gaza genocide, Israel’s Final Solution. The current Israeli protest is not about the genocide but about the Hannibal  More\nThe post Stop Genocide: Israel’s Final Solution to the Palestine Problem appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/04/stop-genocide-israels-final-solution-to-the-palestine-problem/",
          "publishedOn": "2024-09-04T05:52:20.000Z",
          "wordCount": null,
          "title": "Stop Genocide: Israel’s Final Solution to the Palestine Problem",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332395",
          "author": "Peter Bach",
          "description": "As many people know, ghosting began as a dating term meaning abruptly cutting someone off without warning or explanation. It is not peculiar to dating either as there is professional ghosting too. I hope not to have ghosted people, as I know it can be done unconsciously. It is dispiriting when people don’t get back  More\nThe post Letter from London: Ghosting Me, Ghosting You appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/04/letter-from-london-ghosting-me-ghosting-you/",
          "publishedOn": "2024-09-04T05:50:36.000Z",
          "wordCount": null,
          "title": "Letter from London: Ghosting Me, Ghosting You",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332552",
          "author": "Evaggelos Vallianatos",
          "description": "From the early beginnings of NATO, when America recruited Greece and Turkey, American leaders insisted that Greeks and Turks shake hands. NATO was too important. But it was impossible for the political leaders of Greece to shake hands with the leaders of Turkey whose hands were stained in Greek blood. Turkey is an alien country  More\nThe post Uprooting: Turkey, Greece, Cyprus and American Nuclear Weapons appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/04/uprooting/",
          "publishedOn": "2024-09-04T05:44:06.000Z",
          "wordCount": null,
          "title": "Uprooting: Turkey, Greece, Cyprus and American Nuclear Weapons",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332595",
          "author": "Mike Garrity",
          "description": "There’s a boiling controversy right now over the future of hundreds of thousands of acres of Forest Service lands abutting Yellowstone National Park and comprising the core of the Greater Yellowstone Ecosystem. These lands are primarily in the Gallatin and Madison Ranges which are facing increasing pressures from a variety of development and recreational pressures.  More\nThe post First Things First: Designate all Greater Yellowstone Wilderness Study Areas as Wilderness appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/04/first-things-first-designate-all-greater-yellowstone-wilderness-study-areas-as-wilderness/",
          "publishedOn": "2024-09-04T05:28:55.000Z",
          "wordCount": null,
          "title": "First Things First: Designate all Greater Yellowstone Wilderness Study Areas as Wilderness",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332264",
          "author": "Melvin Goodman",
          "description": "The Biden administration’s decision to continue funding the notorious Netzah Yehuda battalion, an ultra-Orthodox unit that operates on the West Bank, is the latest indication that the United States is unwilling to take any steps to counter Israel’s genocidal campaign against the Palestinians.  The funding of the battalion marks a major defeat for the human  More\nThe post Israeli Treatment of Palestinians Remains Unchanged Over 75 Years appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/03/israeli-treatment-of-palestinians-remains-unchanged-over-75-years/",
          "publishedOn": "2024-09-03T06:02:07.000Z",
          "wordCount": null,
          "title": "Israeli Treatment of Palestinians Remains Unchanged Over 75 Years",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332284",
          "author": "Sam Pizzigati",
          "description": "Over 3,000 migrants fleeing from poverty and conflict, the Council on Foreign Relations recently noted, died last year trying to cross the Mediterranean into Europe. Those deaths made barely a ripple in most of the world’s major news media. But this summer one single tragedy on the Mediterranean has been making globs of global headlines. More\nThe post On Our Climate-Challenged Planet, Only Some Deaths Seem to Matter appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/03/on-our-climate-challenged-planet-only-some-deaths-seem-to-matter/",
          "publishedOn": "2024-09-03T05:59:43.000Z",
          "wordCount": null,
          "title": "On Our Climate-Challenged Planet, Only Some Deaths Seem to Matter",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332438",
          "author": "Robert Jensen",
          "description": "Many political and military battles have been sparked by fundamentalism, whether religious, national, or economic. Those fundamentalisms remain strong across the world, requiring vigilance from those who embrace political pluralism and celebrate human diversity. But one other fundamentalism today, common on the left and right, is even more dangerous: technological fundamentalism. While those other forces  More\nThe post Ironic and Tragic: Technological Fundamentalism and Our Fear of Limits appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/03/ironic-and-tragic-technological-fundamentalism-and-our-fear-of-limits/",
          "publishedOn": "2024-09-03T05:56:44.000Z",
          "wordCount": null,
          "title": "Ironic and Tragic: Technological Fundamentalism and Our Fear of Limits",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332495",
          "author": "Binoy Kampmark",
          "description": "Despite much grandstanding in the Biden administration about halting specific arms shipments to Israel over feigned concerns about how they might be used (inflicting death is the expected form), US military supplies have been restored with barely a murmur.  In a report in Haaretz on August 29, a rush of weapons to Israel has been noticed since the end of  More\nThe post A Return to Form: Expediting US Arms to Israel appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/03/a-return-to-form-expediting-us-arms-to-israel/",
          "publishedOn": "2024-09-03T05:55:19.000Z",
          "wordCount": null,
          "title": "A Return to Form: Expediting US Arms to Israel",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332492",
          "author": "Thomas Knapp",
          "description": "“In Florida,” former and possibly future US president Donald Trump writes on Truth Social, “like so many other States that have already given their approval, personal amounts of marijuana will be legalized for adults with Amendment 3. Whether people like it or not, this will happen through the approval of the Voters, so it should  More\nThe post Marijuana: Your Permission Isn’t Really Necessary appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/03/marijuana-your-permission-isnt-really-necessary/",
          "publishedOn": "2024-09-03T05:55:12.000Z",
          "wordCount": null,
          "title": "Marijuana: Your Permission Isn’t Really Necessary",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": [
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=31531",
          "author": "Jaison R. Abel, Richard Deitz, Natalia Emanuel, and Benjamin Hyman",
          "description": "The rapid rise in Artificial Intelligence (AI) has the potential to dramatically change the labor market, and indeed possibly even the nature of work itself. However, how firms are adjusting their workforces to accommodate this emerging technology is not yet clear. Our August regional business surveys asked manufacturing and service firms special topical questions about their use of AI, and how it is changing their workforces. Most firms that report expected AI use in the next six months plan to retrain their workforces, with far fewer reporting adjustments to planned headcounts.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/09/ai-and-the-labor-market-will-firms-hire-fire-or-retrain/",
          "publishedOn": "2024-09-04T12:30:00.000Z",
          "wordCount": 4339,
          "title": "AI and the Labor Market: Will Firms Hire, Fire, or Retrain?",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/08/LSE_2024_artificial-intelligence_hyman_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=31494",
          "author": "Marco Del Negro",
          "description": "Economic surveys are very popular these days and for a good reason. They tell us how the folks being surveyed—professional forecasters, households, firm managers—feel about the economy. So, for instance, the New York Fed’s Survey of Consumer Expectations (SCE) website displays an inflation uncertainty measure that tells us households are more uncertain about inflation than they were pre-COVID, but a bit less than they were a few months ago. The Philadelphia Fed’s Survey of Professional Forecasters (SPF) tells us that forecasters believed last May that there was a lower risk of negative 2024 real GDP growth than there was last February. The question addressed in this post is: Does this information actually have any predictive content? Specifically, I will focus on the SPF and ask: When professional forecasters indicate that their uncertainty about future output or inflation is higher, does that mean that output or inflation is actually becoming more uncertain, in the sense that the SPF will have a harder time predicting these variables?",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/09/can-professional-forecasters-predict-uncertain-times/",
          "publishedOn": "2024-09-04T11:00:00.000Z",
          "wordCount": 4118,
          "title": "Can Professional Forecasters Predict Uncertain Times?",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/08/LSE_2024_forecasting-uncertainty_delnegro_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=31528",
          "author": "Marco Del Negro",
          "description": "The post-COVID years have not been kind to professional forecasters, whether from the private sector or policy institutions: their forecast errors for both output growth and inflation have increased dramatically relative to pre-COVID (see Figure 1 in this paper). In this two-post series we ask: First, are forecasters aware of their own fallibility? That is, when they provide measures of the uncertainty around their forecasts, are such measures on average in line with the size of the prediction errors they make? Second, can forecasters predict uncertain times? That is, does their own assessment of uncertainty change on par with changes in their forecasting ability? As we will see, the answer to both questions sheds light of whether forecasters are rational. And the answer to both questions is “no” for horizons longer than one year but is perhaps surprisingly “yes” for shorter-run forecasts.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/09/are-professional-forecasters-overconfident/",
          "publishedOn": "2024-09-03T11:00:00.000Z",
          "wordCount": 4680,
          "title": "Are Professional Forecasters Overconfident?",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/08/LSE_2024_overconfidence_delnegro_460.jpg"
        }
      ]
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45582",
          "author": "deanbaker1",
          "description": "from Dean Baker In the last-half century, productivity has outpaced the growth of real compensation for the median worker by more than 40 percent. This means that if workers’ pay had kept pace with productivity, as it did in the three decades after World War II, it would be roughly 40 percent higher than it is today. […]",
          "link": "https://rwer.wordpress.com/2024/09/03/diverting-class-warfare-into-generational-warfare/",
          "publishedOn": "2024-09-03T15:13:46.000Z",
          "wordCount": 4393,
          "title": "Diverting class warfare into generational warfare",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45579",
          "author": "Lars Syll",
          "description": "from Lars Syll According to Keynes, financial crises are a recurring feature of our economy and are linked to its fundamental financial instability: It is of the nature of organised investment markets, under the influence of purchasers largely ignorant of what they are buying and of speculators who are more concerned with forecasting the next […]",
          "link": "https://rwer.wordpress.com/2024/08/30/casino-capitalism/",
          "publishedOn": "2024-08-30T10:40:58.000Z",
          "wordCount": 4884,
          "title": "Casino capitalism",
          "imageUrl": "https://i0.wp.com/static.guim.co.uk/sys-images/Guardian/Pix/pictures/2009/8/3/1249340331099/04.08.09-Martin-Rowson-on-005.jpg"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=277912",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics; Kamala's Democrat prep;  Collard greens and code switching.;  Clean air in the schools? Lol no.;   H5N1 reassortment in Cambodia ~",
          "link": "https://www.nakedcapitalism.com/2024/09/200pm-water-cooler-9-4-2024.html",
          "publishedOn": "2024-09-04T18:00:39.000Z",
          "wordCount": 13116,
          "title": "2:00PM Water Cooler 9/4/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/rcp_2024-08-30.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277616",
          "author": "Yves Smith",
          "description": "Off to the fundraiser races! Please remember that Naked Capitalism is a unique and valuable site and support us generously!",
          "link": "https://www.nakedcapitalism.com/2024/09/naked-capitalism-fundraiser-2024-your-sanity-guide-as-leaders-live-dangerously.html",
          "publishedOn": "2024-09-04T16:03:45.000Z",
          "wordCount": 5099,
          "title": "Naked Capitalism Fundraiser 2024:  Your Sanity Guide as  Leaders Live Dangerously",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/gambling.jpeg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277749",
          "author": "Yves Smith",
          "description": "2024 asked a lot of us and we delivered! Can you dig deep to support our work so we can do even more you in the upcoming year?",
          "link": "https://www.nakedcapitalism.com/2024/09/fundraiser-2024-what-we-did-for-you-in-the-past-year.html",
          "publishedOn": "2024-09-04T16:02:46.000Z",
          "wordCount": 4439,
          "title": "Fundraiser 2024: What We Did for You in the Past Year",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277905",
          "author": "Yves Smith",
          "description": "A reminder of how Biden and Harris are complicit in the continuation of the war in Gaza and escalation in the West Bank.",
          "link": "https://www.nakedcapitalism.com/2024/09/biden-harris-and-the-brutal-truth-of-dead-hostages-in-gaza.html",
          "publishedOn": "2024-09-04T13:38:01.000Z",
          "wordCount": 7611,
          "title": "Biden, Harris, and the Brutal Truth of Dead Hostages in Gaza",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277879",
          "author": "Conor Gallagher",
          "description": "Two parties which oppose Project Ukraine make major gains. Is anyone listening?",
          "link": "https://www.nakedcapitalism.com/2024/09/whats-next-for-germany-after-sundays-elections-show-major-backlash-against-status-quo.html",
          "publishedOn": "2024-09-04T13:00:11.000Z",
          "wordCount": 8920,
          "title": "What’s Next for Germany After Sunday’s Elections Show Major Backlash Against Status Quo?",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/Screenshot-2024-09-04-at-11.43.21 AM-1024x506.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277824",
          "author": "Yves Smith",
          "description": "Our trumpeting daily links: giant NYC pigeon, tube tying doubts? non-recycled plastic, Xi protest scuffle, more Germany econ doubts, DoJ v. Sinwar, Ukraine cabinet shake-up, facial ID company fined, Trump v. press, Kamala collard prep questioned, Microsoft AI doubts, dining alone",
          "link": "https://www.nakedcapitalism.com/2024/09/links-9-4-2024.html",
          "publishedOn": "2024-09-04T10:59:08.000Z",
          "wordCount": 17046,
          "title": "Links 9/4/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-04-at-4.42.41-PM.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277874",
          "author": "Yves Smith",
          "description": "An attempt by the Wall Street Journal to mine data on immigration falls short by not providing strong enough caveats.",
          "link": "https://www.nakedcapitalism.com/2024/09/wall-street-journal-tries-to-analyze-not-great-data-on-us-immigration-generating-reader-pushback.html",
          "publishedOn": "2024-09-04T10:15:19.000Z",
          "wordCount": 6022,
          "title": "Wall Street Journal Tries to Analyze Not-Great Data on US Immigration, Generating Reader Pushback",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-04-at-5.03.45-PM-1024x978.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277859",
          "author": "Yves Smith",
          "description": "The Nasdaq Composite dropped 3.3% yesterday.  If the tech stock index declines another 6.7%, it’ll be back to November 2021.",
          "link": "https://www.nakedcapitalism.com/2024/09/bloodletting-in-semiconductor-stocks-kicks-off-september-nvidia-11-7-regular-late-trading-stock-market-cap-drops-by-half-a-tesla.html",
          "publishedOn": "2024-09-04T08:04:04.000Z",
          "wordCount": 4539,
          "title": "Bloodletting in Semiconductor Stocks Kicks Off September: Nvidia -11.7% Regular & Late Trading, Stock Market Cap Drops by Half a Tesla",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-04-at-2.41.27-PM.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277832",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics; The Democrat debate; Kamala's staff; McDonalds store bans masks; Florida real estate ~",
          "link": "https://www.nakedcapitalism.com/2024/09/200pm-water-cooler-9-3-2024.html",
          "publishedOn": "2024-09-03T18:00:12.000Z",
          "wordCount": 17463,
          "title": "2:00PM Water Cooler 9/3/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/rcp_2024-08-30.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277821",
          "author": "Yves Smith",
          "description": "Gee, even super-rich kids have trouble deciding what they want to be when they grow up.",
          "link": "https://www.nakedcapitalism.com/2024/09/who-are-the-global-super-rich-of-tomorrow-we-interviewed-teens-at-one-of-the-worlds-most-expensive-schools-to-find-out.html",
          "publishedOn": "2024-09-03T13:55:26.000Z",
          "wordCount": 3674,
          "title": "Who Are the Global Super-Rich of Tomorrow? We Interviewed Teens at One of the World’s Most Expensive Schools to Find Out",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "10dR1e1P8WbOojN0JGTPOp",
          "author": "Mike Conlow",
          "description": "On September 3, 2024, the White House published a report on Internet routing security. We’ll talk about what that means and how you can help.",
          "link": "https://blog.cloudflare.com/white-house-routing-security",
          "publishedOn": "2024-09-02T23:00:00.000Z",
          "wordCount": 3418,
          "title": "Making progress on routing security: the new White House roadmap",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/114uY9j6317ypdHHPhMKHR/27a19c1738472d8c1b0c8970b7f504ba/Making_progress_on_routing_security-_the_new_White_House_roadmap-OG.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": [
        {
          "id": "https://slack.engineering/?p=16945",
          "author": "Kaili Liang",
          "description": "“What are your goals for this quarter?” It’s the question every manager asks, and one that often prompts a flurry of technical objectives and project milestones. Jumping into this internship, I knew my answer. I wanted to practice making informed decisions on my project, since that was one of the challenges I faced last summer. […]\nThe post Engineering with Empathy: My Journey to Understanding the User Experience appeared first on Slack Engineering.",
          "link": "https://slack.engineering/engineering-with-empathy-my-journey-to-understanding-the-user-experience/",
          "publishedOn": "2024-08-30T22:54:41.000Z",
          "wordCount": 2202,
          "title": "Engineering with Empathy: My Journey to Understanding the User Experience",
          "imageUrl": "https://slack.engineering/wp-content/uploads/sites/7/2024/08/featured_image.png"
        }
      ]
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": []
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=21669",
          "author": null,
          "description": "[...]\nRead More...\nThe post Read Meta’s 2024 Sustainability Report appeared first on Engineering at Meta.",
          "link": "https://sustainability.atmeta.com/2024-sustainability-report/",
          "publishedOn": "2024-09-04T17:04:59.000Z",
          "wordCount": 2114,
          "title": "Read Meta’s 2024 Sustainability Report",
          "imageUrl": "https://sustainability.atmeta.com/wp-content/uploads/2024/08/kayak.png"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=41450153",
          "author": "teruakohatu",
          "description": "> In his many interviews with U.S. media, he portrays the court cases and legal judgements as a crusade against the Internet Archive and all librarians. It's not. It's the logical outcome of one man's seemingly fanatical conviction against the law and the people who work very hard to bring new books into being.\nIf IA had won, IA would be hailed as a cultural hero. They hit and they missed. Claiming Brewster Kahle is against \"the people who work very hard to bring new books into being\" is unfair. The copyright goalposts have moved so far past where they were originally, the people who work very hard can be dead for decades and their works still in copyright, and by the time they are dead for 70 years, the copyright will probably be extended again.",
          "link": "https://news.ycombinator.com/item?id=41450153",
          "publishedOn": "2024-09-04T20:06:53.000Z",
          "wordCount": null,
          "title": "New comment by teruakohatu in \"The Internet Archive has lost its appeal in Hachette vs. Internet Archive\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41449965",
          "author": "ilamont",
          "description": "This has been playing out for many years. And it's all because Brewster Kahle decided that an overly broad interpretation of the Internet Archive's mission trumped the rights of authors and publishers, and the laws of the United States.\nWhen IA was asked to stop CDL - many times - he continued. The National Writers Union tried to open a dialogue as early as 2010 but was ignored:\nThe Internet Archive says it would rather talk with writers individually than talk to the NWU or other writers’ organizations. But requests by NWU members to talk to or meet with the Internet Archive have been ignored or rebuffed.\nhttps://nwu.org/nwu-denounces-cdl/\nWhen the requests to abandon CDL turned into demands, Kahle dug in his heels. When the inevitable lawsuits followed, and IA lost, he insisted that he was still in the right and plowed ahead with appeals.\nHe also opened a new front in the court of public opinion. In his blog posts and interviews with U.S. media, Kahle portrays the court cases and legal judgements as a crusade against the Internet Archive and all librarians (see https://blog.archive.org/2023/12/15/brewster-kahle-appeal-st...). It's not. It's the logical outcome of one man's seemingly fanatical conviction against the law and the people who work very hard to bring new books into being.\nIn addition, there has been real collateral damage to the many noble aspects of the Internet Archive. Legal fees and judgements have diverted resources away from the Wayback Machine, the library of public domain works, and other IA programs that provide real value to society. I truly hope the organization can survive.",
          "link": "https://news.ycombinator.com/item?id=41449965",
          "publishedOn": "2024-09-04T19:52:35.000Z",
          "wordCount": null,
          "title": "New comment by ilamont in \"The Internet Archive has lost its appeal in Hachette vs. Internet Archive\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41448341",
          "author": "AnotherGoodName",
          "description": "Intel is trapped. Its debt repayments alone are massive. The poor performance in stock has encouraged 20years of wage stagnation to the point where you can literally earn over 50% more at amd or nvidia or even an startup for equivalent roles so they aren’t hiring the best. Their pay in the Bay Area is double tsmc in taiwan for equivalent roles in raw dollar terms but the ppp differences means your better off working for tsmc in Taiwan than intel in the Bay Area. That’s not a joke. Intel are literally incapable of attracting talent from Taiwan right now.\nThey don’t have the talent they need and the debt trap and poor performance means a lot of push back to the needed doubling of wages to attract that talent. It’s a very hard sell for any exec trying to correct this problem. They sidelined lip bu tan who was one of the advocates for even more layoffs and wage freezes but he’s one of many backwards thinkers they need to remove. It’s going to be difficult to fix their board.\nWithout talent intel has no hope of winning and they can’t get that talent due to poor stock performance for the past 20years leading to executives and shareholders wishing to implement the opposite of what they need right now. In fact they have ongoing layoffs right now. A true downward spiral and the only real hope is for a newcomer to step up.",
          "link": "https://news.ycombinator.com/item?id=41448341",
          "publishedOn": "2024-09-04T17:34:41.000Z",
          "wordCount": null,
          "title": "New comment by AnotherGoodName in \"Intel Honesty\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41446964",
          "author": "semiquaver",
          "description": "FWIW, I’ve worked at many RedHat shops over the years and I’ve never seen one where disabling SELinux wasn’t a normal part of provisioning a server. I haven’t seen the same thing with AppArmor (although I admit I have less visibility into debian systems administration). YMMV but it seems to me that a component which is so inconvenient that it’s normally disabled doesn’t provide much security in the end.",
          "link": "https://news.ycombinator.com/item?id=41446964",
          "publishedOn": "2024-09-04T15:31:41.000Z",
          "wordCount": 7007,
          "title": "New comment by semiquaver in \"The Insecurity of Debian\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41446120",
          "author": "paxys",
          "description": "> Closest thing we have to a Manhattan Project in the modern era?\nMinus the urgency, scientific process, well-defined goals, target dates, public ownership, accountability...",
          "link": "https://news.ycombinator.com/item?id=41446120",
          "publishedOn": "2024-09-04T14:16:12.000Z",
          "wordCount": null,
          "title": "New comment by paxys in \"Ilya Sutskever's SSI Inc raises $1B\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41446027",
          "author": "paxys",
          "description": "$1B raise, $5B valuation. For a company that is a couple months old and doesn't have a product or even a single line of code in production. Wild.",
          "link": "https://news.ycombinator.com/item?id=41446027",
          "publishedOn": "2024-09-04T14:08:25.000Z",
          "wordCount": null,
          "title": "New comment by paxys in \"Ilya Sutskever's SSI Inc raises $1B\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41445458",
          "author": "laserbeam",
          "description": "I love my remarkable 2. Bought it before \"Connect\" was a thing, so I don't have a subscription. But I cannot recommend it to anyone. There are better alternatives out there and MyDeepGuide (youtube) has reviewed them all better than I ever could.\nThe software is moving too slowly and often in a wrong direction. Especially since they released the keyboard folio most updates were around typing (which is supar on any eink device)... and they generally made my experience as a pen user worse.\nI don't care if the new hardware is awesome, whenever mine breaks I will switch to a competitor.\nEDIT: the reviewer I mention is excited about the device https://www.youtube.com/watch?v=ZkEg8WLeW4Q",
          "link": "https://news.ycombinator.com/item?id=41445458",
          "publishedOn": "2024-09-04T13:22:06.000Z",
          "wordCount": null,
          "title": "New comment by laserbeam in \"ReMarkable Paper Pro\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41441178",
          "author": "JimDabell",
          "description": "This is not how these kinds of things should be designed for the web.\nInstead of putting resources in the root of the web, this is what /.well-known/ was designed for. See RFC 5785:\nhttps://datatracker.ietf.org/doc/html/rfc5785\nInstead of munging URLs to get alternate formats, this is what content negotiation or rel=alternate were designed for.\nI’m not sure making it easier to consume content is something that is needed. I think it might be more useful to define script type=llm that would expose function calling to LLMs embedded in browsers.",
          "link": "https://news.ycombinator.com/item?id=41441178",
          "publishedOn": "2024-09-04T02:06:11.000Z",
          "wordCount": null,
          "title": "New comment by JimDabell in \"Llms.txt\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41438346",
          "author": "panarky",
          "description": "It's not just YubiKey.\nNinjaLab: \"All Infineon security microcontrollers (including TPMs) that run the Infineon cryptographic library (as far as we know, any existing version) are vulnerable to the attack.\"\n- Chips in e-passports from the US, China, India, Brazil and numerous European and Asian nations\n- Secure enclaves in Samsung and OnePlus phones\n- Cryptocurrency hardware wallets like Ledger and Trezor\n- SIM cards\n- TPMs in laptops from Lenovo, Dell, and HP\n- EMV chips in credit and debit cards",
          "link": "https://news.ycombinator.com/item?id=41438346",
          "publishedOn": "2024-09-03T19:34:45.000Z",
          "wordCount": null,
          "title": "New comment by panarky in \"EUCLEAK Side-Channel Attack on the YubiKey 5 Series\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41437728",
          "author": "edent",
          "description": "As per https://arstechnica.com/security/2024/09/yubikeys-are-vulner...\nAn attacker not only needs your username and password, they also need physical access to your key. They then have to disassemble the device. If they want to give it back to you, they'll need to reassemble it.\nSo not exactly trivial!\nA blob of nail-varnish over a plastic seam might be a useful canary.\nBut this does highlight one weakness of these FIDO tokens - you have to manually maintain a list of where you've registered them. And if your token is lost or stolen, you have to manually revoke every single one.",
          "link": "https://news.ycombinator.com/item?id=41437728",
          "publishedOn": "2024-09-03T18:35:44.000Z",
          "wordCount": null,
          "title": "New comment by edent in \"EUCLEAK Side-Channel Attack on the YubiKey 5 Series\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41436904",
          "author": "bko",
          "description": "I found this interesting:\n> Another option is to put it to beneficial use to create heat or even electricity. The Puente Hills landfill I showed earlier has a gas-to-energy facility that’s been running since 1987, and even though the landfill is now closed, it currently provides enough electricity to power around 70,000 homes.\nAnd towards the end\n> Landfills seem like an environmental blight, but really, properly designed ones play a huge role in making sure waste products don’t end up in our soil or air or water. It’s not possible to landfill waste everywhere... But my point is: landfills are a surprisingly low-impact way to manage solid waste in a lot of cases. I hope the future is a utopia where all the stuff we make maintains its beneficial value forever, but for now, I am thankful for the sanitary engineers and the other professions involved in safely and economically dealing with our trash so we don’t have to.\nI love reading about landfills. I wish more environmentalists would be excited about engineering solving environmental ills and relied less on knee-jerk reactions.",
          "link": "https://news.ycombinator.com/item?id=41436904",
          "publishedOn": "2024-09-03T17:05:33.000Z",
          "wordCount": 8968,
          "title": "New comment by bko in \"The Engineering of Landfills\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41435515",
          "author": "yjftsjthsd-h",
          "description": "So obviously claiming that there's no good reason for process to read argv[0] is either demonstrating the author's ignorance or needs a much stronger defense; I'd be fascinated to hear how they think busybox should work on an OpenWrt box with a 16MB root filesystem.\nHowever, I am willing to consider the discussion about whether there could be merit to restricting the ability to write that value; I could imagine a system that populated it only from the actual file name and did not allow it to be written by the parent process or the child process at runtime. The obvious place this still falls apart is that an attacker could just\n    ln /bin/curl ./some\\ other\\ name\n\nbut there are sometimes security measures that we use even though they're less than 100% effective so it at least conceivable that this might be a trade off worth making.",
          "link": "https://news.ycombinator.com/item?id=41435515",
          "publishedOn": "2024-09-03T14:50:41.000Z",
          "wordCount": null,
          "title": "New comment by yjftsjthsd-h in \"Why bother with argv[0]?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41432569",
          "author": "laserbeam",
          "description": "Scenarios where an IDE with full syntactic understanding is better:\n- It's your day to day project and you expect to be working in it for a long time.\nScenarios where grepping is more useful:\n- Your language has #ifdef or equivalent syntax which does conditional compilation making syntactic tools incomplete.\n- You just opened the project for the first time.\n- It's in a language you don't daily drive (you write backend but have to delve in frontend code, it's a 3rd party library, it's configuration files, random json/xml files or data)\n- You're editing or searching through documentation.\n- You haven't even downloaded the project and are checking things out in github (or some similar site for your project).\n- You're providing remote assistance to someone and you are not at your main development machine.\n- You're remoting via SSH and have access to code there (say it's a python server).\nYes, an IDE will save you time daily driving. But there's no reason to sabotage all the other usecases.",
          "link": "https://news.ycombinator.com/item?id=41432569",
          "publishedOn": "2024-09-03T08:21:17.000Z",
          "wordCount": null,
          "title": "New comment by laserbeam in \"Greppability is an underrated code metric\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41431701",
          "author": "lucumo",
          "description": "Grepping for symbols like function names and class names feels so anemic compared to using a tool that has a syntactic understanding of the code. Just \"go to definition\" and \"find usages\" alone reduce the need for text search enormously.\nFor the past decade-plus I have mostly only searched for user facing strings. Those have the advantage of being longer, so are more easily searched.\nHonestly, posts like this sound like the author needs to invest some time in learning about better tools for his language. A good IDE  alone will save you so much time.",
          "link": "https://news.ycombinator.com/item?id=41431701",
          "publishedOn": "2024-09-03T05:51:50.000Z",
          "wordCount": null,
          "title": "New comment by lucumo in \"Greppability is an underrated code metric\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41431211",
          "author": "egypturnash",
          "description": "I got hue 174 as my threshold and really I just wanted to say \"neither, this is turquoise/teal\" for most of the questions. But blue/green was the only option.",
          "link": "https://news.ycombinator.com/item?id=41431211",
          "publishedOn": "2024-09-03T04:17:09.000Z",
          "wordCount": null,
          "title": "New comment by egypturnash in \"Is My Blue Your Blue?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41431114",
          "author": "db48x",
          "description": "Rust and Javascript and Lisp all get extra points because they put a keyword in front of every function definition. Searching for “fn doTheThing” or “defun do-the-thing” ensures that you find the actual definition. Meanwhile C lacks any such keyword, so the best you can do is search for the name. That gets you a sea of callers with the declarations and definitions mixed in. Some C coding conventions have you split the definition into two lines, first the return type on a line followed by a second line that starts with the function name. It looks ugly, but at least you can search for “^doTheThing” to find just the definition(s).",
          "link": "https://news.ycombinator.com/item?id=41431114",
          "publishedOn": "2024-09-03T03:58:36.000Z",
          "wordCount": 10939,
          "title": "New comment by db48x in \"Greppability is an underrated code metric\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41430492",
          "author": "doe_eyes",
          "description": "I suspect it tests your monitor and monitor calibration as much as your color perception. In particular, sRGB displays have a pretty severely limited green gamut. If you have a wide-gamut display, the test is probably gonna appear different.\nBut another problem is with displaying the colors essentially full-window, which is going to be nearly-full-screen for many users. When we're staring at a screen with a particular tint, our eyes quickly do \"auto white balance\" that skews the results. It's the mechanism behind a bunch of optical illusions.\nTo address that last problem, I think the color display area should be much smaller, or you should be shown all hues at once and asked to position a cut-off point.",
          "link": "https://news.ycombinator.com/item?id=41430492",
          "publishedOn": "2024-09-03T01:57:39.000Z",
          "wordCount": 7789,
          "title": "New comment by doe_eyes in \"Is My Blue Your Blue?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41430477",
          "author": "fogleman",
          "description": "I think this is flawed. You quickly end up on a color that's clearly not \"blue\" or \"green\" and you're unlikely to keep hitting \"this is green\" several times in a row, conceding that ok, fine, maybe this is blue, whatever. You're basically measuring how many times people are willing to click the same button in a row.\nEdit: Possible improvements: changing the wording to \"this is MORE green\" and \"this is MORE blue\" and randomizing the order in which they are shown, somehow. I realize you're just doing some kind of binary search, narrowing the color range.\nThis is not to mention color calibration of your monitor, or your eyes adjusting / fatiguing to the bold color over time...",
          "link": "https://news.ycombinator.com/item?id=41430477",
          "publishedOn": "2024-09-03T01:55:17.000Z",
          "wordCount": null,
          "title": "New comment by fogleman in \"Is My Blue Your Blue?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41424153",
          "author": "WoodenChair",
          "description": "Whatever you think of the site itself, this is prime HN content. A kid in high school starts a site that scales to 1,000,000 registered users while working on it during nights and weekends in college. If the founder is on here, what tech stack did you use and how long had you been programming before you built it?",
          "link": "https://news.ycombinator.com/item?id=41424153",
          "publishedOn": "2024-09-02T10:17:01.000Z",
          "wordCount": 806,
          "title": "New comment by WoodenChair in \"1M Users\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41421177",
          "author": "tithe",
          "description": "That's some serious...multithreading!\n(I applaud others for resisting such cringe, but I just couldn't help myself.)",
          "link": "https://news.ycombinator.com/item?id=41421177",
          "publishedOn": "2024-09-01T23:16:25.000Z",
          "wordCount": 219,
          "title": "New comment by tithe in \"The Pentium as a Navajo Weaving\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41420875",
          "author": "tptacek",
          "description": "You generally want to minimize the number of passwords you manage; for instance, you should generally be paying the SSO tax and getting as many services as you can onto OIDC. After that, just do the cloud version of 1Password, which is easy to audit and manage access for, which you'll thank yourself for when it comes time to SOC2.\nRemember, as you give people access to passwords, that those passwords will need to be rotated when those people change to incompatible roles or depart the company. If passwords aren't a total pain in the ass for you, you're probably doing something wrong.",
          "link": "https://news.ycombinator.com/item?id=41420875",
          "publishedOn": "2024-09-01T22:16:32.000Z",
          "wordCount": null,
          "title": "New comment by tptacek in \"Ask HN: How to store and share passwords in a company?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41420633",
          "author": "bikamonki",
          "description": "A friend bootstrapped his fastfood tiny chain to 5 locations and a couple of mill in revenue in two years. Low financial leverage, happy customers.\nAn expert told him to hire experts to keep growing it. Now he's down to two locations, high in debt and uncertainty.\nCorpo bois are not founders, they know nothing of growing a startup. The have never produced value from thin air. They are just good at playing the corpo role. Job security is their main concern.",
          "link": "https://news.ycombinator.com/item?id=41420633",
          "publishedOn": "2024-09-01T21:42:17.000Z",
          "wordCount": null,
          "title": "New comment by bikamonki in \"Founder Mode\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41420455",
          "author": "apetresc",
          "description": "> 10. What Changes When You Are Free\n> You will not be forced to work inside something known as a “virtual environment.”\nOof, this terrible advice cancels out an otherwise reasonable post. Beginners who don't know what they're doing are the last people who should be `pip install -r requirements.txt`-ing into the system Python the way this article is recommending. That's not only going to make working on multiple projects nearly impossible (especially for the kind of beginning students who get recommended Anaconda, which are almost always the Data Science-y crowd using NumPy, Pandas, Scikit, etc, which are notoriously finicky with version conflicts), but it stands a good chance of breaking other Python-based system utilities in completely opaque ways. This sort of advice can fubar a naive user's entire workflow.\nI know virtualenvs suck to explain to people, but in my opinion it needs to be done before you ever tell them about `pip install`.",
          "link": "https://news.ycombinator.com/item?id=41420455",
          "publishedOn": "2024-09-01T21:15:13.000Z",
          "wordCount": null,
          "title": "New comment by apetresc in \"Escaping from Anaconda's Stranglehold on macOS\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41420253",
          "author": "gregfjohnson",
          "description": "I grew up seeing founder mode first-hand.  My dad founded Celestron, and he operated just as Paul is describing.  At my current company, I see the CEO doing the exact same thing, which gives me great hope.  Huge contrast from my previous start-up, for which I have great anti-hope unfortunately.  (Current company is Zap Surgical Systems, with Dr. John Adler as the founder.)  I've seen John everywhere, all day every day.  I've seen him literally on his hands and knees under our robotic treatment table back in the engineering lab, discussing details with a young mechanical engineer.  And yeah, we are curing cancer ;-)\nTo re-iterate:  What I believe PaulG is saying is that there is a crucially important phenomenon that we don't yet understand, and naming it will facilitate the process of bringing it into focus so that we can help more companies be successful.\nHis footnote has a painful resonance:  \"I also have another less optimistic prediction: as soon as the concept of founder mode becomes established, people will start misusing it.\"\nThis is exactly what has happened to the Agile methodology.",
          "link": "https://news.ycombinator.com/item?id=41420253",
          "publishedOn": "2024-09-01T20:47:07.000Z",
          "wordCount": null,
          "title": "New comment by gregfjohnson in \"Founder Mode\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41419008",
          "author": "xwall",
          "description": "Key Ideas:\nHeavier vehicles are safer for their occupants but more dangerous for others: The weight of a vehicle is a critical factor in car crashes, with heavier vehicles causing more fatalities in other cars, pedestrians, and cyclists.\nThe heaviest vehicles kill more people than they save: Analysis of crash data shows that for every life saved by the heaviest 1% of SUVs and trucks, more than a dozen lives are lost in other vehicles.\nWeight advantages have changed little over time: Despite improvements in safety features, the weight advantage of heavier vehicles has remained relatively constant, with heavier vehicles still causing more fatalities in lighter vehicles.\nCarmakers prioritize consumer preferences over safety: Manufacturers are producing increasingly heavier vehicles, driven by consumer demand for larger, more powerful cars, despite the safety risks to others.\nRegulators are ill-equipped to address the issue: The National Highway Traffic Safety Administration's rating system focuses on occupant safety, not the safety of other road users, and tax policies subsidize heavier vehicles.\nPublic awareness and concern are growing: Surveys show increasing concern about the size and safety of SUVs and pickup trucks, with researchers and policymakers starting to take notice.\nElectrification may exacerbate the problem: The shift towards electric vehicles, which tend to be heavier than their internal-combustion equivalents, may increase the weight of vehicles on the road, further amplifying the safety risks.",
          "link": "https://news.ycombinator.com/item?id=41419008",
          "publishedOn": "2024-09-01T18:19:38.000Z",
          "wordCount": 9512,
          "title": "New comment by xwall in \"Americans' love affair with big cars is killing them\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41418149",
          "author": "smugglerFlynn",
          "description": "This whole article is written around one key sentence:\n  > There are things founders can do that managers can't, and not doing them feels wrong to founders, because it is.\n\nAnd to be honest this hn comment section scares me, as it feels like people are discussing Paul’s new clothes without actually voicing out what they are talking about.\nWhat the hell is “Founder mode”, exactly?",
          "link": "https://news.ycombinator.com/item?id=41418149",
          "publishedOn": "2024-09-01T16:26:28.000Z",
          "wordCount": null,
          "title": "New comment by smugglerFlynn in \"Founder Mode\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41415406",
          "author": "magnio",
          "description": "> All the formatting in {fmt} is locale-independent by default (which breaks with the C++’s tradition of having wrong defaults)\nChuckles",
          "link": "https://news.ycombinator.com/item?id=41415406",
          "publishedOn": "2024-09-01T09:10:26.000Z",
          "wordCount": 315,
          "title": "New comment by magnio in \"Honey, I shrunk {fmt}: bringing binary size to 14k and ditching the C++ runtime\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41412758",
          "author": "pfraze",
          "description": "Copying over my latest backend status update; figure folks would find it interesting\nServers are holding up so far! Fortunately we were overprovisioned. If we hit 4mm new signups then things should get interesting. We did have some degradations (user handles entering an invalid state, event-stream crashed a couple times, algo crashed a couple times, image servers hit bad latencies) but we managed to avoid a full outage.\nWe use an event-sourcing model which is: K/V database for primary storage (actually sqlite), into a golang event stream, then into scylladb for computed views. Various separate services for search, algorithms, and images. Hybrid on-prem & cloud. There are ~20 of the k/v servers, 1 event-stream, 2 scylla clusters (I believe).\nThe event-stream crash would cause the application to stop making progress on ingesting events, but we still got the writes, so you'd see eg likes failing to increment the counter but then magically taking effect 60 seconds later. Since the scylla cluster and the KV stores stayed online, we avoided a full outage.",
          "link": "https://news.ycombinator.com/item?id=41412758",
          "publishedOn": "2024-08-31T23:15:18.000Z",
          "wordCount": null,
          "title": "New comment by pfraze in \"Brazil's X ban is sending lots of people to Bluesky\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41411273",
          "author": "bhauer",
          "description": "The step-up in cost basis on death is the original sin that underpins the entire debate over unrealized gains.\nIt's disheartening to see so much thought and deliberation going into an obviously toxic idea (taxing unrealized gains) when the obvious solution (removing the cost basis step-up when assets change hands) is being ignored.\nInherited wealth is the least earned, so it should be politically palatable to change this. But presumably because such a change would acutely affect the people who make laws in the country specifically, it is never seriously considered.",
          "link": "https://news.ycombinator.com/item?id=41411273",
          "publishedOn": "2024-08-31T19:31:32.000Z",
          "wordCount": 6060,
          "title": "New comment by bhauer in \"Buy, Borrow, Die – Explained\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41410912",
          "author": "rzimmerman",
          "description": "I worked for about a year with a consulting firm that handled \"Y2K compliance\". Unlike this Andersen exercise in legal face-saving, it was a real job. Big companies hired us to do a full inventory of their site equipment (this included manufacturing plants, Pharma stuff) and go line by line with their vendors and figure out which components had known Y2K issues, which had not been tested at all, and which ones were fine/had simple fixes. We helped them replace and fix what needed to be fixed.\nY2K was a real problem. The end-of-the-world blackouts + planes falling from the sky was sensationalism, but there were real issues and most of them got fixed. Not trying to take away from this very interesting story of corrupt cronyism, but there were serious people dealing with serious problems out there. \"Remember Y2K? Nothing happened!\" is a super toxic lesson to take away from a rare success where people came together and fixed something instead of firefighting disasters.",
          "link": "https://news.ycombinator.com/item?id=41410912",
          "publishedOn": "2024-08-31T18:46:49.000Z",
          "wordCount": null,
          "title": "New comment by rzimmerman in \"My fake job in Y2K preparedness\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=53130",
          "author": "Ingrid Robeyns",
          "description": "On Monday, the first day of our academic year, I went to a demonstration. The reason for the demonstration are the announced budget cuts for higher education, which our new right/extreme-right government wants to implement. The figures aren’t set in stone yet, but the financial appendix that was presented when the new government took office […]",
          "link": "https://crookedtimber.org/2024/09/04/dark-clouds-over-dutch-universities/",
          "publishedOn": "2024-09-04T06:46:46.000Z",
          "wordCount": 3050,
          "title": "Dark clouds over Dutch Universities",
          "imageUrl": "https://crookedtimber.org/wp-content/uploads/2024/09/Demonstration-Utrecht-CT-300x225.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53118",
          "author": "John Q",
          "description": "This study showing that US academic faculty members are 25 times more likely than Americans in general to have a parent with a PhD or Masters degree has attracted a lot of attention, and comments suggesting that this is unusual and unsatisfactory. But is it? For various reasons, I’ve interacted quite a bit with farmers, […]",
          "link": "https://crookedtimber.org/2024/09/01/academic-nepo-babies/",
          "publishedOn": "2024-09-01T21:47:08.000Z",
          "wordCount": 5482,
          "title": "Academic nepo babies ?",
          "imageUrl": "https://crookedtimber.org/wp-content/uploads/2024/09/InheritedJobs-300x279.png"
        },
        {
          "id": "https://crookedtimber.org/?p=53107",
          "author": "John Holbo",
          "description": "So is Trump going to be able to pivot to pro-choice in the run-up to the election? I mean: he’s trying. But will it work? And will his pro-life base accept it, because he’s Trump? I hope no pro-choice voters are fooled. I hope they hold him responsible for overturning Roe. It’s beyond obvious they […]",
          "link": "https://crookedtimber.org/2024/09/01/a-thought-about-conservative-psychology-re-the-abortion-issue/",
          "publishedOn": "2024-09-01T13:00:18.000Z",
          "wordCount": 15381,
          "title": "A thought about conservative psychology re: the abortion issue",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53104",
          "author": "Chris Bertram",
          "description": "Visit the post for more.",
          "link": "https://crookedtimber.org/2024/09/01/sunday-photoblogging-looking-towards-great-howard-street-liverpool-at-night/",
          "publishedOn": "2024-09-01T05:57:25.000Z",
          "wordCount": 1897,
          "title": "Sunday photoblogging: Looking towards Great Howard Street (Liverpool) at night",
          "imageUrl": "https://live.staticflickr.com/65535/53951428111_69ecbd9b9a.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53098",
          "author": "Belle Waring",
          "description": "I read reddit. Yeah, I know. Plain People of Crooked Timber: “why would you go and do a thing like that when you could sit on the kitchen floor and watch your packet of English muffins slowly pass its sell-by date and develop that unpleasant sour flavour you usually don’t notice until it’s too late […]",
          "link": "https://crookedtimber.org/2024/08/31/how-best-to-do-bad-things-that-hurt-your-spirit/",
          "publishedOn": "2024-08-31T14:57:05.000Z",
          "wordCount": 3160,
          "title": "How Best to Do Bad Things That Hurt Your Spirit",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53089",
          "author": "Eric Schliesser",
          "description": "I am very pleased that our very own Chris Bertram has responded to Joseph Heath’s very entertaining and polemical “John Rawls and the death of Western Marxism,” a widely shared Substack post [HT: Dailynous]. Chris has made some important corrections to the public record, and the comments on his post are extending that. As it happens, I […]",
          "link": "https://crookedtimber.org/2024/08/30/53089/",
          "publishedOn": "2024-08-30T01:54:54.000Z",
          "wordCount": 5097,
          "title": "On Heath and the demise of western Marxism",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/Ecuador-From-Rafael-Correa-to-Guillermo-Lasso-via-Lenin-Moreno",
          "author": "Eric Toussaint",
          "description": "The World Bank and the IMF are 80 years old. 80 years of financial neo-colonialism and the imposition of austerity policies in the name of debt repayment. 80 years is enough! The Bretton Woods institutions must be abolished and replaced by democratic institutions serving an ecological, feminist and anti-racist bifurcation. To mark these 80 years, we are republishing a series of articles every Wednesday until July, looking in detail at the history and damage caused by these two institutions. (...)\nEnglish\n\n/ \nEcuador, \nSouth, \n80 ans BM FMI EN",
          "link": "https://www.cadtm.org/Ecuador-From-Rafael-Correa-to-Guillermo-Lasso-via-Lenin-Moreno",
          "publishedOn": "2024-09-04T08:00:00.000Z",
          "wordCount": 6921,
          "title": "Ecuador: From Rafael Correa to Guillermo Lasso via Lenin Moreno",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L710xH373/fd445ef503d94fcc2b5f65e72879c3-a9a94.png"
        },
        {
          "id": "https://www.cadtm.org/Alarming-development-Rights-activists-including-a-young-woman-face-blasphemy",
          "author": null,
          "description": "Joint statement and appeal by JKNSF and RSF \nEnglish\n\n/ \nSocial movements, \nPakistan, \nSouth Asia",
          "link": "https://www.cadtm.org/Alarming-development-Rights-activists-including-a-young-woman-face-blasphemy",
          "publishedOn": "2024-08-30T09:49:52.000Z",
          "wordCount": 1599,
          "title": "Alarming development: Rights activists, including a young woman, face blasphemy charges in Pakistani-administered Kashmir",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L492xH258/7e2604341f8198270c7664033e866b-b1b16.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=8414",
          "author": "disassociated.com",
          "description": "Mick Tsikas, writing for The Conversation: The severe weather rounds out a weird winter across Australia. The nation’s hottest ever winter temperature was recorded when Yampi Sound in Western Australia reached 41.6C on Tuesday. Elsewhere across Australia, winter temperatures have been way above average. 41.6°C? It doesn’t even get that hot in summer, at least […]",
          "link": "https://disassociated.com/weird-winter-weather-points-more-unstable-weather/",
          "publishedOn": "2024-09-04T21:00:43.000Z",
          "wordCount": 351,
          "title": "Weird winter weather points to yet more unstable weather",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8399",
          "author": "disassociated.com",
          "description": "There’s been a bit of a surge in discussion recently about Indie Web, and seemingly what it means to be a true adherent. This time the focus appears to be about what I’m going to call technical proficiency. From what I can gather, having your own website, with your own domain name, and your own […]",
          "link": "https://disassociated.com/indie-web-small-web-social-web-whatever-web-my-web/",
          "publishedOn": "2024-09-03T21:00:49.000Z",
          "wordCount": 815,
          "title": "Indie Web, small web, social web, whatever web, my web",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8394",
          "author": "disassociated.com",
          "description": "Well, I’m sure pretty no AI is involved. What’s really incredible about this three minute video, made by Faruk Korkmaz, is that it was filmed entirely by a device, a smartphone, many of us carry in our pockets. The narration is fitting also. It comes from a speech given by Canadian-American actor and comedian Jim […]",
          "link": "https://disassociated.com/short-film-iphone-15-pro-max/",
          "publishedOn": "2024-09-02T21:00:02.000Z",
          "wordCount": 265,
          "title": "A short film shot on the iPhone 15 Pro Max, with no lens, filter, or AI",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8381",
          "author": "disassociated.com",
          "description": "Publication of Irish author Sally Rooney’s fourth novel, Intermezzo, on 24 September 2024, nears. It promises to be quite the event. I don’t know about Australia, but in Ireland and the UK, some bookshops will open early on the day, so eager Rooney fans can get hold of her latest offering. But Sally Rooney is […]",
          "link": "https://disassociated.com/ireland-home-best-literature-world/",
          "publishedOn": "2024-09-01T21:00:50.000Z",
          "wordCount": 411,
          "title": "Ireland: home of some of the best literature in the world",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8376",
          "author": "disassociated.com",
          "description": "Brazilians are turning to Bluesky — the microblogging platform founded by then Twitter co-founder Jack Dorsey — in droves, following a ban on X in the South American country. The surge in signups however has prompted warnings from Bluesky that the service may experience outages, as a result. But that seems like a good sort […]",
          "link": "https://disassociated.com/brazilians-flock-bluesky-authorities-block-x/",
          "publishedOn": "2024-09-01T20:30:40.000Z",
          "wordCount": 287,
          "title": "Brazilians flock to Bluesky after authorities block X",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8373",
          "author": "disassociated.com",
          "description": "Dusk, the new novel by Hobart based Australian author Robbie Arnott, is being published on Tuesday 8 October 2024. In the distant highlands, a puma named Dusk is killing shepherds. Down in the lowlands, twins Iris and Floyd are out of work, money and friends. When they hear that a bounty has been placed on […]",
          "link": "https://disassociated.com/dusk-novel-robbie-arnott-published-october-2024/",
          "publishedOn": "2024-08-29T21:00:25.000Z",
          "wordCount": 246,
          "title": "Dusk, a novel by Robbie Arnott, being published in October 2024",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8371",
          "author": "disassociated.com",
          "description": "Backbeat, the word is on the street, Oasis, the old nineties Britpop act — that was, in the words of co-founder Noel Gallagher — bigger than the Beatles, is set to play a series of reunion concerts. Honestly, I was more excited when in 2011, the Stone Roses, an even older act, announced they were* […]",
          "link": "https://disassociated.com/oasis-regroup-unwanted-second-coming/",
          "publishedOn": "2024-08-29T20:30:09.000Z",
          "wordCount": 312,
          "title": "Oasis regroup, this is not the second coming we were waiting for",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": []
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/something-monstrous",
          "author": null,
          "description": "Britain’s colonial pathologies.",
          "link": "https://newleftreview.org/sidecar/posts/something-monstrous",
          "publishedOn": "2024-09-04T00:44:56.000Z",
          "wordCount": 1522,
          "title": "Nadine El-Enany: &ldquo;Something Monstrous&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/09/vip-54420.jpg"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://notes.jeddacp.com/when-being-alone-doesnt-have-to-be-lonely/",
          "author": null,
          "description": "I consider myself an extroverted introvert. Or is it introverted extrovert? More on that later.\nI feel like often times, us introverts are misunderstood. A lot of people mistake introverts to be anti-social, or shy… but that’s not always the case. Being an introvert means that our batteries are recharged by spending time alone, away from social interactions. This past weekend, I fully embraced my recharge by spending 3 days in solitude.\nI mean… I mostly stayed away from human interaction. At least, I didn’t interact with any humans physically, and only through text with my other half, LC. This is also not because I don’t enjoy the company of others, especially LC’s, but there’s just something rejuvenating about spending time alone. You know… just existing in my own space, without the need to formulate words out loud, because sometimes there are just too many words. Of course, my dog got an earful from me every time I decided I needed to speak out loud.\nThere was a lot of silence, and little words, this weekend. It was nice not having any obligations outside of my own personal to-do list. I did a lot of reading, and a lot of binge watching (Dexter), which typically take a backseat in all of the life admin stuff I have to do. It was a great opportunity for me to recharge my mental and emotional batteries, and to force myself to find comfort in the quiet and the familiar.\nI missed having my other half here, a lot, but it also felt good to take a step back from the world to focus on myself.\nSo here’s to the long weekend spent solo, the comfort in the quiet, and the understanding that being alone doesn’t have to be lonely.\nSide note: I never really felt alone (even when I was) since I have a Velcro dog who literally needs to be attached to me at all times. That kind of balances things out, right?\n53/100\nReply by email",
          "link": "https://notes.jeddacp.com/when-being-alone-doesnt-have-to-be-lonely/",
          "publishedOn": "2024-09-04T15:16:00.000Z",
          "wordCount": 1202,
          "title": "When Being Alone Doesn’t Have to be Lonely",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda/alone.png"
        },
        {
          "id": "https://tiramisu.bearblog.dev/coffee-chats/",
          "author": null,
          "description": "The office I work out of runs an opt-in coffee chat program which\nmatches you with someone each week to have a short chat over coffee. I\ndon't know anyone in the office, so at the behest of my director I\nsigned up.\nI had my first coffee chat today. The guy I was supposed to meet with\nshowed up fifteen minutes late, which might have irked me if (i) I\nhadn't rescheduled our chat something like three times and (ii) if I\nactually enjoyed networking. Even though our conversation wasn't bad,\nall things considered, I still found myself rather grateful when we\nhad to run to our 4 PM meetings. I always feel phony networking with\nother people in the office, especially when they're a married\nfortysomething busy salesman high up on the org chart who has better\nthings to do than talk to a lowly peasant…",
          "link": "https://tiramisu.bearblog.dev/coffee-chats/",
          "publishedOn": "2024-09-03T22:24:00.000Z",
          "wordCount": 1267,
          "title": "coffee chats and donut dates",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://birming.com/bearboost-shortcut-bloggers/",
          "author": null,
          "description": "BearBoost\n\nBearBoost is an Apple shortcut designed to help you boost your blogging.\nIt's for all bloggers, but especially those who use the Bear blogging platform. The idea is to give you a quick and easy tool to help you get writing when you're feeling stuck.\nIt's like having your personal muse whisper, \"No more writer's block! Let's turn this blank page into a blog masterpiece!\" Okay, maybe not exactly that, but kind of.\nThe shortcut currently offers nine menu options:\nTrending Posts (Bear discovery feed)\nRecent Posts (Bear discovery feed)\nTen Topics (pick one and start writing)\nDaily Prompt (via Kevin McDonald)\nRandom Prompt (from Blog Prompts)\nRandom Quote (from Random Quotations)\nToday’s Word (via Merriam-Webster)\nBlog Inspiration (a page of mine)\nDiscover Blogs (the blog directory)\nI'll likely add more features over time. If you have any requests, please let me know.\nGet the BearBoost shortcut",
          "link": "https://birming.com/bearboost-shortcut-bloggers/",
          "publishedOn": "2024-09-03T19:29:00.000Z",
          "wordCount": 1279,
          "title": "BearBoost Shortcut for Bear Bloggers",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert/untitled-1.jpeg"
        },
        {
          "id": "https://birming.com/unforeseen/",
          "author": null,
          "description": "This day didn't start off great. I was supposed to be working in the archipelago, which I love, but someone had forgotten to book a boat for me. I was supposed to be on the island at 8:30 AM, but the mistake meant I would arrive at 11:30 AM instead.\nThree hours wasted, and I was supposed to visit six different clients. I could just see myself coming home very late, if I even managed to catch the last ferry back.\nOnce I got there, it turned out that all the houses were close to each other. The houses were also small, so each visit was short. When I was finished with the last customer, she offered to drive me back to the mainland in her boat.\nThe day ended with me finishing ridiculously early.\nSo, why am I telling you this? Because it's so incredibly stupid to paint scenarios in advance when we don't actually have a clue. We imagine how...\n...the workday will be long.\n...the job interview will go badly.\n...the family dinner will be stressful.\n...the date will be awkward.\n...the weather will be a disaster.\nAnd then it turns out in the end that those thoughts weren't accurate at all. The sun came out and during the job interview, it turned out that we had a mutual friend, so it felt very relaxed and good.\nIt's so much unnecessary time and energy that we spend trying to predict what hasn't happened yet. Things we can't possibly know in advance.\nOf course, it's good and even necessary to plan certain things in advance. To do your research and prepare. But it easily gets out of hand or is used when it doesn't serve any sensible purpose.\nWe might tell ourselves that \"you want to be prepared for the worst,\" but is that really a wise strategy? Isn't it better, sometimes, to face the future with an open mind and open arms? That attitude in itself might even increase the chance that it all ends in a surprisingly positive way.\nLet’s embrace the unknown and see where it takes us.",
          "link": "https://birming.com/unforeseen/",
          "publishedOn": "2024-09-03T14:32:00.000Z",
          "wordCount": 1468,
          "title": "The Unforeseen",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert/studio-e070e9bda490adc6e3a3ae6aae7a8620-ht6bcboi.jpg"
        },
        {
          "id": "https://louplummer.lol/my-partner/",
          "author": null,
          "description": "I am deeply and hopelessly in love and there's not much I can do about it. Luckily, the object of my affection is my wife of eleven years. Whenever we are separated, regardless for how long, I unconsciously begin a countdown in my mind until I see her again, even it it's just from the beginning of the work day until lunch. I've never known anyone as well as I know her. I can tell her mood from the sound of her footsteps as she descends the stairs from our bedroom into the living room. Neither of us ever attempt to hide an emotion from the other, so intune we are with each other's feelings.\nMy wife is a classic introvert. Our home is her haven, the place where she recharges her batteries. I long ago accepted the responsibility for answering every knock at the door and being the one to deal …",
          "link": "https://louplummer.lol/my-partner/",
          "publishedOn": "2024-09-03T11:30:00.000Z",
          "wordCount": 1039,
          "title": "My Partner",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/livingoutloud-1725326614.jpeg"
        },
        {
          "id": "https://aco.bearblog.dev/getting-a-life/",
          "author": null,
          "description": "i dont like getting asked \"what have you been up to?\". i don't know. i could have had the most interesting past few days, or the most uneventful, and i would simply not remember. my memory is slim these days, and comes to me in fleeting moments when i can form links with events in the present. sitting here in the sun the sun sends me back to the beach i was on this summer. the embrace from a friend brings the scent of the perfume my grandmother used to wear. the unassumed path we bike on takes me to my mom's hometown. i wonder at times if i only remember things by association.\n\ni've been doing a lot of things recently, which has been nice. i've been seeing friends and getting out of the house most days. at times i wonder if this is what life is supposed to be all about; these joyful moments shared with others, kept a secret from the rest of the world. i don't take many photos when i'm out like that. my mom gets mad i don't have anything to show for my outings. having a photo of the occasion makes me feel like i have cheated myself out of a memory by constraining it to a handful of pixels. who do i need prove i had a good time to?",
          "link": "https://aco.bearblog.dev/getting-a-life/",
          "publishedOn": "2024-09-03T01:42:00.000Z",
          "wordCount": 1254,
          "title": "getting a life",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://louplummer.lol/how-to-be-yourself-and-get-along-online/",
          "author": null,
          "description": "Since I started blogging in January, I've invested time in several different communities, starting with OMG.LOL, followed by Microblog, Scribbles, r/MacApps, r/Obsidian, BearBlog, 500.social and the Blaugust Discord. The most personal of these are the Mastodon community around OMG.LOL, Scribbles and Microblog. The two Reddit communities are the most impersonal. As in any group environment, I have personal interactions with other people and with groups of other people. I also get to watch interactions where I'm not directly involved because of the way the Internet is structured.\nSome of my rules are:\nStay out of other people's fights\nNever ignore racism, homophobia or misogyny\nNever go \"Well, actually…\"\nGive lots of complements\nOffer sympathy\nAnswer questions\nAvoid taking sides unless moral…",
          "link": "https://louplummer.lol/how-to-be-yourself-and-get-along-online/",
          "publishedOn": "2024-09-02T11:30:00.000Z",
          "wordCount": 1082,
          "title": "How to Be Yourself and Get Along Online",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/livingoutloud-1725244010.webp"
        },
        {
          "id": "https://secemp9.bearblog.dev/how-i-mastered-english-through-sheer-anger/",
          "author": null,
          "description": "I was once so angry that I reached this current level of understanding English, the level you see right now.\nIt was in the summer of 2016.\nI wasn’t particularly angry at the time, until a certain event occurred. Looking back, it probably wasn’t that significant, but, to put it briefly, the main cause was an English teacher I had at the time. It might have been a childish reason, but I was just a kid back then.\nDuring that summer, fueled by anger, I took the first hardcover English book I could find at home (I remember the title was \"Frankenstein\") and tried to read it.\nI didn’t have my laptop, internet, TV, or even a paper dictionary at the time. I was furious and struggled to read the book.\nOn my first read, I understood only about 1-5% of the entire book. But I kept going. As I struggled…",
          "link": "https://secemp9.bearblog.dev/how-i-mastered-english-through-sheer-anger/",
          "publishedOn": "2024-09-01T22:06:00.000Z",
          "wordCount": 891,
          "title": "How I mastered English through sheer Anger",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://blog.avas.space/get-with-program/",
          "author": null,
          "description": "I wrote this 2 weeks ago while I was particularly sad about my situation and in a lot of pain; after keeping it in the drafts for a while to consider it, I felt like publishing it now because it's easy to just portray the hopeful, productive ill person to the outside world, but sometimes accepting that stuff is tough!\nI’ve been complaining about being ill sometimes, about specific symptoms, about being unable to do stuff and being stuck in bed so much.. and the response I seem to get (whether outright or implied) is like “Duh, you are chronically ill, of course this is happening.” Like it’s the most normal thing in the world. As if everyone has already known it for ages and has readily accepted it, but I am lagging behind. “Get with the program already!”\nI remember asking my girlfriend if …",
          "link": "https://blog.avas.space/get-with-program/",
          "publishedOn": "2024-09-01T16:30:00.000Z",
          "wordCount": 1485,
          "title": "get with the program",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/avas-1709500835-0.png"
        },
        {
          "id": "https://birming.com/power-tiny-steps/",
          "author": null,
          "description": "I've been thinking about something lately. Something that's the complete opposite of how I usually do things — and it feels really good.\nIt's primarily the work on the Bearming theme that made me realize this. Before, I always wanted to have the whole picture clear in my mind beforehand. I tweaked and fiddled, turned it this way and that before finally deciding to release something.\nThere's been this idea that \"everything has to be perfect.\" This has resulted in spending a huge amount of time before pressing the publish button. There are several problems with such an approach...\nFor one thing, there is no external feedback whatsoever when I'm sitting and tinkering behind closed doors. It becomes a limited creation process with a very narrow perspective. A one-man show for something that's intended for an audience.\nAnother problem with creating \"for my eyes only\" is that the public announcement will never get a response that matches the time spent on the project. It leads to a feeling of scarcity, that it's not worth it. I've spent all this time, and this is all I get?\nThe new approach for me of creating publicly feels incredibly liberating and refreshing. I first released a beta of the theme and have since refined it and added new things along the way. Having a changelog also reinforces the feeling of continuity and development on a creatively rewarding level.\nI'm going to try to implement the same mindset with my entire blog. Revisiting old posts, reviewing the content, maybe adding tags or an image, and so on. A never-ending project without timeframes.\nBits and pieces that slowly, one step at a time, make for a more detailed and interesting picture – that's the kind of digital painting I want to keep creating.",
          "link": "https://birming.com/power-tiny-steps/",
          "publishedOn": "2024-09-01T15:41:00.000Z",
          "wordCount": 1439,
          "title": "The Power of Tiny Steps",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1725204984.jpg"
        },
        {
          "id": "https://louplummer.lol/osa-the-dog-and-the-last-goodbye/",
          "author": null,
          "description": "When we got to my son's house yesterday, he explained to me that one of his dogs wasn't feeling well. Osa, a 13-year-old lab/pit mix had a swollen stomach and was moving around very gingerly. Her condition had not changed by this morning and he elected to take he to the emergency vet's office in his neighborhood. The two of them were not gone long when he returned, grim faced. \"She's dying\" he told me.\nOsa survived the removal of stomach tumors three years ago. Now they have returned and in such profusion and size that removing them at her age isn't a practical option. my granddaughte,r who lives in Virginia had an October trip already planned to come home for a visit with Osa, the family dog since she was in kindergarten. She planned that visit because of Osa's age and health history. My …",
          "link": "https://louplummer.lol/osa-the-dog-and-the-last-goodbye/",
          "publishedOn": "2024-09-01T11:30:00.000Z",
          "wordCount": 1168,
          "title": "Osa the Dog and the Last Goodbye",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/livingoutloud-1725161169.jpeg"
        },
        {
          "id": "https://unwissen.bearblog.dev/blogs-are-weird-and-i-do-not-understand-them/",
          "author": null,
          "description": "Off course I knew what a blog was before finding Bear.1 I read blogposts and used tumblr (…), and I think my mother had a blog for some time, too. But I did not know about the technicalities (wtf is RSS?) and the culture of blogging. And although it took some time to set this whole endeavor up2, it is the culture-thing that is the hardest for me.\nI am used to Twitter and Bluesky, where posts have to be short and draw attention. This combination rewards posts that say divisive shit3 and punishes those that are nuanced and complex. It is easier to wish death onto some asshole politician than to explain what they did wrong. If you want to write something personal or sincere you have to meme and/or bury it under ironic detachment.\nLike posts on microblogging platforms, blogposts follow their o…",
          "link": "https://unwissen.bearblog.dev/blogs-are-weird-and-i-do-not-understand-them/",
          "publishedOn": "2024-08-31T19:45:00.000Z",
          "wordCount": 1027,
          "title": "Blogs are weird and I do not understand them",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://notes.jeddacp.com/notes-on-the-last-day-of-blaugust-2024/",
          "author": null,
          "description": "Happy World Blog Day!\nIn mid-July, I wanted to find a way to challenge myself in August for my birthday month. I initially wanted to do a photo challenge (a photo a day?) of sorts. As I was trying to figure out what to do, it was happenstance to have come across someone posting about Blaugust: A Festival of Blogging. I had no idea what it was but then I read this bit under What is Blaugust?:\nThe goal is to stoke the fires of creativity and allow bloggers and other content creators to mingle in a shared community while pushing each other to post more regularly. Above all the goal of Blaugust has always been to prove to folks that they can in fact sit down every day and create something fresh and then share it with the world.\nI knew I just had to try it.\nAnd here we are.\nI joined telling mys…",
          "link": "https://notes.jeddacp.com/notes-on-the-last-day-of-blaugust-2024/",
          "publishedOn": "2024-08-31T16:56:00.000Z",
          "wordCount": 1397,
          "title": "Notes on the last day of Blaugust 2024",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1722524363.png"
        },
        {
          "id": "https://bakavic.net/psa-remove-your-location-when-uploading-pictures-to-bearblog/",
          "author": null,
          "description": "TL;DR: Bearblog doesn't (currently) strip location data from your uploads, so you need to do it yourself\nUPDATE: Herman just added a comment in the nolt suggestion that locations are now removed, and there is a corresponding commit.\nA new uploaded photo shows that EXIF metadata (including location) is now removed:\n\nThanks Herman for the fast work! 💨\nI noticed that bear blog posts with pictures were loading rather slowly - turns out images are being stored and served as-is, full-sized and all.\nThis is probably a Good Thing(tm) for people running photo blogs, but I also realised that photo metadata, including your location, are being retained - not something you would want, e.g. if your pictures were taken at home.\nIf you have posted images via the native bearblog insert image feature in th…",
          "link": "https://bakavic.net/psa-remove-your-location-when-uploading-pictures-to-bearblog/",
          "publishedOn": "2024-08-31T06:09:00.000Z",
          "wordCount": 852,
          "title": "PSA: Remove your location when uploading pictures to bearblog (fixed!)",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://meadow.cafe/re-write-like-you-talk/",
          "author": null,
          "description": "Earlier today I was reading some new posts by Visa. There’s not much to say about that, except that he uses pretty normal words and writes very well.\nThis might seem like an odd comment, but it stems from my reading of another post, A Brief Case on Bearblog. The author of that post is clearly a talented and experienced writer who, it must be said, writes very (very) well. However, the words they use are so fancy, and the way they’re woven is so perfect that reading them feels ?strange?1.\nThis thought reminded me of an excellent essay by Paul Graham, Write Like You Talk. In it, he argues that if you want people to connect with you, you must write in a way that feels familiar to them. Essentially, the essay rests on the assumption that we all speak similarly but think differently.\nI’m the fi…",
          "link": "https://meadow.cafe/re-write-like-you-talk/",
          "publishedOn": "2024-08-30T22:10:00.000Z",
          "wordCount": 1044,
          "title": "RE: Write like you talk",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://agj.bearblog.dev/ruby-shebang-behavior/",
          "author": null,
          "description": "Ruby has a surprising hack in its interpreter. If the file starts with a shebang line, ruby will skip all lines until it encounters a shebang line which contains the string \"ruby\" in it.\nThis lets you start out as a shell script and then after some setup switch over to ruby\n#!/bin/bash\n\nrvm use 3.3.4\n\nexec ruby $0 \"$@\"\n\necho \"I am a bash line too but I will never run\"\n\n#!/usr/bin/env ruby\nputs \"I run in ruby\"\n\nThere is some ugliness to this hack though. The interpreter only looks for the word \"ruby\" so the shebang line could be whatever including.\n#!/bin/bash\n\nrvm use 3.3.4\n\nexec ruby $0 \"$@\"\n\necho \"I am a bash line too but I will never run\"\n\n#!/I/am/a/rubyist\nputs \"I run in ruby\"\n\nwill work but\n#!/bin/bash\n\nrvm use 3.3.4\n\nexec ruby $0 \"$@\"\n\necho \"I am a bash line too but I will never run\"\n\n#!/bin/rb\nputs \"I run in ruby\"\n\nwill result in a print of \"no Ruby script found in input\"\nSource: ruby.c#L2681\nI am not a fan of such hacks in a language. Python lets you do something similar too - but it takes advantage of the fact that triple-quoted strings are side-effect free in Python and \"\"\"\": is the same as just a : which is two empty strings followed by a true in bash.\n#!/bin/bash\n'''':\nsource /path/to/venv/bin/activate.sh\n\nexec python $0 \"$@\"\n\necho \"I am a bash line too but I will never run\"\n'''\n\nprint(\"I am in python\")",
          "link": "https://agj.bearblog.dev/ruby-shebang-behavior/",
          "publishedOn": "2024-08-30T14:53:00.000Z",
          "wordCount": 716,
          "title": "Ruby shebang behavior",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://matanabudy.com/i-quit-my-job-to-focus-on-my-studies/",
          "author": null,
          "description": "Last week was my last day at work. By “work,” I mean my job as a software engineer at the data-security startup where I’ve been working for the last two and a half years.\nAs you can probably guess from the title, I quit my job to focus on my studies. I started a master’s degree in computational linguistics this year, and I've been juggling both work and university.\nWorking and studying simultaneously has its advantages—the first one is obvious: money. While academic life has its perks, financial gain isn’t usually one of them. Working while studying allowed me to make a living, plain and simple.\nBut there are other benefits, too—like advancing my career as a software engineer, working on interesting problems, interacting with customers, and having the routine of going to the office and spe…",
          "link": "https://matanabudy.com/i-quit-my-job-to-focus-on-my-studies/",
          "publishedOn": "2024-08-29T18:49:10.095Z",
          "wordCount": 1040,
          "title": "I Quit My Job to Focus on My Studies",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": []
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}