{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "46b20f1379c6ec23d9613e71305a3bf8d5fa79a7",
          "author": "Veliswa Boya",
          "description": "Unleash unparalleled computing prowess and energy efficiency for memory-intensive workloads, from in-memory databases to real-time analytics, with C8g and M8g instances powered by AWS Graviton4 processors.",
          "link": "https://aws.amazon.com/blogs/aws/run-your-compute-intensive-and-general-purpose-workloads-sustainably-with-the-new-amazon-ec2-c8g-m8g-instances/",
          "publishedOn": "2024-09-25T21:16:39.000Z",
          "wordCount": 1492,
          "title": "Run your compute-intensive and general purpose workloads sustainably with the new Amazon EC2 C8g, M8g instances",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/08/29/Graviton-blog-feat-img.png"
        },
        {
          "id": "6e2dafa9117525fa56be8f04b271bd8b598b52ef",
          "author": "Danilo Poccia",
          "description": "Pushing the boundaries of generative AI, Meta unveils Llama 3.2, a groundbreaking language model family featuring enhanced capabilities, broader applicability, and multimodal image support, now available in Amazon Bedrock.",
          "link": "https://aws.amazon.com/blogs/aws/introducing-llama-3-2-models-from-meta-in-amazon-bedrock-a-new-generation-of-multimodal-vision-and-lightweight-models/",
          "publishedOn": "2024-09-25T18:18:52.000Z",
          "wordCount": 2682,
          "title": "Introducing Llama 3.2 models from Meta in Amazon Bedrock: A new generation of multimodal vision and lightweight models",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/07/22/Bedrock-models-feat-img.png"
        },
        {
          "id": "6ded5a2482a6ceaea13f37bd0cb8dee31a204b7c",
          "author": "Antje Barth",
          "description": "AI21's Jamba 1.5 models enable high-performance long-context language processing up to 256K tokens, with JSON output support and multilingual capabilities across 9 languages.",
          "link": "https://aws.amazon.com/blogs/aws/jamba-1-5-family-of-models-by-ai21-labs-is-now-available-in-amazon-bedrock/",
          "publishedOn": "2024-09-23T17:59:18.000Z",
          "wordCount": 1654,
          "title": "Jamba 1.5 family of models by AI21 Labs is now available in Amazon Bedrock",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/09/06/BedrockJamba3.png"
        },
        {
          "id": "4aa4231deeeef984194acd947c69a278e49f9574",
          "author": "Abhishek Gupta",
          "description": "AWS Community Days have been in full swing around the world. I am going to put the spotlight on AWS Community Day Argentina where Jeff Barr delivered the keynote, talks and shared his nuggets of wisdom with the community, including a fun story of how he once followed Bill Gates to a McDonald’s! I encourage […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-ec2-x8g-instances-amazon-q-generative-sql-for-amazon-redshift-aws-sdk-for-swift-and-more-sep-23-2024/",
          "publishedOn": "2024-09-23T17:54:32.000Z",
          "wordCount": 1834,
          "title": "AWS Weekly Roundup: Amazon EC2 X8g Instances, Amazon Q generative SQL for Amazon Redshift, AWS SDK for Swift, and more (Sep 23, 2024)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/08/13/AWS-WIR-default.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": [
        {
          "id": "2c4ac69958eb7ffd74f8ddce0a45e334dbc042ba",
          "author": "Luca Mezzalira",
          "description": "Software as a Service (SaaS) applications offer a transformative solution for businesses worldwide, delivering on-demand software solutions to a global audience. However, building a successful SaaS platform demands on meticulous architectural planning, especially given the inherent challenges of multi-tenancy. It’s also essential to ensure that each tenant’s data remains isolated and protected from unauthorized access […]",
          "link": "https://aws.amazon.com/blogs/architecture/lets-architect-building-multi-tenant-saas-systems/",
          "publishedOn": "2024-09-26T18:24:46.000Z",
          "wordCount": 1714,
          "title": "Let’s Architect! Building multi-tenant SaaS systems",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fc074d501302eb2b93e2554793fcaf50b3bf7291/2022/04/20/Site-Merch_Lets-Architect_REVIEW.jpg"
        },
        {
          "id": "1bfaecac76d979dc915e1d060b70e31e9259c7d9",
          "author": "Adam Nemeth",
          "description": "AWS customers often look for ways to run their systems within or under budget, avoiding unnecessary costs. This post offers practical advice on designing scalable and cost-efficient three-tier architectures by using serverless technologies within the AWS Free Tier. With AWS, you can start small and scale cost-effectively as your business demand increases. You can begin […]",
          "link": "https://aws.amazon.com/blogs/architecture/building-a-three-tier-architecture-on-a-budget/",
          "publishedOn": "2024-09-25T15:59:58.000Z",
          "wordCount": 2380,
          "title": "Building a three-tier architecture on a budget",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fc074d501302eb2b93e2554793fcaf50b3bf7291/2024/09/25/ARCHBLOG-1038-fig2.png"
        }
      ]
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps & Developer Productivity Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": [
        {
          "id": "732e837a33a0bac22b031107313b5c620ea3746f",
          "author": "Piyush Mattoo",
          "description": "Many AWS customers run their mission-critical workloads across multiple AWS regions to serve geographically dispersed customer base, meet disaster recovery objectives or address local laws and regulations. Amazon CodeCatalyst is a unified software development service designed to streamline and accelerate the process of building and delivering applications on AWS. It is an all-in-one platform for […]",
          "link": "https://aws.amazon.com/blogs/devops/amazon-ecs-multi-region-deployment-with-amazon-codecatalyst/",
          "publishedOn": "2024-09-25T11:13:52.000Z",
          "wordCount": 3376,
          "title": "Amazon ECS Multi-region Deployment with Amazon CodeCatalyst",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/09/25/featured-image-template-1120x630.png"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "cc8f6cbda91dd5f0445993ecc9602a415fd063e9",
          "author": "Olly Pomeroy",
          "description": "After careful consideration, we have made the decision to discontinue AWS App Mesh, effective September 30th, 2026. Until this date, existing AWS App Mesh customers will be able to use the service as normal, including creating new resources and onboarding new accounts via the AWS CLI and AWS CloudFormation. Additionally, AWS will continue to provide […]",
          "link": "https://aws.amazon.com/blogs/containers/migrating-from-aws-app-mesh-to-amazon-ecs-service-connect/",
          "publishedOn": "2024-09-24T15:02:54.000Z",
          "wordCount": 2114,
          "title": "Migrating from AWS App Mesh to Amazon ECS Service Connect",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/09/20/Featured-images-for-Containers-Blog-1-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=334575",
          "author": "Kshama Sawant",
          "description": "Like workers everywhere, Boeing machinists are fighting for decent wages and benefits in the face of the sky-high cost of living. The workers are demanding a 40 percent wage increase, which is the bare minimum they need given the ground they have lost in past sell-out contracts from the bosses, combined with historic inflation levels and high living costs in the region. They are angry at Boeing’s shell games, including the attempt to take away their annual employee bonuses (called “AMPP”), which they were promised in return for being forced to accept higher healthcare costs in a past contract. More\nThe post Boeing Machinists on Strike Have a Historic Opportunity appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/26/boeing-machinists-on-strike-have-a-historic-opportunity/",
          "publishedOn": "2024-09-26T06:00:46.000Z",
          "wordCount": null,
          "title": "Boeing Machinists on Strike Have a Historic Opportunity",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334506",
          "author": "David Schultz",
          "description": "For years, the Supreme Court enjoyed significant legitimacy and public approval, far outstripping that of both Congress and the President. However, its approval has fallen in recent years, especially under Chief Justice Roberts. This is because the perception increasingly is that the Court is deciding cases not based on neutral legal principles but on the basis of ideology. More\nThe post Constitutional Precedent and Partisan Ideology in the Roberts Supreme Court appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/26/constitutional-precedent-and-partisan-ideology-in-the-roberts-supreme-court/",
          "publishedOn": "2024-09-26T06:00:44.000Z",
          "wordCount": null,
          "title": "Constitutional Precedent and Partisan Ideology in the Roberts Supreme Court",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334443",
          "author": "Paul Bentley",
          "description": "Pierre Trudeau must be rolling in his grave over his heir’s Ukrainian policy. While other more powerful allies waver, Trudeau “le petite” said he “fully supports” firing long-range missiles deep into Russia. He said nothing about the risk of nuclear war, something about which his father was very concerned. More\nThe post Defrocked Priest of Peace? Trudeau Aims Missiles at Moscow appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/26/defrocked-priest-of-peace-trudeau-aims-missiles-at-moscow/",
          "publishedOn": "2024-09-26T05:59:58.000Z",
          "wordCount": null,
          "title": "Defrocked Priest of Peace? Trudeau Aims Missiles at Moscow",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334652",
          "author": "Brian Garvey",
          "description": "Israel’s violence toward its neighbors, long out of control in its destruction of Gaza, now threatens to open new fronts, involve new nations, and even drag the United States into direct conflict. Promises of a ceasefire from the Biden Administration have come to nothing. Soft, behind the scenes diplomacy has failed to achieve peace. In  More\nThe post Biden Can Halt Wider War: Stop Sending Arms appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/26/biden-can-halt-wider-war-stop-sending-arms/",
          "publishedOn": "2024-09-26T05:57:11.000Z",
          "wordCount": null,
          "title": "Biden Can Halt Wider War: Stop Sending Arms",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334635",
          "author": "Sonali Kolhatkar",
          "description": "A Florida resident named Isaac Menasche received a home visit this September from a police officer asking whether he’d signed a petition for a ballot measure. The petition, which Menasche had indeed signed, was for a November initiative overturning a strict abortion ban that Florida Governor Ron DeSantis signed last year. Now the governor is attempting to  More\nThe post Hold GOP Officials Accountable for Illegal Voter Intimidation appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/26/hold-gop-officials-accountable-for-illegal-voter-intimidation/",
          "publishedOn": "2024-09-26T05:55:46.000Z",
          "wordCount": null,
          "title": "Hold GOP Officials Accountable for Illegal Voter Intimidation",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334643",
          "author": "Binoy Kampmark",
          "description": "As with most empires in history, the search for successors can be a blighted affair.  The children will rarely agree to lines of succession, and the parents can often be guaranteed to throw a spanner in the works and soil expectations. Assassinations can take place.  Figures can be deposed and banished. A modern variant of this modern episode  More\nThe post Project Disharmony: The Murdoch Family in Court appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/26/project-disharmony-the-murdoch-family-in-court/",
          "publishedOn": "2024-09-26T05:55:42.000Z",
          "wordCount": null,
          "title": "Project Disharmony: The Murdoch Family in Court",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334641",
          "author": "Paul Sonn",
          "description": "New waves of workers are standing up and demanding fair treatment on the job — from the fast food workers of the Fight for $15 to the workers at companies like Starbucks, Trader Joe’s, and Volkswagen that are fighting for a union and a fair contract. But as these workers have made significant gains, they’ve simultaneously run into huge  More\nThe post To Secure Worker Rights, We Must Fix Our Democracy appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/26/to-secure-worker-rights-we-must-fix-our-democracy/",
          "publishedOn": "2024-09-26T05:55:27.000Z",
          "wordCount": null,
          "title": "To Secure Worker Rights, We Must Fix Our Democracy",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334608",
          "author": "Megan Russell",
          "description": "Earlier this month, US climate envoy John Podesta met with Chinese Foreign Minister Wang Yi in Beijing to discuss climate financing for the upcoming years. The US has long criticized China’s approach to confronting the climate threat, and continuously pushes Chinese leaders to do more. At the same time, US leaders label China’s investment into  More\nThe post Imperial Hypocrisy of the US-China Climate Talks appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/26/imperial-hypocrisy-of-the-us-china-climate-talks/",
          "publishedOn": "2024-09-26T05:53:12.000Z",
          "wordCount": null,
          "title": "Imperial Hypocrisy of the US-China Climate Talks",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334417",
          "author": "Peter Bach",
          "description": "The giant harvest moon in the London sky sent me scurrying back to Neil Young, though rather than moonlight for harvesting farmers, it got me thinking song the last bastion for emotion. (Harvest Moon is about Young’s late ex-wife Pegi.) In English culture, such open-facedness, or vulnerability, can be frowned upon. Even a sometimes personal column  More\nThe post Letter from London: Hush appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/26/letter-from-london-hush/",
          "publishedOn": "2024-09-26T05:50:53.000Z",
          "wordCount": null,
          "title": "Letter from London: Hush",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334615",
          "author": "Ashley Smith",
          "description": "Socialists and the 2024 elections – A Reply to Max Elbaum Max Elbaum departed from the norms of comradely debate in “Profiles in Political Cowardice,” in which he attacks Tempest and the DSA leadership for not voting and campaigning for Kamala Harris. Why he stooped to macho posturing about courage, cowardice, and toughness in political  More\nThe post Block, Squander, Disorganize? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/26/block-squander-disorganize/",
          "publishedOn": "2024-09-26T05:50:18.000Z",
          "wordCount": null,
          "title": "Block, Squander, Disorganize?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334620",
          "author": "Ralph Nader",
          "description": "The late sixties was a heady time for the civic pioneers who persuaded Congressional lawmakers to provide the American people with radio and television programs with real news – local and national – and also report what civic advocates and civic communities were proposing or doing. In 1961 commercial television stations were described by the  More\nThe post Public Radio, Public Media and Local News Deserts appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/26/public-radio-public-media-and-local-news-deserts/",
          "publishedOn": "2024-09-26T05:48:20.000Z",
          "wordCount": null,
          "title": "Public Radio, Public Media and Local News Deserts",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334505",
          "author": "Dean Baker",
          "description": "We know that most people say that they think the economy has performed poorly under the Biden-Harris administration. However, we also know that by standard economic measures the administration has been an incredible success story. We saw the longest stretch of low unemployment in 70 years. Unemployment rates for Blacks, Black teens, and Hispanics all  More\nThe post My Six Favorite Untruths About the Biden-Harris Economy appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/26/my-six-favorite-untruths-about-the-biden-harris-economy/",
          "publishedOn": "2024-09-26T05:38:09.000Z",
          "wordCount": null,
          "title": "My Six Favorite Untruths About the Biden-Harris Economy",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334400",
          "author": "Walden Bello",
          "description": "Javier Milei has been in office for less than a year, but he has taken his chainsaw to the government, as he promised. He chopped off half of the government ministries, devalued the peso by 50 percent, and slashed fuel subsidies. That was just the beginning. In the teeth of bitter opposition in Congress and in the streets, he got his “Bases Law” passed, which would allow him to roll back workers’ rights, provide tax incentives to foreign investors in extractive industries such as mining, forestry, and energy, reduce the tax burden on the rich, and provide him with the power to declare a one-year state of economic emergency with special powers to disband federal agencies and sell off about a dozen public companies. More\nThe post The Mess in Argentina appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/25/the-mess-in-argentina/",
          "publishedOn": "2024-09-25T06:00:29.000Z",
          "wordCount": null,
          "title": "The Mess in Argentina",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334501",
          "author": "Frida Berrigan",
          "description": "My name is Frida and my community is military dependent. (I feel, by the way, like I’m introducing myself at a very strange AA-like meeting with lousy coffee.) As with people who have substance abuse disorders, I’m part of a very large club. After all, there are weapons manufacturers and subcontractors in just about every congressional district in  More\nThe post Militarism Abuse Disorder appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/25/militarism-abuse-disorder/",
          "publishedOn": "2024-09-25T05:58:57.000Z",
          "wordCount": null,
          "title": "Militarism Abuse Disorder",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334466",
          "author": "James Bovard",
          "description": "“You could drop Hillary  into any trouble spot, come back in a month and… she will have made it better,” former president Bill Clinton declared in a 2016 speech championing his wife’s presidential candidacy.  But Hillary’s entry into the brawls surrounding the 2024 presidential election will leave many Americans wishing to drop her elsewhere. More\nThe post Hillary Clinton Returns to Muzzle Everyone   appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/25/hillary-clinton-returns-to-muzzle-everyone/",
          "publishedOn": "2024-09-25T05:58:37.000Z",
          "wordCount": null,
          "title": "Hillary Clinton Returns to Muzzle Everyone",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334527",
          "author": "Thomas Knapp",
          "description": "On September 13, the Biden administration announced a “Notice of Proposed Rulemaking” to “protect American consumers, workers, and businesses by addressing the significant increased abuse of the de minimis exemption.” That’s a pretty bland way of saying that Biden and Friends are opening up a new front in the US government’s war on your ability to find  More\nThe post Biden’s War on Temu is a Political War on Your Wallet appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/25/bidens-war-on-temu-is-a-political-war-on-your-wallet/",
          "publishedOn": "2024-09-25T05:55:56.000Z",
          "wordCount": null,
          "title": "Biden’s War on Temu is a Political War on Your Wallet",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334521",
          "author": "Richard Rhames",
          "description": "The most recent USDA agricultural census (2022) showed the number of American farms decreasing 6% since 2017, with the number of producers aged 35 to 64 declining 9%. Generally, people with (something like) “options” and their lives ahead of them—— when confronted with the bleak economics of farming—— try to do something else. Creating “challenges”  More\nThe post I Know a Farmer Who… appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/25/i-know-a-farmer-who/",
          "publishedOn": "2024-09-25T05:55:53.000Z",
          "wordCount": null,
          "title": "I Know a Farmer Who…",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334523",
          "author": "Jack Rasmus",
          "description": "I recently received a comment to the post of my article ‘The 2nd First Presidential Debate’ that criticized me for leaning in favor of Trump, of even being a ‘closet Trumpist’. The comment went on to repeat ad nauseum the typical Democrat party election ‘talking points’ that pretty much just say ‘don’t vote for Trump  More\nThe post Who’s Really The ‘Crazy’ In The Room In This Election appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/25/whos-really-the-crazy-in-the-room-in-this-election/",
          "publishedOn": "2024-09-25T05:54:53.000Z",
          "wordCount": null,
          "title": "Who’s Really The ‘Crazy’ In The Room In This Election",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334395",
          "author": "Algernon Austin",
          "description": "n recent days, there have been false and incendiary claims about Haitian immigrants living in Springfield, Ohio. This has led to serious public safety concerns – including threats directed at local schools and businesses, and to national media discussions about the economic impact of these newly arrived immigrants. Some historical and socioeconomic context would be  More\nThe post Haitian Americans: a Socioeconomic Snapshot appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/25/haitian-americans-a-socioeconomic-snapshot/",
          "publishedOn": "2024-09-25T05:54:17.000Z",
          "wordCount": null,
          "title": "Haitian Americans: a Socioeconomic Snapshot",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334394",
          "author": "Alfred de Zayas",
          "description": "Exceptionalism is an expression of the aninmus dominandi of powerful nations who refuse to submit to established rules of human coexistence and reject customary international law. Instead, these actors invent new rules as they go along and pretend that their fabled “rules based international order” somehow has legitimacy. A recent study established by Professor Jeffrey  More\nThe post Exceptionalism and international law appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/25/exceptionalism-and-international-law/",
          "publishedOn": "2024-09-25T05:50:25.000Z",
          "wordCount": null,
          "title": "Exceptionalism and international law",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334371",
          "author": "Melvin Goodman",
          "description": "No Democratic administration has been willing to challenge the excesses of Israeli policy, and the Biden administration is no exception.  President Joe Biden’s bear hug of Israeli Prime Minister Benjamin Netanyahu several days after the Hamas attack on October 7th indicated that U.S. policy would be one-sided.  Even worse, Secretary of State Antony Blinken arrived in Israel on October 12th, and said that he was there not only as secretary of state but “as a Jew.” Accordingly, the United States has been complicit in virtually every aspect of Israel’s genocidal campaign in Gaza as well as negligent in accepting Israel’s brutal policies against innocent Palestinians on the West Bank.   More\nThe post No End to Israel’s Killing Machine and U.S. Complicity appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/24/no-end-to-israels-killing-machine-and-u-s-complicity/",
          "publishedOn": "2024-09-24T06:03:43.000Z",
          "wordCount": null,
          "title": "No End to Israel’s Killing Machine and U.S. Complicity",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334343",
          "author": "John G. Russell",
          "description": "The Jews and Hitler come to mind The thought of slavery far behind But white paranoia is here to stay The white boy’s scheming night and day —Gil Scott-Heron, “The King Alfred Plan” (1972) “This is your choice America. “If you import the Third World into your country, you are going to become the Third  More\nThe post They Eat Humans, Don’t They? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/24/they-eat-humans-dont-they/",
          "publishedOn": "2024-09-24T05:58:11.000Z",
          "wordCount": null,
          "title": "They Eat Humans, Don’t They?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334449",
          "author": "Roger Thompson",
          "description": "To many American nationalists and militarists, the U.S. Navy has long held the reputation of being the best and most capable navy in the history of the world. In popular culture, movies like Top Gun, The Final Countdown, and The Hunt for Red October, all made with the consent and support of the Navy, fill  More\nThe post Unbelievable Incompetence: The U.S. Navy’s Achilles Heel appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/24/unbelievable-incompetence-the-u-s-navys-achilles-heel/",
          "publishedOn": "2024-09-24T05:55:50.000Z",
          "wordCount": null,
          "title": "Unbelievable Incompetence: The U.S. Navy’s Achilles Heel",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334454",
          "author": "Karl Grossman",
          "description": "Its title is Hoodwinked in the Hothouse: Resist False Solutions to Climate Change, is now in its third edition and can be accessed—for free— online. It was put together by “an international coalition of organization and activists,” relates the “Hoodwinked Collaborative” that “was convened to produce and distribute the groundbreaking publication on false solutions to the climate crisis.” “Authored  More\nThe post Hoodwinked in the Hothouse appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/24/hoodwinked-in-the-hothouse/",
          "publishedOn": "2024-09-24T05:55:50.000Z",
          "wordCount": null,
          "title": "Hoodwinked in the Hothouse",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334452",
          "author": "David Rosen",
          "description": "The upcoming 2024 presidential election poses two critical questions: What happens if Donald Trump wins? And, equally troubling, what happens if he loses the election? Attempts to address either question are now — months before the election and a newly elected president taking office — purely speculative.  Some have already begun to consider the first question.  In March,  More\nThe post Increasing Calls for Secession appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/24/increasing-calls-for-secession/",
          "publishedOn": "2024-09-24T05:55:42.000Z",
          "wordCount": null,
          "title": "Increasing Calls for Secession",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334436",
          "author": "Andrea Mazzarino",
          "description": "Count on one thing: armed conflict lasts for decades after battles end and its effects ripple thousands of miles beyond actual battlefields. This has been true of America’s post-9/11 forever wars that, in some minimalist fashion, continue in all too many countries around the world. Yet those wars, which we ignited in Afghanistan, Iraq, and Pakistan in the wake of the  More\nThe post War Forever, Everywhere appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/24/war-forever-everywhere/",
          "publishedOn": "2024-09-24T05:55:03.000Z",
          "wordCount": null,
          "title": "War Forever, Everywhere",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334432",
          "author": "Michael Albert",
          "description": "People against destroying our planetary home often favor “No Growth”—“steady as she goes”—or even the rhetorically catchier “DeGrowth”—“shrink baby shrink.” Their pro-growth opponents sometimes say, “grow baby grow,” or more pointedly, “drill baby drill.” But if you asked me, “where do you stand vis a vis growth? Give yourself a really short label that includes  More\nThe post “Post Growth”—Why and How? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/24/post-growth-why-and-how/",
          "publishedOn": "2024-09-24T05:50:19.000Z",
          "wordCount": null,
          "title": "“Post Growth”—Why and How?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334374",
          "author": "Sam Pizzigati",
          "description": "We haven’t of late had much in the way of political “consensus” here in the United States. But we do today have one consensus of sorts — on our tax system of all things. Most everyone considers how we go about taxing ourselves to be, at best, distinctly suboptimal. How do we change that? Where  More\nThe post Could 2025 End Up a Nightmare for Our Tax-Averse Rich? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/24/could-2025-end-up-a-nightmare-for-our-tax-averse-rich/",
          "publishedOn": "2024-09-24T05:44:36.000Z",
          "wordCount": null,
          "title": "Could 2025 End Up a Nightmare for Our Tax-Averse Rich?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334427",
          "author": "Lawrence Wittner",
          "description": "In recent days, Donald Trump and his Republican running mate, JD Vance, have doubled down on their false and defamatory claims about legally-admitted Haitian immigrants in Springfield, Ohio, thus churning up widespread fears, bomb threats, and school evacuations. Claiming that these migrants were destroying the American “way of life,” Trump promised that, if elected, he  More\nThe post Anti-Immigrant Agitation in a Nation of Immigrants appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/24/anti-immigrant-agitation-in-a-nation-of-immigrants/",
          "publishedOn": "2024-09-24T05:44:34.000Z",
          "wordCount": null,
          "title": "Anti-Immigrant Agitation in a Nation of Immigrants",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=334356",
          "author": "Steven Krichbaum",
          "description": "The verbiage in US Forest Service (“FS”) scoping letters (“SL”) and environmental assessments (“EA”) would have the public believe that all you have to do get your desired floristic composition (such as more oaks) is open up the canopy with chainsaws. This disinformation campaign, however, ignores the fact that there is far more influencing conditions  More\nThe post Landscape Ecology and National Forest Mismanagement appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/24/landscape-ecology-and-national-forest-mismanagement/",
          "publishedOn": "2024-09-24T05:36:48.000Z",
          "wordCount": null,
          "title": "Landscape Ecology and National Forest Mismanagement",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": [
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=31680",
          "author": "Kristian Blickle, Evan Perry, and João A.C. Santos",
          "description": "In support of the National Flood Insurance Program (NFIP), the Federal Emergency Management Agency (FEMA) creates flood maps that indicate areas with high flood risk, where mortgage applicants must buy flood insurance. The effects of flood insurance mandates were discussed in detail in a prior blog series. In 2021 alone, more than $200 billion worth of mortgages were originated in areas covered by a flood map. However, these maps are discrete, whereas the underlying flood risk may be continuous, and they are sometimes outdated. As a result, official flood maps may not fully capture the true flood risk an area faces. In this post, we make use of unique property-level mortgage data and find that in 2021, mortgages worth over $600 billion were originated in areas with high flood risk but no flood map. We examine what types of lenders are aware of this “unmapped” flood risk and how they adjust their lending practices. We find that—on average—lenders are more reluctant to lend in these unmapped yet risky regions. Those that do, such as nonbanks, are more aggressive at securitizing and selling off risky loans.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/09/flood-risk-outside-flood-zones-a-look-at-mortgage-lending-in-risky-areas/",
          "publishedOn": "2024-09-25T11:00:00.000Z",
          "wordCount": 4541,
          "title": "Flood Risk Outside Flood Zones — A Look at Mortgage Lending in Risky Areas",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/09/LSE_2024_flood-risk-outside_blickle_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=31859",
          "author": "Henry Dyer, Michael Fleming, and Or Shachar",
          "description": "Trading activity in benchmark U.S. Treasury securities now concentrates on the last trading day of the month. Moreover, this stepped-up activity is associated with lower transaction costs, as shown by a smaller price impact of trades. We conjecture that increased turn-of-month portfolio rebalancing by passive investment funds that manage relative to fixed-income indices helps explain these patterns.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/09/end-of-month-liquidity-in-the-treasury-market/",
          "publishedOn": "2024-09-24T11:00:00.000Z",
          "wordCount": 4801,
          "title": "End‑of‑Month Liquidity in the Treasury Market",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/09/LSE_2024_end-of-month_fleming_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=31880",
          "author": "Michael Fleming",
          "description": "Standard metrics point to an improvement in Treasury market liquidity in 2024 to levels last seen before the start of the current monetary policy tightening cycle. Volatility has also trended down, consistent with the improved liquidity. While at least one market functioning metric has worsened in recent months, that measure is an indirect gauge of market liquidity and suggests a level of current functioning that is far better than at the peak seen during the global financial crisis (GFC).",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/09/has-treasury-market-liquidity-improved-in-2024/",
          "publishedOn": "2024-09-23T11:00:00.000Z",
          "wordCount": 4106,
          "title": "Has Treasury Market Liquidity Improved in 2024?",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/09/LSE_liquidity_colored1_460.jpg"
        }
      ]
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45610",
          "author": "peterradford",
          "description": "from Peter Radford What?  Surely not!  How dare he suggest such a thing. What, you are correct in asking, am I talking about? The recent speech by a Department of Justice official who dared suggest that it is getting quite difficult to find a truly neutral technocratic expert to give testimony in court.  Imagine the […]",
          "link": "https://rwer.wordpress.com/2024/09/26/break-up-economics-continued/",
          "publishedOn": "2024-09-26T12:12:24.000Z",
          "wordCount": 4669,
          "title": "Break Up Economics — continued",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45604",
          "author": "Lars Syll",
          "description": "from Lars Syll Based on our interviews, heterodox economics appears to be a positive project, inevitably deﬁned somewhat in terms of the mainstream but not exhaustively so. It is also eﬃcacious, with policy and real-world impact. It is a complex object, not amenable to deﬁnition by a single criterion. Its dimensions are partly intellectual, in […]",
          "link": "https://rwer.wordpress.com/2024/09/22/what-is-heterodox-economics/",
          "publishedOn": "2024-09-22T17:00:11.000Z",
          "wordCount": 4347,
          "title": "What is heterodox economics?",
          "imageUrl": "https://cdn.corporatefinanceinstitute.com/assets/heterodox-economics-1024x683.jpeg"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45601",
          "author": "peterradford",
          "description": "from Peter Radford Is it a cult? Is it a guild? Both perhaps? I remember reading sometime not long ago that Steve Levitt was leaving Chicago.  Two things stood out in the article bringing that news:  first, Levitt said he was concerned that economics was becoming irrelevant; second, someone had told him he was not […]",
          "link": "https://rwer.wordpress.com/2024/09/20/rizzo-goes-for-the-guild/",
          "publishedOn": "2024-09-20T14:30:44.000Z",
          "wordCount": 4970,
          "title": "Rizzo goes for the guild",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=279351",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics; Kamala's speeches on the economy (transcripts); Election integrity; Negotiations restart at Boeing, as suppliers and customers begin to feel pain; Potential good news on the nasal spray front (albeit a mouse study) ~",
          "link": "https://www.nakedcapitalism.com/2024/09/200pm-water-cooler-9-26-2024.html",
          "publishedOn": "2024-09-26T18:00:34.000Z",
          "wordCount": 15482,
          "title": "2:00PM Water Cooler 9/26/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/rcp_2024-09-20.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279347",
          "author": "Yves Smith",
          "description": "Yet another Biden-Blinken ceasefire fantasy makes headlines.",
          "link": "https://www.nakedcapitalism.com/2024/09/desperate-looking-biden-administration-attempt-to-get-21-day-israel-lebanon-ceasefire.html",
          "publishedOn": "2024-09-26T16:00:15.000Z",
          "wordCount": 8732,
          "title": "Desperate-Looking Biden Administration Attempt to Get 21-Day Israel-Lebanon Ceasefire",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279335",
          "author": "Lambert Strether",
          "description": "Our surging daily links",
          "link": "https://www.nakedcapitalism.com/2024/09/links-9-26-2024.html",
          "publishedOn": "2024-09-26T10:58:22.000Z",
          "wordCount": 13125,
          "title": "Links 9/26/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/Common_raccoon.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279333",
          "author": "Yves Smith",
          "description": "The CBO releases an analysis of a Project 2025-adjacent plan to reduce Social Security benefits. The \"reforms\" don't improve fund solvency!",
          "link": "https://www.nakedcapitalism.com/2024/09/cbo-gop-social-security-plan-would-cut-benefits-by-thousands-not-extend-solvency.html",
          "publishedOn": "2024-09-26T09:02:50.000Z",
          "wordCount": 6471,
          "title": "CBO: GOP Social Security Plan Would Cut Benefits by Thousands, Not Extend Solvency",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279331",
          "author": "Yves Smith",
          "description": "If AI-created content floods the internet, who decides what online information is worth archiving?",
          "link": "https://www.nakedcapitalism.com/2024/09/the-challenge-of-preserving-good-data-in-the-age-of-ai.html",
          "publishedOn": "2024-09-26T08:17:05.000Z",
          "wordCount": 4747,
          "title": "The Challenge of Preserving Good Data in the Age of AI",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279329",
          "author": "Yves Smith",
          "description": "The Indian foreign minister make fatal (at least for now) objections to the idea of a BRICS currency.",
          "link": "https://www.nakedcapitalism.com/2024/09/indian-foreign-minister-throws-cold-water-on-the-idea-of-a-brics-currency.html",
          "publishedOn": "2024-09-26T06:58:35.000Z",
          "wordCount": 10317,
          "title": "Indian Foreign Minister Throws Cold Water on the Idea of a BRICS Currency",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279314",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics; Pollsters and polling; Getting to know Kamala; Election Trump's to lose: Is that what he's doing? Boeing's \"absurd litany of self-inflicted crises\" plus brutal Senate report on whistleblower reports ~",
          "link": "https://www.nakedcapitalism.com/2024/09/200pm-water-cooler-9-25-2024.html",
          "publishedOn": "2024-09-25T18:00:24.000Z",
          "wordCount": 19672,
          "title": "2:00PM Water Cooler 9/25/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/rcp_2024-09-20.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279309",
          "author": "Yves Smith",
          "description": "An exhortation for doctors to get more nutrition education so they can advise patients on diet. But is that as simple as it seems?",
          "link": "https://www.nakedcapitalism.com/2024/09/diet-related-diseases-are-the-no-1-cause-of-death-in-the-us-yet-many-doctors-receive-little-to-no-nutrition-education-in-med-school.html",
          "publishedOn": "2024-09-25T14:26:31.000Z",
          "wordCount": 12523,
          "title": "Diet-Related Diseases Are the No. 1 Cause of Death in the US – Yet Many Doctors Receive Little to No Nutrition Education in Med School",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279262",
          "author": "Yves Smith",
          "description": "Our dazzling daily links: Poland v. beavers, heebie jeebie pix, long Covid finds, recycling EV batteries? China missile test, moar Starmer wobbles, Israel-Lebanon escalation, Zelensky's lame victory plan, Biden war lust UN speech, Haitan groups sue Trump + Vance, Ellison sentenced, US port strike?",
          "link": "https://www.nakedcapitalism.com/2024/09/links-9-25-2024.html",
          "publishedOn": "2024-09-25T10:55:45.000Z",
          "wordCount": 15135,
          "title": "Links 9/25/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/00-owl.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279299",
          "author": "Yves Smith",
          "description": "As the Fed unloads Treasuries, others are purchasing them...including foreign central banks.",
          "link": "https://www.nakedcapitalism.com/2024/09/who-holds-all-these-us-treasuries-update-on-the-investors-in-the-ballooning-us-national-debt-in-q2.html",
          "publishedOn": "2024-09-25T10:54:15.000Z",
          "wordCount": 6676,
          "title": "Who Holds All These US Treasuries? Update on the Investors in the Ballooning US National Debt in Q2",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/00-Treasuries.png"
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "6ct91ZmJYzPu9n9pt8sNBm",
          "author": "Tanushree Sharma",
          "description": "To celebrate Builder Day 2024, we’re shipping 18 updates inspired by direct feedback from developers building on Cloudflare. This includes new capabilities, like running evals with AI Gateway, beta products like Queues and Vectorize graduating to GA, massive speed improvements to KV and Workers AI, pricing simplifications, and bringing key features from Pages into Workers.",
          "link": "https://blog.cloudflare.com/builder-day-2024-announcements",
          "publishedOn": "2024-09-26T21:00:00.000Z",
          "wordCount": 3738,
          "title": "Builder Day 2024: 18 big updates to the Workers platform",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3iSS8tIBJ0kxNe8Spg7Qbc/638d618da92edfd4dc366558d2d8bffd/BLOG-2517_OG.png"
        },
        {
          "id": "4ZEcwzAEh1rg9IxDqC3UyM",
          "author": "Christopher Rotas",
          "description": "Cloudflare’s Startup Program now offers up to $250,000 in credits for companies building on our Developer Platform. The program relaunch uses clear and predictable credits so that you can easily see how usage impacts future pricing.",
          "link": "https://blog.cloudflare.com/startup-program-250k-credits",
          "publishedOn": "2024-09-26T13:00:00.000Z",
          "wordCount": 1278,
          "title": "Startup Program revamped: build and grow on Cloudflare with up to $250,000 in credits",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6JY9nWh0ZbV5uhxCyu0xLY/2cacf8875adfc2f6dd43e76c1afb86b7/Startup_Program_revamped-_build_and_grow_on_Cloudflare_with_up_to__250_000_in_credits-OG.png"
        },
        {
          "id": "2lS9TcgZHa1fubO371mYiv",
          "author": "Michelle Chen",
          "description": "Whether you want the fastest inference at the edge, optimized AI workflows, or vector database-powered RAG, we’re excited to help you harness the full potential of AI and get started on building with Cloudflare.",
          "link": "https://blog.cloudflare.com/workers-ai-bigger-better-faster",
          "publishedOn": "2024-09-26T13:00:00.000Z",
          "wordCount": 3201,
          "title": "Cloudflare’s bigger, better, faster AI platform",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5ulk9RqlQAEwprMduAUPy9/d099c3f8bac3523b90eeeedb2ebee218/Cloudflare_s_bigger__better__faster_AI_platform-OG.png"
        },
        {
          "id": "29PAMer5L0do12OtNa557I",
          "author": "Isaac Rehg",
          "description": "With a new generation of data center accelerator hardware and using optimization techniques such as KV cache compression and speculative decoding, we’ve made large language model (LLM) inference lightning-fast on the Cloudflare Workers AI platform.",
          "link": "https://blog.cloudflare.com/making-workers-ai-faster",
          "publishedOn": "2024-09-26T13:00:00.000Z",
          "wordCount": 2420,
          "title": "Making Workers AI faster and more efficient: Performance optimization with KV cache compression and speculative decoding",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5k8fRyeI3NnIxjvP1AMDn/da6a19b59f120a8d6112781375fdb21a/Making_Workers_AI_faster_and_more_efficient-_Performance_optimization_with_KV_cache_compression_and_speculative_decoding-OG.png"
        },
        {
          "id": "44R2ywetTc9l1c6D7oWTsz",
          "author": "Kenton Varda",
          "description": "Traditional cloud storage is inherently slow because it is accessed over a network and must synchronize many clients. But what if we could instead put your application code deep into the storage layer, such that your code runs where the data is stored? Durable Objects with SQLite do just that.",
          "link": "https://blog.cloudflare.com/sqlite-in-durable-objects",
          "publishedOn": "2024-09-26T13:00:00.000Z",
          "wordCount": 5141,
          "title": "Zero-latency SQLite storage in every Durable Object",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1EuNamTw8x3H3XRzBaobmS/a485560240894c922e322539be6be659/Zero-latency_SQLite_storage_in_every_Durable_Object-OG.png"
        },
        {
          "id": "76i5gcdv0wbMNnwa7E17MR",
          "author": "Thomas Gauvin",
          "description": "Speed is a critical factor that dictates Internet behavior. Every additional millisecond a user spends waiting for your web page to load results in them abandoning your website.",
          "link": "https://blog.cloudflare.com/faster-workers-kv",
          "publishedOn": "2024-09-26T13:00:00.000Z",
          "wordCount": 2180,
          "title": "We made Workers KV up to 3x faster — here’s the data",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2UHkSFT2lmnCkowZyD3wdn/0fcd27ca704da73dbfb6aa9021b34f88/We_made_Workers_KV_up_to_3x_faster___here_s_the_data-OG.png"
        },
        {
          "id": "sC3G9YR2M9IIoRMg8slDl",
          "author": "Alex Krivit",
          "description": "We are excited to announce the latest leap forward in speed – Speed Brain. Speed Brain uses the Speculation Rules API to prefetch content for the user's likely next navigations. The goal is to download a web page to the browser before a user navigates to it, allowing pages to load instantly.",
          "link": "https://blog.cloudflare.com/introducing-speed-brain",
          "publishedOn": "2024-09-25T13:00:00.000Z",
          "wordCount": 5264,
          "title": "Introducing Speed Brain: helping web pages load 45% faster",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2VHvuIVSAEUvuWpfCFPNDu/0cf5d747358b3e9fba3006b214e1457f/BLOG-2422_OG.png"
        },
        {
          "id": "6YLU1FUKD4lioSrbpOnb5r",
          "author": "Matt Bullock",
          "description": "Cloudflare's customers can now take advantage of Zstandard (zstd) compression, offering 42% faster compression than Brotli and 11.3% more efficiency than GZIP. We're further optimizing performance for our customers with HTTP/3 prioritization and BBR congestion control, and enhancing privacy through Encrypted Client Hello (ECH).",
          "link": "https://blog.cloudflare.com/new-standards",
          "publishedOn": "2024-09-25T13:00:00.000Z",
          "wordCount": 6353,
          "title": "New standards for a faster and more private Internet",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1hC0w2tovQ13pI6V7fSFS3/9545ea7caf42e2cd447bb07b00168216/New_standards_for_a_faster_and_more_private_Internet-OG.png"
        },
        {
          "id": "EkJICbovEPPuOSElg8poy",
          "author": "Nils Ohlmeier",
          "description": "TURN servers help relay media and data between devices when direct peer-to-peer connections are blocked or fail. Cloudflare Calls' TURN server uses anycast to eliminate the need to think about regions or scaling, improving reliability of WebRTC applications.",
          "link": "https://blog.cloudflare.com/webrtc-turn-using-anycast",
          "publishedOn": "2024-09-25T13:00:00.000Z",
          "wordCount": 2348,
          "title": "TURN and anycast: making peer connections work globally",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/20Ze6k5hEhGIWiXeMnEFAh/5107c1512f755b6f51edaa37bb6d3b76/TURN_and_anycast-_making_peer_connections_work_globally-OG.png"
        },
        {
          "id": "sdvPBDBwhcEcrODVeOE7A",
          "author": "JQ Lau",
          "description": "Cloudflare is thrilled to announce the general deployment of our next generation of server — Gen 12 powered by AMD Genoa-X processors. This new generation of server focuses on delivering exceptional performance across all Cloudflare services, enhanced support for AI/ML workloads, significant strides in power efficiency, and improved security features.",
          "link": "https://blog.cloudflare.com/gen-12-servers",
          "publishedOn": "2024-09-25T13:00:00.000Z",
          "wordCount": 3794,
          "title": "Cloudflare’s 12th Generation servers — 145% more performant and 63% more efficient",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/ClKSEml6Tev0e5Ut7lPP5/9bc0c234231309ab06359a0d530291cb/BLOG-2116_OG.png"
        },
        {
          "id": "11EWaw0wCUNwPTM30w7oUN",
          "author": "Alex Krivit",
          "description": "Today we’re excited to share that we’ve built the fastest cache purge in the industry.  We now offer a global purge latency for purge by tags, hostnames, and prefixes of less than 150ms on average (P50), representing a 90% improvement since May 2022.",
          "link": "https://blog.cloudflare.com/instant-purge",
          "publishedOn": "2024-09-24T23:00:00.000Z",
          "wordCount": 3950,
          "title": "Instant Purge: invalidating cached content in under 150ms",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/18ZVwqqO5THZ7TrRFKjxR6/a1609c424549ac26ab7a4b47549cdebb/Instant_Purge-_invalidating_cached_content_in_under_150ms-OG.png"
        },
        {
          "id": "6ZZuN3gorGpsi4nPVR284G",
          "author": "Kelly May Johnston",
          "description": "Cloudflare is extending the use of our public DNS resolver through partnering with ISPs and network providers to deliver a safer browsing experience directly to families. Join us in protecting every Internet user from unsafe content with the click of a button, powered by 1.1.1.1 for Families.",
          "link": "https://blog.cloudflare.com/safer-resolver",
          "publishedOn": "2024-09-24T13:00:00.000Z",
          "wordCount": 1732,
          "title": "Cloudflare partners with Internet Service Providers and network equipment providers to deliver a safer browsing experience to millions of homes",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1jC49BsSZPd7VLkqEIFuxf/3153c9155a65579ea0118ad3b255deb1/Cloudflare_partners_with_Internet_Service_Providers_and_network_equipment_providers_to_deliver_a_safer_browsing_experience_t.png"
        },
        {
          "id": "1M8zVthnUiMpJpGylQuptu",
          "author": "Jacob Bednarz",
          "description": "The Cloudflare Terraform provider used to be manually maintained. With the help of our existing OpenAPI code generation pipeline, we’re now automatically generating the provider for better endpoint and attribute coverage, faster updates when new products are announced and a new API documentation site to top it all off. Read on to see how we pulled it all together.",
          "link": "https://blog.cloudflare.com/automatically-generating-cloudflares-terraform-provider",
          "publishedOn": "2024-09-24T13:00:00.000Z",
          "wordCount": 3449,
          "title": "Automatically generating Cloudflare’s Terraform provider",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2jMU7eEhUq17urGaWaoNmk/e48e3863a88636afb308649452f4c38f/Automatically_generating_Cloudflare_s_Terraform_provider-OG.png"
        },
        {
          "id": "3hUMWCRTsPTuqyUixn3aXp",
          "author": "Michael Tremante",
          "description": "Today, we are taking some big steps forward in our mission to help build a better Internet. Cloudflare is giving everyone free access to 10+ different website and network security products and features.",
          "link": "https://blog.cloudflare.com/a-safer-internet-with-cloudflare",
          "publishedOn": "2024-09-24T13:00:00.000Z",
          "wordCount": 3197,
          "title": "A safer Internet with Cloudflare: free threat intelligence, analytics, and new threat detections",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/XnNxePLKdNSOFCHnO9vQ9/642c59a62667d3c81915d6a5f68c9c85/A_safer_Internet_with_Cloudflare-_free_threat_intelligence__analytics__and_new_threat_detections-OG.png"
        },
        {
          "id": "4tzeNEI3qyBtnWskn5TbUa",
          "author": "Thibault Meunier",
          "description": "Cloudflare is now verifying WhatsApp’s Key Transparency audit proofs to ensure the security of end-to-end encrypted messaging conversations without having to manually check QR codes. We are publishing the results of the proof verification to https://dash.key-transparency.cloudflare.com for independent researchers and security experts to compare against WhatsApp’s. Cloudflare does not have access to underlying public key material or message metadata as part of this infrastructure.",
          "link": "https://blog.cloudflare.com/key-transparency",
          "publishedOn": "2024-09-24T13:00:00.000Z",
          "wordCount": 2369,
          "title": "Cloudflare helps verify the security of end-to-end encrypted messages by auditing key transparency for WhatsApp",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3pa4LDT6AEnIn2hah2Q1Lw/f9fc7aafff52a4f0d1de34512f7b2487/Cloudflare_helps_verify_the_security_of_end-to-end_encrypted_messages_by_auditing_key_transparency_for_WhatsApp-OG.png"
        },
        {
          "id": "6V6W6JxQO7bnM0CbhuO1OA",
          "author": "Oliver Payne",
          "description": "As the Internet evolves, Turnstile does too. Introducing Ephemeral IDs — a new dimension in detecting fraudulent activity, bot or human, that links behavior to a specific client instead of an IP address. This makes Turnstile better for everyone, everywhere.",
          "link": "https://blog.cloudflare.com/turnstile-ephemeral-ids-for-fraud-detection",
          "publishedOn": "2024-09-23T13:00:00.000Z",
          "wordCount": 1751,
          "title": "Introducing Ephemeral IDs: a new tool for fraud detection",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4MCk1A0r8lUudsxiKxoCk4/e0986f4be7e1f346869aa02b4e9cac53/BLOG-2548_OG.png"
        },
        {
          "id": "1CRWV43VAHSo5XHLkwPw2R",
          "author": "Emily Music",
          "description": "Since June 2021, we’ve been measuring and ranking our network performance against the top global networks in the world. We use this data to improve our performance, and to share the results of those initiatives. \n\nIn this post, we’re going to share with you how network performance has changed since our last post in March 2024, and discuss the tools and processes we are using to assess network performance.",
          "link": "https://blog.cloudflare.com/network-performance-update-birthday-week-2024",
          "publishedOn": "2024-09-23T13:00:00.000Z",
          "wordCount": 1943,
          "title": "Network performance update: Birthday Week 2024",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4crMCzNwlA33QT4mML0C0/51259c043cd321e9e91bbfab0520d789/BLOG-2569_OG.png"
        },
        {
          "id": "47pmgthPjmg2ZeYqTNmU8f",
          "author": "Sam Rhea",
          "description": "Cloudflare customers on any plan can now audit and control how AI models access the content on their site.",
          "link": "https://blog.cloudflare.com/cloudflare-ai-audit-control-ai-content-crawlers",
          "publishedOn": "2024-09-23T13:00:00.000Z",
          "wordCount": 2803,
          "title": "Start auditing and controlling the AI models accessing your content",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1jkBvkmlPzkzBu0nGCAHGB/ba9a2444c2a68329d166c71dc4846280/BLOG-2509_OG.png"
        },
        {
          "id": "op0CI3wllMcGjptdRb2Ce",
          "author": "Alex Fattouche",
          "description": "In response to customer demand, we now support the ability to DELETE, PATCH, PUT and POST multiple DNS records in a single API call, enabling more efficient and reliable zone management.",
          "link": "https://blog.cloudflare.com/batched-dns-changes",
          "publishedOn": "2024-09-23T13:00:00.000Z",
          "wordCount": 2769,
          "title": "Making zone management more efficient with batch DNS record updates",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7GOZD8wICrGFK9sussU95/f1f53b0af28a0abcf73c66a03bd12077/BLOG-2495_OG.png"
        },
        {
          "id": "7puHT1ajSilk9b0LGo3s2H",
          "author": "Matthew Prince",
          "description": "Cloudflare launched on September 27, 2010. This week we celebrate our fourteenth birthday",
          "link": "https://blog.cloudflare.com/cloudflare-2024-annual-founders-letter",
          "publishedOn": "2024-09-22T15:51:00.000Z",
          "wordCount": 1652,
          "title": "Cloudflare’s 2024 Annual Founders’ Letter",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2j7SiTtuuC2hT2SFHXpKwc/b4fe7b971a7ececb276bc9841e7e3336/-2024-_Blog_Template__1200x628___4_.png"
        },
        {
          "id": "13ueCTf2YFQfu3c1KeOlWj",
          "author": "Curt Robords",
          "description": "Cloudflare’s Capacity Planning team discusses planning for “what-if” type scenarios, and how they’ve introduced a new “Scenario Planner” system to quickly model hypothetical future changes",
          "link": "https://blog.cloudflare.com/scenario-planner",
          "publishedOn": "2024-09-20T14:01:00.000Z",
          "wordCount": 2793,
          "title": "Removing uncertainty through \"what-if\" capacity planning",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7LXdeZ25tTQguXG547ydBE/b26a8f22e674f22a401b4240a55d6087/BLOG-2554_OG.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": [
        {
          "id": "https://medium.com/p/5d18c4782911",
          "author": "Capital One Tech",
          "description": "Capital One is proud to support USC’s Stimulating STEM Summer Program to promote STEM education among underrepresented students.",
          "link": "https://medium.com/capital-one-tech/supporting-the-stimulating-stem-summer-program-at-usc-5d18c4782911?source=rss----3db3a67cb648---4",
          "publishedOn": "2024-09-24T18:13:19.000Z",
          "wordCount": 2372,
          "title": "Supporting the Stimulating STEM Summer Program at USC",
          "imageUrl": "https://miro.medium.com/v2/resize:fit:1200/0*F2YX19xVJeeZTwsn.png"
        }
      ]
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": [
        {
          "id": "https://slack.engineering/?p=16999",
          "author": "Dylan Steen",
          "description": "After a lot of hard work, you’ve landed that coveted internship. Now comes the next big challenge: delivering a meaningful project over the summer. Leading a project independently is an opportunity to sharpen your skills, demonstrate your capabilities, and experience personal growth. As you drive the project on your own, the support from your mentor […]\nThe post Driving a Project: Intern Edition appeared first on Slack Engineering.",
          "link": "https://slack.engineering/driving-a-project-intern-edition/",
          "publishedOn": "2024-09-23T07:00:03.000Z",
          "wordCount": 1925,
          "title": "Driving a Project: Intern Edition",
          "imageUrl": "https://slack.engineering/wp-content/uploads/sites/7/2024/09/sravya.jpeg?w=640"
        }
      ]
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": [
        {
          "id": "https://kubernetes.io/blog/2024/09/24/sig-scheduling-spotlight-2024/",
          "author": null,
          "description": "In this SIG Scheduling spotlight we talked with Kensei Nakada, an\napprover in SIG Scheduling.\nIntroductions\nArvind: Hello, thank you for the opportunity to learn more about SIG Scheduling! Would you\nlike to introduce yourself and tell us a bit about your role, and how you got involved with\nKubernetes?\nKensei: Hi, thanks for the opportunity! I’m Kensei Nakada\n(@sanposhiho), a software engineer at\nTetrate.io. I have been contributing to Kubernetes in my free time for more\nthan 3 years, and now I’m an approver of SIG-Scheduling in Kubernetes. Also, I’m a founder/owner of\ntwo SIG subprojects,\nkube-scheduler-simulator and\nkube-scheduler-wasm-extension.\nAbout SIG Scheduling\nAP: That's awesome! You've been involved with the project since a long time. Can you provide a\nbrief overview of SIG Schedu…",
          "link": "https://kubernetes.io/blog/2024/09/24/sig-scheduling-spotlight-2024/",
          "publishedOn": "2024-09-24T00:00:00.000Z",
          "wordCount": 5585,
          "title": "Spotlight on SIG Scheduling",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": []
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=41661883",
          "author": "throwaway314155",
          "description": "It's about the narrative they tried to create. The spin. It doesn't matter much if they were technically behaving as a for-profit entity previously. What matters is that they wanted the public (and likely, their talent) to _think_ that they weren't even interested in making a profit as this would be a philosophical threat to the notion of any sort of impartial or even hopefully benevolent originator of AGI (a goal which is laid plainly in their mission statement).\nAs you've realized, this should have been (and was) obvious for a long time. But that doesn't make it any less hypocritical or headline worthy.",
          "link": "https://news.ycombinator.com/item?id=41661883",
          "publishedOn": "2024-09-26T18:57:51.000Z",
          "wordCount": 1314,
          "title": "New comment by throwaway314155 in \"OpenAI to become for-profit company\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41661086",
          "author": "philsquared_",
          "description": "The problem I have with this is simple and has to do with the lack of separation of entities.\nAutomattic is a competitor with WPEngine.\nWordpress.com is a competitor with WPEngine.\nWordpress.org and the Wordpress Foundation IS NOT a competitor with WPEngine.\nThere is a dispute between Automattic and WPEngine. The resources of Wordpress.org and the Wordpress Foundation should not be leverage in this dispute.\nThe fact that those boundaries are crossed means that anyone who is in competition with Automattic might have any and all ecosystems that Matt has any control over leveraged against them if they upset Matt or Automattic in any way.\nIt is very poor taste and changes the perspective of the product. Instead of a professional entity who will engage professionally it is now a form of leverage that a single person could wield against anyone who crosses them.\nTo be clear these same exact actions can be taken against anyone who insults one individual. This look is embarrassing.",
          "link": "https://news.ycombinator.com/item?id=41661086",
          "publishedOn": "2024-09-26T17:39:33.000Z",
          "wordCount": 3937,
          "title": "New comment by philsquared_ in \"WordPress.org bans WP Engine\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41659665",
          "author": "ziddoap",
          "description": ">DoNotPay also did not \"hire or retain any attorneys\" to help verify AI outputs or validate DoNotPay's legal claims.\nWow, that's brave. Create a wrapper around ChatGPT, call it a lawyer, and never check the output. $193k fine seems like peanuts.\nSometimes I think about where I would be in life if I had no moral or ethical qualms. I'd probably be running a company like this.",
          "link": "https://news.ycombinator.com/item?id=41659665",
          "publishedOn": "2024-09-26T15:38:41.000Z",
          "wordCount": 6428,
          "title": "New comment by ziddoap in \"DoNotPay has to pay $193K for falsely touting untested AI lawyer, FTC says\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41657337",
          "author": "FL33TW00D",
          "description": "Incredible amount of negativity here.\nHuge kudos to Meta for breaking new ground and doing a ton of R&D/M&A to get to this point. Once MicroLED comes on a little further and the form factor shrinks this could be the next consumer electronics platform.\nSilicon carbide is really interesting, we need high RI materials to make this work.\nHopefully glass 3D printing or similar will make cheap, Rx waveguides possible.",
          "link": "https://news.ycombinator.com/item?id=41657337",
          "publishedOn": "2024-09-26T11:59:56.000Z",
          "wordCount": null,
          "title": "New comment by FL33TW00D in \"Orion, our first true augmented reality glasses\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41656762",
          "author": "bayindirh",
          "description": "> The most surprising thing to me in this is that the non-profit will still exist.\nThat entity will scrape the internet and train the models and claim that \"it's just research\" to be able to claim that all is fair-use.\nAt this point it's not even funny anymore.",
          "link": "https://news.ycombinator.com/item?id=41656762",
          "publishedOn": "2024-09-26T10:37:15.000Z",
          "wordCount": 9054,
          "title": "New comment by bayindirh in \"OpenAI to become for-profit company\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41656743",
          "author": "mtlmtlmtlmtl",
          "description": "The most surprising thing to me in this is that the non-profit will still exist. Not sure what the point of it is anymore. Taken as a whole, OpenAI is now just a for-profit entity beholden to investors and Sam Altman as a shareholder. The non-profit is really just vestigial.\nI guess technically it's supposed to play some role in making sure OpenAI \"benefits humanity\". But as we've seen multiple times, whenever that goal clashes with the interests of investors, the latter wins out.",
          "link": "https://news.ycombinator.com/item?id=41656743",
          "publishedOn": "2024-09-26T10:34:52.000Z",
          "wordCount": 11368,
          "title": "New comment by mtlmtlmtlmtl in \"OpenAI to become for-profit company\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41655883",
          "author": "liquidise",
          "description": "Software is a house. The more you lean into the analogy, the better.\nI often tell clients \"The first thing you asked me to do was to move a dining room chair into the living room. Then you asked me to do the same with the toilet. The latter only works if we tear out all the plumbing.\"\nNon-coders seem to understand these analogies intuitively.",
          "link": "https://news.ycombinator.com/item?id=41655883",
          "publishedOn": "2024-09-26T08:25:10.000Z",
          "wordCount": null,
          "title": "New comment by liquidise in \"Xkcd 1425 (Tasks) turns ten years old today\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41654809",
          "author": "ml_basics",
          "description": "It's quite remarkable how much the goal posts have shifted when it comes to what is impressive with AI/ML. Things like this are a good reminder.\n10 years ago the GAN paper came out and everyone was excited how amazing the generated image quality was (https://arxiv.org/abs/1406.2661)\nThe amount of progress we've made is mind boggling.",
          "link": "https://news.ycombinator.com/item?id=41654809",
          "publishedOn": "2024-09-26T05:23:28.000Z",
          "wordCount": null,
          "title": "New comment by ml_basics in \"Xkcd 1425 (Tasks) turns ten years old today\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41652377",
          "author": "simonw",
          "description": "I'm absolutely amazed at how capable the new 1B model is, considering it's just a 1.3GB download (for the Ollama GGUF version).\nI tried running a full codebase through it (since it can handle 128,000 tokens) and asking it to summarize the code - it did a surprisingly decent job, incomplete but still unbelievable for a model that tiny: https://gist.github.com/simonw/64c5f5b111fe473999144932bef42...\nMore of my notes here: https://simonwillison.net/2024/Sep/25/llama-32/\nI've been trying out the larger image models to using the versions hosted on https://lmarena.ai/ - navigate to \"Direct Chat\" and you can select them from the dropdown and upload images to run prompts.",
          "link": "https://news.ycombinator.com/item?id=41652377",
          "publishedOn": "2024-09-25T22:06:59.000Z",
          "wordCount": null,
          "title": "New comment by simonw in \"Llama 3.2: Revolutionizing edge AI and vision with open, customizable models\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41652023",
          "author": "paxys",
          "description": "I will never understand why people still take statements like these at face value. These aren't her personal thoughts and feelings. The letter was carefully crafted by OpenAI's PR team under strict direction from Sam and the board. Whatever the real story is is sitting under many layers of NDAs and threats of clawing back/diluting her shares, and we will not know it for a long time. What I can say for certain is no executive in her position ever willingly resigns to pursue different passions/spend more time with their family/enjoy retirement or whatever else.",
          "link": "https://news.ycombinator.com/item?id=41652023",
          "publishedOn": "2024-09-25T21:22:22.000Z",
          "wordCount": 1204,
          "title": "New comment by paxys in \"Mira Murati leaves OpenAI\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41651928",
          "author": "vasco",
          "description": ">  Yet the company is still shipping, like no other\nIf executives / high level architects / researchers are working on this quarter's features something is very wrong. The higher you get the more ahead you need to be working, C-level departures should only have an impact about a year down the line, at a company of this size.",
          "link": "https://news.ycombinator.com/item?id=41651928",
          "publishedOn": "2024-09-25T21:11:54.000Z",
          "wordCount": null,
          "title": "New comment by vasco in \"Mira Murati leaves OpenAI\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41651562",
          "author": "lacker",
          "description": "It's easy to have missed this part of the story in all the chaos, but from the NYTimes in March:\nMs. Murati wrote a private memo to Mr. Altman raising questions about his management and also shared her concerns with the board. That move helped to propel the board’s decision to force him out.\nhttps://www.nytimes.com/2024/03/07/technology/openai-executi...\nIt should be no surprise if Sam Altman wants executives who opposed his leadership, like Mira and Ilya, out of the company. When you're firing a high-level executive in a polite way, it's common to let them announce their own departure and frame it the way they want.",
          "link": "https://news.ycombinator.com/item?id=41651562",
          "publishedOn": "2024-09-25T20:33:15.000Z",
          "wordCount": 2085,
          "title": "New comment by lacker in \"Mira Murati leaves OpenAI\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41651350",
          "author": "aresant",
          "description": "I think the much more likely scenario than product roadmap concerns is that Murati (and Ilya for that matter) took their shot to remove Sam, lost, and in an effort to collectively retain billion$ of enterprise value have been playing nice, but were never seriously going to work together again after the failed coup.",
          "link": "https://news.ycombinator.com/item?id=41651350",
          "publishedOn": "2024-09-25T20:09:28.000Z",
          "wordCount": 3015,
          "title": "New comment by aresant in \"Mira Murati leaves OpenAI\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41651310",
          "author": "GlenTheMachine",
          "description": "Thee are a bunch of comments here asking why one would run Windows on a spacecraft.\nI am a spacecraft engineer. I don’t see anything in the linked article indicating that they are actually running Windows - the BSOD claim is tongue-in-cheek, or at least that’s how I read it. I also don’t know of anyone anywhere that runs Windows on a spacecraft, with the exception of laptops used by astronauts. Typically one runs vxWorks, or maybe QNX. Some experimental (high risk, low cost) systems run Linux. Older spacecraft don't run any OS at all, everything is running on bare metal, and that may be true for a handful of current spacecraft as well.\nWindows is used in some places by ground controllers, but these days they tend to be running Linux a lot more often.",
          "link": "https://news.ycombinator.com/item?id=41651310",
          "publishedOn": "2024-09-25T20:06:12.000Z",
          "wordCount": null,
          "title": "New comment by GlenTheMachine in \"How to avoid a BSOD on your 2B dollar spacecraft\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41651210",
          "author": "Imnimo",
          "description": "It is hard for me to square \"This company is a few short years away from building world-changing AGI\" and \"I'm stepping away to do my own thing\". Maybe I'm just bad at putting myself in someone else's shoes, but I feel like if I had spent years working towards a vision of AGI, and thought that success was finally just around the corner, it'd be very difficult to walk away.",
          "link": "https://news.ycombinator.com/item?id=41651210",
          "publishedOn": "2024-09-25T19:55:24.000Z",
          "wordCount": 17180,
          "title": "New comment by Imnimo in \"Mira Murati leaves OpenAI\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41650222",
          "author": "wilsonnb3",
          "description": "Decent hands on article from the verge with more info\nhttps://www.theverge.com/24253908/meta-orion-ar-glasses-demo...\nWireless compute puck. 70 degree FOV. Resolution high enough to read text. Wrist band detects hand gestures and will be used in another product.",
          "link": "https://news.ycombinator.com/item?id=41650222",
          "publishedOn": "2024-09-25T18:11:47.000Z",
          "wordCount": null,
          "title": "New comment by wilsonnb3 in \"Orion, our first true augmented reality glasses\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41648513",
          "author": "JohnMakin",
          "description": "> \"I keep this blog for me to write, not necessarily for others to read.\"\nThis is now to me the \"old school\" internet creator attitude (that I still possess). I don't blog as much any more but do create content elsewhere - a lot of it is for my own enjoyment and creative outlet, to blow off steam, whatever - the fact that other people may want to watch it is secondary. I do try to do things people want, but only if I want to do it.\nThe only reason I highlight this is that the up and coming generations absolutely do not see content creation in the same way. I got in an absurd argument with an early 20 something on a social media platform about how annoying ads were that were disguised as content. The response was overwhelmingly \"Well, how else do you expect content creators to make a living?\"\nI do not disagree that creators should be able to monetize their content however they please, but the fact that people see that as the end and only goal of content creation is baffling to me and almost certainly making it worse. This same person tried to tell me it's been the same way since the earliest days of youtube - which they would have been in diapers around that time - is absolutely not true. The idea of content creation as a full time career is relatively new, and I hate it. The worst part is if you don't participate in the type of obnoxious engagement hacking or buried ads that these \"professional\" creators do, the algorithms punish you for it.",
          "link": "https://news.ycombinator.com/item?id=41648513",
          "publishedOn": "2024-09-25T15:23:58.000Z",
          "wordCount": 11280,
          "title": "New comment by JohnMakin in \"Why I still blog after 15 years\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41642011",
          "author": "Terr_",
          "description": "At this point I can only hope that all these LLM products get exploited so massively and damning-ly that all credibility in them evaporates, before that misplaced trust causes too much insidious damage to everybody else.\nI don't want to live in a world where some attacker can craft juuuust the right thing somewhere on the internet in white-on-white text that primes the big word-association-machine to do stuff like:\n(A) Helpfully\" display links/images where the URL is  exfiltrating data from the current user's conversation.\n(B) Confidently slandering a target individual (or group) as convicted of murder, suggesting that police ought to shoot first in order to protect their own lives.\n(C) Responding that the attacker is a very respected person with an amazing reputation for one billion percent investment returns etc., complete with fictitious citations.",
          "link": "https://news.ycombinator.com/item?id=41642011",
          "publishedOn": "2024-09-24T23:16:02.000Z",
          "wordCount": 6353,
          "title": "New comment by Terr_ in \"Hacker plants false memories in ChatGPT to steal user data in perpetuity\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41641134",
          "author": "jjbinx007",
          "description": "Is anyone at Google even aware how much this hurts their brand?\nI received an email from Google today with the subject line \"Meet the new Google TV Streamer (4K)\"\nThe sender was Google Chromecast. Apparently it's some sort of streaming hardware they are selling for £99.\nI won't even consider buying one. How long until it's an obsolete brick? And when it's a brick, what are the chances I can wipe it and install my own software on it? Probably zero.\nNo thanks, Google. You've blotched your copybook too many times.",
          "link": "https://news.ycombinator.com/item?id=41641134",
          "publishedOn": "2024-09-24T21:27:19.000Z",
          "wordCount": 7039,
          "title": "New comment by jjbinx007 in \"Google Cache is fully dead\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41633688",
          "author": "nicexe",
          "description": "I always thought this was a stupid restriction.  \nYou can't view the post while authenticated but you can view the post while unauthenticated.",
          "link": "https://news.ycombinator.com/item?id=41633688",
          "publishedOn": "2024-09-24T06:42:04.000Z",
          "wordCount": 5905,
          "title": "New comment by nicexe in \"Twitter/X will let people you've blocked see your posts\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41631833",
          "author": "paxys",
          "description": "Live reactions watching this video:\nRemove two screws from the bottom of the phone – easy, I can totally do this!\nSoften the glue and pull out the back – hmm, I guess it's doable if I can find replacement glue.\nDisconnect dozens of cables and parts – wow, it's going to be hard to remember how everything goes back together.\nPeel off protective foam from motherboard – is it even possible to replace this stuff?\nCNC grind the existing 128GB NAND to dust – I should probably stop watching now...",
          "link": "https://news.ycombinator.com/item?id=41631833",
          "publishedOn": "2024-09-24T00:08:05.000Z",
          "wordCount": null,
          "title": "New comment by paxys in \"iPhone 16 Pro Storage Expansion 128GB to 1TB [video]\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41631152",
          "author": "felarof",
          "description": "Hey HN, we recently fine-tuned the llama3.1 405B model on 8xAMD MI300x GPUs using JAX instead of PyTorch. JAX's advanced sharding APIs allowed us to achieve great performance. Check out our blog post to learn about the cool sharding tricks we used. We've also open-sourced the code: https://github.com/felafax/felafax\nWe're a small startup building AI infra for fine-tuning and serving LLMs on non-NVIDIA hardware (TPUs, AMD, Trainium).\nProblem: Many companies are trying to get PyTorch working on AMD GPUs, but we believe this is a treacherous path. PyTorch is deeply intertwined with the NVIDIA ecosystem in a lot of ways (e.g., `torch.cuda` or scaled_dot_product_attention is an NVIDIA CUDA kernel exposed as a PyTorch function). So, to get PyTorch code running on non-NVIDIA hardware, there's a lot of \"de-NVIDIAfying\" that needs to be done.\nSolution: We believe JAX is a better fit for non-NVIDIA hardware. In JAX, ML model code compiles to hardware-independent HLO graphs, which are then optimized by the XLA compiler before hardware-specific optimization. This clean separation allowed us to run the same LLaMA3 JAX code both on Google TPUs and AMD GPUs with no changes.\nOur strategy as a company is to invest upfront in porting models to JAX, then leverage its framework and XLA kernels to extract maximum performance from non-NVIDIA backends. This is why we first ported Llama 3.1 from PyTorch to JAX, and now the same JAX model works great on TPUs and runs perfectly on AMD GPUs.\nWe'd love to hear your thoughts on our vision and repo!",
          "link": "https://news.ycombinator.com/item?id=41631152",
          "publishedOn": "2024-09-23T22:14:40.000Z",
          "wordCount": 3656,
          "title": "New comment by felarof in \"We fine-tuned Llama 405B on AMD GPUs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41631131",
          "author": "wwarner",
          "description": "In 1676 Roemer estimated the speed of light by timing the orbit of Jupiter’s moon Io, noting that as the Earth approached Jupiter, Io emerged from behind Jupiter a little earlier every day, and as the Earth traveled away from Jupiter it appeared a little later every day, with the time of day varying by 22 minutes over a year. Knowing the difference between the two distances, he reckoned that light travels that distance in 22 minutes, or 227 thousand km/s. The actual speed is about 300 thousand km/s. Not bad!",
          "link": "https://news.ycombinator.com/item?id=41631131",
          "publishedOn": "2024-09-23T22:12:01.000Z",
          "wordCount": null,
          "title": "New comment by wwarner in \"In 1870, Lord Rayleigh used oil and water to calculate the size of molecules\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41630264",
          "author": "wormlord",
          "description": "I know that this is a website for startups, but looking at art that people enjoy and put their soul into and thinking \"how can I extract profit from this\" I think is actually close to a mental illness.\nI understand that commodification is inevitable (and yes anime is already a soulless business), but goddamn if it doesn't look like some form of neurosis. It's like walking into an old growth forest and seeing the potential for a toothpick factory.",
          "link": "https://news.ycombinator.com/item?id=41630264",
          "publishedOn": "2024-09-23T20:39:14.000Z",
          "wordCount": 2086,
          "title": "New comment by wormlord in \"Anime is eating the world\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41629493",
          "author": "gwern",
          "description": "> If we want to put AI into the hands of as many people as possible, we need to drive down the cost of compute and make it abundant (which requires lots of energy and chips). If we don’t build enough infrastructure, AI will be a very limited resource that wars get fought over and that becomes mostly a tool for rich people.\nTranslation for the rest of us: \"we need to fully privatize the OA subsidiary and turn it into a B-corp which can raise a lot more capital over the next decade, in order to achieve the goals of the nonprofit, because the chief threat is not anything like existential risk from autonomous agents in the next few years or arms races, but inadequate commercialization due to fundraising constraints\".",
          "link": "https://news.ycombinator.com/item?id=41629493",
          "publishedOn": "2024-09-23T19:11:01.000Z",
          "wordCount": null,
          "title": "New comment by gwern in \"The Intelligence Age\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41626660",
          "author": "billyhoffman",
          "description": "Common Crawl is shown in their screen shot of \"Providers\" along side OpenAI and Antropic. The challenge is that Common Crawl is used for a lot of things that are not AI training. For example, it's a major source of content for the Wayback machine.\nIn fact, that's the entire point of the Common Crawl project. Instead of dozens of companies writing and running their (poorly) designed crawlers and hitting everyone's site, Common Crawl runs once and exposes the data in industry standard formats like WARC for other consumers. Their crawler is quite well behaved (exponential backoff, obeys Crawl-Delay, will use SiteMaps.xml to know when to revisit, follows Robots.txt, etc.).\nThere are significant knock-on effects if CloudFlare starts (literally) gatekeeping content. This feels like a step down the path to a world where the majority of websites use sophisticated security products that gatekeep access to those who pay and those who don't, and that applied whether they are bots or people.",
          "link": "https://news.ycombinator.com/item?id=41626660",
          "publishedOn": "2024-09-23T14:39:48.000Z",
          "wordCount": 11148,
          "title": "New comment by billyhoffman in \"Cloudflare's new marketplace lets websites charge AI bots for scraping\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41623942",
          "author": "debugnik",
          "description": "The usual censor for it is b****fuck, that should do it.",
          "link": "https://news.ycombinator.com/item?id=41623942",
          "publishedOn": "2024-09-23T08:59:52.000Z",
          "wordCount": 147,
          "title": "New comment by debugnik in \"Brainfuck Enterprise Solutions\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41623501",
          "author": "qnleigh",
          "description": "> I would have thought about privately disclosing these findings to Dotpe. But all the API requests are right there in plain sight...\nThere are pretty common ethical standards about disclosing vulnerabilities privately before disclosing them publicly. I don't see how the obviousness of the vulnerability changes the situation. By warning the company, you give them the opportunity to remedy the problem before announcing to the world that anyone with a laptop can exploit it. Probably they were just hoping that nobody would notice, which is stupid of course, but now they don't have the chance to build up a better wall before the flood of fake orders that could cause real harm to the small businesses whose financial information you disclosed online.\nPerhaps I'm being too optimistic about how the company would respond, but I still think it's hard to justify not doing a private disclosure.",
          "link": "https://news.ycombinator.com/item?id=41623501",
          "publishedOn": "2024-09-23T07:57:21.000Z",
          "wordCount": null,
          "title": "New comment by qnleigh in \"What's inside the QR code menu at this cafe?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41623005",
          "author": "rapnie",
          "description": "> Is this what the peak ordering experience looks like?\nCall me old-fashioned, but to me the peak experience is a paper menu to choose from, and a waiter that patiently takes the order. Far prefer that to everyone at the table fiddling on their phones in some weird-ass website or even god forbid custom app.",
          "link": "https://news.ycombinator.com/item?id=41623005",
          "publishedOn": "2024-09-23T06:43:30.000Z",
          "wordCount": 11369,
          "title": "New comment by rapnie in \"What's inside the QR code menu at this cafe?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41619113",
          "author": "pembrook",
          "description": "Anecdotal, but it seems like all the people who “build in public” end up trapped by their chosen distribution strategy.\nWhat I mean by this is, if you’re building in public there’s a 99% chance you’re going to end up building products for other indiehackers who are interested in following people who build in public.\nThis means you’re probably going to end up building yet another micro-Saas dev tool (Saas boilerplate, incident monitoring, etc) or growth hacking tool (for social media, SEO, cold email, AI content, etc).\nAnd you’ll probably get modest success fast, since indiehackers like tools that help them indiehack and if they follow you on social media to hear stories of how they can get rich quick, they’ll definitely buy a product from you promising to help them do that.\nHowever, I think you’ll struggle to ever “cross the chasm” so to speak into building a company that’s bigger than whatever online personality you build (no mass markets or low churn businesses without pyramid scheme dynamics).",
          "link": "https://news.ycombinator.com/item?id=41619113",
          "publishedOn": "2024-09-22T18:56:54.000Z",
          "wordCount": null,
          "title": "New comment by pembrook in \"Does “building in public” work?\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=53226",
          "author": "Belle Waring",
          "description": "I was going to write this super cool music thread with more songs in there than an Erik Loomis “I took time off writing my 1600th American grave post and 547th this day in labor history series to write a 27-part ‘I chance to have been listening to these songs,'” post where I talked about […]",
          "link": "https://crookedtimber.org/2024/09/25/final-choruses-and-outros-apparently/",
          "publishedOn": "2024-09-25T06:19:00.000Z",
          "wordCount": 3454,
          "title": "Final Choruses and Outros Apparently",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53223",
          "author": "Chris Bertram",
          "description": "Visit the post for more.",
          "link": "https://crookedtimber.org/2024/09/22/sunday-photoblogging-fountains-in-altona/",
          "publishedOn": "2024-09-22T06:17:38.000Z",
          "wordCount": 1841,
          "title": "Sunday photoblogging: fountains in Altona",
          "imageUrl": "https://live.staticflickr.com/65535/54001419506_70794129d1.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53215",
          "author": "Doug Muir",
          "description": "Every few years the UN publishes one of these big papers on “world population prospects”, which are… exactly what they sound like: a best guess at what’s going to happen with the world’s population over the next few decades. Nut graph after the jump: So the UN’s current best guess is that world population will […]",
          "link": "https://crookedtimber.org/2024/09/20/occasional-paper-united-nations-world-population-prospects-2024/",
          "publishedOn": "2024-09-20T18:37:57.000Z",
          "wordCount": 13788,
          "title": "Occasional Paper:  United Nations World Population Prospects, 2024",
          "imageUrl": "https://population.un.org/wpp/Graphs/2_Probabilistic%20Projections/1_Population/1_Total%20Population/World.svg"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/When-Israel-s-accomplices-accustom-us-to-a-monstrous-heartless-and-inhuman",
          "author": "Gideon Levy, Yorgos Mitralias",
          "description": "Worse than Israel's crimes is the fact that the entire so-called “civilized” world follows and comments on them as if they were just a video game. When, of course, it's not celebrating them by arming the criminal. Or approving them by letting them go unpunished. And it has been doing so for decades. And live on our TV screens. Day after day, hour after hour. As if these daily massacres were a never-ending TV series, interspersed with commercials, that we can follow lying on our sofas, while we (...)\nEnglish\n\n/ \nPalestine, \nIsrael, \nColonialism",
          "link": "https://www.cadtm.org/When-Israel-s-accomplices-accustom-us-to-a-monstrous-heartless-and-inhuman",
          "publishedOn": "2024-09-26T10:19:04.000Z",
          "wordCount": 2343,
          "title": "When Israel's accomplices accustom us to a monstrous, heartless and inhuman world!",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/a4fd68eb455209c2e91d1081f6161f-79c86.jpg"
        },
        {
          "id": "https://www.cadtm.org/The-gender-equity-farce-a-feminist-reading-of-World-Bank-policies",
          "author": "Camille Bruneau",
          "description": "The World Bank and the IMF are 80 years old. 80 years of financial neo-colonialism and the imposition of austerity policies in the name of debt repayment. 80 years is enough! The Bretton Woods institutions must be abolished and replaced by democratic institutions serving an ecological, feminist and anti-racist bifurcation. To mark these 80 years, we are republishing a series of articles every Wednesday, looking in detail at the history and damage caused by these two institutions. \nEnglish\n\n/ \nFeminisms, \nWorld Bank, \n80 ans BM FMI EN",
          "link": "https://www.cadtm.org/The-gender-equity-farce-a-feminist-reading-of-World-Bank-policies",
          "publishedOn": "2024-09-25T07:30:00.000Z",
          "wordCount": 11254,
          "title": "The “gender equity” farce: a feminist reading of World Bank policies",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L153xH80/7d67b536955c2d468284cb35bf57de-31f2b.png"
        },
        {
          "id": "https://www.cadtm.org/The-Latin-American-Left-amid-China-the-United-States",
          "author": "Eric Toussaint",
          "description": "Claudio Katz has just published a book in Spanish entitled America Latina en la encrucijada global [1] (Latin America at the Global Crossroads). Claudio Katz is a Marxist economist and professor at the University of Buenos Aires, author of some fifteen books concerning the Dependency theory fifty years after its emergence, imperialism today, and issues faced by the Latin American Left. His new book concentrates on Latin America and deals with the continent's relations with China and with (...)\nEnglish\n\n/ \nUnited States of America (USA), \nLatin America, \nChina",
          "link": "https://www.cadtm.org/The-Latin-American-Left-amid-China-the-United-States",
          "publishedOn": "2024-09-24T16:42:04.000Z",
          "wordCount": 10580,
          "title": "The Latin American Left amid China, the United States, late progressivism and the far Right",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L342xH180/6d8874aca83050425bc0a307cb1564-69087.jpg"
        },
        {
          "id": "https://www.cadtm.org/Forum-on-China-Africa-Cooperation-evades-contradictions-at-the-end-of-the-Belt",
          "author": "Patrick Bond",
          "description": "Introduction \nEnglish\n\n/ \nSouth Africa, \nChina, \nBRICS, \nBelt and Road, \nSub-imperialism",
          "link": "https://www.cadtm.org/Forum-on-China-Africa-Cooperation-evades-contradictions-at-the-end-of-the-Belt",
          "publishedOn": "2024-09-22T12:30:15.000Z",
          "wordCount": 12233,
          "title": "Forum on China-Africa Cooperation evades contradictions at the end of the Belt and Road: Chinese investment, finance and trade controversies in Southern Africa",
          "enclosure": {
            "url": "https://www.cadtm.org/IMG/png/100000000000078000000438bfa35013486db0a2-2.png",
            "length": "53539",
            "type": "image/png"
          },
          "imageUrl": "https://www.cadtm.org/IMG/png/100000000000078000000438bfa35013486db0a2-2.png"
        },
        {
          "id": "https://www.cadtm.org/South-Asia-in-the-New-Global-Debt-Crisis-A-Call-for-Collective-Solutions",
          "author": "Amali Wedagedara",
          "description": "Debt payments of developing countries exceed their national revenue. According to a new report, Resolving The Worst Ever Global Debt Crisis, 118 developing countries are experiencing debt distress, with a disproportionate share of their national revenue directed towards debt servicing in 2024 (Martin and Waddock 2024). Thirty-one countries have either defaulted or have access to external financing suspended due to high debt levels. Even though external debt is crippling economies in the (...)\nEnglish\n\n/ \nDebt campaign, \nSouth Asia, \nDebt crisis",
          "link": "https://www.cadtm.org/South-Asia-in-the-New-Global-Debt-Crisis-A-Call-for-Collective-Solutions",
          "publishedOn": "2024-09-22T10:59:48.000Z",
          "wordCount": 5372,
          "title": "South Asia in the New Global Debt Crisis – A Call for Collective Solutions",
          "enclosure": {
            "url": "https://www.cadtm.org/IMG/odt/election_article.odt",
            "length": "48638",
            "type": "application/vnd.oasis.opendocument.text"
          },
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1200xH630/9959eff072d013a16d56ec6c18a6e7-ce289.jpg"
        },
        {
          "id": "https://www.cadtm.org/Is-There-A-Life-Without-IMF-Debunking-The-Myth",
          "author": "Eric Toussaint",
          "description": "Given that Anura Kumara Dissanayake, the progressive presidential candidate from National People's Power, is leading in the election on September 21, 2024, it is crucial to consider the question: Could life exist without the IMF? \nVideos\n\n/ \nAusterity/Structural Adjustment, \nSri Lanka, \nIMF, \nDebt crisis",
          "link": "https://www.cadtm.org/Is-There-A-Life-Without-IMF-Debunking-The-Myth",
          "publishedOn": "2024-09-22T09:43:41.000Z",
          "wordCount": 2125,
          "title": "Is There A Life Without IMF: Debunking The Myth",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1200xH630/399ed8a3f8617433f4011de9c0bb20-02574.jpg"
        },
        {
          "id": "https://www.cadtm.org/Sri-Lanka-s-debt-default",
          "author": "Michael Roberts",
          "description": "Today, 21 September, Sri Lanka will hold its first presidential election since the July 2022 popular uprising known officially declared the worst economic crisis in the country in 73 years. Most foreign debt repayments were suspended after two years of money printing to support tax cuts. The economy contracted 7.8% and the percentage of the population earning less than $3.65 a day doubled to around 25% of the population. \nEnglish\n\n/ \nSri Lanka, \nDebt crisis, \nSouth",
          "link": "https://www.cadtm.org/Sri-Lanka-s-debt-default",
          "publishedOn": "2024-09-21T11:45:44.000Z",
          "wordCount": 2795,
          "title": "Sri Lanka's debt default",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L549xH288/ca8bbe83a6fce2b75aed8c647f0a4e-676e2.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=8577",
          "author": "disassociated.com",
          "description": "Google search does away with its cache, an archived copy of an earlier version of a webpage, but now links to the Internet Archive’s (IA) Wayback Machine copy instead. Try it on your own website, assuming it’s indexed by Google that is. On the search result, click the “more about this page” button, which will […]",
          "link": "https://disassociated.com/internet-archive-wayback-machine-link-replaces-google-search-cache/",
          "publishedOn": "2024-09-26T21:00:58.000Z",
          "wordCount": 271,
          "title": "Internet Archive Wayback Machine link replaces Google search cache",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8573",
          "author": "disassociated.com",
          "description": "Australian teachers in NSW, now have access to NSWEduChat, a generative artificial intelligence (AI) tool, intended to help educators get a grip on AI tools: The tool aims to provide additional support to staff in developing and delivering teaching experiences, easing workload demands, and empowering users to advance their AI skills in a safe environment. […]",
          "link": "https://disassociated.com/nsweduchat-generative-ai-tool-australian-teachers-nsw/",
          "publishedOn": "2024-09-26T20:30:29.000Z",
          "wordCount": 255,
          "title": "NSWEduChat, an AI tool for Australian teachers in NSW",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8582",
          "author": "disassociated.com",
          "description": "A few days ago, a group called the Social Web Foundation was launched. A coming together of “leaders of the open social networking movement“, the foundation aims to make “connections between social platforms with the open standard protocol ActivityPub.” Rather than me reinventing the wheel, here’s the Wikipedia definition of ActivityPub: ActivityPub is a protocol […]",
          "link": "https://disassociated.com/when-social-web-not-social-web/",
          "publishedOn": "2024-09-26T20:00:07.000Z",
          "wordCount": 1068,
          "title": "When is the social web not the social web? When it is THE social web",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8565",
          "author": "disassociated.com",
          "description": "The iPhone 16, Apple’s latest smartphone, has arrived on shop shelves. There are four versions of the device: 16, 16 Plus, 16 Pro, and 16 Pro Max. In time all will feature Apple Intelligence, Apple’s artificial intelligence (AI) offering, which will be “deeply integrated” into iOS18 and other Apple operating systems. From what I can […]",
          "link": "https://disassociated.com/ai-changing-photos-classified-photos-memories/",
          "publishedOn": "2024-09-25T21:00:29.000Z",
          "wordCount": 526,
          "title": "AI is changing the way photos are classified, photos or memories",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8552",
          "author": "disassociated.com",
          "description": "Amazon, the online retailer and tech company, has directed all employees to return to the office by early January 2025. Presently workers are required to be in the workplace at least three days a week. In a recent companywide announcement, CEO Andy Jassy says he wants to do away with the current hybrid working arrangement […]",
          "link": "https://disassociated.com/bringing-everyone-back-workplace-does-little-company-culture/",
          "publishedOn": "2024-09-24T21:00:47.000Z",
          "wordCount": 471,
          "title": "Bringing everyone back to the workplace does little for company culture",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8562",
          "author": "disassociated.com",
          "description": "I’m guessing a few people had a sleepless night on Monday/Tuesday, after getting hold of the new Sally Rooney novel, Intermezzo, at one of the midnight release events earlier this week. Book reviewers, meanwhile, were probably lucky enough to score an advanced reader copy (ARC), at some point beforehand. Anyway, no spoilers here, just some […]",
          "link": "https://disassociated.com/intermezzo-sally-rooney-early-reviews-thoughts-critics/",
          "publishedOn": "2024-09-24T20:30:01.000Z",
          "wordCount": 366,
          "title": "Intermezzo by Sally Rooney: early thoughts, reviews from critics",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8549",
          "author": "disassociated.com",
          "description": "Sara E. Teller, writing for Legal Reader: The research, published in BMC Medicine, focuses on the use of video games, particularly the well-known Tetris game that has been around for decades, to help reduce intrusive memories, a core and sometimes debilitating symptom of the condition. Invented in 1984 by Alexey Pajitnov, Tetris is a straightforward […]",
          "link": "https://disassociated.com/playing-tetris-may-ease-post-traumatic-stress-disorder-symptoms/",
          "publishedOn": "2024-09-23T21:00:47.000Z",
          "wordCount": 176,
          "title": "Playing Tetris may ease post-traumatic stress disorder symptoms",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8542",
          "author": "disassociated.com",
          "description": "American writer and researcher, Gwern Branwen: But how can I not want to write a book? And I get it: writing a book is sacred and unquestionable, the ultimate achievement for Western intellectuals — better than being arrested in a protest (because you don’t have to get sweaty), better than a PhD (because not so […]",
          "link": "https://disassociated.com/writing-book-may-be-health-hazard-just-ask-writer/",
          "publishedOn": "2024-09-22T21:00:14.000Z",
          "wordCount": 255,
          "title": "Writing a book may be a health hazard, just ask a writer",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8540",
          "author": "disassociated.com",
          "description": "Applying for a job, going through the interview process and what not, is much like walking on eggshells. Take one wrong step, and all your efforts may be for nothing. Even something as seemingly innocuous as the way you like your cup of coffee prepared, could be your undoing: I won’t say what work we […]",
          "link": "https://disassociated.com/your-coffee-order-subliminal-revealing-job-interview-question/",
          "publishedOn": "2024-09-22T20:30:33.000Z",
          "wordCount": 231,
          "title": "Your coffee order, a subliminal yet revealing, job interview question?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8538",
          "author": "disassociated.com",
          "description": "There’s the challenge. There’s the adventure, the pioneering spirit, of setting off to another planet. Not everything is, or should be, easy. But are those really the right reasons for wishing to establish a human colony on the fourth rock from the Sun, Mars? Mars does not have a magnetosphere. Any discussion of humans ever […]",
          "link": "https://disassociated.com/unfortunately-colonising-mars-not-great-idea/",
          "publishedOn": "2024-09-22T20:00:08.000Z",
          "wordCount": 234,
          "title": "Unfortunately, colonising Mars is not a great idea",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20240925",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20240925",
          "publishedOn": "2024-09-25T23:00:00.000Z",
          "wordCount": 646,
          "title": "Week Ending September 22, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/singularity",
          "author": null,
          "description": "Fredric Jameson (1934-2024).",
          "link": "https://newleftreview.org/sidecar/posts/singularity",
          "publishedOn": "2024-09-26T14:44:21.000Z",
          "wordCount": 1803,
          "title": "Benjamin Kunkel: &ldquo;Singularity&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/09/jameson-nachruf-1.webp"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://yuricunha.bearblog.dev/i-would-like-to-die-but-i-dont-want-to-die/",
          "author": null,
          "description": "Two blog posts in the same week… this is the first time this has happened - maybe this is cool or good?\nI believe everyone here must know what depression is, right? Well, if you don’t know, you can click here and read more about it… Well, what probably some people don’t know is that there is chronic depression, meaning no matter how much you try to improve, change, take medication, find hobbies, or whatever the attempt may be; you will die with depression. And I’ve had it since I was 16, but I’m not going to tell you my age, right (I’m in my 20s, lol).\nIn the past, I have tried to kill myself, but I was saved by a guy who is a great friend, and at the time, I went to live at his house, to be away from everything and everyone, with my phone turned off, just studying 5/6 hours a day, creatin…",
          "link": "https://yuricunha.bearblog.dev/i-would-like-to-die-but-i-dont-want-to-die/",
          "publishedOn": "2024-09-26T07:37:17.140Z",
          "wordCount": 2185,
          "title": "i would like to die but i dont want to die",
          "imageUrl": "https://yuricunha.com/_next/image?url=%2Fstatic%2Fimages%2Fblog%2Fi-would-like-to-die-but-i-dont-want-to-die%2Fi-would-like-to-die-but-i-dont-want-to-die.gif&w=1920&q=75"
        },
        {
          "id": "https://birming.com/finding-strength-sharing/",
          "author": null,
          "description": "It's not only when we're wrong that we find it difficult to admit it. The same applies when we exhibit weakness in some way. Or rather, what we've come to believe is 'weakness'.\nThat's why it took so long for me to seek help when I was going through the most challenging time of my life. I thought it was a sign of weakness – a failure, a loser.\nWhen I finally came to my senses and got the help I needed, you might think that kind of foolish reasoning was finally gone, right? Nope, not at all!\nTwo weeks into treatment, I called my doctor and explained that I'd figured out how to fix this on my own. Of course, he strongly advised against it but said it was ultimately my decision.\nAfter the call, I started thinking...\n\"Why do I even want to do this on my own? It's because I think therapy is a s…",
          "link": "https://birming.com/finding-strength-sharing/",
          "publishedOn": "2024-09-25T15:56:00.000Z",
          "wordCount": 1890,
          "title": "Finding Strength in Sharing",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert/img_5705.png"
        },
        {
          "id": "https://yuricunha.bearblog.dev/reflections-on-solitude-and-superficiality/",
          "author": null,
          "description": "Hey,\nHow long has it been since I last created a blog post? 3 or 4 months? It’s been a long time and it has also been exhausting, both mentally and physically.\nHonestly, when I thought about posting something here, I had an idea of what I wanted to write, that is, I knew what the topic would be, but I didn’t know when I would write it because I am mentally exhausted.\nHave you ever wished that people wouldn’t talk to you? Because the only thing I’ve been thinking and wishing for is exactly that… I don’t want people to talk to me, I don’t care who it is, passerby or close friend, I just don’t want to talk or respond, so it can take me anywhere from seconds to weeks to respond, and it’s not because something happened or because I’m “afk” temporarily, but because I don’t feel like opening the …",
          "link": "https://yuricunha.bearblog.dev/reflections-on-solitude-and-superficiality/",
          "publishedOn": "2024-09-24T20:22:00.000Z",
          "wordCount": 2052,
          "title": "reflections on solitude and superficiality",
          "imageUrl": "https://yuricunha.com/_next/image?url=%2Fstatic%2Fimages%2Fblog%2Freflections-on-solitude-and-superficiality%2Freflections-on-solitude-and-superficiality.png&w=1920&q=75"
        },
        {
          "id": "https://blog.ruby.gay/five-years-of-hrt/",
          "author": null,
          "description": "five years! of estrogen!\nfive years! of breasts!\nfive years! of watching myself slowly morph into my mother\nfive years...\nthe lead up to getting on hrt nearly killed me. i came out to my mother when i was 17, and then to the rest of my family about a year later, just a few weeks before starting hormones. in the year between was a lot of counseling and therapy, working with specialists to try to figure out if this was really what i wanted (it was).\ncoming out wasn't really my choice; the doctor said that they could \"try to do some creative billing,\" but that ultimately the bill would go through from the gender clinic, and the main insurance holder (my dad) would be able to see that. i was lucky enough that nobody in my (immediate) family cared too much. they all eventually moved over to my new name and pronouns (they/them, at the time -- being referred to as a woman then was, strangely, dysphoria inducing -- but she/her nowadays).\nfive years...\nfive years ago i was fresh out of high school. five years ago i had no direction. five years ago i had only barely begun to separate from my abusive father. five years ago i felt powerless.\nfive years later and a lot has changed. i'm away from him now! i broke into the software industry. i moved twice, i'm living with my partner (whom i met within the last five years). i've met so many wonderful friends. i've lost a few. i've bought a car. i've gotten over my long-standing fear of roller coasters. i've had more than a few mental health episodes... i've also healed a lot of trauma and anxiety. i've learned to be so much of a better person.\nand yes, five years of hormones. five years of ruby.\nwonder what'll happen in the next five!",
          "link": "https://blog.ruby.gay/five-years-of-hrt/",
          "publishedOn": "2024-09-24T18:38:00.000Z",
          "wordCount": 1581,
          "title": "five years of hrt",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/wooby/favicon.png"
        },
        {
          "id": "https://itskristin.bearblog.dev/there-just-isnt-much-to-say/",
          "author": null,
          "description": "I’ve found that bloggers on this site are very passionate about the idea that you should challenge yourself to blog every day. it’s good for you to work out the writing muscle in your brain, it documents your thoughts, you have an archive of who you are, etc etc.\nI don’t have much to say. it’s not that I lead some boring life, sometimes you just don’t have anything to comment on. this is a remarkable change for me as someone who tweeted at least 20 times a day over the past three years, but even then most twitter posts are just reactions to other twitter posts. I’ve never really just posted status updates of what I’m doing that day, I’m just commenting on something that came up on my for you.\nI have the same issue with journaling. sometimes there is just nothing to say and no introspection to be done. I went to work, my coworkers did this, my kids did this, my parents are doing this, I’m doing whatever. it’s just, like, nothing.\nthis isn’t to say that everyone that blogs everyday is some sort of super genius with so much insight to offer the world so it’s only natural that they post everyday, because that’s not the case either. a lot of posts I see recently are quotes of something someone found elsewhere, responses to other blogs, blogging about blogging (like I’m doing now), or the typical introspective post.\nI don’t know. I’m in the middle. viewing this from a quality over quantity perspective, you wouldn’t want to post everyday so you can just put out your best stuff, but isn’t blogging supposed to be about you? isn’t it supposed to be for you? and not the clamor for engagement and eyes on your post?\nbut it’s different for everyone, I guess. some people use bearblog like a portfolio, others like a diary, and others like a media dumping ground.\ndo what you want I guess is the answer here, if there’s an answer at all. no need for an answer, really.\non my end, I don’t think I’ll be a daily blogger. there just isn’t much to say. 🤷🏾‍♀️\nreply via email",
          "link": "https://itskristin.bearblog.dev/there-just-isnt-much-to-say/",
          "publishedOn": "2024-09-24T18:21:58.977Z",
          "wordCount": 1376,
          "title": "there just isn’t much to say",
          "imageUrl": "https://i.imgur.com/JinBrPU.png"
        },
        {
          "id": "https://birming.com/right-way-wrong/",
          "author": null,
          "description": "\"I could be wrong; I've been wrong once before.\"\nA former coworker of mine used to say this. Of course, he said it as a joke, but it's also a classic example of 'it's funny because it's true'.\nNo one would seriously express themselves this way, but it seems to be the attitude many people harbor. I was reminded of this when I read Manuel Moreale's great post, It should be easy to say \"My bad, I was wrong\". He writes:\nSaying \"I was wrong\" is a sign you're willing to get better and improve.\nSo true! Making mistakes and being wrong is part of life's learning curve, from the moment we take our first stumbling steps. We learn, develop, and move forward with newfound knowledge and wisdom.\nBut it's as if our delicate little egos, built on something as fragile as always being right, are afraid of perishing if they admit to being wrong. It's not only a fragile existence but also a very foolish attitude.\nOften, when we make mistakes, it's partly because someone else taught us wrong from the beginning. So, it's not just our own ego we're trying to protect but others as well. An impossible mission where the only thing that will self-destruct is ourselves.\nAdmitting that we were wrong is not only the right thing to do. It's also significantly easier than fighting for the right to \"be right.\"\nLet's all do the right thing when we're wrong by simply saying:\nSorry, I was wrong.\nmail Email\n print Print\n share Share",
          "link": "https://birming.com/right-way-wrong/",
          "publishedOn": "2024-09-24T15:06:00.000Z",
          "wordCount": 1787,
          "title": "The Right Way to Be Wrong",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert/image-7.png"
        },
        {
          "id": "https://lucio.bearblog.dev/the-sisyphean-task-of-getting-hired/",
          "author": null,
          "description": "So, I'm currently on the hunt for a job. I was previously in a decently paid if incredibly monotonous QA job and while the firing sucked, I wasn't particularly distraught over it: I went to work there mainly because there was a lot of downtime and it gave me time to do homework and prepare for tests, so I didn't have to pick between school and work, and instead do school at work. Beyond that, it was fairly dead-end job and once I was approaching graduation I started looking for greener, brighter pastures.  \"Maybe a gaming job,\" I thought to myself, \"or just a regular backend gig. I'm sure I can find some sort of junior position to slot into in no time at all.\"\nThat was about four months ago and now my standards are somewhere along the Mariana Trench.\nI want HR teams across the country to u…",
          "link": "https://lucio.bearblog.dev/the-sisyphean-task-of-getting-hired/",
          "publishedOn": "2024-09-24T12:24:00.000Z",
          "wordCount": 1311,
          "title": "The Sisyphean Task of Getting Hired",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://blog.aurahack.jp/new-post/",
          "author": null,
          "description": "This was originally written for Cohost.org\nI’ve not… really… spent a lot of energy thinking of a “my time on Cohost” retrospective post like some folks have done (which have all been a pleasure to read!) because I’m not sure I really can. I think it’s easy to pick apart the stuff that’s individually made Cohost such a wonderful place to exist on, and certainly added to the greater whole of the thing, but trying to sum up everything into A Post feels impossible. How do you sum up years of emotion and attachment in a way that’s, like, understandable to others outside your specific lived experience on a website built to let the individual tailor it to their desires.\nI tried tackling some of it in my last blog post in a more pointed manner. I’ve been spending a lot more time sorta doomer-think…",
          "link": "https://blog.aurahack.jp/new-post/",
          "publishedOn": "2024-09-24T00:08:00.000Z",
          "wordCount": 1276,
          "title": "Goodbye, Cohost",
          "imageUrl": "https://aurahack.neocities.org/header.png"
        },
        {
          "id": "https://coco-fraise.bearblog.dev/on-having-outgrown-a-city/",
          "author": null,
          "description": "This impression is staying on my skin like ink stays on the stamp after the paper has already been stamped.\nIt’s as if every step has already been had. Every smile has been smiled. Every breath has been breathed. Every corner has been explored. One unique place holds on so much memories that it is starting to feel crowded, like this one subway line at 6:38 at night when you come back from work.\nI feel this way about Lyon, the city where I grew up. In a kind of weird way that I did not notice at first, this impression became tiring.\nIt felt like being physically attached to my past. When you see multiple memories at every corner of the street, it makes creating new memories a bit more difficult.\nI’ll give you an example.\nThis morning, I was just out for a morning run and I turned the corner…",
          "link": "https://coco-fraise.bearblog.dev/on-having-outgrown-a-city/",
          "publishedOn": "2024-09-23T17:03:00.000Z",
          "wordCount": 1438,
          "title": "On having outgrown a city",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://birming.com/hell-healing/",
          "author": null,
          "description": "”In your darkest hour, what saved you? What helped you find the strength to carry on?”\nThese are the questions posed by Matthew Graybosch for September's IndieWeb Carnival, Power Underneath Despair.\nMy darkest moment in life occurred about five years ago. For a long time, I understood that something wasn't right, but refused to accept it — both for those around me and for myself.\n\"I'm handling this myself! I won’t let anyone think there’s something wrong with me, ever. I got this!\"\nI tried weight training, yoga, meditation, running, seeking spirituality, reading books, attending online events, going on retreats…\nWhile these activities provided some temporary relief, they weren't enough. My issues ran deeper. I needed professional help but had the foolish belief that seeking it was a sign o…",
          "link": "https://birming.com/hell-healing/",
          "publishedOn": "2024-09-23T16:08:00.000Z",
          "wordCount": 1897,
          "title": "From Hell to Healing",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert/img_5671.png"
        },
        {
          "id": "https://jkap.io/one-week-until-i-stop-casually-using-social-media/",
          "author": null,
          "description": "this was crossposted from cohost. the original url was cohost.org/jkap/post/7810928-one-week-until-i-sto\none week until i stop casually using social media. if you see my ass again it's because i need to promote something or i'm reblogging art i like.\nthe past few years have taught me that i really don't like the microblogging style of social media. you would think that a shorter character limit would lead to concision but it doesn't; it just encourages you to split your thoughts across multiple posts.\ni never really enjoyed \"posting\" on tumblr (which i realize sounds silly given that cohost lifted from tumblr's design the most) so i'm unlikely to start doing that. i genuinely think this might be it for me. i will retreat to my group chats with friends and move to the pre-social media model: if i want to know how my friends are doing, i'll ask them. if i'm gonna be in town somewhere and want to see someone, i'll message them instead of posting into the void.\nit's all the same core theme: being deliberate. a focus on social media can hamper your relationships with your non-social media-using friends; they don't know what's going on because you're shouting into the void and they're not in it, but you don't actively talk to them because there's this subconscious assumption that everyone Important to you sees your posts.\nanyway. i'm pretty sure i think about social media more than the average person. i'm looking forward to never thinking about social media again.",
          "link": "https://jkap.io/one-week-until-i-stop-casually-using-social-media/",
          "publishedOn": "2024-09-23T14:42:59.487Z",
          "wordCount": 846,
          "title": "one week until i stop casually using social media",
          "imageUrl": "https://files.crime.team/eggbug-profile.jpg"
        },
        {
          "id": "https://birming.com/bear-share-buttons/",
          "author": null,
          "description": "Bear Share Buttons\nThis add-on for the Bearming theme allows you to include buttons for emailing, printing, and sharing your blog posts on social media (see examples at the bottom of this page).\nTo use the add-on, which requires the latest version of the Bearming theme (1.3), add the code below to the end of your posts. If you prefer to avoid adding it manually each time, paste the code into your post template (Bear dashboard -> Posts -> Edit template).\n<ul class=\"share\">\n<li><a href=\"mailto:?subject={{ post_title }}&body=Hey there,%0D%0A%0D%0AI saw this post and thought you might like it:%0D%0A{{ post_link }}\"><span class=\"material-icons\">mail</span> Email</a></li>\n<li><a href=\"javascript:if(window.print)window.print()\"> <span class=\"material-icons\">print</span> Print</a></li>\n<li><a href=\"https://www.addtoany.com/share#url={{ post_link }}&title={{ post_title }}\" target=\"_blank\"> <span class=\"material-icons\">share</span> Share</a></li>\n</ul>\n\nThen add the following style to your theme:\n/* Share buttons */\n.share {\n  margin: 30px 0;\n  padding: 0;\n  list-style: none;\n  font-family: var(--font-secondary);\n  font-size: 13px;\n}\n.share li {\n  display: inline;\n  margin-right: 7px;\n  line-height: 41px;\n}\n.share a {\n  padding: 6px 10px;\n  color: var(--link-color);\n  text-decoration: none;\n  border: 1px solid var(--link-color);\n  border-radius: 6px;\n  background-color: var(--background-color);\n}\n.share a:hover {\n  background-color: var(--accent-color);\n}\n.material-icons {\n  font-family: 'Material Icons';\n  font-size: 16px;\n  color: var(--link-color);\n  vertical-align: text-top;\n  text-rendering: optimizeLegibility;\n  -moz-osx-font-smoothing: grayscale;\n  font-feature-settings: 'liga';\n}\n\nThat's it! I hope your readers find this feature useful.\nmail Email\n print Print\n share Share",
          "link": "https://birming.com/bear-share-buttons/",
          "publishedOn": "2024-09-22T14:16:00.000Z",
          "wordCount": 1727,
          "title": "Bear Share Buttons",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert/img_5654.png"
        },
        {
          "id": "https://blog.avas.space/engagement/",
          "author": null,
          "description": "I proposed in front of a castle :) she said yes!\nPublished {{ post_published_date }}, edited {{ post_last_modified }} ago",
          "link": "https://blog.avas.space/engagement/",
          "publishedOn": "2024-09-22T14:13:58.298Z",
          "wordCount": 617,
          "title": "i got engaged!",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/avas-1709500835-0.png"
        },
        {
          "id": "https://louplummer.lol/life-s-simple-pleasures/",
          "author": null,
          "description": "One of the ways that I'm fortunate is that I enjoy simple pleasures the most. I have no need for elaborate, constant, and expensive variety to be satisfied. It's not that I don't enjoy an occasional adventure—I do. It's just that I am very happy to have a nice time in my own home, surrounded by the things I've already accumulated that bring me pleasure. It was only as a teenager that I felt that restless call to get out and get away from home to experience something besides the same old, same old.\nGranted, our at-home entertainment choices today are much more varied than they were in the 70s and 80s when I was coming of age. I don't have to spend an hour at the Record Bar to find new music. I enjoyed it then, but I also enjoy the way we discover music today. I've been to a few really enjoy…",
          "link": "https://louplummer.lol/life-s-simple-pleasures/",
          "publishedOn": "2024-09-22T11:30:00.000Z",
          "wordCount": 1196,
          "title": "Life's Simple Pleasures",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/livingoutloud/img_3402.jpg"
        },
        {
          "id": "https://blog.someplace-else.xyz/photo-mode-0/",
          "author": null,
          "description": "<img src=\"https://natclayton.uk/wp-content/uploads/2024/09/dsc00033.jpg\" width:100%/>\n(note: this post is image-heavy)\nI bought a new camera this week. Or, at least, a refurbished one, purchased on impulse as part of a mad scramble to fill my life with things to do that don't involve looking at a computer.\nThis isn't my first flirtation with photography. A brief obsession with the fantastic Umurangi Generation pushed me to pick up a cheap Centon df300 a few years back. I love film, I really do; the warm texture of shots, the ritual of getting it developed, the unpredictability of how things will turn out. But between the cost and time it took to see the results and the technical fussiness of keeping a decades-old handheld working, I slowly began to fall off.\n<img src=\"https://natclayton.uk…",
          "link": "https://blog.someplace-else.xyz/photo-mode-0/",
          "publishedOn": "2024-09-21T15:49:00.000Z",
          "wordCount": 967,
          "title": "Photo Mode",
          "imageUrl": "https://natclayton.uk/wp-content/uploads/2024/09/dsc00033.jpg"
        },
        {
          "id": "https://birming.com/mom-love/",
          "author": null,
          "description": "Today marks exactly one year since my dear dad was laid to rest. I want to share the beautiful words that my mother wrote today:\n”If I could give you one thing in life, it would be the ability to see yourself through my eyes. Only then would you truly understand how special you've been to me. If I did anything right in my life, it was when I gave my heart to you. I will love you forever and ever.”",
          "link": "https://birming.com/mom-love/",
          "publishedOn": "2024-09-20T15:50:00.000Z",
          "wordCount": 1589,
          "title": "From mom with love",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert/img_5635.png"
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/alexander-dunlap-book-review-we-are-forests-inhabiting-territories-in-struggle?v=1727332502",
          "author": null,
          "description": "Author: Alexander Dunlap\nTitle: Book Review: “We Are Forests: Inhabiting Territories in Struggle”\nDate: 2024/09/25\nSource: https://undisciplinedenvironments.org/2024/09/25/book-review-we-are-forests-inhabiting-territories-in-struggle-cambridgepolity-2023/\n\n Jean-Baptiste Vidalou, “We Are Forests: Inhabiting Territories in Struggle” (Cambridge: Polity, 2023) \n It’s shameful. The original French publication of We are Forests: Inhabiting Territories in Struggle by Jean-Baptiste Vidalou was in my hands since April 2018. Frequently described as “the French Seeing Like a State,” the book explores the art of state making in France. Having been in stimulating dialogues with Jean-Baptiste Vidalou (JBV) since 2018, and being linguistically challenged, I knew the general ideas and points in the book—…",
          "link": "https://theanarchistlibrary.org/library/alexander-dunlap-book-review-we-are-forests-inhabiting-territories-in-struggle?v=1727332502",
          "publishedOn": "2024-09-26T06:35:02.000Z",
          "wordCount": 2018,
          "title": "Alexander Dunlap - Book Review: “We Are Forests: Inhabiting Territories in Struggle”",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "10686",
            "url": "https://theanarchistlibrary.org/library/alexander-dunlap-book-review-we-are-forests-inhabiting-territories-in-struggle.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/ethel-mannin-bread-and-roses?v=1727218691",
          "author": null,
          "description": "Author: Ethel Mannin\nTitle: Bread and Roses\nSubtitle: An Utopian Survey and Blueprint\nDate: December 1944\nNotes: London, December, 1943 -May, 1944.\nSource: https://archive.org/details/in.ernet.dli.2015.213271/page/n7\n\nI. UTOPIA — THE EVERLASTING DREAM\n Throughout the ages, from the earliest times, men of all nations have dreamed of that ‘ideal commonwealth whose inhabitants exist under perfect conditions’. What constitutes ‘perfect conditions’ is obviously a matter of personal preferences and prejudices, but there is a common basis to the visionary dream in all its forms — the increase of human happiness, or, perhaps, more accurately, well-being — the greatest good for the greatest number, whether it is the Golden Age of ancient Greek and Roman mythology, or the confused contemporary dream…",
          "link": "https://theanarchistlibrary.org/library/ethel-mannin-bread-and-roses?v=1727218691",
          "publishedOn": "2024-09-24T22:58:11.000Z",
          "wordCount": 80180,
          "title": "Ethel Mannin - Bread and Roses",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "197529",
            "url": "https://theanarchistlibrary.org/library/ethel-mannin-bread-and-roses.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/enemy-of-the-state-an-interview-with-john-zerzan?v=1727218416",
          "author": null,
          "description": "Author: John Zerzan, Derrick Jensen\nTitle: Enemy of the State: An Interview with John Zerzan\nDate: September 1, 1998\nSource: Retrieved on December 11, 2020 from <derrickjensen.org/1998/09/enemy-state-interview-john-zerzan>\n\nDJ: What is Anarchism? \nJZ: I would say Anarchism is the attempt to eradicate all forms of domination. This includes not only such obvious forms as the nation-state, with its routine use of violence and the force of law, and the corporation, with its institutionalized irresponsibility, but also such internalized forms as patriarchy, racism, homophobia. Also it is the attempt to expose the ways our philosophy, religion, economics, and other ideological constructions perform their primary function, which is to rationalize or naturalize–make seem natural–the domination tha…",
          "link": "https://theanarchistlibrary.org/library/enemy-of-the-state-an-interview-with-john-zerzan?v=1727218416",
          "publishedOn": "2024-09-24T22:53:36.000Z",
          "wordCount": 10506,
          "title": "John Zerzan, Derrick Jensen - Enemy of the State: An Interview with John Zerzan",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "27272",
            "url": "https://theanarchistlibrary.org/library/enemy-of-the-state-an-interview-with-john-zerzan.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/john-crump-not-quite-an-anarchist?v=1727094416",
          "author": null,
          "description": "Author: John Crump\nTitle: Not Quite an Anarchist\nDate: October 1964\nNotes: Published in Anarchy #44.\nSource: Retrieved on 23rd September 2024 from libcom.org\n\n “THOMAS PAINE … WAS NEVER ENOUGH of an optimist to let his natural anarchism run its full course.”[1] His contemporary, William Godwin, said in his “Enquiry Concerning Political Justice” (1793), “With what delight must every well-informed friend of mankind look forward to the dissolution of political government, of that brute engine which has been the only perennial cause of the vices of mankind … and no otherwise to be removed than by its utter annihilation.” Paine takes a more negative stance:— “Some writers have so confounded society with government as to leave little or no distinction between them; whereas they are not only diff…",
          "link": "https://theanarchistlibrary.org/library/john-crump-not-quite-an-anarchist?v=1727094416",
          "publishedOn": "2024-09-23T12:26:56.000Z",
          "wordCount": 1870,
          "title": "John Crump - Not Quite an Anarchist",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "8547",
            "url": "https://theanarchistlibrary.org/library/john-crump-not-quite-an-anarchist.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/carne-ross-anarchy-is-love?v=1727069956",
          "author": null,
          "description": "Author: Carne Ross\nTitle: Anarchy is Love\nDate: Summer 2024\nSource: Dope 26\n\n I used to think that anarchism was “just” a political philosophy. I was wrong. It is much, much more than that. \n By political philosophy, I mean a way of thinking about politics, institutions and decision-making. How people arbitrate their business with one another, theories of government – or self-government – or the abolition of all hierarchy. I liked to boil down anarchism into a few pithy phrases like, “anarchism is about no one having power over anyone else.” \n I was not wrong. Anarchism is indeed about all of these things. It is indeed a political philosophy. It is indeed about how people take decisions together and manage their affairs collectively. But I thought this was its philosophy in toto, that ther…",
          "link": "https://theanarchistlibrary.org/library/carne-ross-anarchy-is-love?v=1727069956",
          "publishedOn": "2024-09-23T05:39:16.000Z",
          "wordCount": 1530,
          "title": "Carne Ross - Anarchy is Love",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7031",
            "url": "https://theanarchistlibrary.org/library/carne-ross-anarchy-is-love.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/p-b-the-making-of-the-spanish-cnt-iwa-2010-2024?v=1727043833",
          "author": null,
          "description": "Author: P. B.\nTitle: The Making of the Spanish CNT-IWA (2010–2024)\nDate: September 21, 2024\nSource: Retrieved on 23rd September 2024 from libcom.org\n\n It is about 7 years since the spanish CNT-AIT organisation came into existence. Despite its name, which claims a historical trajectory, it is a split from the CNT. A split of almost an entire internal current which fought for control of the Confederation by all possible means, and eventually failed. In short, this is why it ended up outside. This (rather incomplete) article resumes the story of that conflict as seen through the eyes of what is now the CNT (CIT). \nThe Cordoba Congress, 2010\n If we trace back the origins, some can go back to the debates at the Cordoba Congress in 2010. Other people might consider that the position of what woul…",
          "link": "https://theanarchistlibrary.org/library/p-b-the-making-of-the-spanish-cnt-iwa-2010-2024?v=1727043833",
          "publishedOn": "2024-09-22T22:23:53.000Z",
          "wordCount": 7853,
          "title": "P. B. - The Making of the Spanish CNT-IWA (2010–2024)",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "27697",
            "url": "https://theanarchistlibrary.org/library/p-b-the-making-of-the-spanish-cnt-iwa-2010-2024.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}