{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "9cfd65284251edc6dd58c8e354d0d331f26c8185",
          "author": "Donnie Prakoso",
          "description": "In the last AWS Weekly Roundup, Channy reminded us on how life has ups and downs. It’s just how life is. But, that doesn’t mean that we should do it alone. Farouq Mousa, AWS Community Builder, is fighting brain cancer and Allen Helton, AWS Serverless Hero, his daughter is fighting leukemia. If you have a […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-new-aws-heroes-amazon-api-gateway-amazon-q-and-more-june-10-2024/",
          "publishedOn": "2024-06-10T16:02:48.000Z",
          "wordCount": 1539,
          "title": "AWS Weekly Roundup: New AWS Heroes, Amazon API Gateway, Amazon Q and more (June 10, 2024)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/06/10/AWS-WIR-default-1.png"
        },
        {
          "id": "601196434e43e79993b9d6b3fc9bcffdf6c5b9af",
          "author": "Danilo Poccia",
          "description": "Map enterprise controls to AWS data sources effortlessly with predefined, pre-mapped controls based on auditor reviews. Automatically inherit improvements as Audit Manager updates.",
          "link": "https://aws.amazon.com/blogs/aws/simplify-risk-and-compliance-assessments-with-the-new-common-control-library-in-aws-audit-manager/",
          "publishedOn": "2024-06-06T18:59:12.000Z",
          "wordCount": 1788,
          "title": "Simplify risk and compliance assessments with the new common control library in AWS Audit Manager",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/04/17/CommonControls-feat-img2.png"
        },
        {
          "id": "064422b90ddb5c6a2f9e1679e220258b147e6e10",
          "author": "Taylor Jacobsen",
          "description": "The vibrant AWS community is made up of millions of builders worldwide. Within this global audience, there are technical enthusiasts who are going above and beyond to solve problems and generously share their learnings and best practices to empower others—the AWS Heroes. These inspirational leaders make significant contributions, and the AWS Heroes program is our […]",
          "link": "https://aws.amazon.com/blogs/aws/our-brand-new-cohort-of-aws-heroes-has-arrived-june-2024/",
          "publishedOn": "2024-06-05T17:01:57.000Z",
          "wordCount": 1445,
          "title": "Our brand-new cohort of AWS Heroes has arrived – June 2024",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/10/AWS-Heroes-program_RGB_Social-blog.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": [
        {
          "id": "68a73badc4128fca45f9a02fca4a40354c43ba89",
          "author": "Rostislav Markov",
          "description": "Genomics workflows process petabyte-scale datasets on large pools of compute resources. In this blog post, we discuss how life science organizations can use Amazon Web Services (AWS) to run transcriptomic sequencing data analysis using public datasets. This allows users to quickly test research hypotheses against larger datasets in support of clinical diagnostics. We use AWS […]",
          "link": "https://aws.amazon.com/blogs/architecture/genomics-workflows-part-7-analyze-public-rna-sequencing-data-using-aws-healthomics/",
          "publishedOn": "2024-06-05T15:46:19.000Z",
          "wordCount": 2259,
          "title": "Genomics workflows, Part 7: analyze public RNA sequencing data using AWS HealthOmics",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fc074d501302eb2b93e2554793fcaf50b3bf7291/2024/06/04/ARCHBLOG-1026-rna-sequencing-using-healthomics-1260x587.png"
        }
      ]
    },
    {
      "title": "The GitHub Blog: Engineering News and Updates",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/category/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": [
        {
          "id": "e266f15f4c44e10267e7203bc95772d1893f4740",
          "author": "Brendan Jenkins",
          "description": "Operators, administrators, developers, and many other personas leveraging AWS come across multiple common issues when it comes to troubleshooting in the AWS Console. To help alleviate this burden, AWS released Amazon Q. Amazon Q is AWS’s generative AI-powered assistant that helps make your organizational data more accessible, write code, answer questions, generate content, solve problems, […]",
          "link": "https://aws.amazon.com/blogs/devops/five-troubleshooting-examples-with-amazon-q/",
          "publishedOn": "2024-06-07T11:05:29.000Z",
          "wordCount": 2631,
          "title": "Five troubleshooting examples with Amazon Q",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/05/30/Slide4.png"
        },
        {
          "id": "164df924bc95becc32ff082f3115d9fb5a422c33",
          "author": "Matt Laver",
          "description": "AWS CodeBuild now supports managed self-hosted GitHub Action runners, allowing you to build powerful CI/CD capabilities right beside your code and quickly implement a build, test and deploy pipeline. Last year AWS announced that customers can define their GitHub Actions steps within any phase of a CodeBuild buildspec file but with a self-hosted runner, jobs […]",
          "link": "https://aws.amazon.com/blogs/devops/aws-codebuild-managed-self-hosted-github-action-runners/",
          "publishedOn": "2024-06-07T10:52:45.000Z",
          "wordCount": 2558,
          "title": "AWS CodeBuild Managed Self-Hosted GitHub Action Runners",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/06/06/Screenshot-2024-06-06-at-22.23.01-1121x630.png"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/fd78328ee0bb",
          "author": "Netflix Technology Blog",
          "description": "At Netflix, we want to ensure that every current and future member finds content that thrills them today and excites them to come back for…",
          "link": "https://netflixtechblog.com/round-2-a-survey-of-causal-inference-applications-at-netflix-fd78328ee0bb?source=rss----2615bd06b42e---4",
          "publishedOn": "2024-06-06T20:10:54.000Z",
          "wordCount": 5149,
          "title": "Round 2: A Survey of Causal Inference Applications at Netflix",
          "imageUrl": "https://miro.medium.com/v2/da:true/resize:fit:823/0*e8IMSJf7p60mk-WG"
        }
      ]
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": []
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=324992",
          "author": "L. Michael Hager",
          "description": "With likely findings of war crimes and genocide by the International Court of Justice (ICJ) against Israel; and arrest warrants against two members of the Israeli war cabinet by the International Criminal Court (ICC), it may be time to consider the possible liabilities of the state and individual parties that have aided and abetted Israel in its war on Gaza. What are the governing laws?  How have the international legal institutions addressed complicity in other cases of genocide?  Could the complicity provisions apply to the United States and its leaders  for assisting Israel in a war on Gaza that has cost so many thousands of civilian lives? More\nThe post Complicity in Genocide appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/10/complicity-in-genocide/",
          "publishedOn": "2024-06-10T06:00:38.000Z",
          "wordCount": null,
          "title": "Complicity in Genocide",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324981",
          "author": "Sonali Kolhatkar",
          "description": "There is an obscure mechanism by which fossil fuel companies maintain their global domination even as their products are destroying our futures. Most rank-and-file climate activists haven’t heard of it and most news media rarely discuss it in great detail. It is a tool that has its origins in colonialism and advantages corporate power over democracy. The technical term for such a tool is “Investor-state dispute settlement” or ISDS. And while it sounds boring and technical, it is crucial that we familiarize ourselves with it in order to dismantle it. More\nThe post Biden Should End the Fossil Fuel Industry’s Secret Weapon appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/10/biden-should-end-the-fossil-fuel-industrys-secret-weapon/",
          "publishedOn": "2024-06-10T05:59:22.000Z",
          "wordCount": null,
          "title": "Biden Should End the Fossil Fuel Industry’s Secret Weapon",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324977",
          "author": "Victor Grossman",
          "description": "For people in southern Germany, there was not much to be happy about this springtime; many were hit by the worst flooding in living history. Not a few lost the results of a life’s work. Some were aware that the major perpetrators had known – decades ago – what cardinal sins they were committing but  More\nThe post Netanyahu and Germany appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/10/netanyahu-and-germany/",
          "publishedOn": "2024-06-10T05:55:31.000Z",
          "wordCount": null,
          "title": "Netanyahu and Germany",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=325117",
          "author": "Jonah Raskin",
          "description": "Now that Cal has the go-ahead from the State Supreme Court to build student housing in People’s Park I thought of Mario Savio, one of the leaders of the ’64 Free Speech Movement who was also for several decades a colleague of mine at Sonoma State University (SSU), an hour north of Berkeley. I wondered  More\nThe post Censorship, Free Speech, Carol Christ & Mario Savio appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/10/censorship-free-speech-carol-christ-mario-savio/",
          "publishedOn": "2024-06-10T05:55:27.000Z",
          "wordCount": null,
          "title": "Censorship, Free Speech, Carol Christ & Mario Savio",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=325115",
          "author": "Gary Belan",
          "description": "It’s impossible to underscore the importance of healthy rivers: 60 percent of the drinking water supply in the United States comes from rivers. And while your tap water may be clean, unfortunately, tens of millions of Americans don’t have the same assurance, and this problem is only escalating, particularly with so-called “forever chemicals” like PFAS contaminating the national water  More\nThe post The Supreme Court’s Clean Water Act Decision Threatens the Nation’s Rivers appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/10/the-supreme-courts-clean-water-act-decision-threatens-the-nations-rivers/",
          "publishedOn": "2024-06-10T05:55:09.000Z",
          "wordCount": null,
          "title": "The Supreme Court’s Clean Water Act Decision Threatens the Nation’s Rivers",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=325043",
          "author": "John Laforge",
          "description": "The US Nuclear Regulatory Commission (NRC) has formally apologized for multiple false assurances from its staff that a major leak of radioactive tritium from Xcel Energy’s Monticello nuclear reactor had not reached the Mississippi River — the drinking water source for 20 million people, including, 3.7 million in the Minneapolis/St. Paul metro area. In opening  More\nThe post Radioactive Tritium from Monticello Reactor Leaked to the Mississippi River appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/10/radioactive-tritium-from-monticello-reactor-leaked-to-the-mississippi-river/",
          "publishedOn": "2024-06-10T05:54:08.000Z",
          "wordCount": null,
          "title": "Radioactive Tritium from Monticello Reactor Leaked to the Mississippi River",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324976",
          "author": "Sam Pizzigati",
          "description": "So you think the rich have life easy, do you? Just try telling that to the deep pockets who’ve spent tens of millions buying condos at 432 Park Avenue, the 11-year-old Manhattan luxury tower that once rated as our hemisphere’s tallest residence. Condo owners in the tower have had to put up with “faulty elevators,  More\nThe post For the Rich, One Nation Isn’t Rolling Out the Red Carpet appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/10/for-the-rich-one-nation-isnt-rolling-out-the-red-carpet/",
          "publishedOn": "2024-06-10T05:52:17.000Z",
          "wordCount": null,
          "title": "For the Rich, One Nation Isn’t Rolling Out the Red Carpet",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=325041",
          "author": "Robert Koehler",
          "description": "If we can end, let us say . . . slavery — the legal “ownership” of other human beings — can’t we also end other great social wrongs? Can’t we also end war? As I ask this question, I am suddenly bludgeoned by an unexpected irony, since the United States ended slavery through a brutal  More\nThe post Is Abolishing War Possibile? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/10/is-abolishing-war-possibile/",
          "publishedOn": "2024-06-10T05:49:55.000Z",
          "wordCount": null,
          "title": "Is Abolishing War Possibile?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=325146",
          "author": "Carlos Zacarias de Sena Junior",
          "description": "Approaching 60 days, the strike by the faculty of public federal universities (UFs) and federal high school institutes (IFs) in Brazil merits attention for its resilience and scope. In Congress, far-right deputies attempt to capitalize on workers’ discontent, betting on the current government’s deterioration. On the left, especially among PSOL (Socialism and  Liberty Party) members,  More\nThe post In Defense of Brazil’s Public Universities (Again) appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/10/in-defense-of-brazils-public-universities-again/",
          "publishedOn": "2024-06-10T05:36:32.000Z",
          "wordCount": null,
          "title": "In Defense of Brazil’s Public Universities (Again)",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=325046",
          "author": "Andrew Moss",
          "description": "There’s a breathtaking hubris at work when a political party seeks to suppress the votes of an entire people, then claims its leaders are the champions of that same people. You don’t have to look far to find such hubris in the Republican Party today. When Donald Trump travels the country, telling African Americans that  More\nThe post Republican Hubris in Courting Black Voters appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/10/republican-hubris-in-courting-black-voters/",
          "publishedOn": "2024-06-10T05:34:32.000Z",
          "wordCount": null,
          "title": "Republican Hubris in Courting Black Voters",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324998",
          "author": "Mike Garrity",
          "description": "A recent column by the Anaconda Sportsmen Club disparaged the Alliance for the Wild Rockies for challenging the illegal Pintler Face logging project in southwest Montana in federal court. What they failed to disclose to you is that federal courts have already established as illegal the same type of actions the Forest Service has taken  More\nThe post Forest Service Must Follow the Law Like Everyone Else appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/10/forest-service-must-follow-the-law-like-everyone-else/",
          "publishedOn": "2024-06-10T05:22:48.000Z",
          "wordCount": null,
          "title": "Forest Service Must Follow the Law Like Everyone Else",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324208",
          "author": "Pete Dolack",
          "description": "Image by Dan Cristian Pădureț.\nYou can’t have infinite growth on a finite planet. That should be a commonplace idea. And that inevitably means facing up to the necessity of putting an end to capitalism in favor of an economic system of rationality, sustainability and equity for all the world’s peoples.\nIt can’t be said too many times that the concept of “green capitalism” is a chimera. Unfortunately, belief in that chimera is not limited to the world’s center-left political parties; it extends to the world’s Green parties. Various “Green New Deal” programs have been floated in recent years, generally revolving around a massive buildout of renewable-energy infrastructure and strengthening the social safety net. On their own, there is no rational argument that such programs, should they materialize, would not provide some benefits. But how transformative are such programs?\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Capitalism Can’t Overcome the Laws of Physics appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/09/capitalism-cant-overcome-the-laws-of-physics/",
          "publishedOn": "2024-06-09T06:13:19.000Z",
          "wordCount": null,
          "title": "Capitalism Can’t Overcome the Laws of Physics",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324863",
          "author": "Susie Day",
          "description": "Emmaia Gelman.\nSince 1897, Zionism has been the religious and political impetus behind what is now the nation-state of Israel, which, like the United States, is settled on the lives, land, and cultures of millions of Indigenous peoples. Although today’s Israel began as a refuge for European Jews fleeing the Holocaust, Zionism long ago broke out of its moral constraints to become a formidable geopolitical force that demands study. Which is why, in late 2023 America, the Institute for the Critical Study of Zionism was created. And why, because the Institute is fundamentally antizionist, it’s under attack for antisemitism.\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post The Need for Studying Zionism, Critically appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/09/the-need-for-studying-zionism-critically/",
          "publishedOn": "2024-06-09T05:55:51.000Z",
          "wordCount": null,
          "title": "The Need for Studying Zionism, Critically",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324934",
          "author": "Jeffrey St. Clair",
          "description": "Whoops, they did it again. Only this time it was no “tragic mistake.” There were no apologies. Indeed, the IDF claimed the bombing was a “precision strike.” The target? An UNRWA school in the Nuseirat Refugee Camp in central Gaza, which was being used as a shelter for thousands of displaced Palestinian families. The victims: at least 40 killed, 14 of them children and 9 women. Another 75 were wounded, including 23 children and 18 women. The weapon? A US-made GBU 39, the same bombs used to kill 45 people at the Tel al-Sultan tent encampment outside Rafah last week.\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Whoops, They Did It Again appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/08/whoops-they-did-it-again/",
          "publishedOn": "2024-06-08T05:59:36.000Z",
          "wordCount": null,
          "title": "Whoops, They Did It Again",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324793",
          "author": "Jeffrey St. Clair",
          "description": "Rasha Kareem wasn’t hiding from the police. She didn’t think she’d done anything wrong. And she hadn’t done anything wrong. Not by any reasonable standard. Rasha was simply going about her day. She owned a beauty salon in Majd Al-Krum, a town in the Galilee. She was running routine errands when Israeli police pulled her over. Rasha is tall and elegant. She has the face of a model and long, shimmering black hair. She was wearing a sleek black dress. She tried to maintain her composure as Israeli police swarmed around her. There is a look of confusion and then a flash of fear on her face as she is told she’s being arrested.  More\nThe post Snatch-and-Grab Israeli Style: Disappearing into the Gulag appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/snatch-and-grab-israeli-style-disappearing-into-the-gulag/",
          "publishedOn": "2024-06-07T06:00:14.000Z",
          "wordCount": null,
          "title": "Snatch-and-Grab Israeli Style: Disappearing into the Gulag",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324833",
          "author": "Vijay Prashad",
          "description": "The neoliberal attack on government expenditure in poorer countries was a key driver of international migration. Even by 1990, it had become clear that the migrants had become an essential force in providing foreign exchange to their countries through increasing remittance payments to their families. By 2015, remittances—mostly by the international working class—outstripped the volume of Official Development Assistance (ODA) by three times and Foreign Direct Investment (FDI). ODA is the aid money provided by states, whereas FDI is the investment money provided by private companies. For some countries, such as Mexico and the Philippines, remittance payments from working-class migrants prevented state bankruptcy. More\nThe post Migrating Workers Provide Wealth for the World appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/migrating-workers-provide-wealth-for-the-world/",
          "publishedOn": "2024-06-07T05:59:39.000Z",
          "wordCount": null,
          "title": "Migrating Workers Provide Wealth for the World",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324797",
          "author": "Matthew Stevenson",
          "description": "I am not saying that Judge Merchan should lock Trump away in some KGB mental hospital, as happened to the political opposition in Stalin’s Soviet Union. But I am pointing out that while New York State court has jurisdiction over convicted felon Trump, the judge has both the right and the obligation—before issuing a sentence—to find out if the defendant has understood the charges that were brought against him. (From his endless press conferences during his trials, Trump sounds clueless about the facts in his own cases.) More\nThe post Send Trump to Bedlam, Not Rikers appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/send-trump-to-bedlam-not-rikers/",
          "publishedOn": "2024-06-07T05:58:09.000Z",
          "wordCount": null,
          "title": "Send Trump to Bedlam, Not Rikers",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324818",
          "author": "Daniel Falcone",
          "description": "Introduction This writing discusses the importance of teaching the Israeli-Palestinian conflict and attempts to explain the barriers and obstacles associated with teaching it. After providing 9/11 as a case study, I emphasize why school leaders and teachers hesitate to address, or outright ignore the conflict. Additionally, it is important to understand what can be avoided  More\nThe post Teaching Palestine: The Causes and Consequences of Organized Forgetting appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/teaching-palestine-the-causes-and-consequences-of-organized-forgetting/",
          "publishedOn": "2024-06-07T05:57:43.000Z",
          "wordCount": null,
          "title": "Teaching Palestine: The Causes and Consequences of Organized Forgetting",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324906",
          "author": "Quincy Saul",
          "description": "“When you write about our adventure in Nepal, make sure it doesn’t read like a tourist guide” – Satyajit Ray (The Criminals of Kathmandu) I return from the World Social Forum in Nepal with a haystack full of notes, a head full of a thousand threads, asking my heart how to find and thread the  More\nThe post The World Social Forum in Nepal appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/the-world-social-forum-in-nepal/",
          "publishedOn": "2024-06-07T05:56:35.000Z",
          "wordCount": null,
          "title": "The World Social Forum in Nepal",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324719",
          "author": "Eve Ottenberg",
          "description": "The whole phony case against Assange stinks of corruption and abuse of power. Corruption because the CIA under Mike “Get Assange” Pompeo plotted to kidnap or murder the journalist and also, corruptly, listened in on his privileged conversations with his attorney in the Ecuadoran embassy. Corruption because bogus charges were cooked up against him by a pliant Swedish prosecutor, the sole purpose of which was to toss Assange into the clutches of the furious U.S. government. Assange did not rape those two women in Sweden, and the prosecutor eventually dropped the case. But the damage was done: to Assange’s reputation and to his freedom, because once he sought refuge in the Ecuadoran embassy, he was trapped. More\nThe post How Long Must He Wait? Assange Wins Right to Appeal appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/how-long-must-he-wait-assange-wins-right-to-appeal/",
          "publishedOn": "2024-06-07T05:56:07.000Z",
          "wordCount": null,
          "title": "How Long Must He Wait? Assange Wins Right to Appeal",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324750",
          "author": "Binoy Kampmark",
          "description": "Australia’s modest sovereign wealth fund, modestly standing at A$272.3 billion, has crawled into some trouble of late.  Investors, morally twinged, are keeping an eye on where the money of the Australian Future Fund goes.  Inevitably, a good slice of it seems to be parked in the military-industrial complex, a sector that performs on demand. Filed last October,  More\nThe post Inexplicable Investments: Elbit Systems and Australia’s Future Fund appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/inexplicable-investments-elbit-systems-and-australias-future-fund/",
          "publishedOn": "2024-06-07T05:55:11.000Z",
          "wordCount": null,
          "title": "Inexplicable Investments: Elbit Systems and Australia’s Future Fund",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324713",
          "author": "Kathleen Wallace",
          "description": "What to do when your home country fits all the criteria in the DSM-5 for Narcissistic Personality Disorder? That’s a tough one. If a nation can allow corporations to be persons, I think it is only fair that the nation itself be subject to the same mental scrutiny that a person behaving in a deranged  More\nThe post Narcissistic Personality Disorder in the USA appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/narcissistic-personality-disorder-in-the-usa/",
          "publishedOn": "2024-06-07T05:55:08.000Z",
          "wordCount": null,
          "title": "Narcissistic Personality Disorder in the USA",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324807",
          "author": "William Astore",
          "description": "As a late-stage baby boomer, a child of the 1960s, I grew up dreaming about America’s nuclear triad. You may remember that it consisted of strategic bombers like the B-52 Stratofortress, land-based intercontinental ballistic missiles (ICBMs) like the Minuteman, and submarine-launched ballistic missiles (SLBMs) like the Poseidon, all delivery systems for what we then called  More\nThe post Nuclear Armageddon Is Us appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/nuclear-armageddon-is-us/",
          "publishedOn": "2024-06-07T05:55:04.000Z",
          "wordCount": null,
          "title": "Nuclear Armageddon Is Us",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324802",
          "author": "Robert Hunziker",
          "description": "“Whiskey’s for drinking and water’s for fighting,” a popular adage from the chronicles of the American West that’s starting to come back into vogue. The world’s megacities are on a knife’s edge of water stress. Climate change is clobbering water resources and testing the nerves of the world, especially megacities, e.g., Mexico City (pop. 22  More\nThe post Where’s the Water? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/wheres-the-water/",
          "publishedOn": "2024-06-07T05:55:03.000Z",
          "wordCount": null,
          "title": "Where’s the Water?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324929",
          "author": "David Yearsley",
          "description": "We met in Minot. My father came from Seattle on the “Empire Builder” Amtrak train with the rifle—a Winchester 1886. I flew in from New York with a Reiseklavier—a travel clavichord modeled on the portable instruments virtuosos such as Mozart used when on the road back in Europe in the 18th century. The gun hasn’t  More\nThe post Bang for Your Bach appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/bang-for-your-bach/",
          "publishedOn": "2024-06-07T05:54:48.000Z",
          "wordCount": null,
          "title": "Bang for Your Bach",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324706",
          "author": "Daniel Warner",
          "description": "Russia and its president have become pariahs in the West. Politically, several Western countries, companies and the European Union sanctioned Russian President Vladimir Putin, members of his government and Russian citizens as well as Russian banks with various forms of economic boycotts and embargoes following Russia’s invasion of Ukraine. Legally, the International Court of Justice  More\nThe post Make Israel and Netanyahu Pariahs Like Russia and Putin appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/make-israel-and-netanyahu-pariahs-like-russia-and-putin/",
          "publishedOn": "2024-06-07T05:54:37.000Z",
          "wordCount": null,
          "title": "Make Israel and Netanyahu Pariahs Like Russia and Putin",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324722",
          "author": "Ariel Dorfman",
          "description": "On May 4, as war and famine raged in Gaza, Amsterdam marked Remembrance Day, an annual commemoration of those who resisted the Nazi occupation, with special emphasis from the city’s organizing committee on the Jews who perished in the onslaught. Among the dozens of ceremonies that crisscrossed the city, I joined one at the Centrale  More\nThe post Remembering the Holocaust as Gaza Starves appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/remembering-the-holocaust-as-gaza-starves/",
          "publishedOn": "2024-06-07T05:53:52.000Z",
          "wordCount": null,
          "title": "Remembering the Holocaust as Gaza Starves",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324795",
          "author": "Eric Mann",
          "description": "How a Black United Front in Harlem, the Students’ Afro American Society, and Students for a Democratic Society took on the Columbia University Ruling Class, Mayor John Lindsay, the New York Times, the NYPD—and won! “There are decades where nothing happens; and there are weeks when decades happen.” – V.I. Lenin This article was written  More\nThe post The Historic 1968 Struggle Against Columbia University appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/the-historic-1968-struggle-against-columbia-university-2/",
          "publishedOn": "2024-06-07T05:50:36.000Z",
          "wordCount": null,
          "title": "The Historic 1968 Struggle Against Columbia University",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324815",
          "author": "Mel Gurtov",
          "description": "South Africa, India, and Mexico just held general elections. Britain will hold a general election July 4. The US will hold one Nov. 5. Record-setting demonstrations in Israel may yet lead to a general election there. Five of these six elections reveal the precarious hold on power of the incumbents, and the threats to democracy  More\nThe post The Elections‑Democracy Gap appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/the-elections%e2%80%91democracy-gap/",
          "publishedOn": "2024-06-07T05:50:16.000Z",
          "wordCount": null,
          "title": "The Elections‑Democracy Gap",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324733",
          "author": "Joseph Grosso",
          "description": "A serious look at the state of global energy presents something of a double-edged sword. On one hand, 2023 was another record year for renewable installations worldwide. An estimated 507 GW (gigawatts) of new generation capacity was installed a 50 percent increase from 2022. On the other hand, according to estimates by the International Energy  More\nThe post The Necessary State: the Market Can’t Deliver the Energy Transition appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/the-necessary-state-the-market-cant-deliver-the-energy-transition/",
          "publishedOn": "2024-06-07T05:50:07.000Z",
          "wordCount": null,
          "title": "The Necessary State: the Market Can’t Deliver the Energy Transition",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": []
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45407",
          "author": "Lars Syll",
          "description": "from Lars Syll Recognition of the speculative value of counterfactualizing provides the grounding for a defense of theoretical pluralism in economics. The existence of multiple contending theories in economics is inconvenient, of course. It casts doubt on the truth content of the counterfactual scenarios generated by the predominant approach and challenges the predominant causal claims […]",
          "link": "https://rwer.wordpress.com/2024/06/10/in-praise-of-pluralism/",
          "publishedOn": "2024-06-10T17:19:45.000Z",
          "wordCount": 5176,
          "title": "In praise of pluralism",
          "imageUrl": "https://georgedemartino.files.wordpress.com/2022/08/george-demartino-author-photo_no-credit-needed-copy.jpg?w=640"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45403",
          "author": "Lars Syll",
          "description": "from Lars Syll In practice, what math does is let macro-economists locate the FWUTVs [facts with unknown truth values] farther away from the discussion of identification … Relying on a micro-foundation lets an author say, “Assume A, assume B, … blah blah blah … And so we have proven that P is true. Then the […]",
          "link": "https://rwer.wordpress.com/2024/06/04/post-real-economics-a-severe-case-of-mathiness/",
          "publishedOn": "2024-06-04T16:31:32.000Z",
          "wordCount": 4502,
          "title": "Post-real economics — a severe case of mathiness",
          "imageUrl": "https://larspsyll.wordpress.com/wp-content/uploads/2017/05/blah_blah.jpg"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=273058",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Open Thread ~",
          "link": "https://www.nakedcapitalism.com/2024/06/200pm-water-cooler-6-10-2024.html",
          "publishedOn": "2024-06-10T18:00:54.000Z",
          "wordCount": 3789,
          "title": "2:00PM Water Cooler 6/10/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/06/black_eyed_susans.jpeg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=273036",
          "author": "Yves Smith",
          "description": "How the unexpected success of right wing parties in France, Germany, and Austria might be focusing a few minds about Russia.",
          "link": "https://www.nakedcapitalism.com/2024/06/the-russian-endgame-in-ukraine-and-european-resistance-to-right-wing-advances-a-thought-experiment.html",
          "publishedOn": "2024-06-10T12:15:43.000Z",
          "wordCount": 15560,
          "title": "The Russian Endgame in Ukraine and European Resistance to “Right Wing” Advances: A Thought Experiment",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=273016",
          "author": "Conor Gallagher",
          "description": "",
          "link": "https://www.nakedcapitalism.com/2024/06/links-6-10-2024.html",
          "publishedOn": "2024-06-10T10:55:15.000Z",
          "wordCount": 13687,
          "title": "Links 6/10/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/06/Screenshot-2024-06-08-at-11.50.46 PM-1024x679.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=273012",
          "author": "Conor Gallagher",
          "description": "In “The Occasional Human Sacrifice,” Carl Elliott notes that those who expose medical wrongdoings are hardly heroes.",
          "link": "https://www.nakedcapitalism.com/2024/06/book-review-truth-and-consequences-for-medical-whistleblowers.html",
          "publishedOn": "2024-06-10T09:00:06.000Z",
          "wordCount": 3619,
          "title": "Book Review: Truth and Consequences for Medical Whistleblowers",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/06/Screenshot-2024-06-09-at-10.50.09 PM-e1717966399688.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=273023",
          "author": "Yves Smith",
          "description": "On the romance of being you own boss.",
          "link": "https://www.nakedcapitalism.com/2024/06/the-desire-to-be-your-own-boss-in-america.html",
          "publishedOn": "2024-06-10T08:47:21.000Z",
          "wordCount": 7010,
          "title": "The Desire to Be “Your Own Boss” in America",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/06/00-boss.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272981",
          "author": "Conor Gallagher",
          "description": "",
          "link": "https://www.nakedcapitalism.com/2024/06/links-6-9-2024.html",
          "publishedOn": "2024-06-09T10:55:18.000Z",
          "wordCount": 18860,
          "title": "Links 6/9/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/06/Screenshot-2024-06-08-at-6.32.21 PM-1024x648.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272989",
          "author": "Conor Gallagher",
          "description": "What happens when everyone starts to believe in the con?",
          "link": "https://www.nakedcapitalism.com/2024/06/the-war-racket-in-germany.html",
          "publishedOn": "2024-06-09T10:00:50.000Z",
          "wordCount": 10268,
          "title": "The War Racket in Germany",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/06/Screenshot-2024-06-09-at-7.04.35 AM-1024x780.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272986",
          "author": "Conor Gallagher",
          "description": "Faulty lead test kits made by Magellan Diagnostics may have been used as late as 2021 to test children for exposure to the toxic metal. The company agreed to pay $42 million to settle criminal charges that it concealed malfunctions.",
          "link": "https://www.nakedcapitalism.com/2024/06/thousands-of-children-got-tested-for-lead-with-faulty-devices-what-parents-should-know.html",
          "publishedOn": "2024-06-09T09:00:37.000Z",
          "wordCount": 3676,
          "title": "Thousands of Children Got Tested for Lead With Faulty Devices: What Parents Should Know",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272975",
          "author": "Yves Smith",
          "description": "Did Modi's BJP suffer a setback due to failing to provide enough economic benefits to lower-caste voters?",
          "link": "https://www.nakedcapitalism.com/2024/06/one-issue-proved-key-to-the-oppositions-stunning-success-in-indias-election-caste-politics.html",
          "publishedOn": "2024-06-08T14:21:12.000Z",
          "wordCount": 7835,
          "title": "One Issue Proved Key to the Opposition’s Stunning Success in India’s Election: Caste Politics",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272861",
          "author": "Yves Smith",
          "description": "Our boisterous daily links: modeling dog barks, altruism on flight, climate and food crises, China mortgage worries, Macron freakout about far right, Israel into Lebanon? moar Russian retaliation worries, official narcissism, Trump v. Schumer, Hunter bad look, Supreme $ revelations, syndicated loan losses",
          "link": "https://www.nakedcapitalism.com/2024/06/links-6-8-2024.html",
          "publishedOn": "2024-06-08T10:59:35.000Z",
          "wordCount": 24223,
          "title": "Links 6/8/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/06/Screen-Shot-2024-06-08-at-1.49.15-PM.png"
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "666716c4e955c4000a8b4cf1",
          "author": "João Tomé",
          "description": "The 2024 EU Parliament election caused declines in Internet traffic during voting and spikes during results announcements, with persistent cyber threats targeting government sites",
          "link": "https://blog.cloudflare.com/exploring-the-2024-eu-election-internet-traffic-trends-and-cybersecurity-insights",
          "publishedOn": "2024-06-10T15:27:43.000Z",
          "wordCount": 2195,
          "title": "Exploring the 2024 EU Election: Internet traffic trends and cybersecurity insights",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/06/Exploring-the-2024-EU-Election--Internet-traffic-trends-and-cybersecurity-insights-OG-1.png"
        },
        {
          "id": "66636b01e955c4000a8b4c6c",
          "author": "João Tomé",
          "description": "2024 brings a global increase in election activity. Here, we highlight traffic and cyberattack trends witnessed in countries like the Netherlands, South Africa, Iceland, India, and Mexico. Additionally, we provide an up-to-date 2024 Election Insights report on Cloudflare Radar",
          "link": "https://blog.cloudflare.com/internet-insights-on-2024-elections-in-the-netherlands-south-africa-iceland-india-and-mexico",
          "publishedOn": "2024-06-07T20:40:57.000Z",
          "wordCount": 2690,
          "title": "Internet insights on 2024 elections in the Netherlands, South Africa, Iceland, India, and Mexico",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/06/BLOG-2438-1.png"
        },
        {
          "id": "66620b31e955c4000a8b4b51",
          "author": "João Tomé",
          "description": "The 2024 European Parliament election began in the Netherlands on June 6. Cloudflare mitigated several multi-hour DDoS attacks on Dutch political websites on June 5 and 6",
          "link": "https://blog.cloudflare.com/dutch-political-websites-hit-by-cyber-attacks-as-eu-voting-starts",
          "publishedOn": "2024-06-06T19:23:17.000Z",
          "wordCount": 1085,
          "title": "Dutch political websites hit by cyber attacks as EU voting starts",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/06/Dutch-political-websites-hit-by-cyber-attacks-as-EU-voting-starts-OG-1.png"
        },
        {
          "id": "66609308e955c4000a8b49da",
          "author": "Jocelyn Woolbright",
          "description": "In celebration of Project Galileo's 10th anniversary, we want to give you a snapshot of what organizations that work in the public interest experience on an everyday basis when it comes to keeping their websites online",
          "link": "https://blog.cloudflare.com/galileo10anniversaryradardashboard",
          "publishedOn": "2024-06-06T10:00:23.000Z",
          "wordCount": 1648,
          "title": "Protecting vulnerable communities for 10 years with Project Galileo",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/06/Protecting-vulnerable-communities-for-10-years-with-Project-Galileo-OG-3.png"
        },
        {
          "id": "6658791a7d1754000b5c0e7a",
          "author": "Petra Arts",
          "description": "Between 6 and 9 June 2024, hundreds of millions of EU citizens will be voting to elect their members of the European Parliament (MEPs). All EU member states have different election processes, institutions and methods, and the security risks are significant",
          "link": "https://blog.cloudflare.com/eu-elections-2024",
          "publishedOn": "2024-06-05T13:00:46.000Z",
          "wordCount": 2268,
          "title": "European Union elections 2024: securing democratic processes in light of new threats",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/06/European-Union-elections-2024--securing-democratic-processes-in-light-of-new-threats-OG-1.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": [
        {
          "id": "https://kubernetes.io/blog/2024/06/06/10-years-of-kubernetes/",
          "author": null,
          "description": "Ten (10) years ago, on June 6th, 2014, the\nfirst commit\nof Kubernetes was pushed to GitHub. That first commit with 250 files and 47,501 lines of go, bash\nand markdown kicked off the project we have today. Who could have predicted that 10 years later,\nKubernetes would grow to become one of the largest Open Source projects to date with over\n88,000 contributors from\nmore than 8,000 companies, across\n44 countries.\nThis milestone isn't just for Kubernetes but for the Cloud Native ecosystem that blossomed from\nit. There are close to 200 projects\nwithin the CNCF itself, with contributions from\n240,000+ individual contributors and\nthousands more in the greater ecosystem. Kubernetes would not be where it is today without them, the\n7M+ Developers,\nand the even larger user community that have all hel…",
          "link": "https://kubernetes.io/blog/2024/06/06/10-years-of-kubernetes/",
          "publishedOn": "2024-06-06T00:00:00.000Z",
          "wordCount": 5358,
          "title": "10 Years of Kubernetes",
          "imageUrl": "kcseu2024.jpg"
        }
      ]
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": [
        {
          "id": "https://code.visualstudio.com/blogs/2024/06/07/wasm-part2",
          "author": null,
          "description": "Read the full article",
          "link": "https://code.visualstudio.com/blogs/2024/06/07/wasm-part2",
          "publishedOn": "2024-06-07T00:00:00.000Z",
          "wordCount": 2170,
          "title": "VS Code Extensions and WebAssembly - Part Two",
          "imageUrl": "https://code.visualstudio.com/opengraphimg/opengraph-blog.png"
        },
        {
          "id": "https://code.visualstudio.com/updates/v1_90",
          "author": null,
          "description": "Visual Studio Code May 2024\nRead the full article",
          "link": "https://code.visualstudio.com/updates/v1_90",
          "publishedOn": "2024-06-05T17:00:00.000Z",
          "wordCount": 4026,
          "title": "Visual Studio Code May 2024",
          "imageUrl": "https://code.visualstudio.com/assets/updates/1_90/release-highlights.png"
        }
      ]
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=21209",
          "author": null,
          "description": "At Meta, Bento, our internal Jupyter notebooks platform, is a popular tool that allows our engineers to mix code, text, and multimedia in a single document. Use cases run the entire spectrum from what we call “lite” workloads that involve simple prototyping to heavier and more complex machine learning workflows. However, even though the lite [...]\nRead More...\nThe post Serverless Jupyter Notebooks at Meta appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/06/10/data-infrastructure/serverless-jupyter-notebooks-bento-meta/",
          "publishedOn": "2024-06-10T16:30:55.000Z",
          "wordCount": 2360,
          "title": "Serverless Jupyter Notebooks at Meta",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2022/04/Eng-Blog-Self-Serve-Hero-Images-ANALYTICS-401-Teale.jpg"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=40633255",
          "author": "toddmorey",
          "description": "I parent a child with autism. The care needs are intense; the burnout is real. But I can't employ usual burnout mitigation techniques like taking time off or making career / lifestyle changes. The world relentlessly marches forward. However, I've learned human resilience is AMAZING. You'll be surprised at what you are capable of when life asks for it.\nHere are a few big insights that have really helped me:\n- You never have to feel like doing something to start doing it. This insight is so strangely freeing. It really got me out of my head and the loop that I was in berating myself about motivation.\n- The act of doing something is usually what creates motivation to continue. Tell yourself you'll spend 30 minutes on whatever it is. No matter what it is, I always know I can survive 30 minutes of it. However, 90% of the time, the timer goes off, but I don't feel like stopping. I've found my grove and I keep going.\n- Procrastination isn't poor time management; it's poor emotional management. Be gentle with yourself. Know that you can be scared, frustrated, or angry but don't have to let those emotions define you. CBT works really well here. Don't define emotions as \"good\" or \"bad\". Define them as \"useful\". If the emotion you feel isn't useful, acknowledge it, but realize it's fleeting and let it pass on. Some people like to visualize emotions as clouds drifting by.\n\"And whatever your labors and aspirations, in the noisy confusion of life, keep peace in your soul. With all its sham, drudgery and broken dreams, it is still a beautiful world. Be cheerful. Strive to be happy.\"\n(My grandmother, who survived the Great Depression on a farm, had the Desiderata posted on her wall. https://www.desiderata.com/desiderata.html)",
          "link": "https://news.ycombinator.com/item?id=40633255",
          "publishedOn": "2024-06-10T13:12:10.000Z",
          "wordCount": null,
          "title": "New comment by toddmorey in \"Understanding the neuroscience behind burnout (2022)\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40631834",
          "author": "hcrean",
          "description": "Imagine working this hard to track down people sharing ideas, that you didn't work to produce or fund in the first place, in order to punish them for not giving you a financial cut... Companies like this are just holding humanity back.",
          "link": "https://news.ycombinator.com/item?id=40631834",
          "publishedOn": "2024-06-10T09:53:02.000Z",
          "wordCount": 2495,
          "title": "New comment by hcrean in \"Elsevier embeds a hash in the PDF metadata that is unique for each download (2022)\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40628059",
          "author": "wavemode",
          "description": "No, a lack of monitoring cost you $10K. Your app was throwing a database exception and nobody was alerted that this was not only happening, but happening continuously and in large volumes. Such an alert would have made this a 5-minute investigation rather than 5 days.\nIf you haven't fixed that alerting deficiency, then you haven't really fixed anything.",
          "link": "https://news.ycombinator.com/item?id=40628059",
          "publishedOn": "2024-06-09T22:13:40.000Z",
          "wordCount": null,
          "title": "New comment by wavemode in \"A ChatGPT mistake cost us $10k\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40627898",
          "author": "userbinator",
          "description": "It read like no one really knew what they were doing. \"We just let it generate the code and everything seemed to work\" is certainly not a good way to market your company.",
          "link": "https://news.ycombinator.com/item?id=40627898",
          "publishedOn": "2024-06-09T21:47:30.000Z",
          "wordCount": 3699,
          "title": "New comment by userbinator in \"A ChatGPT mistake cost us $10k\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40627837",
          "author": "Aurornis",
          "description": "On one hand, thanks for being honest about a story of how this bug came to be.\nOn the other hand, I don’t think advertising the fact that the company introduced a major bug from copy and pasting ChatGPT code around and that they spent a week being unable to even debug why it was failing.\nI don’t know much about this startup, but this blog post had the opposite effect of all of the other high quality post-mortem posts I’ve read lately. Normally the goal of these posts is to demonstrate your team’s rigor and engineering skills, not reveal that ChatGPT is writing your code and your engineers can’t/won’t debug it for a very long time despite knowing that it’s costing them signups.",
          "link": "https://news.ycombinator.com/item?id=40627837",
          "publishedOn": "2024-06-09T21:39:12.000Z",
          "wordCount": null,
          "title": "New comment by Aurornis in \"A ChatGPT mistake cost us $10k\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40626041",
          "author": "Animats",
          "description": "Four.\nThat's the magic number. There have to be four competitors of significant size before prices go down. There are both EU and US studies substantiating this.\nIt's been seen in cellular phone networks, ISPs, drugstores, and banks. Drop below the threshold of four, and the magic happens. Prices go up, margins go up, and consumers lose.\nFour should be the basis of antitrust policy. Less than four, and there are two options - break up, or become a regulated public utility.\nTwo or three isn't enough. Collusion happens. Explicitly or implicitly, price competition doesn't happen with only two or three players.\nFour seems to be enough that cartels usually break up on their own. Somebody won't play ball.\nFour.",
          "link": "https://news.ycombinator.com/item?id=40626041",
          "publishedOn": "2024-06-09T17:32:52.000Z",
          "wordCount": null,
          "title": "New comment by Animats in \"Economic Termites: Monopolies not noticeable enough for most of us\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40625643",
          "author": "cglan",
          "description": "Popular or not, all this has taught me is that NYC, and with that most of America has no vision for any future. If after 10 years and millions in setup just to get congestion pricing in place, it falls thru because of the whims of a governor there’s just no hope for any more difficult capital projects.\nRealistically, we’re never going to see any ambitious projects in my life time and it’s sad to see",
          "link": "https://news.ycombinator.com/item?id=40625643",
          "publishedOn": "2024-06-09T16:41:08.000Z",
          "wordCount": null,
          "title": "New comment by cglan in \"With congestion pricing stop, New York City enters new era of economic gridlock\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40625630",
          "author": "woodruffw",
          "description": "One of the more ridiculous things about the chaos Hochul has wrought over the last 72 hours is that it isn't remotely clear that she can even order the suspension of congestion pricing like this: it's the law of the land in New York, one she already signed, passed by our legislative branch, funded by taxes, and administrated solely by an independent public corporation (the MTA) that she has only minority authority over. It's the equivalent of a president signing a bill and then attempting to post-facto veto it.\nIt's been very frustrating to see so little news (both local and national) pick up on this basic reality: Hochul is acting far beyond her constitutional powers as the governor, and the legislative branch has so far responded only tepidly (by refusing to pass her last-minute tax alternative).",
          "link": "https://news.ycombinator.com/item?id=40625630",
          "publishedOn": "2024-06-09T16:39:46.000Z",
          "wordCount": null,
          "title": "New comment by woodruffw in \"With congestion pricing stop, New York City enters new era of economic gridlock\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40625190",
          "author": "ianbicking",
          "description": "There's definitely been a move to demand individuals be good at everything... old stereotypes of the nerd brought a lot of negatives, but they were also apologetic, acknowledging the trade off, that paying attention deeply to one thing does lead to being worse at other things.\nThe exact stereotype differed by domain... the performer who is a diva, the self destructive author, the manic artist... each with a hint of nobility but also quite off-putting.\nThe author wanting to combine Weird Nerd with autistic is very incorrect IMHO... I've known a lot of weird nerds, am one myself, and there's lots of different flavors, most of them not autistic.\nSo much of talent is just really caring about something specific. Caring about it above other things. Specifically above external motivation and incentives. Do that and the weirdness grows naturally, neurodivergence isn't even necessary (though it might help)",
          "link": "https://news.ycombinator.com/item?id=40625190",
          "publishedOn": "2024-06-09T15:42:36.000Z",
          "wordCount": null,
          "title": "New comment by ianbicking in \"The Weird Nerd comes with trade-offs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40621080",
          "author": "GlickWick",
          "description": "Wasn't this class of medication originally for cardiovascular issues, and the whole ED mitigation was a happy marketable accident?",
          "link": "https://news.ycombinator.com/item?id=40621080",
          "publishedOn": "2024-06-09T00:30:18.000Z",
          "wordCount": null,
          "title": "New comment by GlickWick in \"Viagra improves brain blood flow and could help to prevent dementia\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40620630",
          "author": "gota",
          "description": "This stuff seems miraculous.\n> \"Through minimally invasive surgery, Shu injected adeno-associated virus (AAV) engineered to carry and deliver functioning copies of the human OTOF transgene, into the children’s inner ears. \"\nCan't read that and not get curious, excited, for the future.\nCongratulations to all those involved in the research and thanks to all who contributed to it - including all taxpayers if public funding was given, even indirectly (i.e. in the schooling and education, grants, for said researchers)",
          "link": "https://news.ycombinator.com/item?id=40620630",
          "publishedOn": "2024-06-08T22:32:26.000Z",
          "wordCount": null,
          "title": "New comment by gota in \"Gene therapy restores hearing to children with inherited deafness\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40618032",
          "author": "UseofWeapons1",
          "description": "As you consider the decision to let them go, consider the impact on other people in your work place too. Other developers notice someone like that underperforming and getting overpaid, and it can hurt the good climate you aim for. It may feel bad to fire them, but it may be worse to keep them.",
          "link": "https://news.ycombinator.com/item?id=40618032",
          "publishedOn": "2024-06-08T15:10:59.000Z",
          "wordCount": 1684,
          "title": "New comment by UseofWeapons1 in \"Ask HN: How to handle a senior hire turning out to be junior?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40618025",
          "author": "bob1029",
          "description": "We had one of these. Excellent interview, couldn't even handle explorer.exe on the other side. We fired them within the week. No one felt bad about it. Just do it and move on. The longer you drag it out, the worse it will get.",
          "link": "https://news.ycombinator.com/item?id=40618025",
          "publishedOn": "2024-06-08T15:09:53.000Z",
          "wordCount": 1365,
          "title": "New comment by bob1029 in \"Ask HN: How to handle a senior hire turning out to be junior?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40615244",
          "author": "schmookeeg",
          "description": "Getting my models dunked on by people who can't open MS Outlook more than 3 tries out of 5, however, have a remarkable depth and insight into their chosen domain of expertise. It's rather humbling.\nCollaborating with nontechnical people is oddly my favorite part of doing MLE work right now. It wasn't the case when I did basic web/db stuff. They see me as a magician. I see them as voodoo priests and priestesses. When we get something trained up and forecasting that we both like, it's super fulfilling. I think for both sides.\nMost of my modeling is healthcare related. I tease insights out of a monstrous data lake of claims, Rx, doctor notes, vital signs, diagnostic imagery, etc. What is also monstrous is how accessible this information is. HIPAA my left foot.\nSince you seemed to be asking about the temporal realities, it's about 3 hours of meetings a week, probably another 3 doing task grooming/preparatory stuff, fixing some ETL problem, or doing a one-off query for the business, the rest is swimming around in the data trying to find a slight edge to forecast something that surprised us for a $million or two using our historical snapshots. It's like playing wheres waldo with math. And the waldo scene ends up being about 50TB or so in size. :D",
          "link": "https://news.ycombinator.com/item?id=40615244",
          "publishedOn": "2024-06-08T04:16:41.000Z",
          "wordCount": null,
          "title": "New comment by schmookeeg in \"Ask HN: Machine learning engineers, what do you do at work?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40614898",
          "author": "mikeortman",
          "description": "Hi, hobbyist here! This is a huge area where government meteorologists and \"Big Weather\" differ and you can help close that gap!\nFor context:\nThe governments of the world provides these big weather companies (weather.com (cough IBM), Accuweather (cough IBM cough), etc) a metric shit ton of their data completely for free (by law) including data transfer. These are things like radar, satellite, ground station data, forecasts, composite models, etc. These companies profit substantially on it, as in billions of dollars. You as citizens also can get this data completely for free as well! MADIS is a system the government is working on to make that data access easier by bringing together many of these systems together and removing the bureaucratic redundancy and abstracting out the aging infrastr…",
          "link": "https://news.ycombinator.com/item?id=40614898",
          "publishedOn": "2024-06-08T02:47:30.000Z",
          "wordCount": null,
          "title": "New comment by mikeortman in \"Own a weather station? We want your data\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40614380",
          "author": "bicx",
          "description": "I saw the headline earlier, and my first thought was \"I hope he was the pilot, because that would be a fitting way to go for a legend.\" Not only was he the pilot, but he was flying solo at 90 years old.",
          "link": "https://news.ycombinator.com/item?id=40614380",
          "publishedOn": "2024-06-08T00:44:46.000Z",
          "wordCount": null,
          "title": "New comment by bicx in \"Apollo 8 astronaut William Anders ID'd in WA plane crash\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40614313",
          "author": "toomuchtodo",
          "description": "https://en.wikipedia.org/wiki/William_Anders\nHe took the Earthrise photo, which Nature photographer Galen Rowell described as \"the most influential environmental photograph ever taken\": https://en.wikipedia.org/wiki/Earthrise\nhttps://www.abc.net.au/science/moon/earthrise.htm",
          "link": "https://news.ycombinator.com/item?id=40614313",
          "publishedOn": "2024-06-08T00:33:10.000Z",
          "wordCount": 952,
          "title": "New comment by toomuchtodo in \"Apollo 8 astronaut William Anders ID'd in WA plane crash\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40613011",
          "author": "boznz",
          "description": "Spent several years writing and editing my first book before thinking the job was finished when I hit the publish now button. But it is literally only half the job done.\nThe hell now is unless you get friends and family or an agency involved to push it and market it it will languish on the 500th page of any Amazon search forever. Oh and did I say that there are thousands of books a day released and there is nowhere you can self-promote stuff if you do not have social media, HN and reddit will also immediately block self-promotion even if relevant to the audience (I guess I can understand why). I guess the only ones destined to read it are the AI training algorithms.\nStill it wont stop me writing, having a book published, even if nobody reads it is very self-satisfying and leaves something of you in this world when you are gone.",
          "link": "https://news.ycombinator.com/item?id=40613011",
          "publishedOn": "2024-06-07T21:08:57.000Z",
          "wordCount": null,
          "title": "New comment by boznz in \"Why are debut novels failing to launch?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40612033",
          "author": "atribecalledqst",
          "description": "Maybe a bit off-topic, but I sure wish they'd do this for OneDrive! I installed Windows for personal use for the first time recently (although I use it exclusively at work) and it drove me ABSOLUTELY BONKERS that my home drive was mapping to C:\\Users\\atribecalledqst\\OneDrive.\nWhat I hated the most was that the File Explorer just calls the folders in there e.g. \"Documents\" and \"Pictures\" without showing the full path. So it was hard to figure out just where in the file system you were looking -- a major annoyance if you do any work in the command-line!\nEven after switching OneDrive off and doing as much as I can to try and get rid of the OneDrive folder structure, I haven't been completely successful. You can make some -- but not all -- home folders (like Downloads, Documents, etc.) point directly to their place in the local user folder, but others, particularly Pictures, don't seem to be movable. Additionally, some programs still seem to want to use the OneDrive folder by default, like I think Office programs still do their best to use them.\nIn the grand scheme of things it's a small annoyance but god it annoys the shit out of me! I didn't ask for cloud backup and it drives me nuts they tried to force it on me!",
          "link": "https://news.ycombinator.com/item?id=40612033",
          "publishedOn": "2024-06-07T19:25:54.000Z",
          "wordCount": 4766,
          "title": "New comment by atribecalledqst in \"Microsoft will switch off Recall by default after security backlash\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40611450",
          "author": "janosdebugs",
          "description": "Having written an SSH server that is used in a few larger places, I find the perspective of enabling these features on a per-address basis by default in the future troubling. First, with IPv4 this will have the potential to increasingly penalize innocent bystanders as CGNs are deployed. Worst case, this will give bad actors the option to lock the original owner out of their own server if they have a botnet host in the same network. With IPv6 on the other hand, it is trivially easy to get a new IP, so the protection method described here will be completely ineffective.\nFrom my experiments with several honeypots over a longer period of time, most of these attacks are dumb dictionary attacks. Unless you are using default everything (user, port, password), these attacks don't represent a significant threat and more targeted attacks won't be caught by this. (Please use SSH keys.)\nI have seen experienced sysadmins create the test user with the password of \"test\" on a live server on port 22 because they were having an \"autopilot moment\". It got hacked within 20 minutes of going online and these mechanisms wouldn't have saved it, the attacker got in on the second or third try.\nIf you want to have a read about unsolved problems around SSH that should be addressed, Tatu Ylonen (the inventor of SSH) has written a paper about it in 2019: https://helda.helsinki.fi/server/api/core/bitstreams/471f0ff...",
          "link": "https://news.ycombinator.com/item?id=40611450",
          "publishedOn": "2024-06-07T18:25:54.000Z",
          "wordCount": null,
          "title": "New comment by janosdebugs in \"OpenSSH introduces options to penalize undesirable behavior\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40611194",
          "author": "davedx",
          "description": "pip install pytorch\nEnvironment broken\nSpend 4 hours fixing python environment\npip install Pillow\nSomething something incorrect cpu architecture for your Macbook\nSpend another 4 hours reinstalling everything from scratch after nuking every single mention of python\npip install … oh time to go home!",
          "link": "https://news.ycombinator.com/item?id=40611194",
          "publishedOn": "2024-06-07T18:03:48.000Z",
          "wordCount": null,
          "title": "New comment by davedx in \"Ask HN: Machine learning engineers, what do you do at work?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40611155",
          "author": "GordonS",
          "description": "Your browsing history is unlikely to contain personal information, secrets, porn images etc. And if you use Chrome, they get your full browsing history by default.\nI get your point, but Microsoft's Recall can capture anything onscreen - emails, personal info, porn, passwords and the like. And it feels, bizarrely for 2024, that little thought has gone into privacy or security.",
          "link": "https://news.ycombinator.com/item?id=40611155",
          "publishedOn": "2024-06-07T18:00:08.000Z",
          "wordCount": 4105,
          "title": "New comment by GordonS in \"Microsoft will switch off Recall by default after security backlash\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40611136",
          "author": "tambourineman88",
          "description": "The opposite of what you’d think when studying machine learning…\n95% of the job is data cleaning, joining datasets together and feature engineering. 5% is fitting and testing models.",
          "link": "https://news.ycombinator.com/item?id=40611136",
          "publishedOn": "2024-06-07T17:58:32.000Z",
          "wordCount": 1474,
          "title": "New comment by tambourineman88 in \"Ask HN: Machine learning engineers, what do you do at work?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40610804",
          "author": "plasticbugs",
          "description": "Tom7 is my favorite content creator. Each of his projects feels like a ~master’s thesis~ video dissertation. If you are not familiar with his work, please take some time to watch his other videos. They are all outstanding so I won’t recommend any specific one.\nTom7, if you’re out there (here), thank you for the free education and entertainment. You are an inspiration!",
          "link": "https://news.ycombinator.com/item?id=40610804",
          "publishedOn": "2024-06-07T17:27:17.000Z",
          "wordCount": null,
          "title": "New comment by plasticbugs in \"Tom 7: Badness 0 (Three ways)\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40608690",
          "author": "cs702",
          "description": "This looks great.\nThe authors randomly permute (i.e., shuffle) input tokens in training and add two positional encodings to each token: one with the token's position and another with the position of the token to be predicted. Otherwise, the model is a standard autoregressive GPT. The consequences of this seemingly \"simple\" modification are significant:\n* The authors can prompt the trained model with part of a sequence and then decode the missing tokens, all at once, in parallel, regardless of order -- i.e., the model can in-fill in parallel.\n* The authors can compute conditional probability densities for every missing token in a sequence, again in parallel, i.e., densities for all missing tokens at once.\n* The authors propose a rejection-sampling method for generating in-fill tokens, again in parallel. Their method seems to work well in practice.\nI've added this to my reading list. Thank you for sharing it on HN.",
          "link": "https://news.ycombinator.com/item?id=40608690",
          "publishedOn": "2024-06-07T13:49:14.000Z",
          "wordCount": null,
          "title": "New comment by cs702 in \"σ-GPTs: A new approach to autoregressive models\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40607742",
          "author": "tartaruz",
          "description": "To avoid a cancellation fee with Adobe, follow these steps:\n1. Change Your Current Plan: First, switch your existing Adobe plan to a different one. This is because Adobe offers a 14-day cancellation period for any new plan.\n2. Cancel the New Plan: Wait until the next day, then cancel this new plan. Due to the 14-day cancellation policy, you should be able to do this without incurring any fees.\nExplanation: Adobe's policy allows you to cancel a plan within 14 days of purchase without a penalty. By switching to a new plan and then cancelling it within this window, you effectively bypass any cancellation fees that would apply to your original plan.",
          "link": "https://news.ycombinator.com/item?id=40607742",
          "publishedOn": "2024-06-07T11:54:11.000Z",
          "wordCount": null,
          "title": "New comment by tartaruz in \"Cancel Adobe if you are a creative under NDA with your clients\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40607738",
          "author": "j16sdiz",
          "description": "Their response is basically \"we won't abuse it\".\nEven if we trust them, this response is not good enough for any project under NDA. Unless I can, somehow, put Adobe under the NDA, it's not helping.\nNever mention most of us don't actually trust them to be not abusing.",
          "link": "https://news.ycombinator.com/item?id=40607738",
          "publishedOn": "2024-06-07T11:53:59.000Z",
          "wordCount": null,
          "title": "New comment by j16sdiz in \"Cancel Adobe if you are a creative under NDA with your clients\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40607613",
          "author": "panphora",
          "description": "If you're planning to cancel, here's how to avoid the 50% cancellation fee:\n1. Go to cancel your subscription. You will see a screen with the cancellation fee. Continue.\n2. They will offer you a new plan to avoid the cancellation fee. Choose the cheapest one to switch to a new plan.\n3. Here's the loophole: You can cancel any plan for free within two weeks. Cancel the new plan within this period and get your money back for the first month of the new plan.\nYou've avoided the fee.\nSource: https://www.reddit.com/r/VideoEditing/comments/k9kh6v/how_to...",
          "link": "https://news.ycombinator.com/item?id=40607613",
          "publishedOn": "2024-06-07T11:36:01.000Z",
          "wordCount": null,
          "title": "New comment by panphora in \"Cancel Adobe if you are a creative under NDA with your clients\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40605735",
          "author": "kstrauser",
          "description": "Not the submitter, but I installed this a couple days ago to replace Bartender. For those not following along at home, the Bartender author just sold it to some sketchy app mill. It’s an app that legitimately requires screen recording permissions to work. I trusted the old author’s reputation. I have zero trust in the own owner.\nIce isn’t as good yet. It’s not nearly so configurable. For example, you can either hide all icons or none. You can’t decide to show some of them all the time. That’s a bummer. I’ll still happily accept that trade off to replace Bartender, which I’d previously purchased several versions of. It’s dead to me.\nGreat job so far, Ice. I hope you keep improving!",
          "link": "https://news.ycombinator.com/item?id=40605735",
          "publishedOn": "2024-06-07T06:02:58.000Z",
          "wordCount": null,
          "title": "New comment by kstrauser in \"Ice – open source menu bar manager for macOS\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40604233",
          "author": "renaudg",
          "description": "The problem may have more to do with Uganda and having a surveillance state than it has to do with National ID cards.\nMost European countries have them and they are as uncontroversial as passports.\nCountries without national ID cards are not especially more privacy minded : for the purpose of identity verification they just use alternative documents & processes that are less straightforward and at least as intrusive (e.g. driving licenses, utility bills and credit checks in the US and UK).\nIMO it's much more honest to recognize that there's a legitimate need to be able to prove one's identity in a functioning society, and to build a dedicated system for that, instead of tying your existence as a citizen to your ability / willingness to drive a large piece of metal around.",
          "link": "https://news.ycombinator.com/item?id=40604233",
          "publishedOn": "2024-06-07T00:58:36.000Z",
          "wordCount": null,
          "title": "New comment by renaudg in \"Uganda's surveillance state is built on national ID cards\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=52751",
          "author": "Chris Bertram",
          "description": "Visit the post for more.",
          "link": "https://crookedtimber.org/2024/06/09/sunday-photoblogging-wisteria-at-iford/",
          "publishedOn": "2024-06-09T09:37:36.000Z",
          "wordCount": 1756,
          "title": "Sunday photoblogging: wisteria at Iford",
          "imageUrl": "https://live.staticflickr.com/65535/52929971294_a3811721f8.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52745",
          "author": "Harry",
          "description": "It’s more than 5 years since Erik died which, for those who knew him, is quite hard to believe, as he is still a strong voice in many of our heads. Because I know many of our readers knew and admired him or his work (or both!) I thought I’d let you know that a […]",
          "link": "https://crookedtimber.org/2024/06/06/engaging-erik-olin-wright-between-class-analysis-and-real-utopias/",
          "publishedOn": "2024-06-06T14:45:47.000Z",
          "wordCount": 1928,
          "title": "Engaging Erik Olin Wright: Between Class Analysis and Real Utopias",
          "imageUrl": "https://crookedtimber.org/wp-content/uploads/2024/06/getimage_11eb0385-db5c-4818-818e-16d1e9820871.webp"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/The-ETERNAL-Norita",
          "author": "CADTM International, Eric Toussaint, Maria Elena Saludas",
          "description": "At 6:41 p. m. on Thursday, May 30, at the age of 94, our beloved Nora Cortiñas left us; we will miss her so much. Barely a few seconds after this sad news, which we didn't want to hear, was announced, someone had already shouted “ETERNAL Norita!” at this iconic Plaza de Mayo location. \nEnglish\n\n/ \nSocial movements, \nArgentina, \nHuman Rights",
          "link": "https://www.cadtm.org/The-ETERNAL-Norita",
          "publishedOn": "2024-06-07T16:43:37.000Z",
          "wordCount": 2843,
          "title": "The ETERNAL Norita!",
          "enclosure": {
            "url": "https://www.cadtm.org/IMG/jpg/la_deuda_es_terminar_con_la_pobreza.jpg",
            "length": "11752",
            "type": "image/jpeg"
          },
          "imageUrl": "https://www.cadtm.org/IMG/jpg/la_deuda_es_terminar_con_la_pobreza.jpg"
        },
        {
          "id": "https://www.cadtm.org/When-the-new-South-Africa-of-the-betrayed-expectations-also-betrays-its-hero",
          "author": "Yorgos Mitralias",
          "description": "“You are guilty not only when you commit a crime, but also when you do nothing to prevent it when you have the chance”. (Dimitri Tsafendas) \nEnglish\n\n/ \nSouth Africa, \nSouth",
          "link": "https://www.cadtm.org/When-the-new-South-Africa-of-the-betrayed-expectations-also-betrays-its-hero",
          "publishedOn": "2024-06-07T12:01:43.000Z",
          "wordCount": 1965,
          "title": "When the new South Africa of the betrayed expectations, also betrays its hero Dimitri Tsafendas!",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/c908f4b7c9a1ec1e8883076aaca18d-ef115.jpg"
        },
        {
          "id": "https://www.cadtm.org/The-6th-International-Eco-socialist-Meeting-and-the-1st-Latin-American-and",
          "author": "Maria Elena Saludas",
          "description": "Over three days (9-11 May), the city of Buenos Aires received over 250 activists from 30 nations. After more than a year of planning, we were able to assemble in the auditorium of the ATE (Association of State Workers) to discuss and attempt to create strategies for developing resistance to the capitalist system. \nEnglish\n\n/ \nSocial movements, \nArgentina, \nAgriculture and Food Sovereignty, \nEcology/Climate",
          "link": "https://www.cadtm.org/The-6th-International-Eco-socialist-Meeting-and-the-1st-Latin-American-and",
          "publishedOn": "2024-06-07T07:30:54.000Z",
          "wordCount": 3077,
          "title": "The 6th International Eco-socialist Meeting and the 1st Latin American and Caribbean Eco-socialist Meeting concluded successfully",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1200xH630/a601858ea5394d476d91c2804b6a42-e6e86.jpg"
        },
        {
          "id": "https://www.cadtm.org/The-Drums-of-War-are-Banging-in-Europe",
          "author": "Eric Toussaint, Miguel Urbán Crespo, Paul Murphy",
          "description": "These weeks see the end of the term for an ineffectual European legislature which served during the worst pandemic of this century, during Vladimir Putin's invasion of Ukraine, and with it, the outbreak of a war on European soil that evokes the worst memories of the world wars of the last century. And as we witness the televised genocide of the Palestinian people, it appears that the international system of liberal governance seems to be collapsing like a house of cards. \nEnglish\n\n/ \nAusterity/Structural Adjustment, \nEurope, \nUkraine, \nNorth",
          "link": "https://www.cadtm.org/The-Drums-of-War-are-Banging-in-Europe",
          "publishedOn": "2024-06-06T16:37:23.000Z",
          "wordCount": 6720,
          "title": "The Drums of War are Banging in Europe",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/78d3d638c0b18c1b9ff77c46815d04-2b616.jpg"
        },
        {
          "id": "https://www.cadtm.org/The-World-Bank-s-accounts",
          "author": "Eric Toussaint",
          "description": "In July 2024, the World Bank and the IMF will be 80 years old. 80 years of financial neo-colonialism and the imposition of austerity policies in the name of debt repayment. 80 years is enough! The Bretton Woods institutions must be abolished and replaced by democratic institutions serving an ecological, feminist and anti-racist bifurcation. To mark these 80 years, we are republishing a series of articles every Wednesday until July, looking in detail at the history and damage caused by these (...)\nEnglish\n\n/ \nIMF, \nWorld Bank, \nFinance against people, \n80 ans BM FMI FR",
          "link": "https://www.cadtm.org/The-World-Bank-s-accounts",
          "publishedOn": "2024-06-05T07:30:00.000Z",
          "wordCount": 3293,
          "title": "The World Bank's accounts",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L792xH416/0e8842dd05df7c7ac89669eb940b50-d0fb9.png"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=7778",
          "author": "disassociated.com",
          "description": "Best I keep this brief, especially after complaining about film franchises continually rebooting and retelling the same story. Alien: Romulus (isn’t Romulus a planet in the Star Trek universe? Yeah, I thought so), is a story about some people on a spaceship, whose lives are threatened by a sinister alien stowaway. Reminds me a lot […]",
          "link": "https://disassociated.com/alien-romulus-alien-story-continues-great-poster/",
          "publishedOn": "2024-06-06T21:00:12.000Z",
          "wordCount": 328,
          "title": "Alien: Romulus, the Alien story continues. Great poster though",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7775",
          "author": "disassociated.com",
          "description": "Great news for fans of 2019 thriller/comedy/whodunit, Knives Out… a follow up is on the way. Daniel Craig will reprise his role as private detective Benoit Blanc, in Wake Up Dead Man, due for cinematic release sometime in 2025. Check out the teaser/trailer, though it’s more teaser than trailer. Good to hear CSI KFC’s voice […]",
          "link": "https://disassociated.com/wake-up-dead-man-rian-johnson-daniel-craig-benoit-blanc-returns/",
          "publishedOn": "2024-06-06T20:30:25.000Z",
          "wordCount": 243,
          "title": "Wake Up Dead Man, by Rian Johnson, with Daniel Craig: Benoit Blanc returns",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7769",
          "author": "disassociated.com",
          "description": "There has been talk of the four-day workweek for as long as I can remember. We were told about it when I started school. Yet it’s to fully, properly, officially, arrive. The work week is still, for the most part, in many places, five days: Monday to Friday. We don’t live in an age where […]",
          "link": "https://disassociated.com/four-day-workweeks-nigh-zero-day-workweeks/",
          "publishedOn": "2024-06-05T21:00:53.000Z",
          "wordCount": 418,
          "title": "Four-day workweeks are nigh, followed by zero-day workweeks",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7764",
          "author": "disassociated.com",
          "description": "Colonel Sanders founded KFC at age sixty-two. Anna Mary Robertson Moses AKA Grandma Moses, started painting when she was seventy-six, and had an illustrious career spanning twenty-five years. American actor Kathryn Joosten began her Hollywood career aged fifty-six. These are just a few examples of people who are considered to be late bloomers. Those who […]",
          "link": "https://disassociated.com/extremely-simple-way-detect-potential-late-bloomers/",
          "publishedOn": "2024-06-04T21:00:31.000Z",
          "wordCount": 521,
          "title": "An extremely simple way to detect potential late bloomers",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": []
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/rule-of-law",
          "author": null,
          "description": "Trump and the courts.",
          "link": "https://newleftreview.org/sidecar/posts/rule-of-law",
          "publishedOn": "2024-06-07T14:39:07.000Z",
          "wordCount": 4114,
          "title": "JoAnn Wypijewski: &ldquo;Rule of Law?&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/06/08-gettyimages-2147829397.webp"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/all-or-nothing",
          "author": null,
          "description": "Jiajun ‘Oscar’ Zhang’s first feature.",
          "link": "https://newleftreview.org/sidecar/posts/all-or-nothing",
          "publishedOn": "2024-06-07T10:56:18.000Z",
          "wordCount": 1781,
          "title": "Trevor Clarke: &ldquo;All or Nothing&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/06/Zhang.jpeg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/wartime-lithuania",
          "author": null,
          "description": "Jingoism and discontent.",
          "link": "https://newleftreview.org/sidecar/posts/wartime-lithuania",
          "publishedOn": "2024-06-06T12:09:18.000Z",
          "wordCount": 2250,
          "title": "Michael Casper: &ldquo;Wartime Lithuania&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/06/creation-of-the-world-iii.jpg"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://tiramisu.bearblog.dev/love-bradbury/",
          "author": null,
          "description": "Minutes before I left home on Thursday one of my mom's coworkers pulled up on the driveway and handed me a plastic bag of zongzi as a going away gift. \"Good luck with the move!\" he said. \"Go do what you love.\"\nThat last remark has been echoing in my head. It runs directly contrary to the advice I received from my parents and their friends growing up. Hearing my aunts now telling me to follow my dreams and not to worry about money makes me wonder how my mom's framed this new career shift of mine.\nA large part of me is suspicious. Mom always told me growing up that being an adult was learning to do things you didn't want to do and that nobody would pay me to do a job I found fun. Why's she switching it up on me now? Did it take me crashing and burning in an actual job for her to realize I'm not cut out for a life in STEM? I try not to look back with regret, but how much further along would I be had I chased something I liked earlier?\nIn Zen in the Art of Writing Bradbury reflects and decides that \"looking back over a lifetime, you see that love was the answer to everything.\" I've been thinking about that as I prepare mentally for a week (and month) of writing and teaching writing for fifty hours a week, things my parents have been telling everyone are things I like to do. At the risk of speaking too soon (knocks on wood), this is the first Sunday I'm not actually dreading the coming week, if not ever then at least for a very long time. I'm nervous and well aware that my schedule will test me, but a strong undercurrent of appreciation for what I'm doing (and not doing) buoys me now and that is nothing short of a revelation for me.",
          "link": "https://tiramisu.bearblog.dev/love-bradbury/",
          "publishedOn": "2024-06-09T15:55:00.000Z",
          "wordCount": 820,
          "title": "looking back over a lifetime, you see that love was the answer to everything",
          "imageUrl": null
        },
        {
          "id": "https://sankalp.bearblog.dev/just-keep-doing-the-bit-karma-yoga-edition/",
          "author": null,
          "description": "I have been preparing for job interviews (looking to get into genai+backend roles you know). I like building projects and learning new stuff but job search is something that scares me. Partly because of the various uncertainties involved like places to apply, strenous interview processes, where I would work next, what kind of work I will get. It’s not the first time I am going through this process but it sucks (a lot in the beginning atleast). The other aspect is the grind.\nTranslation: I am not afraid of slap sir, I am afraid of job search\nI could be solving some leetcode problems right now, I could be applying right now… I have many things to do even outside job search - oh no - fuck fuck fuck. That’s sort of the state of my mind - atleast in the background. Till I don’t build some momen…",
          "link": "https://sankalp.bearblog.dev/just-keep-doing-the-bit-karma-yoga-edition/",
          "publishedOn": "2024-06-09T14:25:00.000Z",
          "wordCount": 2073,
          "title": "Just keep doing the bit (Karma Yoga Edition)",
          "imageUrl": null
        },
        {
          "id": "https://notes.jeddacp.com/weekends-a-different-kind-of-busy/",
          "author": null,
          "description": "Weekends are an interesting concept for me. By the time Sunday night rolls around, I’m already counting down to Friday afternoon, which marks the start of of my weekend. I spend the whole week wishing for the weekend, but why exactly?\nWeekdays are exhausting. I’ve mentioned that I'm not a morning person, despite having to be bright, fresh and ready for stand-up at 7am. After work, I crash and crawl into bed for my (much needed) afternoon nap. When I wake up, I am FAMISHED, so we either prep dinner or pick something up. After dinner, I decompress (reading or tv) or work out. Then the next day, it starts all over again. All of the errands, housekeeping, and life things that need to get done take a backseat during the weekdays because... work really just takes up a majority of my brain power.\nBy the time the weekend rolls around, personal and household to-do lists are endless. We spend the entire weekend being productive in other areas of our life that we neglected during the week. Because of this, there are times when there's just little room for excursions or “fun”. There are things that need to get done, so we get them done during the weekend.\nIt's an odd thing to look forward to doing other work outside of actual work. Perhaps it's not the work that I look forward to, but the shift in productivity. Although it’s nice to be productive, sometimes I wish we had more time for the fun things we actually want to do. Weekends are another kind of busy, but they could be so much more than just catching up on life’s to-dos.\nWhere is that petition for the 4-day work week?\nThis weekend’s task: Prep for the over-the-range microwave delivery, by attempting to figure out how to remove the backsplash.\n🐘 Reply on Mastodon // 📧 Reply by email\nSubscribe via RSS here",
          "link": "https://notes.jeddacp.com/weekends-a-different-kind-of-busy/",
          "publishedOn": "2024-06-08T18:40:00.000Z",
          "wordCount": 848,
          "title": "Weekends: A Different Kind of Busy",
          "imageUrl": "https://img.playbook.com/wc-ZAFWUGsBrQe1jJqZ8i7Vo0ts1sUIU8xNzIe6ehGo/Z3M6Ly9wbGF5Ym9v/ay1hc3NldHMtcHVi/bGljL2U3ZTRlMzM1/LWQ0NDEtNDNhYS1h/YTk5LTAxZjk0M2Rl/ODU5Ng"
        },
        {
          "id": "https://yuricunha.bearblog.dev/one-day-at-a-time/",
          "author": null,
          "description": "What's up?\nYou made it through the day. I'm proud of you. Seriously, I'm so proud of you.\nIf nobody told you today, I love you. I mean that with all my heart.\nYou made it through today, and you should be proud of yourself too.\nSometimes, it's hard to look forward to anything when you're feeling down. But when you reach the end of the day and look back at what you went through, you'll see you have more to look forward to because every day it gets a bit better.\nI always tell myself, \"Someday I'll feel better. Someday I'll be alright.\" Remember, that \"someday\" comes one day at a time, and you'll get there. You will.\nI'm proud of you. I'm very proud of you.\nMake sure you come back.\nListen on YouTube or Spotify\n\n\nLinks: \nEmail me if you want |\nWebsite | Blog | \n\nPodcast: \nSpotify | Youtube | \n\nShare on: \nWhatsApp |  X/Twitter |  Facebook |  Linkedin | Reddit |",
          "link": "https://yuricunha.bearblog.dev/one-day-at-a-time/",
          "publishedOn": "2024-06-08T15:23:00.000Z",
          "wordCount": 1028,
          "title": "one day at a time",
          "imageUrl": "https://yuricunha.com/_next/image?url=%2Fstatic%2Fimages%2Fblog%2Fone-day-at-a-time%2Fone-day-at-a-time.png&w=1920&q=75"
        },
        {
          "id": "https://birming.com/bear-blog-search/",
          "author": null,
          "description": "Blogging is back and today we have a myriad of great platforms to choose from. This one is hosted on Bear. If you have your own blog and are reading this, chances are that your blog is also a Bear one. 🐻\nHowever, one of the things most of these “indie tools” lack is a search feature. I’ve written a separate post about it: The basic feature blogging platforms lack. 🔎\nWell, it looks like things are about to change for us Bear bloggers. I just noticed that Herman's blog now has such a feature (can’t recall having seen it before). And it works elegantly. 🤩\nLet's hope this is something we'll all have soon. Thank you in advance, Herman! ✌️\nUpdate: Bear user Yordi made it possible to add your own (example). You can get yours here. Thank you, Yordi! 😎\nUpdate 2: The search results only include links to posts where the search word is included in the title. Hopefully there will come a “true search feature” in the future.",
          "link": "https://birming.com/bear-blog-search/",
          "publishedOn": "2024-06-08T14:54:00.000Z",
          "wordCount": 645,
          "title": "Bear blog got a search feature?",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1717834500-0.jpeg"
        },
        {
          "id": "https://tiramisu.bearblog.dev/parecen-viernes/",
          "author": null,
          "description": "Friday nights in New York have an energy about them, one that's been easier for me to pick up on after arriving in the city midweek. I'm not used to it, like a river fish dumped in a tank. Everyone's dressed up in skin and mascara and waiting to go to the clubs and even though that life is not for me I love soaking in their anticipation on the subway platforms. Back when I worked abroad in that job I hated I remember writing something about how my soul left my body on Monday mornings and returned on Friday nights. I don't miss that feeling one bit, but I do sometimes think about that hunger for life I felt on Friday evenings, that burning desire to avenge the week of my life I sold to live for two days. If I could bottle that joie de vivre and down it everyday, I'd be unstoppable.\nI'm gett…",
          "link": "https://tiramisu.bearblog.dev/parecen-viernes/",
          "publishedOn": "2024-06-08T03:48:00.000Z",
          "wordCount": 974,
          "title": "parecen viernes",
          "imageUrl": null
        },
        {
          "id": "https://birming.com/awesome-aging/",
          "author": null,
          "description": "I was listening to an interview with the Swedish artist Peter Jöback. They were talking about aging and he said:\nI feel like my life started after I turned 50. It's so much fun getting older! Now I can face the world with ease.\nHe says that after 50 he feels he has become more playful and that life feels \"less serious\".\nI turned 50 myself a couple of years ago and I can relate 100 percent. Aside from a few minor “bugs”, like always having to keep a pair of reading glasses handy, there are only positive changes.\nI don't worry so much about what people think of me. It's not that I don't care about things - on the contrary, humility and compassion are more prominent than ever - but I've come to truly realize that you can never control what others think and say about you.\nYou can't please them all – and that's fine!\nIn many ways, I think aging is a bit like the story of Benjamin Button. Not in terms of appearance, of course. Aging is noticeable in the form of gray hairs here and there, and other hairs have completely given up, never to return, etc…\nBut that doesn’t feel very important.\nThe lightness, though, really does feel like it makes the mind younger and younger. Like magic! It's more fun and interesting to live.\nNo matter your age, stay curious and enjoy life. Aging is pretty awesome, trust me.\nWant more “proof”? Check out Alyssa’s post Thoughts on Being in My 30s.",
          "link": "https://birming.com/awesome-aging/",
          "publishedOn": "2024-06-07T15:42:00.000Z",
          "wordCount": 709,
          "title": "Awesome aging",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1717774914-0.jpg"
        },
        {
          "id": "https://iml.bearblog.dev/ai-powered-has-become-a-red-flag/",
          "author": null,
          "description": "Since the launch of ChatGPT back in 2022 AI has explod — just kidding. Those lead-ins are getting tiring, right?\nBut what has become even more irritating is how everything is \"AI-powered\" all of a sudden.\nLet me make it clear up-front that I am not opposed to using AI, whatever that means anymore, for a product. I've done it myself and it's a good way to add value to the product, if it really needs it.\nBut what truly irks me are the common-day apps which have been just fine without such AI plug-ins and, all of a sudden, they become \"AI-powered\". Here are a few things that go through my head when \"AI-powered\" is advertised up-front:\nHow reliable are the outputs / are hallucinations present?\nWhere does my data go? (Probably OpenAI, but not 100% sure)\nIs the AI-powered going to be a mark-up?\n…",
          "link": "https://iml.bearblog.dev/ai-powered-has-become-a-red-flag/",
          "publishedOn": "2024-06-07T15:27:00.000Z",
          "wordCount": 958,
          "title": "\"AI-powered\" has become a red flag",
          "imageUrl": null
        },
        {
          "id": "https://notes.jeddacp.com/settling-into-my-new-notes-home/",
          "author": null,
          "description": "Well, hello there.\nI went back and forth on whether or not I wanted to make the move from my former (Notes) blogging platform to Bear blog. I listed out some pros and cons in one of my previous posts1, and I really thought I was going to stay put for a little bit. After all, I wanted to look away from the new and shiny temptation and really think about what it would mean to switch. Moving sucks, and I hate having to pack, and unpack.\nWell, I spent the past few days packing, and then unpacking (aka migrating my blog). I figured this was a good way to test out Bear to see if writing in all markdown would bother me. It didn’t. I’m already primarily writing in Markdown on Bear (Notes App) before posting, so there wasn’t much overheard. I found myself enjoying this lightweight yet customizable platform.\nSo, here I am. Things are a little bit scattered. Still have no idea where to put some of my things. I think it will take some time, but I’m already cozying up in my new home.\nIf you’re new here, welcome! If you’ve been following me from the beginning, I’m so glad to have you on here. Grab a seat, and enjoy my Notes about anything and everything.\nUntil then, go read some posts from some awesome bloggers I have listed here for JUnited. They're all pretty great!\n🐘 Reply on Mastodon // 📧 Reply by email\nSubscribe via RSS\noriginally posted on the other platform, and imported here.↩",
          "link": "https://notes.jeddacp.com/settling-into-my-new-notes-home/",
          "publishedOn": "2024-06-06T23:07:00.000Z",
          "wordCount": 843,
          "title": "Settling into my new (notes) home",
          "imageUrl": "https://img.playbook.com/wc-ZAFWUGsBrQe1jJqZ8i7Vo0ts1sUIU8xNzIe6ehGo/Z3M6Ly9wbGF5Ym9v/ay1hc3NldHMtcHVi/bGljL2U3ZTRlMzM1/LWQ0NDEtNDNhYS1h/YTk5LTAxZjk0M2Rl/ODU5Ng"
        },
        {
          "id": "https://kartikay.bearblog.dev/attracting-similar-people/",
          "author": null,
          "description": "The point of this blog was to put myself out there. Why? I stopped filling my mind with content and the resulting silence led to an outpour of content in my head. I needed an outlet to express the thoughts in my head. Something I cover in my essay on writing here. Also who wants to miss out on being part of the future AGI training set?\nYet I never thought of one huge perk. Attracting like-minded people. The internet is amazing. You put out slivers of your consciousness and watch as like-minded people gather around. I have got DMS asking such specific things. Relating to my essays, to my impact page. People I looked up to on x. People who inspired me. It feels nice to interact with your tribe.\nI have already got many people writing and sharing on Twitter. Especially through bearblog. I would urge more people to do the same. Be you. Even if you don't get many views. Just share your thoughts. You will attract similar-minded people. Find friends, business partners, and\nmaybe life partners. That is the hidden perk no one tells you about.\nSo if you are on the fence, start writing and sharing. Best of luck!",
          "link": "https://kartikay.bearblog.dev/attracting-similar-people/",
          "publishedOn": "2024-06-05T22:21:00.000Z",
          "wordCount": 655,
          "title": "Attracting Similar People",
          "imageUrl": null
        },
        {
          "id": "https://paulogpd.bearblog.dev/en-rabbit-r1-its-a-scam/",
          "author": null,
          "description": "It’s not new that the promise of artificial intelligence capable of helping us and solving a series of problems we don't have has emerged. However, it is only from 2022 onwards that large models (LLM, LAM, and others) are gaining traction and attention worldwide. It started with OpenAI and ChatGPT, followed by Humana's AI Pin and Rabbit R1 from Rabbit Inc. Neither delivered on their promises, but the Rabbit R1 has an extra touch.\nWhile Humane's brooch is just an overpriced product that doesn’t work properly, the Rabbit R1 is a mishmash of poorly executed features and a good dose of scams, especially coming from a company previously involved with NFTs and \"pay-to-win\" games (which use NFTs). Most of the instructions are hardcoded into the device, meaning that most actions are predefined acc…",
          "link": "https://paulogpd.bearblog.dev/en-rabbit-r1-its-a-scam/",
          "publishedOn": "2024-06-05T18:55:10.692Z",
          "wordCount": 1183,
          "title": "[en] rabbit r1 it's a SCAM",
          "imageUrl": null
        },
        {
          "id": "https://tiramisu.bearblog.dev/nothing-nonnegotiable/",
          "author": null,
          "description": "Vegetating aside, the last few days before big moves usually also brings lots of appointments. This week I get my teeth cleaned and eyes checked before I leave, scheduling follow-ups in a year and making plans to be back for them.\nGoing to these appointments is one of the few activities I actually prefer my parents come along. Not because I enjoy their company (it's hit or miss), but because I'm no good at doing the things they usually do. (And by 'they' I mean my mom.)\nToday before I leave for the optometrist Mom tells me I shouldn't agree to pay more than $110 for my visit, the same amount we paid last year. Upon arrival, the receptionist informs me that the fee for checkups is $250 now. $250? I thought it was supposed to be $110, I say. She shows me a packet with the price printed in bo…",
          "link": "https://tiramisu.bearblog.dev/nothing-nonnegotiable/",
          "publishedOn": "2024-06-05T18:41:00.000Z",
          "wordCount": 1018,
          "title": "nothing nonnegotiable",
          "imageUrl": null
        },
        {
          "id": "https://kartikay.bearblog.dev/feedback-loops/",
          "author": null,
          "description": "Everything is dependent on feedback loops. Video games/reels have short exciting feedback loops. That is why they are so addictive. Real life often has long feedback loops. Anything you do, it will take time to see the results.\nYou will have to grind hard at something and for a sufficiently long amount of time to achieve something meaningful. Yet if your brain is trained to enjoy short feedback loops it becomes hard to do something for long without seeing exciting results.\nYou either train yourself to enjoy long feedback loops or you shorten the loop through regular rewards. Maybe break down the huge task into small chunks.\nIt is often good to run both a long and short feedback loop on a task. The long loop keeps you aware of the bigger picture so the setbacks don't seem as bad. The short loop keeps you on track and gives that constant nudge in the right direction.\nYou are already in a feedback loop whether you are aware of it or not. Better off being in a feedback loop that helps you grow. One of your own making.",
          "link": "https://kartikay.bearblog.dev/feedback-loops/",
          "publishedOn": "2024-06-05T18:30:00.000Z",
          "wordCount": 622,
          "title": "Feedback Loops",
          "imageUrl": null
        },
        {
          "id": "https://krueger.ink/a-new-digital-home-etc/",
          "author": null,
          "description": "My blog was housed on Scribbles since February, but I recently started playing around with Bear, another Indie Web blogging platform. it offers light customization and uses Markdown — two things I’d really been missing on Scribbles.\nWell, here I am — permanently blogging on Bear now. I’ve also changed the name of my blog and have a new domain. It feels a bit like starting over, but not quite because I brought some old posts over with me. I’m certainly looking forward to this new adventure, though.\nMy old blog is still online and still available to visit, if anyone has an inkling to do so. I’m also not leaving the Scribbles platform entirely. My Camp Snap Chronicle photo blog will still remain there. And since that camera arrived yesterday, I’m hoping to maybe have some photos to post by the weekend. We’ll see. It’s been a busy few days for me.\nAnyway, feel free to add this new blog to your RSS reader of choice. I apologize for changing things, but I did what I felt was best for me. Stay tuned for all of the weird rambles you’ve come to expect, haha.",
          "link": "https://krueger.ink/a-new-digital-home-etc/",
          "publishedOn": "2024-06-04T16:33:23.439Z",
          "wordCount": 617,
          "title": "💻 A New Digital Home, Etc.",
          "imageUrl": null
        },
        {
          "id": "https://kartikay.bearblog.dev/pain/",
          "author": null,
          "description": "This is a short story I wrote a while back :\nIt was warm and cozy in his room.The walls, adorned with peeling wallpaper, seemed to hug him in a comforting embrace. He was safe here, cocooned in this familiar space. As long as he didn’t open the door, he could pretend. Pretend that everything was okay, that the world outside was just as gentle and forgiving as his secluded corner.\nSometimes, he heard loud, jarring knocks on the door. Bang Bang. Each knock sounded like a thunderclap, threatening to shatter his illusion. The door, scarred from previous assaults, was almost giving way. He remembered being afraid, trembling as he went to the door and pressing his body weight against it to lend it support. After all, it was his sole protector from the outside world, a barrier between him and the…",
          "link": "https://kartikay.bearblog.dev/pain/",
          "publishedOn": "2024-06-04T15:03:00.000Z",
          "wordCount": 1370,
          "title": "Pain",
          "imageUrl": null
        },
        {
          "id": "https://mgx.me/invisible-struggles/",
          "author": null,
          "description": "Cape Cod Morning by Edward Hopper, 1950, via the Smithsonian.\nWhat triggers this feeling of being overwhelmed for no reason? From an outside perspective, there is no objective reason things should feel so heavy. My circumstances have not markedly changed. There are no notable stressors present. Yet, internally, everything seems foggy, fuzzy, and oppressive. On these overwhelming days, I want so badly to grasp why I feel this way or make sense of some cause, yet no cause or reason can be found. The only reasonable response is rebellion through persistent, passionate, and lucid living despite it all.",
          "link": "https://mgx.me/invisible-struggles/",
          "publishedOn": "2024-06-04T07:52:17.097Z",
          "wordCount": 1160,
          "title": "invisible struggles",
          "imageUrl": "https://static.mgx.me/images/2024/cape-cod-morning.webp"
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/gabriel-pombo-da-silva-on-detention?v=1717970489",
          "author": null,
          "description": "Author: Gabriel Pombo Da Silva\nTitle: On detention\nDate: December 17, 2013\nSource: <actforfree.nostate.net/?p=15779>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\n JANUARY – OCTOBER – THE STRUGGLE CONTINUES \n To my friends, brothers and sisters, comrades\nI remember that last day as if it were yesterday, when !finally! I left (was expelled from) the cold,narrow aseptic cell of the maximum security prison of Aachen, Germany… On January 16 (2013) I was escorted to the airport of Barajas, Madrid, by Interpol, and from there I was taken to the tribunal of Plaza Castilla, not before being photographed (they were particularly interested in my chest as they looked in vain to find a tattoo of the acronym FAI/FRI), ‘playing the piano’ (had my fingerprints taken) in order to ascertain that it was …",
          "link": "https://theanarchistlibrary.org/library/gabriel-pombo-da-silva-on-detention?v=1717970489",
          "publishedOn": "2024-06-09T22:01:29.000Z",
          "wordCount": 2348,
          "title": "Gabriel Pombo Da Silva - On detention",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "9480",
            "url": "https://theanarchistlibrary.org/library/gabriel-pombo-da-silva-on-detention.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/jurnal-anarki-interview-with-anarchist-author-kevin-tucker?v=1717970217",
          "author": null,
          "description": "Author: Kevin Tucker\nTitle: Jurnal Anarki Interview with Anarchist Author Kevin Tucker\nDate: Feb 18, 2020\nSource: <web.archive.org/.../anarchistsworldwide.noblogs.org/post/2020/02/18/indonesia-usa-jurnal-anarki-interview-with-anarchist-author-kevin-tucker>\n\nThe following interview with self-described primal anarchist advocate, writer, editor, independent researcher, publisher, musician and rewilding human, Kevin Tucker, originally appeared in the first issue of the new Indonesian anarchist journal, Jurnal Anarki. Jurnal Anarki is written entirely in Bahasa Indonesian, and this is the first time content from it has been republished in English. We’d like to thank comrade Eat for making this possible!\n1. Looking at the Anarcho-Primitivist Primer by John Moore, he explains that Anarcho-Primiti…",
          "link": "https://theanarchistlibrary.org/library/jurnal-anarki-interview-with-anarchist-author-kevin-tucker?v=1717970217",
          "publishedOn": "2024-06-09T21:56:57.000Z",
          "wordCount": 9368,
          "title": "Kevin Tucker - Jurnal Anarki Interview with Anarchist Author Kevin Tucker",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "25497",
            "url": "https://theanarchistlibrary.org/library/jurnal-anarki-interview-with-anarchist-author-kevin-tucker.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/leo-tolstoy-a-calendar-of-wisdom?v=1717970042",
          "author": null,
          "description": "Author: Leo Tolstoy\nTitle: A Calendar of Wisdom\nSubtitle: Daily Thoughts to Nourish the Soul, Written and Selected From the World’s Sacred Texts\nDate: 1906\nNotes: Translated From the Russian by Peter Sekirin.\nSource: <archive.org/details/calendarofwisdom0000tols>\n\nThis translation is dedicated to MELISSA TEMERTY\nTranslator’s Acknowledgments\n I would like to express my deepest and most sincere acknowledgments to the following people: \n professors who introduced me to Russian literature: K. Lantz, R. Bogert, Ch. Barnes, H. Marshall, R. Lindheim, O. Bakitsh, C. Bedford, M. Valdez, L. Hutcheon; and other professors and students of the Slavic Department and the Department of Comparitive Literature of the University of Toronto; my literary agent, Ivy Fischer Stone, of the Fifi Oscard Agency; my …",
          "link": "https://theanarchistlibrary.org/library/leo-tolstoy-a-calendar-of-wisdom?v=1717970042",
          "publishedOn": "2024-06-09T21:54:02.000Z",
          "wordCount": 69745,
          "title": "Leo Tolstoy - A Calendar of Wisdom",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "399222",
            "url": "https://theanarchistlibrary.org/library/leo-tolstoy-a-calendar-of-wisdom.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/uploads/en/thumbnails/l-t-leo-tolstoy-a-calendar-of-wisdom-1.jpg.large.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/gabriel-pombo-da-silva-a-letter?v=1717966612",
          "author": null,
          "description": "Author: Gabriel Pombo Da Silva\nTitle: A Letter\nDate: December 30, 2015\nSource: <actforfree.nostate.net/?p=22046>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\n ‘..while there is a lower class, I am in it, and while there is a criminal element I am of it, and while there is a soul in prison, I am not free.’ — Eugene Debs \n Comrades!\nToday I’m in high spirits (you know our life is not a straight line, nor constant, or static…), and those who know me personally know that I have a pretty black a sense of humour (what ‘scandalizes’ others makes me smile, etc.) almost cynically (especially when it comes to talking about/describing facts to do with the ‘Law’, ‘Rights’, the ‘Authorities’, etc.); because these are ‘things’ that I can’t take seriously (even though my life is wrapped up in all tha…",
          "link": "https://theanarchistlibrary.org/library/gabriel-pombo-da-silva-a-letter?v=1717966612",
          "publishedOn": "2024-06-09T20:56:52.000Z",
          "wordCount": 2864,
          "title": "Gabriel Pombo Da Silva - A Letter",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "216394",
            "url": "https://theanarchistlibrary.org/library/gabriel-pombo-da-silva-a-letter.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/francisco-solar-nothing-is-over?v=1717966072",
          "author": null,
          "description": "Author: Francisco Solar\nTitle: Nothing is over\nSubtitle: On the need to accept the fullness of our choices\nDate: June 5, 2016\nSource: <actforfree.nostate.net/?p=23856>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\n ‘Anarchist prisoners are not alone’ and ‘if they touch one, they touch all’ are slogans that lived once again in the everyday anarchist action before, during and after the trial against us. The screams of disgust for authority that pierced the police control and the walls around those on trial clearly enraged the judge and magistrates, as was evident on their faces and which put smiles on ours. The presence in court of dear ones known and unknown filled us with pride and joy, preventing the prosecutors’ accusations and demands from having any possibility of intimidating us. T…",
          "link": "https://theanarchistlibrary.org/library/francisco-solar-nothing-is-over?v=1717966072",
          "publishedOn": "2024-06-09T20:47:52.000Z",
          "wordCount": 1505,
          "title": "Francisco Solar - Nothing is over",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7072",
            "url": "https://theanarchistlibrary.org/library/francisco-solar-nothing-is-over.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-theofilos-mavropoulos-chaos-just-around-the-corner?v=1717964569",
          "author": null,
          "description": "Author: Conspiracy of Cells of Fire, Theofilos Mavropoulos\nTitle: Chaos just around the corner\nDate: July 9, 2012\nSource: <actforfree.nostate.net/?p=10293>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\n(Italy, Mexico, Greece)\n On Wednesday, June 13th, the international anti-anarchist campaign under the name ‘operation boldness’ was set up. The Italian antiterrorism forces of ROS and carabiniers were put under the command of the Inquisitor-prosecutor of Perugia Manuela Comodi, and proceeded to arrest eight anarchist comrades. In parallel, investigations are conducted against other comrades as well (among them are the comrades of Edizioni Cerbero). \n We neither know the details of the case, nor are we lawyers to speak the language of documentary evidence or not. All we know is that the wo…",
          "link": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-theofilos-mavropoulos-chaos-just-around-the-corner?v=1717964569",
          "publishedOn": "2024-06-09T20:22:49.000Z",
          "wordCount": 1404,
          "title": "Conspiracy of Cells of Fire, Theofilos Mavropoulos - Chaos just around the corner",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7375",
            "url": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-theofilos-mavropoulos-chaos-just-around-the-corner.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-theofilos-mavropoulos-bullets-of-words-for-the-bullets-of-fai-fri?v=1717964491",
          "author": null,
          "description": "Author: Conspiracy of Cells of Fire & Theofilos Mavropoulos\nTitle: Bullets of words for the bullets of FAI/FRI\nDate: May 14, 2012\nSource: <actforfree.nostate.net/?p=9380>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\n It is a wonderful moment, the moment that the enemy kneels and falls from the determination of your brothers and sisters. A few days ago Roberto Adinolfi, CEO-magister of the nuclear energy company Ansaldo Nucleare, was shot by our brothers and sisters of the Olga Cell of the Informal Anarchist Federation (FAI)–International Revolutionary Front (FRI). \n Roberto Adinolfi is a high priest of the new totalitarianism of science and technology imperatives. Science has become the modern religion of our time, promising an apathetic society the lethargy of a stuffed belly and arti…",
          "link": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-theofilos-mavropoulos-bullets-of-words-for-the-bullets-of-fai-fri?v=1717964491",
          "publishedOn": "2024-06-09T20:21:31.000Z",
          "wordCount": 1616,
          "title": "Conspiracy of Cells of Fire & Theofilos Mavropoulos - Bullets of words for the bullets of FAI/FRI",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7768",
            "url": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-theofilos-mavropoulos-bullets-of-words-for-the-bullets-of-fai-fri.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-theofilos-mavropoulos-breaking-down-the-myths-of-prison?v=1717964334",
          "author": null,
          "description": "Author: Conspiracy of Cells of Fire & Theofilos Mavropoulos\nTitle: Breaking down the myths of prison\nDate: May 13, 2012\nSource: <actforfree.nostate.net/?p=9359>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\n SOLIDARITY TO OLGA ECONOMIDOU \n “Turn off the main switch in this dump. Here the beautiful becomes ugly, the choice becomes a habit and the meaningless important. Prison dirties creases and swallows pieces of dreams, desires, thoughts and feelings. Its most permanent residents, the majority of the prisoners are now a part of the appliances of the prison. Bars, yard, cameras, locks, prisoners mix all together and re-enact the world of captivity. Nothing is worthy in here. Come let’s go and don’t look back… Only fire will cleanse this place… ” \n Prison and its numbered residents. Pris…",
          "link": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-theofilos-mavropoulos-breaking-down-the-myths-of-prison?v=1717964334",
          "publishedOn": "2024-06-09T20:18:54.000Z",
          "wordCount": 1259,
          "title": "Conspiracy of Cells of Fire & Theofilos Mavropoulos - Breaking down the myths of prison",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6855",
            "url": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-theofilos-mavropoulos-breaking-down-the-myths-of-prison.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-unless-we-die-for-each-other-we-are-already-dead?v=1717964258",
          "author": null,
          "description": "Author: Conspiracy of Cells of Fire\nTitle: Unless We Die for Each Other, We Are Already Dead\nSubtitle: Communique by the Conspiracy of Cells of Fire About the Hunger Strike\nDate: 2015\nNotes: Translated by Inter Arma.\nSource: <interarma.info/2015/03/11/ellada-keimeno-spf-gia-apergia-peinas>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\n On March 3rd, “justice” decided on the pre-trial detention of the mother of the comrades Christos and Gerasimos Tsakalos and the second one’s girlfriend, with the charge of accession and participation in a terrorist organization.\n Behind the obvious ridiculousness of the charge, it is the morbid vindictiveness of the counter-terrorism and the judicial authority hiding, which wishes to blackmail emotionally both the two comrades and all of us. It is not ju…",
          "link": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-unless-we-die-for-each-other-we-are-already-dead?v=1717964258",
          "publishedOn": "2024-06-09T20:17:38.000Z",
          "wordCount": 1484,
          "title": "Conspiracy of Cells of Fire - Unless We Die for Each Other, We Are Already Dead",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7478",
            "url": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-unless-we-die-for-each-other-we-are-already-dead.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-two-statements-of-solidarity?v=1717964154",
          "author": null,
          "description": "Author: Conspiracy of Cells of Fire\nTitle: Two Statements of Solidarity\nSource: <actforfreedomnow.wordpress.com/2011/11/16/a-flame-of-solidarity-from-the-ccf-for-the-brothers-and-sisters-in-chile> & <actforfree.nostate.net/?p=8188>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\nA flame of solidarity from the CCF for the brothers and sisters in Chile (2011)\nWhen the prison bars stop our hands from throwing the fire of anarchy into the world of power, our words become the sharp rasp of escape.\n Armed with thoughts, desires, secret plans, new conspiracies, we give a warmest embrace in our imaginary meeting with the comrades of action across the world. \n Now we want our voice to reach our brothers and sister in distant Chile to Luciano (Tortuga) prosecuted on November 22 and to Monica, to Fe…",
          "link": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-two-statements-of-solidarity?v=1717964154",
          "publishedOn": "2024-06-09T20:15:54.000Z",
          "wordCount": 1440,
          "title": "Conspiracy of Cells of Fire - Two Statements of Solidarity",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "8270",
            "url": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-two-statements-of-solidarity.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-statement?v=1717963961",
          "author": null,
          "description": "Author: Conspiracy of Cells of Fire\nTitle: Statement\nDate: 31 March 2010\nSource: <sysiphus-angrynewsfromaroundtheworld.blogspot.com/2010/03/athens-statement-from-conspiracy-of.html>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\n The past 24 hours find us in an extreme emotional antithesis… \n On the one hand, great sorrow for the death of the 15-year old Afghani and the injury of his sister and on the other hand, maximum rage for the reportages of the media which totally arbitrarily and purposefully try to involve our organisation in this event. We are not usually “bothered” by the panic-ridden scenaria of the media, yet the importance of the event forces us to take a public position directly, without a connection to any attack of ours. \n For this reason we CLEARLY STATE THAT THE CONSPIR…",
          "link": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-statement?v=1717963961",
          "publishedOn": "2024-06-09T20:12:41.000Z",
          "wordCount": 1255,
          "title": "Conspiracy of Cells of Fire - Statement",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6776",
            "url": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-statement.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-political-statement?v=1717960334",
          "author": null,
          "description": "Author: Conspiracy of Cells of Fire\nTitle: Political Statement\nDate: 2011\nSource: <interarma.info/2011/12/02/politiki_dilwsi>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\n This statement is made to clarify and publicly state our position in relation to our recent attempted escape from prison. \n The fact that we are captives in the prison cells of democracy does not mean that we accept for a moment our position either as prisoners or as defendants before the civil court-martial that you have set up against us. There will never be either a prison guard to lock up our soul or a judge to rule on our values. We are eternal enemies of law and order and eternal prison breakers. \n Obviously these few following words cannot describe the miserable conditions inside penitentiaries that are experi…",
          "link": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-political-statement?v=1717960334",
          "publishedOn": "2024-06-09T19:12:14.000Z",
          "wordCount": 1104,
          "title": "Conspiracy of Cells of Fire - Political Statement",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6410",
            "url": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-political-statement.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-memory-is-our-weapon?v=1717958906",
          "author": null,
          "description": "Author: Conspiracy of Cells of Fire\nTitle: Memory is our Weapon\nDate: 2015\nNotes: Translated by Inter Arma.\nSource: <interarma.info/2015/05/19/ellada-i-mnimi-einai-to-oplo-mas-spf>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\n It was the dawn of May 22, 2009, when an explosion in Santiago, Chile caused fragments which crossed endless kilometers and borders until they brought us the news that were nailed in our hearts. \n It was the dawn of May 22, 2009 when our brother and comrade Mauricio Morales, consistent fighter of the anarchist insurrection, put his conspiratorial plan in place, heading to the school of prison guards in Santiago in order to blow it up. But fate played an ugly game that day. The bomb our brother was carrying exploded prematurely resulting in him falling dead, just …",
          "link": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-memory-is-our-weapon?v=1717958906",
          "publishedOn": "2024-06-09T18:48:26.000Z",
          "wordCount": 1164,
          "title": "Conspiracy of Cells of Fire - Memory is our Weapon",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6483",
            "url": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-memory-is-our-weapon.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-letter-regarding-the-new-investigations-by-prosecutors?v=1717958712",
          "author": null,
          "description": "Author: Conspiracy of Cells of Fire\nTitle: Letter regarding the new investigations by prosecutors\nDate: March 29, 2012\nSource: <actforfree.nostate.net/?p=8558>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\nI The choice of claiming responsibility and not capitulation\n We as Conspiracy of Cells of Fire-imprisoned members, chose and claimed responsibility from inside the prison for our participation in our project. The responsibility claim is the least way to defend and honour the most beautiful acts that we share. Not as a memory that fades away after our arrests but as a living reality and prospect of carrying on our actions in the continuous present, the here and now. \n We believe that the responsibility claim and the words we express through this contribute decisively to the intensific…",
          "link": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-letter-regarding-the-new-investigations-by-prosecutors?v=1717958712",
          "publishedOn": "2024-06-09T18:45:12.000Z",
          "wordCount": 2256,
          "title": "Conspiracy of Cells of Fire - Letter regarding the new investigations by prosecutors",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "11262",
            "url": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-letter-regarding-the-new-investigations-by-prosecutors.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-in-cold-blood?v=1717958555",
          "author": null,
          "description": "Author: Conspiracy of Cells of Fire\nTitle: In Cold Blood\nSubtitle: Concerning Gatherings, the Referendum and Complicit Democracy\nDate: August 2015\nNotes: Translated by Inter Arma\nSource: <interarma.info/2015/08/02/ellada-en-psixro-peri-sygkentoseon-dimopsifismatos-kai-sinenoxis-dimokratias-spf>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\nIt is sometimes useful to keep a distance from events before you talk about them. Anticipation and the frozen time of captivity in prison accelerate, nevertheless, the cool-headed distance from events. A self-possessed distance gives you the opportunity to observe details which are usually ignored and bulldozed by the warm blood conditions’ momentum of intensity. So, as they often say, “the devil is hidden in the details”…\nI. The rise before the fall …",
          "link": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-in-cold-blood?v=1717958555",
          "publishedOn": "2024-06-09T18:42:35.000Z",
          "wordCount": 5596,
          "title": "Conspiracy of Cells of Fire - In Cold Blood",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "21133",
            "url": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-in-cold-blood.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-fire-and-gunpowder?v=1717958445",
          "author": null,
          "description": "Author: Conspiracy of Cells of Fire\nTitle: Fire and Gunpowder\nSubtitle: From Indonesia to Chile… A proposition for FAI/IRF\nDate: December 4, 2011\nSource: <actforfree.nostate.net>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\n We hear the song of fire that comes from far away. The words smell of gunpowder. From the other side of the world rebellious comrades burn the nights and liberate places and moments. we can hear them… They conspire, plan, attack… We do not have to say anything else, we leave our brothers and sisters to speak for us. \n“We are all Conspiracy Cells of Fire. C.C.F. is not an organization or just a group. On the contrary it is a antagonistic expression of rage and contempt towards authority and its structures. To spread the C.C.F. all you need is gasoline, matches and t…",
          "link": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-fire-and-gunpowder?v=1717958445",
          "publishedOn": "2024-06-09T18:40:45.000Z",
          "wordCount": 4653,
          "title": "Conspiracy of Cells of Fire - Fire and Gunpowder",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "17164",
            "url": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-fire-and-gunpowder.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-either-with-anarchy-or-with-authority?v=1717958374",
          "author": null,
          "description": "Author: Conspiracy of Cells of Fire\nTitle: Either with Anarchy or with Authority\nDate: 2015\nNotes: Translated by Inter Arma.\nSource: <interarma.info/2015/03/27/ellada-i-me-tin-anarxia-i-me-tin-eksousia-spf>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\n It’s been already 25 days that the mother of Christos and Gerasimos Tsakalos and the girlfriend of the second one are locked up in the cells of democracy. \n We have already been for 25 days on hunger strike until death, demanding their immediate release. \n It’s been 25 days and already eight of us are in hospitals with their health condition on the limits. \n 25 days are not just a number on a calendar, it is the experiment of evolution of repression, with new methods of emotional blackmail against imprisoned anarchist urban guerrillas.\n …",
          "link": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-either-with-anarchy-or-with-authority?v=1717958374",
          "publishedOn": "2024-06-09T18:39:34.000Z",
          "wordCount": 1523,
          "title": "Conspiracy of Cells of Fire - Either with Anarchy or with Authority",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7507",
            "url": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-either-with-anarchy-or-with-authority.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-communization?v=1717958232",
          "author": null,
          "description": "Author: Conspiracy of Cells of Fire\nTitle: Communization\nSubtitle: The Senile Decay of Anarchy (or Re-Inventing Anarchy)\nDate: 2015\nNotes: Fragment of the unpublished pamphlet “FAI Reloaded” by the Conspiracy of Cells of Fire. Translated by Inter Arma.\nSource: <interarma.info/2015/06/01/ellada-kommounistikopoiisi-i-gerontiki-ania-tis-anarxias-spf>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\nI. Frozen Marxism\n Today’s era smells like engine oil, cheap labor sweat and naphthalene of the morality of voluntary obedience… We do not want to be defined by the culture of techno-industrial fascism, the white uniforms of scientists, the neckties of technocrats, the eager silences of ordinary people, the stupid smiles of consumers… We do not match with the aesthetics of the glass world of flat t…",
          "link": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-communization?v=1717958232",
          "publishedOn": "2024-06-09T18:37:12.000Z",
          "wordCount": 3902,
          "title": "Conspiracy of Cells of Fire - Communization",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "15534",
            "url": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-communization.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-communique-for-the-arrested-comrades?v=1717958118",
          "author": null,
          "description": "Author: Conspiracy of Cells of Fire\nTitle: Communique for the Arrested Comrades\nDate: 25/11/2010\nSource: <guerrillanews.wordpress.com/2010/12/25/communique-for-the-arrested-comrades-by-conspiracy-of-cells-of-fire>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\nDeclaration for the 1st November letter-bombing against European State targets by Conspiracy of Cells of Fire\n Currently our three brothers, three members of our group are incarcerated in the prisons of Greek democracy. Their absence from our side is not rectified through the text of a proclamation. The words seem hopelessly small and insignificant against the intensity of situations and emotions that we share with them. But even during these moments, when the walls and bars of the prison rise among us, nothing has changed… Gerasim…",
          "link": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-communique-for-the-arrested-comrades?v=1717958118",
          "publishedOn": "2024-06-09T18:35:18.000Z",
          "wordCount": 8429,
          "title": "Conspiracy of Cells of Fire - Communique for the Arrested Comrades",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "31146",
            "url": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-communique-for-the-arrested-comrades.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-better-to-be-a-demon-of-vengeance-than-an-angel-of-forgiveness?v=1717957988",
          "author": null,
          "description": "Author: Conspiracy of Cells of Fire\nTitle: Better to Be a Demon of Vengeance, Than an Angel of Forgiveness\nDate: 2015\nNotes: A signal of complicity from the Greek prisons, for the international call of solidarity made from Publicacion Refractario, Colectivo Lucha Revolucionaria (Revolutionary Struggle Collective) and Sin Banderas Ni Fronteras, to our brothers and sister Nataly Casanova, Juan Flores, Guillermo Durán and Enrique Guzmán, who are imprisoned in Chile, accused for attacks made by the International Conspiracy of Revenge and the Conspiracy of Cells of Fire, Chile. \n Translated by Inter Arma.\nSource: interarma.info/2015/05/05/ellada-kalytera-daimonas-ths-ekdikhshs-para-aggelos-ths-sygxwreshs-spf>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\n Nothing is uglier than ugliness repe…",
          "link": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-better-to-be-a-demon-of-vengeance-than-an-angel-of-forgiveness?v=1717957988",
          "publishedOn": "2024-06-09T18:33:08.000Z",
          "wordCount": 1247,
          "title": "Conspiracy of Cells of Fire - Better to Be a Demon of Vengeance, Than an Angel of Forgiveness",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7224",
            "url": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-better-to-be-a-demon-of-vengeance-than-an-angel-of-forgiveness.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-and-death-will-no-longer-have-any-power?v=1717957804",
          "author": null,
          "description": "Author: Conspiracy of Cells of Fire\nTitle: And death will no longer have any power\nSubtitle: Concerning the fire in the Marfin Bank\nDate: July 10, 2010\nSource: <actforfree.nostate.net/?p=2188>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\n In the incidents of the 5th May concerning the fire in the Marfin Bank there were three dead bank employees and thousands of “charred” truths. The suffocating atmosphere of the heartbreaking hypocrisy of propaganda and the worn moralistic humanism of the radical movement’s Cassandras, force us to take a public stand concerning these events. This does not mean that we are talking as “specialists” of violence, or that we are “self-appointed” prosecutors or defenders of the people who attacked the bank building. But we find it necessary that some things …",
          "link": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-and-death-will-no-longer-have-any-power?v=1717957804",
          "publishedOn": "2024-06-09T18:30:04.000Z",
          "wordCount": 3855,
          "title": "Conspiracy of Cells of Fire - And death will no longer have any power",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "18229",
            "url": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-and-death-will-no-longer-have-any-power.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-amongst-two-worlds?v=1717957605",
          "author": null,
          "description": "Author: Conspiracy of Cells of Fire\nTitle: Amongst Two Worlds\nSubtitle: International Call of Action for the Hunger Strike of the Conspiracy of Cells of Fire Until Death\nDate: 2015\nNotes: Translated by Inter Arma\nSource: <interarma.info/2015/03/29/ellada-anamesa-se-2-kosmous-diethnes-kalesma-drasis-apo-spf>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\n The moment the following words were written, we’re on the 25th day of hunger strike, for the liberation of Christos and Gerasimos Tsakalos’ mother, as well as the second one’s girlfriend. \n The pre-trial detention of our two comrades’ relatives was an act of revenge by the judicial power against us, in retaliation for the escape we had prepared, with the bombing of the prison. \n Now, reaching a tipping point between life and death, we wa…",
          "link": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-amongst-two-worlds?v=1717957605",
          "publishedOn": "2024-06-09T18:26:45.000Z",
          "wordCount": 1321,
          "title": "Conspiracy of Cells of Fire - Amongst Two Worlds",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6973",
            "url": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-amongst-two-worlds.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-about-the-attacks-against-state-and-capital?v=1717957404",
          "author": null,
          "description": "Author: Conspiracy of Cells of Fire\nTitle: About the attacks against State and Capital\nDate: 9 November 2009\nSource: <sysiphus-angrynewsfromaroundtheworld.blogspot.com/2009/11/about-attacks-against-state-and-capital.html>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\n A huge storm of revolt raged through the streets of Greece in December 2008. After the young Andreas Grigoropoulos was murdered by a cop, riots spread throughout the whole country for several weeks. Hundreds of banks, shops, car dealers, offices,… were attacked, plundered and put on fire. Although it were anarchists and anti-authoritarians who took the lead in this storm during the first week after the murder, it spread itself fast and many people got involved in this revolt against miserable living conditions, against the…",
          "link": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-about-the-attacks-against-state-and-capital?v=1717957404",
          "publishedOn": "2024-06-09T18:23:24.000Z",
          "wordCount": 3824,
          "title": "Conspiracy of Cells of Fire - About the attacks against State and Capital",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "12818",
            "url": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-about-the-attacks-against-state-and-capital.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-a-small-contribution-about-solidarity?v=1717957177",
          "author": null,
          "description": "Author: Conspiracy of Cells of Fire\nTitle: A small contribution about Solidarity\nDate: May 4, 2011\nSource: <actforfree.nostate.net/?p=4500>. Retrieved on 09/06/2024 from lib.anarhija.net.\n\nUntil the day comes we will remain with the head held high....\n1. Solidarity is our weapon\n Many things have been written and said about solidarity. Usually when there have been so many discussions and so many texts have circulated on a matter, it ends up trite, predictable and without any particular interest. It seems as if its content has run out and it’s constantly being repeated. \n We believe there are no trite practices, but trite ways of thinking. Particularly today, in the suspicious days we are living in, with the dozens of imprisoned urban guerrillas and anarchists, we should sharpen the blade o…",
          "link": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-a-small-contribution-about-solidarity?v=1717957177",
          "publishedOn": "2024-06-09T18:19:37.000Z",
          "wordCount": 2584,
          "title": "Conspiracy of Cells of Fire - A small contribution about Solidarity",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "13371",
            "url": "https://theanarchistlibrary.org/library/conspiracy-of-cells-of-fire-a-small-contribution-about-solidarity.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/black-rose-anarchist-federation-turning-the-tide?v=1717936810",
          "author": null,
          "description": "Author: Black Rose Anarchist Federation\nTitle: Turning the Tide\nSubtitle: An Anarchist Program for Popular Power\nDate: May 1, 2023\nNotes: Written and approved by the membership of Black Rose / Rosa Negra. First edition released May 1, 2023, available at blackrosefed.org. Cover illustration by Dinelli: dinelliarte.com.\nSource: Retrieved on 2023-05-23 from blackrosefed.org/wp-content/uploads/2023/04/brrn-program-2023.pdf\n\nGeneral Introduction\n This is the political program of our organization, Black Rose Anarchist Federation / Federación Anarquista Rosa Negra (BRRN). The writings it contains are the result of nearly two years of collective analysis, discussion, and debate. The content of the program is divided into three parts: sections that detail our understanding of the social, political,…",
          "link": "https://theanarchistlibrary.org/library/black-rose-anarchist-federation-turning-the-tide?v=1717936810",
          "publishedOn": "2024-06-09T12:40:10.000Z",
          "wordCount": 23540,
          "title": "Black Rose Anarchist Federation - Turning the Tide",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "823656",
            "url": "https://theanarchistlibrary.org/library/black-rose-anarchist-federation-turning-the-tide.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/uploads/en/thumbnails/b-r-black-rose-anarchist-federation-turning-the-ti-2.png.large.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/john-creaghe-the-argentine-republic-and-english-radical-reformers?v=1717513259",
          "author": null,
          "description": "Author: John Creaghe\nTitle: The Argentine Republic and English Radical Reformers\nDate: January 1890\nNotes: Original Title: 'The Argentine Republic and English Radical Reformers' in Commonweal Bibliography Creaghe, John, 'The Argentine Republic and English Radical Reformers' in Commonweal, Vol. 6, No. 208, (London, 1890), pg. 2-3 Creaghe, John, 'The Argentine Republic and English Radical Reformers' in Commonweal, Vol. 6, No. 209, (London, 1890), pg. 10 Creaghe, John, 'The Argentine Republic and English Radical Reformers' in Commonweal, Vol. 6, No. 210, (London, 1890), pg. 20-21\nSource: Retreived on 4 June 2024 from https://www.marxists.org/history/international/social-democracy/commonweal/1890/index.htm\n\nThe writer of the following pages, having lived for many years in the Argentine Republi…",
          "link": "https://theanarchistlibrary.org/library/john-creaghe-the-argentine-republic-and-english-radical-reformers?v=1717513259",
          "publishedOn": "2024-06-04T15:00:59.000Z",
          "wordCount": 5484,
          "title": "John Creaghe - The Argentine Republic and English Radical Reformers",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "15832",
            "url": "https://theanarchistlibrary.org/library/john-creaghe-the-argentine-republic-and-english-radical-reformers.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}