{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "4fb73ba1739dd770b73cc79b69696086e450955f",
          "author": "Esra Kayabali",
          "description": "With the arrival of September, AWS re:Invent 2024 is now 3 months away and I am very excited for the new upcoming services and announcements at the conference. I remember attending re:Invent 2019, just before the COVID-19 pandemic. It was the biggest in-person re:Invent with 60,000+ attendees and it was my second one. It was […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-aws-parallel-computing-service-amazon-ec2-status-checks-and-more-september-2-2024/",
          "publishedOn": "2024-09-02T17:42:42.000Z",
          "wordCount": 2152,
          "title": "AWS Weekly Roundup: AWS Parallel Computing Service, Amazon EC2 status checks, and more (September 2, 2024)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/09/02/AWS-WIR-default-AWSNEWS-2068.png"
        },
        {
          "id": "a5b458691b849a5cf02d12c1cf9dca72099fe15e",
          "author": "Channy Yun (윤석찬)",
          "description": "With AWS Parallel Computing Service, run HPC workloads at virtually any scale effortlessly; leverage Slurm and managed clusters to accelerate simulations.",
          "link": "https://aws.amazon.com/blogs/aws/announcing-aws-parallel-computing-service-to-run-hpc-workloads-at-virtually-any-scale/",
          "publishedOn": "2024-08-28T17:53:59.000Z",
          "wordCount": 2348,
          "title": "Announcing AWS Parallel Computing Service to run HPC workloads at virtually any scale",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/08/26/PCS-feat-img2.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": []
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps & Developer Productivity Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": []
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/ac15cada49ef",
          "author": "Netflix Technology Blog",
          "description": "By Jiangwei Pan, Gary Tang, Henry Wang, and Justin Basilico",
          "link": "https://netflixtechblog.com/recommending-for-long-term-member-satisfaction-at-netflix-ac15cada49ef?source=rss----2615bd06b42e---4",
          "publishedOn": "2024-08-29T01:01:40.000Z",
          "wordCount": 3844,
          "title": "Recommending for Long-Term Member Satisfaction at Netflix",
          "imageUrl": "https://miro.medium.com/v2/resize:fit:1200/1*Y8QDcyallv_mh7ylPzXqkA.png"
        }
      ]
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": [
        {
          "id": "https://engineering.atspotify.com/?p=7186",
          "author": "Spotify Engineering",
          "description": "We have a lot of dashboards at Spotify. Our Insight teams and analysts from across the company are constantly whipping [...]\nThe post Unlocking Insights with High-Quality Dashboards at Scale appeared first on Spotify Engineering.",
          "link": "https://engineering.atspotify.com/2024/08/unlocking-insights-with-high-quality-dashboards-at-scale/",
          "publishedOn": "2024-08-28T19:29:39.000Z",
          "wordCount": 2020,
          "title": "Unlocking Insights with High-Quality Dashboards at Scale",
          "imageUrl": "https://storage.googleapis.com/production-eng/1/2024/08/EN221-1200-x-630-black.png"
        }
      ]
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "ed82f2e2617bb8ba0abe2dbd4214f8982ac7d851",
          "author": "Elamaran Shanmugam",
          "description": "Kubernetes has become the de-facto standard for container orchestration, providing powerful capabilities for deploying and managing stateless workloads. However, users running stateful applications on Kubernetes face unique challenges, especially in VMware environments. A key issue is that the virtual disks used by stateful apps can’t be attached to pods as easily as ephemeral storage. The […]",
          "link": "https://aws.amazon.com/blogs/containers/using-gitops-for-stateful-workload-management-with-vsphere-csi-driver-on-on-premises-kubernetes-2/",
          "publishedOn": "2024-08-28T22:37:57.000Z",
          "wordCount": 3221,
          "title": "Using GitOps for Stateful Workload Management with vSphere CSI driver on on-premises Kubernetes",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/08/14/Featured-images-for-Containers-Blog-4-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=332264",
          "author": "Melvin Goodman",
          "description": "The Biden administration’s decision to continue funding the notorious Netzah Yehuda battalion, an ultra-Orthodox unit that operates on the West Bank, is the latest indication that the United States is unwilling to take any steps to counter Israel’s genocidal campaign against the Palestinians.  The funding of the battalion marks a major defeat for the human  More\nThe post Israeli Treatment of Palestinians Remains Unchanged Over 75 Years appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/03/israeli-treatment-of-palestinians-remains-unchanged-over-75-years/",
          "publishedOn": "2024-09-03T06:02:07.000Z",
          "wordCount": null,
          "title": "Israeli Treatment of Palestinians Remains Unchanged Over 75 Years",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332284",
          "author": "Sam Pizzigati",
          "description": "Over 3,000 migrants fleeing from poverty and conflict, the Council on Foreign Relations recently noted, died last year trying to cross the Mediterranean into Europe. Those deaths made barely a ripple in most of the world’s major news media. But this summer one single tragedy on the Mediterranean has been making globs of global headlines. More\nThe post On Our Climate-Challenged Planet, Only Some Deaths Seem to Matter appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/03/on-our-climate-challenged-planet-only-some-deaths-seem-to-matter/",
          "publishedOn": "2024-09-03T05:59:43.000Z",
          "wordCount": null,
          "title": "On Our Climate-Challenged Planet, Only Some Deaths Seem to Matter",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332438",
          "author": "Robert Jensen",
          "description": "Many political and military battles have been sparked by fundamentalism, whether religious, national, or economic. Those fundamentalisms remain strong across the world, requiring vigilance from those who embrace political pluralism and celebrate human diversity. But one other fundamentalism today, common on the left and right, is even more dangerous: technological fundamentalism. While those other forces  More\nThe post Ironic and Tragic: Technological Fundamentalism and Our Fear of Limits appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/03/ironic-and-tragic-technological-fundamentalism-and-our-fear-of-limits/",
          "publishedOn": "2024-09-03T05:56:44.000Z",
          "wordCount": null,
          "title": "Ironic and Tragic: Technological Fundamentalism and Our Fear of Limits",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332495",
          "author": "Binoy Kampmark",
          "description": "Despite much grandstanding in the Biden administration about halting specific arms shipments to Israel over feigned concerns about how they might be used (inflicting death is the expected form), US military supplies have been restored with barely a murmur.  In a report in Haaretz on August 29, a rush of weapons to Israel has been noticed since the end of  More\nThe post A Return to Form: Expediting US Arms to Israel appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/03/a-return-to-form-expediting-us-arms-to-israel/",
          "publishedOn": "2024-09-03T05:55:19.000Z",
          "wordCount": null,
          "title": "A Return to Form: Expediting US Arms to Israel",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332492",
          "author": "Thomas Knapp",
          "description": "“In Florida,” former and possibly future US president Donald Trump writes on Truth Social, “like so many other States that have already given their approval, personal amounts of marijuana will be legalized for adults with Amendment 3. Whether people like it or not, this will happen through the approval of the Voters, so it should  More\nThe post Marijuana: Your Permission Isn’t Really Necessary appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/03/marijuana-your-permission-isnt-really-necessary/",
          "publishedOn": "2024-09-03T05:55:12.000Z",
          "wordCount": null,
          "title": "Marijuana: Your Permission Isn’t Really Necessary",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332496",
          "author": "Elaine Siu",
          "description": "Next-generation (“next-gen”) materials are innovative alternatives to traditional petrochemical and animal-based materials like leather, silk, down, fur, wool, and exotic skins. They aim to replace animal-based materials and significantly reduce environmental impacts and animal welfare concerns. Next-gen materials replicate the performance of their animal-based counterparts by using biomimicry approaches while being more sustainable. The Six  More\nThe post How Sustainable Next-Gen Materials Can Create a More Ethical Consumer Market appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/03/how-sustainable-next-gen-materials-can-create-a-more-ethical-consumer-market/",
          "publishedOn": "2024-09-03T05:55:05.000Z",
          "wordCount": null,
          "title": "How Sustainable Next-Gen Materials Can Create a More Ethical Consumer Market",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332526",
          "author": "Katie Bilodeau",
          "description": "The 1964 Wilderness Act celebrates its 60th anniversary on September 3rd. Diamonds are a gift for a 60th wedding anniversary and presumably represent strength, but from a humanitarian lens diamonds have evolved to represent consumption and exploitation. This duality resonates with the 1964 Wilderness Act’s diamond anniversary and provides an opportunity to reflect on where  More\nThe post Please, No Diamonds for the Wilderness Act’s 60th Anniversary appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/03/please-no-diamonds-for-the-wilderness-acts-60th-anniversary/",
          "publishedOn": "2024-09-03T05:50:41.000Z",
          "wordCount": null,
          "title": "Please, No Diamonds for the Wilderness Act’s 60th Anniversary",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332440",
          "author": "Winslow Myers",
          "description": "A generation ago South Africa looked into twin abysses: becoming a nuclear weapons state, and race war. Looking into the heart of darkness that lay at the bottom of these separate abysses, they chose the common sense route of dismantling their nuclear weapons. Under the visionary leadership of Nelson Mandela, they also dismantled apartheid. This  More\nThe post The Great Crossing: From Competition to “Coöperatism” appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/03/the-great-crossing-from-competition-to-cooperatism/",
          "publishedOn": "2024-09-03T05:49:57.000Z",
          "wordCount": null,
          "title": "The Great Crossing: From Competition to “Coöperatism”",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332353",
          "author": "George J Annas",
          "description": "The dock of defendants seated during the Doctors Trial at Nuremberg. United States Holocaust Memorial Museum via Wikimedia Commons After World War II, Nuremberg, Germany, was the site of trials of Nazi officials charged with war crimes and crimes against humanity. The Nuremberg trials were landmarks in the development of international law. But one of  More\nThe post Medical Ethics and the Nuremberg Code appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/03/medical-ethics-and-the-nuremberg-code/",
          "publishedOn": "2024-09-03T05:44:29.000Z",
          "wordCount": null,
          "title": "Medical Ethics and the Nuremberg Code",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331835",
          "author": "George Wuerthner",
          "description": "In the 1930s, Bob Marshall (for whom the Montana wilderness is named) started the Wilderness Society. Marshall declared at the organization’s founding: “We do not want those whose first impulse is to compromise. We want no straddlers, for, in the past, they have surrendered too much good wilderness and primeval areas which should never have  More\nThe post We Can’t Compromise When It Comes to Preserving Wilderness appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/03/we-cant-compromise-when-it-comes-to-preserving-wilderness/",
          "publishedOn": "2024-09-03T05:40:19.000Z",
          "wordCount": null,
          "title": "We Can’t Compromise When It Comes to Preserving Wilderness",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332236",
          "author": "Spencer Osberg",
          "description": "The impact of losing access to healthcare is starkly illustrated by the example of pregnant women in Gaza, estimated at 50,000 when the war began. Many have miscarried and are having stillbirths, faced C-sections with unsensitized equipment and without anesthetic, while increasing numbers of newborns are “simply dying,” according to the World Health Organization, because starving mothers are giving birth to critically underweight babies. More\nThe post Beyond Bombs and Bullets: The Full Tally of Gaza’s Dead appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/02/beyond-bombs-and-bullets-the-full-tally-of-gazas-dead/",
          "publishedOn": "2024-09-02T06:00:42.000Z",
          "wordCount": null,
          "title": "Beyond Bombs and Bullets: The Full Tally of Gaza’s Dead",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332231",
          "author": "Frank Joyce",
          "description": "Currently, the President sending the limitless money and weapons happens to be a Democrat.  Lest anyone forget the Republican’s loyalty to the cause, however, the “sane” presidential aspirant, Nikki Haley thought it was a great idea to be photographed autographing the U.S. manufactured and supplied bombs before they were loaded on the U.S. made warplanes.  More\nThe post Chicago Post Mortem 2024: How This Time Can be Different appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/02/chicago-post-mortem-2024-how-this-time-can-be-different/",
          "publishedOn": "2024-09-02T06:00:28.000Z",
          "wordCount": null,
          "title": "Chicago Post Mortem 2024: How This Time Can be Different",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332367",
          "author": "Zoltan Grossman",
          "description": "On a recent trip to Germany, I sought to better understand how the Nazi Party rose to power, and carried out the Holocaust, in which most of my Hungarian Jewish relatives perished. I gained some new insights, and learned several lessons that may be useful in the polarized United States today, with the election looming and far-right agitation growing.\nMore\nThe post Lessons of Kristallnacht, “Civil War,” and Mass Deportation appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/02/lessons-of-kristallnacht-civil-war-and-mass-deportation/",
          "publishedOn": "2024-09-02T05:58:35.000Z",
          "wordCount": null,
          "title": "Lessons of Kristallnacht, “Civil War,” and Mass Deportation",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332413",
          "author": "Freddie Clayton and Sonja Smith",
          "description": "From the outskirts of cities to the most rural parts of the country, more than 1 million Namibians lack adequate access to toilets, and they are often faced with only one option: open defecation. According to the World Health Organization and UNICEF’s Joint Monitoring Program (JMP) 2020 data, Namibia ranked sixth for the highest rate of open  More\nThe post Sanitation in Namibia Is a Catastrophe for Its People and Environment appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/02/sanitation-in-namibia-is-a-catastrophe-for-its-people-and-environment/",
          "publishedOn": "2024-09-02T05:55:38.000Z",
          "wordCount": null,
          "title": "Sanitation in Namibia Is a Catastrophe for Its People and Environment",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332415",
          "author": "Binoy Kampmark",
          "description": "The tiltrotor V-22 Osprey has a plagued, bloodied history.  But blighted as it is, the aircraft remains a cherished feature of the US Marines, regarded as vital in supporting combat assault, logistics and transport, not to mention playing a role in search-and-rescue missions and delivering equipment for the Navy carrier air wings. In March this year,  More\nThe post Protecting the Widow Maker: The US Marines Exonerate the Osprey appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/02/protecting-the-widow-maker-the-us-marines-exonerate-the-osprey/",
          "publishedOn": "2024-09-02T05:55:08.000Z",
          "wordCount": null,
          "title": "Protecting the Widow Maker: The US Marines Exonerate the Osprey",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332405",
          "author": "Andie Stewart",
          "description": "Imane Khelif: Working Class Muslim Hero For the millionth time: Imane Khelif is not a trans woman. She is AFAB, has female body parts from birth, all the essentialist markers that transphobes use to justify their bigotry. This truly is an instance of horse-shoe theory at its best. Transphobes start off by laying down these  More\nThe post Lost in Translation: Radical Politics of a Trans Trade Unionist appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/02/lost-in-translation-radical-politics-of-a-trans-trade-unionist/",
          "publishedOn": "2024-09-02T05:46:46.000Z",
          "wordCount": null,
          "title": "Lost in Translation: Radical Politics of a Trans Trade Unionist",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332363",
          "author": "George Ochenski",
          "description": "Somewhere, the industry lobbyists who successfully introduced “collaboration” to the arena of conservation policies and politics are toasting their success at splitting the conservation community.  The proof is playing out right now over the collaborators’ Gallatin Conservation and Recreation Act — which is meeting significant opposition from long-time wilderness advocates. This is nothing Montanans haven’t  More\nThe post Collaborators on the Ropes as Wilderness Advocates Fight Back appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/02/collaborators-on-the-ropes-as-wilderness-advocates-fight-back/",
          "publishedOn": "2024-09-02T05:46:38.000Z",
          "wordCount": null,
          "title": "Collaborators on the Ropes as Wilderness Advocates Fight Back",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332403",
          "author": "Mel Gurtov",
          "description": "“Blood on His Hands” “After close to a year of neglect, Netanyahu doesn’t miss a single opportunity to ensure that there won’t be a deal. Not a day goes by in which Netanyahu doesn’t take concrete action to jeopardize the return home of all the hostages.” Those are the outraged words of the Hostages and  More\nThe post Cease-fire Agreements in the Middle East Seem More Remote than Ever appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/02/cease-fire-agreements-in-the-middle-east-seem-more-remote-than-ever/",
          "publishedOn": "2024-09-02T05:43:13.000Z",
          "wordCount": null,
          "title": "Cease-fire Agreements in the Middle East Seem More Remote than Ever",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332232",
          "author": "Sarah Anderson",
          "description": "The Lowe’s home improvement store spent $43 billion on stock buybacks over the past five years. With that sum, the big box chain could’ve given each of its 285,000 employees a $30,000 bonus every year between 2019 and 2023. The extra cash would’ve meant a lot to Lowe’s workers — half of whom make less  More\nThe post The Low-Wage Corporations That Blew Half a Trillion Dollars to Inflate CEO Pay appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/02/the-low-wage-corporations-that-blew-half-a-trillion-dollars-to-inflate-ceo-pay/",
          "publishedOn": "2024-09-02T05:37:06.000Z",
          "wordCount": null,
          "title": "The Low-Wage Corporations That Blew Half a Trillion Dollars to Inflate CEO Pay",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332464",
          "author": "Bernie Sanders",
          "description": "As we celebrate Labor Day, 2024, there is some very good news. Public approval of labor unions, at 70%, is higher today than it has been in decades. Over the last year major unions like the UAW have won some highly publicized strikes, while many other unions have negotiated trail-blazing contracts for their members. Young  More\nThe post The State of American Labor on Labor Day appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/02/the-state-of-american-labor-on-labor-day/",
          "publishedOn": "2024-09-02T05:30:22.000Z",
          "wordCount": null,
          "title": "The State of American Labor on Labor Day",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332407",
          "author": "Wim Laven",
          "description": "Perhaps you’ve heard the term “teachable moment” in recent years. It is a way of framing or reframing a mistake or misfortune into a learning opportunity or chance for growth. I have had “teachable moments” unfold when text message alerts have hit multiple mobile phones in a classroom at the same time: “Warning! Active shooter  More\nThe post Dirty Deleting, a Lack of Accountability, and Next Steps appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/02/dirty-deleting-a-lack-of-accountability-and-next-steps/",
          "publishedOn": "2024-09-02T04:54:05.000Z",
          "wordCount": null,
          "title": "Dirty Deleting, a Lack of Accountability, and Next Steps",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332027",
          "author": "Rebecca Maria Goldschmidt",
          "description": "As students worldwide head back to school this fall, in Gaza, there are no schools left. The U.N. considers the systemic obliteration of the education system by the Israeli military to be a “scholasticide” — all universities, over 80% of schools, the Central Archives of Gaza, and at least 13 libraries have been destroyed, as of April 2024, in Israel’s relentless bombing campaign. Almost 10,000 students are dead and 16,000 wounded, many killed in attacks on schools being used as sites of refuge.\nAcademics and university administrators in Gaza released an open letter asking for solidarity and resistance from the rest of the world: “We call upon our colleagues in the homeland and internationally to support our steadfast attempts to defend and preserve our universities for the sake of the future of our people, and our ability to remain on our Palestinian land in Gaza. We built these universities from tents. And from tents, with the support of our friends, we will rebuild them once again.”\nAs a graduate student, an aspiring professor, and the child of a Jewish academic, I take this call for solidarity seriously. Where and how do we learn ideologies of resistance, radicalism, and revolution? Once we have inherited a radical idea, what do we do with it? And how do we choose what ideas not to inherit?\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Revolutionary Inheritance appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/01/revolutionary-inheritance/",
          "publishedOn": "2024-09-01T06:11:07.000Z",
          "wordCount": null,
          "title": "Revolutionary Inheritance",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=331759",
          "author": "Scott Remer",
          "description": "Image by Pau Casals.\nThese days, I find myself in a strange place. Despite the Democrats’ miraculous replacement of Biden, Trump’s reelection remains distinctly possible. I studied authoritarianism for my master’s degree, and I strongly believe that a second Trump presidency would represent the end of American democracy. Yet even so, I find myself frequently tempted to dismiss commentators’ pleas as hyperbolic handwringing. I think I’m probably not alone in this confusing toggling between panic and blaséness. After some soul-searching, I think one of the reasons for the ever-present allure of complacency, other than the natural human tendency towards denial, is Trump’s humor.\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Clowns Can Be Killers, Too appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/01/clowns-can-be-killers-too/",
          "publishedOn": "2024-09-01T05:56:54.000Z",
          "wordCount": null,
          "title": "Clowns Can Be Killers, Too",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332199",
          "author": "Jeffrey St. Clair",
          "description": "“It’s hard not to feel invisible as a Palestinian-American. Our trauma and pain feel unseen and ignored by both parties. One party uses our identity as a slur, and the other refuses to hear from us.” – Rep. Rashida Tlaib Israel drew all sorts of US military forces and intelligence assets into the Middle East […]\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post A Whiter Shade of Genocide appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/31/a-whiter-shade-of-genocide/",
          "publishedOn": "2024-08-31T13:12:32.000Z",
          "wordCount": null,
          "title": "A Whiter Shade of Genocide",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332068",
          "author": "Melvin Goodman",
          "description": "There is no greater strategic madness than the belief that nuclear superiority must be maintained at each rung of the nuclear ladder in order to maintain deterrence.  U.S. weapons technology was a major driver of escalation dominance throughout the 1950s and 1960s along with the belief that the Soviet Union would move to a level of nuclear conflict that the United States could not counter.  “Dr. Strangelove or How I Stopped Worrying and Learned to Love the Bomb” parodied these fears, and the arms control and disarmament developments of the 1970s and 1980s helped to defuse them.  Sadly, the Biden administration has taken a step that suggests a return to escalation dominance, which will spiral a Pentagon budget that will soon reach $1 trillion per year. More\nThe post A Looming Nuclear Catastrophe appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/30/a-looming-nuclear-catastrophe-2/",
          "publishedOn": "2024-08-30T06:02:37.000Z",
          "wordCount": null,
          "title": "A Looming Nuclear Catastrophe",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332169",
          "author": "Gary Fields",
          "description": "Since 2007, when the State of Israel implemented its still-ongoing blockade of Gaza, several different monikers have emerged to describe the conditions for Palestinians living in the territory under the ongoing Israeli siege.  Now, after 11 months of the murderous Israeli assault on the people of Gaza, it is necessary once again to revise what the State of Israel has imposed on the territory.  What the state of Israel has created in the Gaza Strip is nothing less than a death camp akin to what the Nazis created for the massacre of Jews and other so-called enemies of the Reich. More\nThe post Death Camp appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/30/death-camp/",
          "publishedOn": "2024-08-30T06:01:49.000Z",
          "wordCount": null,
          "title": "Death Camp",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332089",
          "author": "Sonali Kolhatkar",
          "description": "As he runs for reelection in 2024, former president Donald Trump has made the outlandish claim that “millions of people [have crossed the United States border] …from prisons, jails and mental institutions to come into our country and destroy our country.” His statement was a combination of two tropes that are often deployed by those seeking political  More\nThe post Election Years Are Dangerous Times for People of Color appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/30/election-years-are-dangerous-times-for-people-of-color/",
          "publishedOn": "2024-08-30T06:01:32.000Z",
          "wordCount": null,
          "title": "Election Years Are Dangerous Times for People of Color",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332066",
          "author": "Jeffrey St. Clair",
          "description": "True to form, Trump has now taken to calling Kamala Harris “low IQ” and “stupid,” racist tropes he draws on whenever he’s confronted by minorities, women or both. But for all her faults, Harris isn’t stupid. In fact, she’s demonstrated her ability to swiftly master and deftly deploy the finer points of Clintonian triangulation, the strategy of political bait-and-switch that prioritizes running against the core issues held by her own party, even policies she once enthusiastically promoted as signature features of her own previous campaigns. Pulling this off required some pretty adroit political gymnastics, where Harris had to completely reverse herself without showing the strain over long-held positions on fracking, immigration, asylum, a human rights-based foreign policy, student loan forgiveness, torture, the death penalty, and a single-payer health care system. But she sold these policy retreats so smoothly that the Democratic base eagerly embraced her joyful politics of austerity, aggressive policing and genocide with a smile. More\nThe post Roaming Charges: Genocide With a Smile appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/30/roaming-charges-genocide-with-a-smile/",
          "publishedOn": "2024-08-30T05:59:50.000Z",
          "wordCount": null,
          "title": "Roaming Charges: Genocide With a Smile",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332094",
          "author": "Mandy Medley",
          "description": "The following speech was given at Union Park at the March on the DNC on Monday, August 19th. Chicago for Abortion Rights is out here today because we REFUSE to allow the Democrats to use abortion rights and trans rights as a bargaining chip to force us to vote for their imperialist agenda. We refuse the  More\nThe post No Reproductive Justice Without Palestinian Liberation appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/30/no-reproductive-justice-without-palestinian-liberation/",
          "publishedOn": "2024-08-30T05:58:39.000Z",
          "wordCount": null,
          "title": "No Reproductive Justice Without Palestinian Liberation",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=332156",
          "author": "Tony McKenna",
          "description": "I was at university when I first heard the Doors.  It was springtime, coming on summer.  I was living on campus, my first year, and I was eighteen.  I was in a housemate’s room, waiting for him to get back for some reason I don’t recall now.  The building we lived in was a little  More\nThe post Break on Through: Finding The Doors appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/08/30/break-on-through-finding-the-doors/",
          "publishedOn": "2024-08-30T05:57:03.000Z",
          "wordCount": null,
          "title": "Break on Through: Finding The Doors",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": [
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=31528",
          "author": "Marco Del Negro",
          "description": "The post-COVID years have not been kind to professional forecasters, whether from the private sector or policy institutions: their forecast errors for both output growth and inflation have increased dramatically relative to pre-COVID (see Figure 1 in this paper). In this two-post series we ask: First, are forecasters aware of their own fallibility? That is, when they provide measures of the uncertainty around their forecasts, are such measures on average in line with the size of the prediction errors they make? Second, can forecasters predict uncertain times? That is, does their own assessment of uncertainty change on par with changes in their forecasting ability? As we will see, the answer to both questions sheds light of whether forecasters are rational. And the answer to both questions is “no” for horizons longer than one year but is perhaps surprisingly “yes” for shorter-run forecasts.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/09/are-professional-forecasters-overconfident/",
          "publishedOn": "2024-09-03T11:00:00.000Z",
          "wordCount": 4672,
          "title": "Are Professional Forecasters Overconfident?",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/08/LSE_2024_overconfidence_delnegro_460.jpg"
        }
      ]
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45582",
          "author": "deanbaker1",
          "description": "from Dean Baker In the last-half century, productivity has outpaced the growth of real compensation for the median worker by more than 40 percent. This means that if workers’ pay had kept pace with productivity, as it did in the three decades after World War II, it would be roughly 40 percent higher than it is today. […]",
          "link": "https://rwer.wordpress.com/2024/09/03/diverting-class-warfare-into-generational-warfare/",
          "publishedOn": "2024-09-03T15:13:46.000Z",
          "wordCount": 4317,
          "title": "Diverting class warfare into generational warfare",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45579",
          "author": "Lars Syll",
          "description": "from Lars Syll According to Keynes, financial crises are a recurring feature of our economy and are linked to its fundamental financial instability: It is of the nature of organised investment markets, under the influence of purchasers largely ignorant of what they are buying and of speculators who are more concerned with forecasting the next […]",
          "link": "https://rwer.wordpress.com/2024/08/30/casino-capitalism/",
          "publishedOn": "2024-08-30T10:40:58.000Z",
          "wordCount": 4887,
          "title": "Casino capitalism",
          "imageUrl": "https://i0.wp.com/static.guim.co.uk/sys-images/Guardian/Pix/pictures/2009/8/3/1249340331099/04.08.09-Martin-Rowson-on-005.jpg"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=277832",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics; The Democrat debate; Kamala's staff; McDonalds store bans masks; Florida real estate ~",
          "link": "https://www.nakedcapitalism.com/2024/09/200pm-water-cooler-9-3-2024.html",
          "publishedOn": "2024-09-03T18:00:12.000Z",
          "wordCount": 7151,
          "title": "2:00PM Water Cooler 9/3/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/rcp_2024-08-30.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277821",
          "author": "Yves Smith",
          "description": "Gee, even super-rich kids have trouble deciding what they want to be when they grow up.",
          "link": "https://www.nakedcapitalism.com/2024/09/who-are-the-global-super-rich-of-tomorrow-we-interviewed-teens-at-one-of-the-worlds-most-expensive-schools-to-find-out.html",
          "publishedOn": "2024-09-03T13:55:26.000Z",
          "wordCount": 3548,
          "title": "Who Are the Global Super-Rich of Tomorrow? We Interviewed Teens at One of the World’s Most Expensive Schools to Find Out",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277770",
          "author": "Yves Smith",
          "description": "Our finnicky daily links: NZ tourist charges, high Covid rates in US, carbon scheme costs, China econ worries, Maduro plane seized, German freakout over AfD success, Israel strikes over hostages, Russian advances, Turkiye to join BRICS? scurvy in US? Kamala ducks questions, campuses v. protestors, high housing costs",
          "link": "https://www.nakedcapitalism.com/2024/09/links-9-3-2024.html",
          "publishedOn": "2024-09-03T10:55:22.000Z",
          "wordCount": 14870,
          "title": "Links 9/3/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-03-at-3.58.19-PM.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277776",
          "author": "Nick Corbishley",
          "description": "\"China firmly supports the just position of Latin American countries on opposing foreign interference and safeguarding their nations’ sovereignty.\"",
          "link": "https://www.nakedcapitalism.com/2024/09/in-rare-intervention-china-urges-us-to-give-up-monroe-doctrine.html",
          "publishedOn": "2024-09-03T10:45:59.000Z",
          "wordCount": 5832,
          "title": "China Urges US to Give Up Monroe Doctrine, As Washington Intensifies Its Meddling in Latin America",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277819",
          "author": "Yves Smith",
          "description": "The Skunk Party Manifesto explained how the best political system money can buy is great for its customers and lousy  for the rest of us",
          "link": "https://www.nakedcapitalism.com/2024/09/naked-capitalisms-skunk-party-manifesto-finds-a-home-in-the-new-kentucky-party.html",
          "publishedOn": "2024-09-03T10:00:19.000Z",
          "wordCount": 9577,
          "title": "Naked Capitalism’s  Skunk Party Manifesto Finds a Home in the New Kentucky Party",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277817",
          "author": "Yves Smith",
          "description": "A reminder that it would not be hard to \"save\" and even expand Social Security, save the reluctance to tax the rich a smidge more.",
          "link": "https://www.nakedcapitalism.com/2024/09/this-labor-day-working-families-earned-social-security-benefits-are-at-risk.html",
          "publishedOn": "2024-09-03T09:56:55.000Z",
          "wordCount": 3766,
          "title": "This Labor Day, Working Families’ Earned Social Security Benefits Are at Risk",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277767",
          "author": "Lambert Strether",
          "description": "UAW President Shawn Fain's call for a general strike: Background, critique, and possibilities",
          "link": "https://www.nakedcapitalism.com/2024/09/will-there-be-a-general-strike-on-may-day2028.html",
          "publishedOn": "2024-09-02T20:25:51.000Z",
          "wordCount": 10865,
          "title": "Will There Be a General Strike on May Day, 2028?",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/uaw_strike.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277742",
          "author": "Conor Gallagher",
          "description": "",
          "link": "https://www.nakedcapitalism.com/2024/09/links-9-2-2024.html",
          "publishedOn": "2024-09-02T10:55:54.000Z",
          "wordCount": 20460,
          "title": "Links 9/2/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/Screenshot-2024-09-01-at-11.04.48 PM-581x1024.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277750",
          "author": "Conor Gallagher",
          "description": "Is Kamala's price gouging proposal is a ruse, and why won't she voice support for Lina Khan at the Federal Trade Commission?",
          "link": "https://www.nakedcapitalism.com/2024/09/the-stupid-price-gouging-discourse.html",
          "publishedOn": "2024-09-02T09:00:46.000Z",
          "wordCount": 6842,
          "title": "The Stupid Price Gouging Discourse",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=277677",
          "author": "Conor Gallagher",
          "description": "",
          "link": "https://www.nakedcapitalism.com/2024/09/links-9-1-2024.html",
          "publishedOn": "2024-09-01T10:55:14.000Z",
          "wordCount": 20817,
          "title": "Links 9/1/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/08/Screenshot-2024-08-31-at-6.31.41 PM-1024x772.png"
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": []
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": [
        {
          "id": "https://slack.engineering/?p=16945",
          "author": "Kaili Liang",
          "description": "“What are your goals for this quarter?” It’s the question every manager asks, and one that often prompts a flurry of technical objectives and project milestones. Jumping into this internship, I knew my answer. I wanted to practice making informed decisions on my project, since that was one of the challenges I faced last summer. […]\nThe post Engineering with Empathy: My Journey to Understanding the User Experience appeared first on Slack Engineering.",
          "link": "https://slack.engineering/engineering-with-empathy-my-journey-to-understanding-the-user-experience/",
          "publishedOn": "2024-08-30T22:54:41.000Z",
          "wordCount": 2194,
          "title": "Engineering with Empathy: My Journey to Understanding the User Experience",
          "imageUrl": "https://slack.engineering/wp-content/uploads/sites/7/2024/08/featured_image.png"
        }
      ]
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": []
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=21662",
          "author": null,
          "description": "The Quantum Apocalypse is coming. The advent of quantum computers has raised real questions about the future of data privacy over the internet.  Someday, advances in quantum computing will make it possible to decrypt sensitive data that was encrypted using today’s complex cryptography systems. In the latest episode of the Meta Tech Podcast you’ll meet Sheran [...]\nRead More...\nThe post Meta is getting ready for post-quantum cryptography appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/08/28/security/post-quantum-cryptography-meta/",
          "publishedOn": "2024-08-28T16:19:35.000Z",
          "wordCount": 1610,
          "title": "Meta is getting ready for post-quantum cryptography",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/08/Meta-Tech-Podcast-Post-quantum-readiness.webp"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=41431211",
          "author": "egypturnash",
          "description": "I got hue 174 as my threshold and really I just wanted to say \"neither, this is turquoise/teal\" for most of the questions. But blue/green was the only option.",
          "link": "https://news.ycombinator.com/item?id=41431211",
          "publishedOn": "2024-09-03T04:17:09.000Z",
          "wordCount": 1413,
          "title": "New comment by egypturnash in \"Is My Blue Your Blue?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41431114",
          "author": "db48x",
          "description": "Rust and Javascript and Lisp all get extra points because they put a keyword in front of every function definition. Searching for “fn doTheThing” or “defun do-the-thing” ensures that you find the actual definition. Meanwhile C lacks any such keyword, so the best you can do is search for the name. That gets you a sea of callers with the declarations and definitions mixed in. Some C coding conventions have you split the definition into two lines, first the return type on a line followed by a second line that starts with the function name. It looks ugly, but at least you can search for “^doTheThing” to find just the definition(s).",
          "link": "https://news.ycombinator.com/item?id=41431114",
          "publishedOn": "2024-09-03T03:58:36.000Z",
          "wordCount": 9504,
          "title": "New comment by db48x in \"Greppability is an underrated code metric\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41430492",
          "author": "doe_eyes",
          "description": "I suspect it tests your monitor and monitor calibration as much as your color perception. In particular, sRGB displays have a pretty severely limited green gamut. If you have a wide-gamut display, the test is probably gonna appear different.\nBut another problem is with displaying the colors essentially full-window, which is going to be nearly-full-screen for many users. When we're staring at a screen with a particular tint, our eyes quickly do \"auto white balance\" that skews the results. It's the mechanism behind a bunch of optical illusions.\nTo address that last problem, I think the color display area should be much smaller, or you should be shown all hues at once and asked to position a cut-off point.",
          "link": "https://news.ycombinator.com/item?id=41430492",
          "publishedOn": "2024-09-03T01:57:39.000Z",
          "wordCount": 5692,
          "title": "New comment by doe_eyes in \"Is My Blue Your Blue?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41430477",
          "author": "fogleman",
          "description": "I think this is flawed. You quickly end up on a color that's clearly not \"blue\" or \"green\" and you're unlikely to keep hitting \"this is green\" several times in a row, conceding that ok, fine, maybe this is blue, whatever. You're basically measuring how many times people are willing to click the same button in a row.\nEdit: Possible improvements: changing the wording to \"this is MORE green\" and \"this is MORE blue\" and randomizing the order in which they are shown, somehow. I realize you're just doing some kind of binary search, narrowing the color range.\nThis is not to mention color calibration of your monitor, or your eyes adjusting / fatiguing to the bold color over time...",
          "link": "https://news.ycombinator.com/item?id=41430477",
          "publishedOn": "2024-09-03T01:55:17.000Z",
          "wordCount": 3460,
          "title": "New comment by fogleman in \"Is My Blue Your Blue?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41424153",
          "author": "WoodenChair",
          "description": "Whatever you think of the site itself, this is prime HN content. A kid in high school starts a site that scales to 1,000,000 registered users while working on it during nights and weekends in college. If the founder is on here, what tech stack did you use and how long had you been programming before you built it?",
          "link": "https://news.ycombinator.com/item?id=41424153",
          "publishedOn": "2024-09-02T10:17:01.000Z",
          "wordCount": null,
          "title": "New comment by WoodenChair in \"1M Users\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41421177",
          "author": "tithe",
          "description": "That's some serious...multithreading!\n(I applaud others for resisting such cringe, but I just couldn't help myself.)",
          "link": "https://news.ycombinator.com/item?id=41421177",
          "publishedOn": "2024-09-01T23:16:25.000Z",
          "wordCount": 219,
          "title": "New comment by tithe in \"The Pentium as a Navajo Weaving\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41420875",
          "author": "tptacek",
          "description": "You generally want to minimize the number of passwords you manage; for instance, you should generally be paying the SSO tax and getting as many services as you can onto OIDC. After that, just do the cloud version of 1Password, which is easy to audit and manage access for, which you'll thank yourself for when it comes time to SOC2.\nRemember, as you give people access to passwords, that those passwords will need to be rotated when those people change to incompatible roles or depart the company. If passwords aren't a total pain in the ass for you, you're probably doing something wrong.",
          "link": "https://news.ycombinator.com/item?id=41420875",
          "publishedOn": "2024-09-01T22:16:32.000Z",
          "wordCount": 4280,
          "title": "New comment by tptacek in \"Ask HN: How to store and share passwords in a company?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41420455",
          "author": "apetresc",
          "description": "> 10. What Changes When You Are Free\n> You will not be forced to work inside something known as a “virtual environment.”\nOof, this terrible advice cancels out an otherwise reasonable post. Beginners who don't know what they're doing are the last people who should be `pip install -r requirements.txt`-ing into the system Python the way this article is recommending. That's not only going to make working on multiple projects nearly impossible (especially for the kind of beginning students who get recommended Anaconda, which are almost always the Data Science-y crowd using NumPy, Pandas, Scikit, etc, which are notoriously finicky with version conflicts), but it stands a good chance of breaking other Python-based system utilities in completely opaque ways. This sort of advice can fubar a naive user's entire workflow.\nI know virtualenvs suck to explain to people, but in my opinion it needs to be done before you ever tell them about `pip install`.",
          "link": "https://news.ycombinator.com/item?id=41420455",
          "publishedOn": "2024-09-01T21:15:13.000Z",
          "wordCount": null,
          "title": "New comment by apetresc in \"Escaping from Anaconda's Stranglehold on macOS\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41418149",
          "author": "smugglerFlynn",
          "description": "This whole article is written around one key sentence:\n  > There are things founders can do that managers can't, and not doing them feels wrong to founders, because it is.\n\nAnd to be honest this hn comment section scares me, as it feels like people are discussing Paul’s new clothes without actually voicing out what they are talking about.\nWhat the hell is “Founder mode”, exactly?",
          "link": "https://news.ycombinator.com/item?id=41418149",
          "publishedOn": "2024-09-01T16:26:28.000Z",
          "wordCount": null,
          "title": "New comment by smugglerFlynn in \"Founder Mode\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41415406",
          "author": "magnio",
          "description": "> All the formatting in {fmt} is locale-independent by default (which breaks with the C++’s tradition of having wrong defaults)\nChuckles",
          "link": "https://news.ycombinator.com/item?id=41415406",
          "publishedOn": "2024-09-01T09:10:26.000Z",
          "wordCount": null,
          "title": "New comment by magnio in \"Honey, I shrunk {fmt}: bringing binary size to 14k and ditching the C++ runtime\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41412758",
          "author": "pfraze",
          "description": "Copying over my latest backend status update; figure folks would find it interesting\nServers are holding up so far! Fortunately we were overprovisioned. If we hit 4mm new signups then things should get interesting. We did have some degradations (user handles entering an invalid state, event-stream crashed a couple times, algo crashed a couple times, image servers hit bad latencies) but we managed to avoid a full outage.\nWe use an event-sourcing model which is: K/V database for primary storage (actually sqlite), into a golang event stream, then into scylladb for computed views. Various separate services for search, algorithms, and images. Hybrid on-prem & cloud. There are ~20 of the k/v servers, 1 event-stream, 2 scylla clusters (I believe).\nThe event-stream crash would cause the application to stop making progress on ingesting events, but we still got the writes, so you'd see eg likes failing to increment the counter but then magically taking effect 60 seconds later. Since the scylla cluster and the KV stores stayed online, we avoided a full outage.",
          "link": "https://news.ycombinator.com/item?id=41412758",
          "publishedOn": "2024-08-31T23:15:18.000Z",
          "wordCount": null,
          "title": "New comment by pfraze in \"Brazil's X ban is sending lots of people to Bluesky\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41411273",
          "author": "bhauer",
          "description": "The step-up in cost basis on death is the original sin that underpins the entire debate over unrealized gains.\nIt's disheartening to see so much thought and deliberation going into an obviously toxic idea (taxing unrealized gains) when the obvious solution (removing the cost basis step-up when assets change hands) is being ignored.\nInherited wealth is the least earned, so it should be politically palatable to change this. But presumably because such a change would acutely affect the people who make laws in the country specifically, it is never seriously considered.",
          "link": "https://news.ycombinator.com/item?id=41411273",
          "publishedOn": "2024-08-31T19:31:32.000Z",
          "wordCount": null,
          "title": "New comment by bhauer in \"Buy, Borrow, Die – Explained\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41410912",
          "author": "rzimmerman",
          "description": "I worked for about a year with a consulting firm that handled \"Y2K compliance\". Unlike this Andersen exercise in legal face-saving, it was a real job. Big companies hired us to do a full inventory of their site equipment (this included manufacturing plants, Pharma stuff) and go line by line with their vendors and figure out which components had known Y2K issues, which had not been tested at all, and which ones were fine/had simple fixes. We helped them replace and fix what needed to be fixed.\nY2K was a real problem. The end-of-the-world blackouts + planes falling from the sky was sensationalism, but there were real issues and most of them got fixed. Not trying to take away from this very interesting story of corrupt cronyism, but there were serious people dealing with serious problems out there. \"Remember Y2K? Nothing happened!\" is a super toxic lesson to take away from a rare success where people came together and fixed something instead of firefighting disasters.",
          "link": "https://news.ycombinator.com/item?id=41410912",
          "publishedOn": "2024-08-31T18:46:49.000Z",
          "wordCount": null,
          "title": "New comment by rzimmerman in \"My fake job in Y2K preparedness\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41405773",
          "author": "tux1968",
          "description": "Have posted this before, but it really left an impression about crows, and the bond between their mates:\nYears ago I was putting out the garbage in the back alley behind our building where I lived on the 8th floor. A crow attacked me out of the blue. Distracted by the attack, the back door slammed shut behind me. Since my key was only good for the front door, I had to walk around the building. That damn crow followed me the entire time, dive bombing my head, and screaming bloody murder at me. It was a little spooky.\nWhen I finally got back inside and upstairs, I went and looked out the living room window, which looked out the same direction as the back alley. The crow had flown back around and was at the 8th floor looking in the window, from the other side of the pigeon netting we had on our balcony. On the inside of the pigeon netting, was another crow, desperately trying to figure out how it could escape. Not really sure how it had got itself through the pigeon netting in the first place.\nI went out and sliced a hole through the netting and the trapped crow quickly joined its mate outside, who finally stopped screaming bloody murder. To this day it still amazes me that the crow's mate, knew which apartment I lived in and spotted me downstairs.",
          "link": "https://news.ycombinator.com/item?id=41405773",
          "publishedOn": "2024-08-31T00:30:24.000Z",
          "wordCount": null,
          "title": "New comment by tux1968 in \"Crows are even smarter than we thought\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41403970",
          "author": "rock_artist",
          "description": "> Finally, I’d like to end this piece with a comment on the Cable TV-ification of the web. A core belief that Anand and I have held dear for years, and is still on our About page to this day, is AnandTech’s rebuke of sensationalism, link baiting, and the path to shallow 10-o'clock-news reporting. It has been our mission over the past 27 years to inform and educate our readers by providing high-quality content\nThat’s the core of it. And too bad they’re off. Finding a news outlet that isn’t “tweeting” an article and isn’t a blog post on HN was great. And while they mention Tom’s hardware. It always felt (to me) less verbose where I needed it.\nFair well.",
          "link": "https://news.ycombinator.com/item?id=41403970",
          "publishedOn": "2024-08-30T20:05:38.000Z",
          "wordCount": 3152,
          "title": "New comment by rock_artist in \"AnandTech Farewell\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41400911",
          "author": "ryukoposting",
          "description": "Anandtech is how I learned what Ubuntu is. I must have been about 10 years old, and the concept of any OS besides Windows or MacOS was completely foreign to me. Within a few weeks, I had dug an old laptop out of my dad's bin of \"stuff work wasn't using anymore\" and I managed to put Ubuntu on it. I think it was an HP. I don't remember the exact specs but I do remember that the GPU was failing, there were weird video glitches all the time, and the battery held a charge for about 15 minutes.\nThat was my first experience with Linux. That broken-ass computer was what I used when I learned Arduino. I'm now a firmware engineer, writing this comment on my work laptop, which is running Ubuntu.",
          "link": "https://news.ycombinator.com/item?id=41400911",
          "publishedOn": "2024-08-30T14:10:40.000Z",
          "wordCount": null,
          "title": "New comment by ryukoposting in \"AnandTech Farewell\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41400265",
          "author": "Sesse__",
          "description": "Extremely sad. There basically is nothing like Anandtech; the depth, the ability to explain, the lack of sensationalism, and the integrity in benchmarking (I still vividly remember when they noticed an issue with HPET in Windows affecting their benchmarks, and promptly pulled all of them offline until they could reassess). Chips and Cheese is great but only covers a certain segment of it.\nIn the end, I would assume it just boiled down to lack of money. There were people among us who would gladly pay for this kind of coverage, but Anandtech said at some point they had considered it and couldn't find a good model. (As an aside, I pay for LWN, and I would pay for something that covered similar areas to Phoronix but actually was good.)",
          "link": "https://news.ycombinator.com/item?id=41400265",
          "publishedOn": "2024-08-30T13:00:13.000Z",
          "wordCount": null,
          "title": "New comment by Sesse__ in \"AnandTech Farewell\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41400161",
          "author": "codeslave13",
          "description": "A sad day. My buddy and I were the original developers of anandtech when it went live running on cold fusion and oracle as the backend. I started a hosting company and hosted anadtrch for a few years. Lots of memories there.",
          "link": "https://news.ycombinator.com/item?id=41400161",
          "publishedOn": "2024-08-30T12:48:25.000Z",
          "wordCount": null,
          "title": "New comment by codeslave13 in \"AnandTech Farewell\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41396943",
          "author": "adityapurwa",
          "description": "I don’t know. Reading this made me tear up a bit. I learned software engineering when I was in junior high school. I learned it because I sucked at math, and I want to write  programs that solve my homework. Then I continue writing LAN chat, HTTP server, Anti Virus, and a lot more things just because it was fun to do.\nIt was fun, it was challenging, it was rewarding, it was amazing.\nNow that I’m working, with the endless stream of new technologies, the debates of X considered harmful, J is better than K, and a barrage of never ending new things. It started to numb my mind.\nSomehow, those joyful feeling of engineering no longer feels like the blue sky. I think its still blue, but for an eye washed in silvers, everything looks gray.\nReading this story somehow light up that childhood feeling of me learning software engineering. It can still be fun. I can still write things for the sake of me and not for the sake of exit nor a new shiny SaaS.\nThank your for writing this. It gave me a ray of hope that it can still be fun.",
          "link": "https://news.ycombinator.com/item?id=41396943",
          "publishedOn": "2024-08-30T01:14:37.000Z",
          "wordCount": null,
          "title": "New comment by adityapurwa in \"The secret inside One Million Checkboxes\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41396635",
          "author": "tgsovlerkhgsel",
          "description": "If you're interested in historical buildings, go ahead, visit Bletchley Park. But expect most of the exhibits to be buildings, living quarters, offices etc. and mundane descriptions of day-to-day life there, not exhibits about the technical/cryptological aspects (although they do have some of those too).\nIf you're interested in computer history and Bombe/Colossus, visit the much lesser known National Museum of Computing at the same site. https://www.tnmoc.org/\nI spent way too much time at the the boring parts of Bletchley Park and as a result didn't have enough time for the Museum of Computing.\nI'd recommend starting at the Museum of Computing, then if you have time left, the 1-2 buildings inside the official Bletchley Park museum that have the crypto exhibits.",
          "link": "https://news.ycombinator.com/item?id=41396635",
          "publishedOn": "2024-08-30T00:14:45.000Z",
          "wordCount": null,
          "title": "New comment by tgsovlerkhgsel in \"Visit Bletchley Park\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41396053",
          "author": "eieio",
          "description": "author here :)\nthis is my favorite story from running the site, and possibly the best story I've ever been a part of. I'm not a big crier but I have cried so many times thinking and trying to write about it over the past 2 months. And of course, the process of discovery (and going from panic to excitement) was pretty crazy too.\nOne of my favorite things about this is that it validated one of the core beliefs I have when making these things - that you need constraints for the small group of people that are jerks, but that for the most part those constraints are fodder for the largely-good and very creative folks that play around on the internet.\nHappy to answer any questions folks have!",
          "link": "https://news.ycombinator.com/item?id=41396053",
          "publishedOn": "2024-08-29T22:36:54.000Z",
          "wordCount": null,
          "title": "New comment by eieio in \"The secret inside One Million Checkboxes\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41395709",
          "author": "asolove",
          "description": "This part is so important:\n> The adults in my life were largely not mad at me. They asked me to knock it off, but also made me a t-shirt. I don’t think I’d be doing what I do now without the encouragement that I received then.\nTeena need a place to be moderately mischievous, with semi-real social outcomes, but also some boundaries and help to not take it too far.\nAnd adults who aren’t authorities over them except insofar that they have cool talents the kids want to learn.",
          "link": "https://news.ycombinator.com/item?id=41395709",
          "publishedOn": "2024-08-29T21:58:32.000Z",
          "wordCount": null,
          "title": "New comment by asolove in \"The secret inside One Million Checkboxes\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41394613",
          "author": "caymanjim",
          "description": "I spend four months of the year traveling in an RV. Two years ago, I budgeted over $6000 for my desired solar setup (at least 1200Ah of battery, at least 2400W of solar, plus various controllers and other components). It was expensive enough for me to hold off, and more importantly, I didn't have the space on my current RV for the solar panels.\nIn just the two years since then, prices on batteries and panels have dropped 25% or more, and solar power per square foot at a good price point has gone up significantly (400W monocrystalline panels can be gotten for $200, in the same form factor as the 200W panels I had been budgeting for). I've now lowered my budget to $4000 for the same setup I was planning to spend $6000 on two years ago, and with 400W panels, I no longer need to upgrade to a l…",
          "link": "https://news.ycombinator.com/item?id=41394613",
          "publishedOn": "2024-08-29T19:49:07.000Z",
          "wordCount": null,
          "title": "New comment by caymanjim in \"Can solar costs keep shrinking?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41393216",
          "author": "VyseofArcadia",
          "description": "> Hilarious that the entire TSA system is vulnerable to the most basic web programming error that you generally learn to avoid 10 minutes\nThe article mentions that FlyCASS seems to be run by one person. This isn't a matter of technical chops, this is a matter of someone who is good at navigating bureaucracy convincing the powers that be that they should have a special hook into the system.\nWhat should really be investigated is who on the government side approved and vetted the initial FlyCASS proposal and subsequent development? And why, as something with a special hook into airline security infrastructure, was it never security audited?",
          "link": "https://news.ycombinator.com/item?id=41393216",
          "publishedOn": "2024-08-29T17:28:54.000Z",
          "wordCount": null,
          "title": "New comment by VyseofArcadia in \"Bypassing airport security via SQL injection\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41393163",
          "author": "macNchz",
          "description": "What was surprising to me was that they didn't immediately do pre-dawn raids on the pentesters' homes and hold them without a lawyer under some provision of an anti-terror law.",
          "link": "https://news.ycombinator.com/item?id=41393163",
          "publishedOn": "2024-08-29T17:24:29.000Z",
          "wordCount": null,
          "title": "New comment by macNchz in \"Bypassing airport security via SQL injection\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41393115",
          "author": "UniverseHacker",
          "description": "Hilarious that the entire TSA system is vulnerable to the most basic web programming error that you generally learn to avoid 10 minutes into reading about web programming- and that every decent quality web framework automatically prevents.\nIt is really telling that they try to cover up and deny instead of fix it, but not surprising. That is a natural consequence of authoritarian thinking, which is the entire premise and culture of the TSA. Any institution that covers up and ignores existential risks instead of confronting them head on will eventually implode by consequences of its own negligence- which hopefully will happen to the TSA.",
          "link": "https://news.ycombinator.com/item?id=41393115",
          "publishedOn": "2024-08-29T17:19:34.000Z",
          "wordCount": null,
          "title": "New comment by UniverseHacker in \"Bypassing airport security via SQL injection\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41392963",
          "author": "dylan604",
          "description": "Since they actually went past the SQL injection and then created a fake record for an employee, I'm shocked that Homeland did not come after and arrest those involved. Homeland would have been top of the list to misinterpret a disclosure and prefer to refer to the disclosure as malicious hacking instead of responsible disclosure. I'm more impressed by this than the incompetence of the actual issue.",
          "link": "https://news.ycombinator.com/item?id=41392963",
          "publishedOn": "2024-08-29T17:03:36.000Z",
          "wordCount": 4107,
          "title": "New comment by dylan604 in \"Bypassing airport security via SQL injection\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41392938",
          "author": "woodruffw",
          "description": "The TSA's response here is childish and embarrassing, although perhaps unsurprising given the TSA's institutional disinterest in actual security. It's interesting to see that DHS seemingly (initially) handled the report promptly and professionally, but then failed to maintain top-level authority over the fix and disclosure process.",
          "link": "https://news.ycombinator.com/item?id=41392938",
          "publishedOn": "2024-08-29T17:00:45.000Z",
          "wordCount": null,
          "title": "New comment by woodruffw in \"Bypassing airport security via SQL injection\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41392867",
          "author": "nsagent",
          "description": "The current comments seem to say this is rings the death knell of social media and that this just leads to government censorship. I'm not so sure.\nI think the ultimate problem is that social media is not unbiased — it curates what people are shown. In that role they are no longer an impartial party merely hosting content. It seems this ruling is saying that the curation being algorithmic does not absolve the companies from liability.\nIn a very general sense, this ruling could be seen as a form of net neutrality. Currently social media platforms favor certain content, while down weighting others. Sure, it might be at a different level than peer agreements between ISPs and websites, but it amounts to a similar phenomenon when most people interact on social media through the feed.\nHonestly, I think I'd love to see what changes this ruling brings about. HN is quite literally the only social media site (loosely interpreted) I even have an account on anymore, mainly because of how truly awful all the sites have become. Maybe this will make social media more palatable again? Maybe not, but I'm inclined to see what shakes out.",
          "link": "https://news.ycombinator.com/item?id=41392867",
          "publishedOn": "2024-08-29T16:55:26.000Z",
          "wordCount": null,
          "title": "New comment by nsagent in \"Judges rule Big Tech's free ride on Section 230 is over\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41390033",
          "author": "jehna1",
          "description": "Author of HumanifyJS here! I've created specifically a LLM based tool for this, which uses LLMs on AST level to guarantee that the code keeps working after the unminification step:\nhttps://github.com/jehna/humanify",
          "link": "https://news.ycombinator.com/item?id=41390033",
          "publishedOn": "2024-08-29T12:19:32.000Z",
          "wordCount": 1857,
          "title": "New comment by jehna1 in \"OpenAI is good at unminifying code\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=53118",
          "author": "John Q",
          "description": "This study showing that US academic faculty members are 25 times more likely than Americans in general to have a parent with a PhD or Masters degree has attracted a lot of attention, and comments suggesting that this is unusual and unsatisfactory. But is it? For various reasons, I’ve interacted quite a bit with farmers, […]",
          "link": "https://crookedtimber.org/2024/09/01/academic-nepo-babies/",
          "publishedOn": "2024-09-01T21:47:08.000Z",
          "wordCount": 5501,
          "title": "Academic nepo babies ?",
          "imageUrl": "https://crookedtimber.org/wp-content/uploads/2024/09/InheritedJobs-300x279.png"
        },
        {
          "id": "https://crookedtimber.org/?p=53107",
          "author": "John Holbo",
          "description": "So is Trump going to be able to pivot to pro-choice in the run-up to the election? I mean: he’s trying. But will it work? And will his pro-life base accept it, because he’s Trump? I hope no pro-choice voters are fooled. I hope they hold him responsible for overturning Roe. It’s beyond obvious they […]",
          "link": "https://crookedtimber.org/2024/09/01/a-thought-about-conservative-psychology-re-the-abortion-issue/",
          "publishedOn": "2024-09-01T13:00:18.000Z",
          "wordCount": 10628,
          "title": "A thought about conservative psychology re: the abortion issue",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53104",
          "author": "Chris Bertram",
          "description": "Visit the post for more.",
          "link": "https://crookedtimber.org/2024/09/01/sunday-photoblogging-looking-towards-great-howard-street-liverpool-at-night/",
          "publishedOn": "2024-09-01T05:57:25.000Z",
          "wordCount": 1916,
          "title": "Sunday photoblogging: Looking towards Great Howard Street (Liverpool) at night",
          "imageUrl": "https://live.staticflickr.com/65535/53951428111_69ecbd9b9a.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53098",
          "author": "Belle Waring",
          "description": "I read reddit. Yeah, I know. Plain People of Crooked Timber: “why would you go and do a thing like that when you could sit on the kitchen floor and watch your packet of English muffins slowly pass its sell-by date and develop that unpleasant sour flavour you usually don’t notice until it’s too late […]",
          "link": "https://crookedtimber.org/2024/08/31/how-best-to-do-bad-things-that-hurt-your-spirit/",
          "publishedOn": "2024-08-31T14:57:05.000Z",
          "wordCount": 2967,
          "title": "How Best to Do Bad Things That Hurt Your Spirit",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53089",
          "author": "Eric Schliesser",
          "description": "I am very pleased that our very own Chris Bertram has responded to Joseph Heath’s very entertaining and polemical “John Rawls and the death of Western Marxism,” a widely shared Substack post [HT: Dailynous]. Chris has made some important corrections to the public record, and the comments on his post are extending that. As it happens, I […]",
          "link": "https://crookedtimber.org/2024/08/30/53089/",
          "publishedOn": "2024-08-30T01:54:54.000Z",
          "wordCount": 5116,
          "title": "On Heath and the demise of western Marxism",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53079",
          "author": "Chris Bertram",
          "description": "There has been much attention online to a piece by Joseph Heath arguing that analytical Marxism disappeared because the analytical Marxists all turned into Rawlsian liberals. At a certain level of resolution (blurred, zoomed out) the argument has something going for it. But at that level, all it amounts to is the claim that this […]",
          "link": "https://crookedtimber.org/2024/08/29/on-joseph-heaths-account-of-the-trajectory-of-analytical-marxism/",
          "publishedOn": "2024-08-29T08:41:12.000Z",
          "wordCount": 7122,
          "title": "On Joseph Heath’s account of the trajectory of analytical Marxism",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53071",
          "author": "Belle Waring",
          "description": "OK guys, here’s the deal. Last night I had a decently long dream in which Vishnu appeared to me personally, blue but golden with godly light and so on, to explain to me that he was real, and that I should worship him but not necessarily his avatars, more just him, (though I objected that […]",
          "link": "https://crookedtimber.org/2024/08/28/should-i-become-a-vaishnavite/",
          "publishedOn": "2024-08-28T21:56:04.000Z",
          "wordCount": 4111,
          "title": "Should I Become a Vaishnavite?",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53064",
          "author": "Chris Bertram",
          "description": "(Originally drafted for a conference at Frankfurt in 2018 to mark the 40th anniversary of Karl Marx’s Theory of History: A Defence. I’ve done a bit of editing of my conference script and added a few footnotes etc, but it isn’t necessarily produced to the scholarly standards one might require of a journal article.) In […]",
          "link": "https://crookedtimber.org/2024/08/28/g-a-cohen-on-the-output-bias/",
          "publishedOn": "2024-08-28T10:34:44.000Z",
          "wordCount": 8294,
          "title": "G.A. Cohen on the output bias",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53062",
          "author": "Kevin Munger",
          "description": "Harris’ nomination locks in another Boomer presidency. This single generation — those born in the nineteen years between 1946 and 1964 — is guaranteed another presidency. 36 consecutive years, not counting the Biden Interregnum (he’s technically too old). Despite being a Boomer, you may have noticed that she’s the young, exciting candidate. Yes, the generational […]",
          "link": "https://crookedtimber.org/2024/08/28/the-electoral-politics-of-age-gaps/",
          "publishedOn": "2024-08-28T09:05:49.000Z",
          "wordCount": 4468,
          "title": "The (Electoral) Politics of Age Gaps",
          "imageUrl": "https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa8d899b2-d666-4253-ba43-cd406c3fd016_2153x1560.png"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/Alarming-development-Rights-activists-including-a-young-woman-face-blasphemy",
          "author": null,
          "description": "Joint statement and appeal by JKNSF and RSF \nEnglish\n\n/ \nSocial movements, \nPakistan, \nSouth Asia",
          "link": "https://www.cadtm.org/Alarming-development-Rights-activists-including-a-young-woman-face-blasphemy",
          "publishedOn": "2024-08-30T09:49:52.000Z",
          "wordCount": 1598,
          "title": "Alarming development: Rights activists, including a young woman, face blasphemy charges in Pakistani-administered Kashmir",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L492xH258/7e2604341f8198270c7664033e866b-b1b16.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=8394",
          "author": "disassociated.com",
          "description": "Well, I’m sure pretty no AI is involved. What’s really incredible about this three minute video, made by Faruk Korkmaz, is that it was filmed entirely by a device, a smartphone, many of us carry in our pockets. The narration is fitting also. It comes from a speech given by Canadian-American actor and comedian Jim […]",
          "link": "https://disassociated.com/short-film-iphone-15-pro-max/",
          "publishedOn": "2024-09-02T21:00:02.000Z",
          "wordCount": 255,
          "title": "A short film shot on the iPhone 15 Pro Max, with no lens, filter, or AI",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8381",
          "author": "disassociated.com",
          "description": "Publication of Irish author Sally Rooney’s fourth novel, Intermezzo, on 24 September 2024, nears. It promises to be quite the event. I don’t know about Australia, but in Ireland and the UK, some bookshops will open early on the day, so eager Rooney fans can get hold of her latest offering. But Sally Rooney is […]",
          "link": "https://disassociated.com/ireland-home-best-literature-world/",
          "publishedOn": "2024-09-01T21:00:50.000Z",
          "wordCount": 411,
          "title": "Ireland: home of some of the best literature in the world",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8376",
          "author": "disassociated.com",
          "description": "Brazilians are turning to Bluesky — the microblogging platform founded by then Twitter co-founder Jack Dorsey — in droves, following a ban on X in the South American country. The surge in signups however has prompted warnings from Bluesky that the service may experience outages, as a result. But that seems like a good sort […]",
          "link": "https://disassociated.com/brazilians-flock-bluesky-authorities-block-x/",
          "publishedOn": "2024-09-01T20:30:40.000Z",
          "wordCount": 287,
          "title": "Brazilians flock to Bluesky after authorities block X",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8373",
          "author": "disassociated.com",
          "description": "Dusk, the new novel by Hobart based Australian author Robbie Arnott, is being published on Tuesday 8 October 2024. In the distant highlands, a puma named Dusk is killing shepherds. Down in the lowlands, twins Iris and Floyd are out of work, money and friends. When they hear that a bounty has been placed on […]",
          "link": "https://disassociated.com/dusk-novel-robbie-arnott-published-october-2024/",
          "publishedOn": "2024-08-29T21:00:25.000Z",
          "wordCount": 246,
          "title": "Dusk, a novel by Robbie Arnott, being published in October 2024",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8371",
          "author": "disassociated.com",
          "description": "Backbeat, the word is on the street, Oasis, the old nineties Britpop act — that was, in the words of co-founder Noel Gallagher — bigger than the Beatles, is set to play a series of reunion concerts. Honestly, I was more excited when in 2011, the Stone Roses, an even older act, announced they were* […]",
          "link": "https://disassociated.com/oasis-regroup-unwanted-second-coming/",
          "publishedOn": "2024-08-29T20:30:09.000Z",
          "wordCount": 312,
          "title": "Oasis regroup, this is not the second coming we were waiting for",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8368",
          "author": "disassociated.com",
          "description": "What we learned in our first year of 404 Media, by 404 Media. Has it really been a year? Here we are a year later, and we are very proud and humbled to report that, because of your support, 404 Media is working. Our business is sustainable, we are happy, and we aren’t going anywhere. […]",
          "link": "https://disassociated.com/404-media-not-going-anywhere-but-they-are/",
          "publishedOn": "2024-08-28T21:00:35.000Z",
          "wordCount": 172,
          "title": "404 Media are not going anywhere, but yes they are",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8363",
          "author": "disassociated.com",
          "description": "Chris Welch, a writer for The Verge, on the new “reimagine” feature, that shipped with Google’s recently launched Pixel 9 smartphones. Long story short, “reimagine” allows someone to edit/enhance any photo, anyway they choose: With a simple prompt, you can add things to photos that were never there. And the company’s Gemini AI makes it […]",
          "link": "https://disassociated.com/photorealistic-ai-generation-revolution-here/",
          "publishedOn": "2024-08-28T20:30:58.000Z",
          "wordCount": 201,
          "title": "The photorealistic AI-generation revolution is here",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8358",
          "author": "disassociated.com",
          "description": "Speaking in 1964, the late British author and futurist made numerous predictions, mainly relating to advances in technology, many of which were prescient. Clarke called artificial intelligence (no surprise there, coming from the co-writer of the 1968 movie, 2001: A Space Odyssey). He also foresaw the internet, working from home, and a favourite of mine, […]",
          "link": "https://disassociated.com/arthur-c-clarke-predicts-future-1964/",
          "publishedOn": "2024-08-28T20:00:53.000Z",
          "wordCount": 340,
          "title": "Arthur C Clarke predicts some of the future in 1964",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8355",
          "author": "disassociated.com",
          "description": "One Minute Park by Elliott Cost, has been named winner of the main prize of the Tiny Awards 2024, while One Million Checkboxes by Nolen Royalty, took out the multiplayer player gong. One is your lucky number this year. Held annually since last year, 2023, the Tiny Awards recognise excellence in non-commercial websites designed by […]",
          "link": "https://disassociated.com/one-minute-park-one-million-checkboxes-tiny-awards-2024/",
          "publishedOn": "2024-08-28T19:30:32.000Z",
          "wordCount": 163,
          "title": "One Minute Park, One Million Checkboxes, win Tiny Awards 2024",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20240828",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20240828",
          "publishedOn": "2024-08-28T23:00:00.000Z",
          "wordCount": 636,
          "title": "Week Ending August 25, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": []
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://louplummer.lol/my-partner/",
          "author": null,
          "description": "I am deeply and hopelessly in love and there's not much I can do about it. Luckily, the object of my affection is my wife of eleven years. Whenever we are separated, regardless for how long, I unconsciously begin a countdown in my mind until I see her again, even it it's just from the beginning of the work day until lunch. I've never known anyone as well as I know her. I can tell her mood from the sound of her footsteps as she descends the stairs from our bedroom into the living room. Neither of us ever attempt to hide an emotion from the other, so intune we are with each other's feelings.\nMy wife is a classic introvert. Our home is her haven, the place where she recharges her batteries. I long ago accepted the responsibility for answering every knock at the door and being the one to deal …",
          "link": "https://louplummer.lol/my-partner/",
          "publishedOn": "2024-09-03T11:30:00.000Z",
          "wordCount": 1039,
          "title": "My Partner",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/livingoutloud-1725326614.jpeg"
        },
        {
          "id": "https://louplummer.lol/how-to-be-yourself-and-get-along-online/",
          "author": null,
          "description": "Since I started blogging in January, I've invested time in several different communities, starting with OMG.LOL, followed by Microblog, Scribbles, r/MacApps, r/Obsidian, BearBlog, 500.social and the Blaugust Discord. The most personal of these are the Mastodon community around OMG.LOL, Scribbles and Microblog. The two Reddit communities are the most impersonal. As in any group environment, I have personal interactions with other people and with groups of other people. I also get to watch interactions where I'm not directly involved because of the way the Internet is structured.\nSome of my rules are:\nStay out of other people's fights\nNever ignore racism, homophobia or misogyny\nNever go \"Well, actually…\"\nGive lots of complements\nOffer sympathy\nAnswer questions\nAvoid taking sides unless moral…",
          "link": "https://louplummer.lol/how-to-be-yourself-and-get-along-online/",
          "publishedOn": "2024-09-02T11:30:00.000Z",
          "wordCount": 1082,
          "title": "How to Be Yourself and Get Along Online",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/livingoutloud-1725244010.webp"
        },
        {
          "id": "https://secemp9.bearblog.dev/how-i-mastered-english-through-sheer-anger/",
          "author": null,
          "description": "I was once so angry that I reached this current level of understanding English, the level you see right now.\nIt was in the summer of 2016.\nI wasn’t particularly angry at the time, until a certain event occurred. Looking back, it probably wasn’t that significant, but, to put it briefly, the main cause was an English teacher I had at the time. It might have been a childish reason, but I was just a kid back then.\nDuring that summer, fueled by anger, I took the first hardcover English book I could find at home (I remember the title was \"Frankenstein\") and tried to read it.\nI didn’t have my laptop, internet, TV, or even a paper dictionary at the time. I was furious and struggled to read the book.\nOn my first read, I understood only about 1-5% of the entire book. But I kept going. As I struggled…",
          "link": "https://secemp9.bearblog.dev/how-i-mastered-english-through-sheer-anger/",
          "publishedOn": "2024-09-01T22:06:00.000Z",
          "wordCount": 891,
          "title": "How I mastered English through sheer Anger",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://blog.avas.space/get-with-program/",
          "author": null,
          "description": "I wrote this 2 weeks ago while I was particularly sad about my situation and in a lot of pain; after keeping it in the drafts for a while to consider it, I felt like publishing it now because it's easy to just portray the hopeful, productive ill person to the outside world, but sometimes accepting that stuff is tough!\nI’ve been complaining about being ill sometimes, about specific symptoms, about being unable to do stuff and being stuck in bed so much.. and the response I seem to get (whether outright or implied) is like “Duh, you are chronically ill, of course this is happening.” Like it’s the most normal thing in the world. As if everyone has already known it for ages and has readily accepted it, but I am lagging behind. “Get with the program already!”\nI remember asking my girlfriend if …",
          "link": "https://blog.avas.space/get-with-program/",
          "publishedOn": "2024-09-01T16:30:00.000Z",
          "wordCount": 1485,
          "title": "get with the program",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/avas-1709500835-0.png"
        },
        {
          "id": "https://birming.com/power-tiny-steps/",
          "author": null,
          "description": "I've been thinking about something lately. Something that's the complete opposite of how I usually do things — and it feels really good.\nIt's primarily the work on the Bearming theme that made me realize this. Before, I always wanted to have the whole picture clear in my mind beforehand. I tweaked and fiddled, turned it this way and that before finally deciding to release something.\nThere's been this idea that \"everything has to be perfect.\" This has resulted in spending a huge amount of time before pressing the publish button. There are several problems with such an approach...\nFor one thing, there is no external feedback whatsoever when I'm sitting and tinkering behind closed doors. It becomes a limited creation process with a very narrow perspective. A one-man show for something that's intended for an audience.\nAnother problem with creating \"for my eyes only\" is that the public announcement will never get a response that matches the time spent on the project. It leads to a feeling of scarcity, that it's not worth it. I've spent all this time, and this is all I get?\nThe new approach for me of creating publicly feels incredibly liberating and refreshing. I first released a beta of the theme and have since refined it and added new things along the way. Having a changelog also reinforces the feeling of continuity and development on a creatively rewarding level.\nI'm going to try to implement the same mindset with my entire blog. Revisiting old posts, reviewing the content, maybe adding tags or an image, and so on. A never-ending project without timeframes.\nBits and pieces that slowly, one step at a time, make for a more detailed and interesting picture – that's the kind of digital painting I want to keep creating.",
          "link": "https://birming.com/power-tiny-steps/",
          "publishedOn": "2024-09-01T15:41:00.000Z",
          "wordCount": 1439,
          "title": "The Power of Tiny Steps",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1725204984.jpg"
        },
        {
          "id": "https://louplummer.lol/osa-the-dog-and-the-last-goodbye/",
          "author": null,
          "description": "When we got to my son's house yesterday, he explained to me that one of his dogs wasn't feeling well. Osa, a 13-year-old lab/pit mix had a swollen stomach and was moving around very gingerly. Her condition had not changed by this morning and he elected to take he to the emergency vet's office in his neighborhood. The two of them were not gone long when he returned, grim faced. \"She's dying\" he told me.\nOsa survived the removal of stomach tumors three years ago. Now they have returned and in such profusion and size that removing them at her age isn't a practical option. my granddaughte,r who lives in Virginia had an October trip already planned to come home for a visit with Osa, the family dog since she was in kindergarten. She planned that visit because of Osa's age and health history. My …",
          "link": "https://louplummer.lol/osa-the-dog-and-the-last-goodbye/",
          "publishedOn": "2024-09-01T11:30:00.000Z",
          "wordCount": 1168,
          "title": "Osa the Dog and the Last Goodbye",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/livingoutloud-1725161169.jpeg"
        },
        {
          "id": "https://unwissen.bearblog.dev/blogs-are-weird-and-i-do-not-understand-them/",
          "author": null,
          "description": "Off course I knew what a blog was before finding Bear.1 I read blogposts and used tumblr (…), and I think my mother had a blog for some time, too. But I did not know about the technicalities (wtf is RSS?) and the culture of blogging. And although it took some time to set this whole endeavor up2, it is the culture-thing that is the hardest for me.\nI am used to Twitter and Bluesky, where posts have to be short and draw attention. This combination rewards posts that say divisive shit3 and punishes those that are nuanced and complex. It is easier to wish death onto some asshole politician than to explain what they did wrong. If you want to write something personal or sincere you have to meme and/or bury it under ironic detachment.\nLike posts on microblogging platforms, blogposts follow their o…",
          "link": "https://unwissen.bearblog.dev/blogs-are-weird-and-i-do-not-understand-them/",
          "publishedOn": "2024-08-31T19:45:00.000Z",
          "wordCount": 1027,
          "title": "Blogs are weird and I do not understand them",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://notes.jeddacp.com/notes-on-the-last-day-of-blaugust-2024/",
          "author": null,
          "description": "Happy World Blog Day!\nIn mid-July, I wanted to find a way to challenge myself in August for my birthday month. I initially wanted to do a photo challenge (a photo a day?) of sorts. As I was trying to figure out what to do, it was happenstance to have come across someone posting about Blaugust: A Festival of Blogging. I had no idea what it was but then I read this bit under What is Blaugust?:\nThe goal is to stoke the fires of creativity and allow bloggers and other content creators to mingle in a shared community while pushing each other to post more regularly. Above all the goal of Blaugust has always been to prove to folks that they can in fact sit down every day and create something fresh and then share it with the world.\nI knew I just had to try it.\nAnd here we are.\nI joined telling mys…",
          "link": "https://notes.jeddacp.com/notes-on-the-last-day-of-blaugust-2024/",
          "publishedOn": "2024-08-31T16:56:00.000Z",
          "wordCount": 1396,
          "title": "Notes on the last day of Blaugust 2024",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1722524363.png"
        },
        {
          "id": "https://bakavic.net/psa-remove-your-location-when-uploading-pictures-to-bearblog/",
          "author": null,
          "description": "TL;DR: Bearblog doesn't (currently) strip location data from your uploads, so you need to do it yourself\nI noticed that bear blog posts with pictures were loading rather slowly - turns out images are being stored and served as-is, full-sized and all.\nThis is probably a Good Thing(tm) for people running photo blogs, but I also realised that photo metadata, including your location, are being retained - not something you would want, e.g. if your pictures were taken at home.\nIf you have posted images via the native bearblog insert image feature in the past, it is a good idea to check that your location hasn't been inadvertently leaked.\nAlso, if you would like this to be solved for everyone, please help to upvote the suggestion to preprocess images.\nEDIT: Herman has marked this suggestion as ‘planned’ ＼ʕ •ᴥ•ʔ／\nThanks everyone for upvoting this issue!\nAndroid\nI'm not too sure how to this natively in Android (do let me know if you have an elegant way to remove location data!) - I'm wary to recommend any of the numerous apps that seem to do this, as I'm not sure which of them can be trusted.\nEDIT: Jd dropped me an email recommending Aves (F-Droid|Github) for Android :-\nJust saw your post and I was thinking to write the same a few days ago.\nTo remove metadata on your android phone, Aves is a really good gallery app. You can edit all of your metadata and also sort images in different ways.\nIt is available on playstore as well as fdroid.\nThanks for the recommendation! I haven't been in touch with the Android ecosystem for a while, and it's great to see photo/file manager apps which are not riddled with ads.\niOS\nIn the meantime, if you're on iOS 17+, there is an option in the photo picker when inserting images, to remove location and resize the image:\nExample images (of a sunrise on Alishan)\nOriginal image, with GPS metadata:\n\nInspector in macOS Preview:\nResized image, without GPS metadata:\n\nInspector in macOS Preview:",
          "link": "https://bakavic.net/psa-remove-your-location-when-uploading-pictures-to-bearblog/",
          "publishedOn": "2024-08-31T06:09:00.000Z",
          "wordCount": 805,
          "title": "PSA: Remove your location when uploading pictures to bearblog",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://meadow.cafe/re-write-like-you-talk/",
          "author": null,
          "description": "Earlier today I was reading some new posts by Visa. There’s not much to say about that, except that he uses pretty normal words and writes very well.\nThis might seem like an odd comment, but it stems from my reading of another post, A Brief Case on Bearblog. The author of that post is clearly a talented and experienced writer who, it must be said, writes very (very) well. However, the words they use are so fancy, and the way they’re woven is so perfect that reading them feels ?strange?1.\nThis thought reminded me of an excellent essay by Paul Graham, Write Like You Talk. In it, he argues that if you want people to connect with you, you must write in a way that feels familiar to them. Essentially, the essay rests on the assumption that we all speak similarly but think differently.\nI’m the fi…",
          "link": "https://meadow.cafe/re-write-like-you-talk/",
          "publishedOn": "2024-08-30T22:10:00.000Z",
          "wordCount": 1044,
          "title": "RE: Write like you talk",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://birming.com/oops-did-again/",
          "author": null,
          "description": "A month ago, I decided to shut down this blog. The next day I changed my mind, which I wrote about in the post \"The blog that refuses to die.\"\nYesterday, I launched a membership called Birming Buddies. When I woke up this morning after a long and good night's sleep, I realized it didn't feel right. I have now removed the page.\nIt probably sounds crazy – and maybe it is.\nBut neither the decision to start Birming Buddies nor to shut down the blog were impulsive actions. It's always been a long period of consideration before I hit the OK button. Once I've done that, I quickly realize whether it was the right decision or not.\nIt's as if I can't reason my way through some decisions. I have to put them into action to really be able to determine what is right and what is not. Not very practical, I know, but that's apparently how I work.\nAnyway, no harm done. The member fees are  refunded and the blog lives on. And I'll continue to develop the Bearming theme. Today I released an add-on to show excerpts of your blog posts (see example on my home page), and a new color palette named Green Screen.\nI hope you have the patience to continue following my rather crooked blog journey. Hopefully, the transparency will bring some comfort to those who can relate.\nBy the way, I also launched a newsletter today. Subscribe now, who knows, maybe I'll delete it tomorrow ;)\nI wish you a wonderful weekend!",
          "link": "https://birming.com/oops-did-again/",
          "publishedOn": "2024-08-30T17:46:00.000Z",
          "wordCount": 1404,
          "title": "Oops! I Did It Again",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1725039397.jpg"
        },
        {
          "id": "https://agj.bearblog.dev/ruby-shebang-behavior/",
          "author": null,
          "description": "Ruby has a surprising hack in its interpreter. If the file starts with a shebang line, ruby will skip all lines until it encounters a shebang line which contains the string \"ruby\" in it.\nThis lets you start out as a shell script and then after some setup switch over to ruby\n#!/bin/bash\n\nrvm use 3.3.4\n\nexec ruby $0 \"$@\"\n\necho \"I am a bash line too but I will never run\"\n\n#!/usr/bin/env ruby\nputs \"I run in ruby\"\n\nThere is some ugliness to this hack though. The interpreter only looks for the word \"ruby\" so the shebang line could be whatever including.\n#!/bin/bash\n\nrvm use 3.3.4\n\nexec ruby $0 \"$@\"\n\necho \"I am a bash line too but I will never run\"\n\n#!/I/am/a/rubyist\nputs \"I run in ruby\"\n\nwill work but\n#!/bin/bash\n\nrvm use 3.3.4\n\nexec ruby $0 \"$@\"\n\necho \"I am a bash line too but I will never run\"\n\n#!/bin/rb\nputs \"I run in ruby\"\n\nwill result in a print of \"no Ruby script found in input\"\nSource: ruby.c#L2681\nI am not a fan of such hacks in a language. Python lets you do something similar too - but it takes advantage of the fact that triple-quoted strings are side-effect free in Python and \"\"\"\": is the same as just a : which is two empty strings followed by a true in bash.\n#!/bin/bash\n'''':\nsource /path/to/venv/bin/activate.sh\n\nexec python $0 \"$@\"\n\necho \"I am a bash line too but I will never run\"\n'''\n\nprint(\"I am in python\")",
          "link": "https://agj.bearblog.dev/ruby-shebang-behavior/",
          "publishedOn": "2024-08-30T14:53:00.000Z",
          "wordCount": 716,
          "title": "Ruby shebang behavior",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://notes.jeddacp.com/work-notifications-set-to-off/",
          "author": null,
          "description": "First day back to work.\nOne of my self-sabotaging behavior is my occasional inability to set boundaries, specifically when it comes to my personal time and work.\nI rarely take days off from work. I know that it’s a problem because I have maxed out my vacation accrual days (like now) during several occasions. When I do take the time off from work, I still check my messages in case there’s something on fire and I need to fix it. I also have my notifications on in the evenings, because some of my co-workers also don’t have boundaries when it comes to work, and will ping me because they too are working late.\nI know, it’s bad.\nThis time around, very in line with my Do Not Disturb mentality, I decided to turn my Slack messages and work email notifications off during my time off.\nIt worked out so well. I mostly didn’t think about work. I didn’t see any messages that needed my attention right away. I didn’t have to think about the things I need to solve for my team during my time off. I had a clear separation of me enjoying my time off, and work that stresses me out more than it should.\nBecause of this, I decided to make this separation a little bit more permanent. I’m going to actually turn my (work) notifications off when it’s time to log off, so that I’m not unintentionally working during the evenings. We’ll see if this pans out.\nJust the little things to get my mental health sorted out.\n29/31 - Blaugust\n💬 Community Echoes\nAlways On - Freelancers and Notifications by Nathan Friend\nReply by email",
          "link": "https://notes.jeddacp.com/work-notifications-set-to-off/",
          "publishedOn": "2024-08-29T21:04:00.000Z",
          "wordCount": 1119,
          "title": "Work Notifications Set to Off",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1724965115.png"
        },
        {
          "id": "https://matanabudy.com/i-quit-my-job-to-focus-on-my-studies/",
          "author": null,
          "description": "Last week was my last day at work. By “work,” I mean my job as a software engineer at the data-security startup where I’ve been working for the last two and a half years.\nAs you can probably guess from the title, I quit my job to focus on my studies. I started a master’s degree in computational linguistics this year, and I've been juggling both work and university.\nWorking and studying simultaneously has its advantages—the first one is obvious: money. While academic life has its perks, financial gain isn’t usually one of them. Working while studying allowed me to make a living, plain and simple.\nBut there are other benefits, too—like advancing my career as a software engineer, working on interesting problems, interacting with customers, and having the routine of going to the office and spe…",
          "link": "https://matanabudy.com/i-quit-my-job-to-focus-on-my-studies/",
          "publishedOn": "2024-08-29T18:49:10.095Z",
          "wordCount": 1040,
          "title": "I Quit My Job to Focus on My Studies",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://birming.com/dear-dad/",
          "author": null,
          "description": "Dear Dad,\nToday marks the first anniversary of your passing. Not a day goes... eeh, what’s that you said?\n\"I know, you don't have to rub it in.\"\nHaha! Your sense of humor is intact. That's still one of the first things people mention when your name comes up: your wonderful sense of humor, and how incredibly kind you were.\nYou truly treated everyone with the same care and respect.\nI still remember the incident in the garden from when I was little. A drug addict had wandered in and fallen asleep there. Mom and all of us kids stood at a safe distance, nervously watching as you helped him. Before staggering off, he turned around with tears of gratitude and asked:\n\"Are you a priest?\"\nThat’s the kind of person you were. A helping hand and a life saver. A true hero.\nAs you know, your other son turns 50 today. But this day is not about birth or death. It’s a day of celebration and love. A day of unity, no matter the realm of residence.\nThank you for the long and wonderful time you gave us. Thank you for all the lovely memories that keep your spirit alive. Thank you for all the beautiful things you passed on to us.\nI'll end with your last words:\nI love you!",
          "link": "https://birming.com/dear-dad/",
          "publishedOn": "2024-08-28T18:10:00.000Z",
          "wordCount": 1355,
          "title": "Dear Dad",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1724864523.jpg"
        },
        {
          "id": "https://notes.jeddacp.com/memories-of-the-last-few-days/",
          "author": null,
          "description": "We’re finally back home.\nI’ve had a really good few days (since Friday) break. We did a lot in a relatively short amount of time.\nSo many indicators of a memorable time.\nTan lines in random places to indicate getting that much needed Vitamin D.\nPhotographs that froze time to be remembered and printed.\n(Enamel) Pins added to my collection of places visited.\nStickers. All of the stickers, even though pins have replaced that obsession.\nA couple of library cards to show that even during vacation, I still think about all of the books to be read in the future.\nMemories of full bellies because we ate a lot of really yummy food.\nI’m still processing everything. I’ll be posting all of the photos in the future, whether it be on here, or on the photoblog.\nLast day of my very short “vacation” today.\nI woke up this morning after having dreamt of work, with tears in my eyes. Is it respectable for me to throw a tantrum to show that I really don’t want to go back to work tomorrow?\nProbably not. For today, I’m going to try really hard to just not think about it.\nVacation is not over until it’s over.\n28/31 - Blaugust\nReply by email",
          "link": "https://notes.jeddacp.com/memories-of-the-last-few-days/",
          "publishedOn": "2024-08-28T18:08:00.000Z",
          "wordCount": 1053,
          "title": "Memories of the Last Few Days",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda-1724868410.png"
        },
        {
          "id": "https://wait.lol/polar-bear/",
          "author": null,
          "description": ":root {\n  --image-border: rgba(0,0,0,0.1);\n  --image-shadow: rgba(0,0,0,0.1);\n}\n@media (prefers-color-scheme: dark) {\n  :root {\n    --image-border: rgba(255,255,255,0.2);\n    --image-shadow: rgba(255,255,255,0.1);\n  }\n}\n.app-image {\n  box-shadow: 0 4px 8px var(--image-shadow);\n  border: 1px solid var(--image-border);\n}\n@media (prefers-color-scheme: dark) {\n  .app-image {\n    box-shadow: 0 4px 8px var(--image-shadow), 0 0 0 1px var(--image-border);\n  }\n}\nsup { font-size: 0.6em; }\n.footnotes { font-size: 0.8em; color: #666; }\n@media (prefers-color-scheme: dark) {\n  .footnotes { color: #aaa; }\n}\n.image-container {\n  display: flex;\n  justify-content: space-between;\n  gap: 10px;\n  margin: 60px 0;\n}\n.image-container img {\n  width: calc(50% - 5px);\n  height: auto;\n  object-fit: cover;\n  cursor: p…",
          "link": "https://wait.lol/polar-bear/",
          "publishedOn": "2024-08-28T09:12:00.000Z",
          "wordCount": 1270,
          "title": "Polar Bear",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/margaret-killjoy-anti-communist-communists?v=1724924772",
          "author": null,
          "description": "Author: Margaret Killjoy\nTitle: Anti-Communist communists\nSubtitle: Or: on capitalization and capitalism\nDate: August 28, 2024\nSource: Retrieved on 29th August 2024 from margaretkilljoy.substack.com\n\n It feels like two years ago but it was probably five. I drove from one side of North Carolina to another side of North Carolina because the “neo-confederates” were planning some kind of armed march through some small town and we needed all the numbers we could get to confront them. It worked, and we outnumbered them, and the people in town seemed grateful for our presence. \n After a few hours, it devolved into a strange shouting match alongside a rural road. The confederates on one side of the road, the anti-fascists on the other. We probably called them Nazis. They called us communists. \n “I…",
          "link": "https://theanarchistlibrary.org/library/margaret-killjoy-anti-communist-communists?v=1724924772",
          "publishedOn": "2024-08-29T09:46:12.000Z",
          "wordCount": 2027,
          "title": "Margaret Killjoy - Anti-Communist communists",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "8424",
            "url": "https://theanarchistlibrary.org/library/margaret-killjoy-anti-communist-communists.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/ignacy-jozwiak-interview-with-denys-pankratov-organizer-of-the-crane-operators-union-of-the-lvi?v=1724876882",
          "author": null,
          "description": "Author: Ignacy Jóźwiak\nTitle: Interview with Denys Pankratov, organizer of the Crane Operators Union of the Lviv Region — Ukraine\nSubtitle: Comrades from the Polish trade union OZZ IP, a member of the International Labour Network of Solidarity and Struggles give a voice to trade unionists from Ukraine\nDate: March 5, 2022\nSource: Retrieved on 28th August 2024 from laboursolidarity.org\n\n We met Denys and members of the Crane Operators Union in spring 2021, during online meetings and exchange of experience between unionised operators in Poland and Ukraine. At the time, protests were underway in both countries over pay rises and improved workplace safety in this sector. Ukrainian operators regularly informed about our actions and expressed solidarity in their social media. We wrote about the s…",
          "link": "https://theanarchistlibrary.org/library/ignacy-jozwiak-interview-with-denys-pankratov-organizer-of-the-crane-operators-union-of-the-lvi?v=1724876882",
          "publishedOn": "2024-08-28T20:28:02.000Z",
          "wordCount": 1216,
          "title": "Ignacy Jóźwiak - Interview with Denys Pankratov, organizer of the Crane Operators Union of the Lviv Region — Ukraine",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6516",
            "url": "https://theanarchistlibrary.org/library/ignacy-jozwiak-interview-with-denys-pankratov-organizer-of-the-crane-operators-union-of-the-lvi.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/whitney-kimball-revenge-spectrum-workers-on-strike-build-their-own-isp?v=1724876594",
          "author": null,
          "description": "Author: Whitney Kimball\nTitle: Revenge: Spectrum Workers on Strike Build Their Own ISP\nDate: April 14, 2021\nSource: Retrieved on 28th August 2024 from gizmodo.com\n\n If, for any number of reasons, you’d like to burn telecoms to the ground and build a new internet service provider on their smoldering remains, good news for you. New York City Spectrum workers, who’ve weathered an anguishing four-year strike, have built their own internet service provider. If the city throws its support behind it, People’s Choice Communications could liberate New Yorkers from cable gangsters once and for all. \n The city itself is almost constantly fighting Spectrum. With its rise to dominance in New York, Gov. Andrew Cuomo has tried to evict it; attorneys general had to chase it around for allegedly defrauding…",
          "link": "https://theanarchistlibrary.org/library/whitney-kimball-revenge-spectrum-workers-on-strike-build-their-own-isp?v=1724876594",
          "publishedOn": "2024-08-28T20:23:14.000Z",
          "wordCount": 2060,
          "title": "Whitney Kimball - Revenge: Spectrum Workers on Strike Build Their Own ISP",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "8924",
            "url": "https://theanarchistlibrary.org/library/whitney-kimball-revenge-spectrum-workers-on-strike-build-their-own-isp.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/patrick-le-trehondat-i-kostya-ukrainian-high-school-student-member-of-the-direct-action-union?v=1724876246",
          "author": null,
          "description": "Author: Patrick Le Tréhondat\nTitle: “I, Kostya, Ukrainian high school student, member of the Direct Action union”\nSubtitle: Interview by Patrick Le Tréhondat\nDate: April 19, 2023\nSource: Retrieved on 28th August 2024 from laboursolidarity.org\n\nPlease introduce yourself to our readers\n My name is Kostya, I am a student of the second grade. [Kostya lives in the Volyn region in northwestern Ukraine.] \nHow did you experience the beginning of the war?\n In fact, I sensed that a full-scale invasion would soon occur, but I did not expect it to be so large and destructive. I remember the beginning very well. My mother asked me to buy food, which was practically non-existent, and told me to stay at home. The first week was very scary, nobody knew what was going to happen. We were just hoping for the…",
          "link": "https://theanarchistlibrary.org/library/patrick-le-trehondat-i-kostya-ukrainian-high-school-student-member-of-the-direct-action-union?v=1724876246",
          "publishedOn": "2024-08-28T20:17:26.000Z",
          "wordCount": 1041,
          "title": "Patrick Le Tréhondat - “I, Kostya, Ukrainian high school student, member of the Direct Action union”",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "6116",
            "url": "https://theanarchistlibrary.org/library/patrick-le-trehondat-i-kostya-ukrainian-high-school-student-member-of-the-direct-action-union.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/volodya-vagner-builders-in-solidarity?v=1724876004",
          "author": null,
          "description": "Author: Volodya Vagner\nTitle: Builders in Solidarity\nSubtitle: A rambunctious Russian-speaking union shakes up Sweden’s labor movement\nDate: August 16, 2024\nSource: Retrieved on 28th August 2024 from meduza.io\n\n Sweden is usually outside of The Beet’s purview, but the migrant workers at the heart of its growing shadow economy are not. In the construction sector in particular, many of these migrants hail from the countries that emerged from the Soviet Union’s collapse and they still use Russian as their lingua franca. To fight for their rights and combat exploitation, hundreds of these workers have formed Builders in Solidarity (Solidariska Byggare, in Swedish). Freelance journalist Volodya Vagner reports on this rapidly growing Russian-speaking union shaking up the Swedish labor movement. …",
          "link": "https://theanarchistlibrary.org/library/volodya-vagner-builders-in-solidarity?v=1724876004",
          "publishedOn": "2024-08-28T20:13:24.000Z",
          "wordCount": 2562,
          "title": "Volodya Vagner - Builders in Solidarity",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "12396",
            "url": "https://theanarchistlibrary.org/library/volodya-vagner-builders-in-solidarity.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/fritz-brupbacher-bakunin-and-his-confession?v=1724856892",
          "author": null,
          "description": "Author: Fritz Brupbacher\nTitle: Bakunin and his Confession\nDate: 1929\nNotes: Original title: *Bakunin e la sua Confessione\n Fritz Brupbacher \n Témoins, III, n. 10–11, autunno-inverno 1955–56 \n via: finimondo.org/node/2118 \n Michael Bakunin: Der Satan der Revolte \n by Fritz Brupbacher First published in 1929\nSource: Retrieved on August 28, 2024 from https://www.elephanteditions.net/library/bakunin-and-his-confession?v=1724822630\n\nI\n \n For most contemporaries, Michail Bakunin is unknown. If a certain number of people only know him by name, that is enough to hate and slander him. But there are some who love him with fervour. \n Once Bakunin was truly a great name. While one would search in vain in the edition of the great encyclopedic dictionary published in 1866 for the name of Karl Marx, tha…",
          "link": "https://theanarchistlibrary.org/library/fritz-brupbacher-bakunin-and-his-confession?v=1724856892",
          "publishedOn": "2024-08-28T14:54:52.000Z",
          "wordCount": 9314,
          "title": "Fritz Brupbacher - Bakunin and his Confession",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "32044",
            "url": "https://theanarchistlibrary.org/library/fritz-brupbacher-bakunin-and-his-confession.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}