{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "ced116e7e17d31fc151eb05653942b5f0b206031",
          "author": "Sébastien Stormacq",
          "description": "Discover how this high-performance remote protocol securely streams graphics-intensive apps from cloud to device, with QUIC, client enhancements, and extended OS support.",
          "link": "https://aws.amazon.com/blogs/aws/nice-desktop-cloud-visualization-dcv-is-now-amazon-dcv/",
          "publishedOn": "2024-10-01T19:05:59.000Z",
          "wordCount": 2000,
          "title": "NICE DCV is now Amazon DCV with 2024.0 release",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/09/24/NiceIMG2.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": [
        {
          "id": "5aedbbd23e8bd759d82d3999de0db5fb2461fbaa",
          "author": "Otis Antoniou",
          "description": "This post was co-written with Paulo Barbosa, the COO of Banfico.  Introduction Banfico is a London-based FinTech company, providing market-leading Open Banking regulatory compliance solutions. Over 185 leading Financial Institutions and FinTech companies use Banfico to streamline their compliance process and deliver the future of banking. Under the EU’s revised PSD2, banks can use application […]",
          "link": "https://aws.amazon.com/blogs/architecture/how-banfico-built-an-open-banking-and-payment-services-directive-psd2-compliance-solution-on-aws/",
          "publishedOn": "2024-10-04T14:03:39.000Z",
          "wordCount": 1995,
          "title": "How Banfico built an Open Banking and Payment Services Directive (PSD2) compliance solution on AWS",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fc074d501302eb2b93e2554793fcaf50b3bf7291/2024/09/24/ARCHBLOG-992-arch-diagram-1118x630.png"
        }
      ]
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps & Developer Productivity Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": [
        {
          "id": "3c8053df1e60e8c4552906f954b9aabc2c5c8d81",
          "author": "Brian Beach",
          "description": "Generative AI is leading to many new features and capabilities. As a result, your employees may not know about all the new tools you are deploying. I was recently working with a customer that had deployed Amazon Q Developer for all their software developers. However, many developers didn’t know they had access to the productivity […]",
          "link": "https://aws.amazon.com/blogs/devops/how-to-identify-inactive-users-of-amazon-q-developer/",
          "publishedOn": "2024-10-04T22:06:26.000Z",
          "wordCount": 1531,
          "title": "How to identify inactive users of Amazon Q Developer",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/10/04/featured-image-template-3-1120x630.png"
        },
        {
          "id": "956d52eea644a70dfc8ebceae873bac6346bbd13",
          "author": "Marina Novikova",
          "description": "We are pleased to announce the general availability of the AWS Cloud Control provider for Pulumi, an modern infrastructure management platform, which allows our customers to adopt AWS innovations faster than ever before. AWS has consistently expanded its range of services to support any cloud workload, supporting over 200 fully featured services and introducing more […]",
          "link": "https://aws.amazon.com/blogs/devops/use-the-latest-aws-innovations-with-the-new-aws-cloud-control-provider-for-pulumi/",
          "publishedOn": "2024-10-04T20:29:54.000Z",
          "wordCount": 1241,
          "title": "Use the latest AWS innovations with the new AWS Cloud Control provider for Pulumi",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/10/04/Use-the-latest-AWS-innovations-with-the-new-AWS-Cloud-Control-provider-for-Pulumi-1120x630.png"
        },
        {
          "id": "127ceb55ec20227577714c7d0c5af63df6e6cc7b",
          "author": "Jonathan Vogel",
          "description": "In this blog, we will explore how Amazon Q Developer Agent for code transformation accelerates Java application upgrades. We will examine the benefits of this Generative AI-powered agent and outline strategies to achieve maximal acceleration, drawing from real-world success stories and best practices. Benefits of using Amazon Q Developer to upgrade your applications Amazon Q […]",
          "link": "https://aws.amazon.com/blogs/devops/accelerate-application-upgrades-with-amazon-q-developer-agent-for-code-transformation/",
          "publishedOn": "2024-10-03T13:43:55.000Z",
          "wordCount": 2436,
          "title": "Accelerate application upgrades with Amazon Q Developer agent for code transformation",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/10/03/Slide1.png"
        },
        {
          "id": "997dd18c527aa0428e12fdb6d20bc3309fd39e11",
          "author": "David Ernst",
          "description": "As organizations increasingly adopt Amazon Q Developer, understanding how developers use it is essential. Diving into specific telemetry events and user-level data clarifies how users interact with Amazon Q Developer, offering insights into feature usage and developer behaviors. This granular view, accessible through logs, is vital for identifying trends, optimizing performance, and enhancing the overall […]",
          "link": "https://aws.amazon.com/blogs/devops/exploring-telemetry-events-in-amazon-q-developer/",
          "publishedOn": "2024-09-30T19:58:09.000Z",
          "wordCount": 4005,
          "title": "Exploring Telemetry Events in Amazon Q Developer",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/09/30/Exploring_TelemetryEventsinAmazonQ_Developer_ppt-1121x630.png"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "95dfc4f3cbdd61e24d37d2443925fb6f15ae679e",
          "author": "Geeta Gharpure",
          "description": "Introduction We are pleased to announce the launch of the Neuron Helm Chart, which streamlines the deployment of AWS Neuron components on Amazon Elastic Kubernetes Service (Amazon EKS). With this new Helm Chart, you can now seamlessly install the necessary Kubernetes artifacts needed to run training and inference workloads on AWS Trainium and AWS Inferentia instances. Until now, […]",
          "link": "https://aws.amazon.com/blogs/containers/announcing-aws-neuron-helm-chart/",
          "publishedOn": "2024-10-03T14:48:48.000Z",
          "wordCount": 2006,
          "title": "Announcing AWS Neuron Helm Chart",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/09/30/Featured-images-for-Containers-Blog-3-1260x630.jpg"
        },
        {
          "id": "cd545d279ab991a3ed8f657b7adc59e9b1f42900",
          "author": "Piyush Shukla",
          "description": "After careful consideration, we have made the decision to discontinue AWS App Mesh, effective September 30th, 2026. Until this date, existing AWS App Mesh customers will be able to use the service as normal, including creating new resources and onboarding new accounts via the AWS CLI and AWS CloudFormation. Additionally, AWS will continue to provide […]",
          "link": "https://aws.amazon.com/blogs/containers/migrating-from-aws-app-mesh-to-amazon-vpc-lattice/",
          "publishedOn": "2024-10-01T17:48:04.000Z",
          "wordCount": 2659,
          "title": "Migrating from AWS App Mesh to Amazon VPC Lattice",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/09/30/Featured-images-for-Containers-Blog-6-1260x630.jpg"
        },
        {
          "id": "533837ea15587ac1d6c7f1df3cb349aa1fad90ac",
          "author": "Jason Janiak",
          "description": "Introduction In August 2022, Amazon Elastic Kubernetes Service (Amazon EKS) announced the availability of an Amazon EKS-optimized bundle of Kubecost for cluster cost visibility. The bundle is available to Amazon EKS users free of charge and enables users to gain deeper cost insights into Kubernetes resources, such as namespace, cluster, pod, and organizational concepts (for […]",
          "link": "https://aws.amazon.com/blogs/containers/aws-and-kubecost-collaborate-to-deliver-kubecost-2-0-for-amazon-eks-users/",
          "publishedOn": "2024-09-30T19:16:39.000Z",
          "wordCount": 1965,
          "title": "AWS and Kubecost Collaborate to Deliver Kubecost 2.0 for Amazon EKS Users",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/09/27/Featured-images-for-Containers-Blog-2-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=336004",
          "author": "Jamal Kanj",
          "description": "The Iranian retaliation against Israel followed a week of political ploy and military subterfuge. On the political level, Iran’s newly elected reformist president extended conciliatory gestures at the UN General Assembly, while the Supreme Leader issued somber statements of resignation in what seemed to be an acceptance of fate. On the military front, U.S. intelligence  More\nThe post Netanyahu’s Intoxicated Euphoria will Turn into a Prolonged Hangover appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/07/netanyahus-intoxicated-euphoria-will-turn-into-a-prolonged-hangover/",
          "publishedOn": "2024-10-07T06:01:02.000Z",
          "wordCount": null,
          "title": "Netanyahu’s Intoxicated Euphoria will Turn into a Prolonged Hangover",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=336031",
          "author": "Melvin Goodman",
          "description": "Several days after the Washington Post bogusly declared that Israel has recovered the “military primacy” that it lost a year ago, the New York Times goes one step further.  It obscenely proclaims that the Israeli military has regained its “stature.”  We’re are talking about a sophisticated and lethal military force that has been facing Arab adversaries who lack air power and air defense for the past 57 years.  Israel, a superpower in the Middle East, has been facing Arab states that have not threatened Israel since Egyptian President Anwar Sadat capitulated in Jerusalem 45 years ago.  As a result of that decision, Sadat lost his life to an assassin. More\nThe post The NYT’s Proclaims Israel’s Military Has Reclaimed Its “Stature” appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/07/the-nyts-proclaims-israels-military-has-reclaimed-its-stature/",
          "publishedOn": "2024-10-07T06:00:08.000Z",
          "wordCount": null,
          "title": "The NYT’s Proclaims Israel’s Military Has Reclaimed Its “Stature”",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=336047",
          "author": "L. Michael Hager",
          "description": "Israeli Prime Minister Benjamin Netanyahu may not have anticipated October 7. But the Hamas massacre that day gave him a welcome opportunity to execute a long=held Israeli plan. Its steps are to create a Greater Israel; destroy Hamas, Hezbollah and other adversaries in Iraq, Syria and Yemen; and quash Iran's budding nuclear program.  Over the past 12 months, that plan has unfolded successively in four principal locations: Gaza, the West Bank (and East Jerusalem), Lebanon and now Iran. More\nThe post Bibi’s Game Plan appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/07/bibis-game-plan/",
          "publishedOn": "2024-10-07T05:59:57.000Z",
          "wordCount": null,
          "title": "Bibi’s Game Plan",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=336231",
          "author": "Robert Lipsyte",
          "description": "After Joe Biden was shuffled off stage on trumped-up charges of senility, I started thinking seriously about the weaponization of old age in our world. Who gets credit for old age and who gets the boot? At 86, I share that affliction, pervasive among the richest, healthiest, and/or luckiest of us, who manage to hang  More\nThe post Growing Old in the Age (And That’s the Appropriate Word!) of Trump appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/07/growing-old-in-the-age-and-thats-the-appropriate-word-of-trump/",
          "publishedOn": "2024-10-07T05:55:52.000Z",
          "wordCount": null,
          "title": "Growing Old in the Age (And That’s the Appropriate Word!) of Trump",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=336237",
          "author": "Binoy Kampmark",
          "description": "When established, well fed and fattened, a credible professional tires from the pursuit.  One can get complacent, flatulently confident, self-assured.  From that summit, the inner lecturer emerges, along with a disease: false expertise. The Australian journalist Peter Greste has faithfully replicated the pattern.  At one point in his life, he was lean, hungry and determined to get the  More\nThe post Handmaiden to the Establishment: Peter Greste’s Register of Journalists appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/07/handmaiden-to-the-establishment-peter-grestes-register-of-journalists/",
          "publishedOn": "2024-10-07T05:55:51.000Z",
          "wordCount": null,
          "title": "Handmaiden to the Establishment: Peter Greste’s Register of Journalists",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=336002",
          "author": "Ralph Nader",
          "description": "With little more than four weeks to go before the November elections, polls show the Trump/Harris race as “too close to call.” Winning should be a breeze for Harris and the other Democratic candidates. The GOP’s Congressional votes and policies are bad for women, children, and workers. The GOP doesn’t recognize and act against climate  More\nThe post Will the Democratic Party Stop Genocide and Champion Winning Domestic Issues in Time for November? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/07/will-the-democratic-party-stop-genocide-and-champion-winning-domestic-issues-in-time-for-november/",
          "publishedOn": "2024-10-07T05:55:35.000Z",
          "wordCount": null,
          "title": "Will the Democratic Party Stop Genocide and Champion Winning Domestic Issues in Time for November?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=336055",
          "author": "Manuel Perez-Rocha",
          "description": "As hired gunmen kill human rights leaders to protect private interests, transnational corporations are suing Honduras for halting “mafia-style” investments made during coup-instituted regimes, before the current government led by Xiomara Castro. Juan López is the latest in a long list of environmental defenders whose lives have been taken for opposing extractivism, often linked to  More\nThe post A Tribute to a Brave Anti-Mining Activist: ¡Juan López, Presente! appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/07/a-tribute-to-a-brave-anti-mining-activist-juan-lopez-presente/",
          "publishedOn": "2024-10-07T05:55:23.000Z",
          "wordCount": null,
          "title": "A Tribute to a Brave Anti-Mining Activist: ¡Juan López, Presente!",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=336235",
          "author": "John Kendall Hawkins",
          "description": "Greg Palast is known for his investigative reports for the Guardian and bestsellers including The Best Democracy Money Can Buy.   Palast has just released his film about the latest attacks on the right to vote.  It’s called, Vigilantes Inc: America’s New Vote Suppression Hitmen, narrated by Rosario Dawson and produced by Martin Sheen.  Leonardo DiCaprio just released the  More\nThe post December 12, 2024:  A Day That Will Live in Infamy? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/07/december-12-2024-a-day-that-will-live-in-infamy/",
          "publishedOn": "2024-10-07T05:55:08.000Z",
          "wordCount": null,
          "title": "December 12, 2024:  A Day That Will Live in Infamy?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=336228",
          "author": "Joe Allen",
          "description": "The Teamsters backhanded endorsement of Donald Trump for president has caused an uproar in the U.S. trade movement. Teamster General President Sean O’Brien, who just a year and a half ago was being touted as a new militant leader of the Teamsters, hosted at Labor Notes conferences, toured the country with Bernie Sanders and Sarah Nelson, and received enthusiastic coverage in  More\nThe post Can Teamsters Against Trump Beat the MAGA Vote? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/07/can-teamsters-against-trump-beat-the-maga-vote/",
          "publishedOn": "2024-10-07T05:44:28.000Z",
          "wordCount": null,
          "title": "Can Teamsters Against Trump Beat the MAGA Vote?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=336051",
          "author": "Dean Baker",
          "description": "The September employment report was far stronger than generally expected. The unemployment rate edged down to 4.1 percent, while the establishment survey showed the economy adding 254,000 jobs. In addition, the jobs numbers for the prior two months were revised up by 72,000. This report should end any fears that the economy was heading for  More\nThe post Unemployment Edges Lower, Economy Adds 254,000 Jobs appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/07/unemployment-edges-lower-economy-adds-254000-jobs/",
          "publishedOn": "2024-10-07T05:35:03.000Z",
          "wordCount": null,
          "title": "Unemployment Edges Lower, Economy Adds 254,000 Jobs",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=336037",
          "author": "Korkut Boratav",
          "description": "Two well-known economists from Turkey, Ahmet Tonak and Sungar Savran, have brought together a selection of their papers and essays presented as Chapters in their book, In the Tracks of Marx’s Capital (Palmgrave). The authors are prominent representatives of contemporary Marxist social science in Turkey. These are papers on Marxist political economy. The scope is  More\nThe post The Meaning of Marx in 21st Century Capitalism appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/07/the-meaning-of-marx-in-21st-century-capitalism/",
          "publishedOn": "2024-10-07T05:15:05.000Z",
          "wordCount": null,
          "title": "The Meaning of Marx in 21st Century Capitalism",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335996",
          "author": "Ray Acheson",
          "description": "With the world at war, the feeling that the international system has failed humanity is increasing. The challenges posed to international law and the United Nations are structural—a minority of violent, militarized governments dictate the terms and play by their own rules. But can the will of the majority result in real change?\nTo read this article, log in here or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Matching Words With Deeds at the United Nations and Beyond appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/06/matching-words-with-deeds-at-the-united-nations-and-beyond/",
          "publishedOn": "2024-10-06T06:20:59.000Z",
          "wordCount": null,
          "title": "Matching Words With Deeds at the United Nations and Beyond",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=336007",
          "author": "Susie Day",
          "description": "Photo Courtesy of Pankaj Mishra. Congrats to renowned author and novelist Pankaj Mishra, who recently won Canada’s prestigious Weston International Award! As winner of this impressive honor, Pankaj was asked to deliver a lecture at the Royal Ontario Museum, excerpts of which were to be published in Canada’s paper of record, the Globe and Mail. […]\nTo read this article, log in here or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post WRITERS! Win More Prizes Than Pankaj Mishra! appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/06/writers-win-more-prizes-than-pankaj-mishra/",
          "publishedOn": "2024-10-06T05:47:03.000Z",
          "wordCount": null,
          "title": "WRITERS! Win More Prizes Than Pankaj Mishra!",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335811",
          "author": "Jeffrey St. Clair",
          "description": "Iranian missiles targeting Nevatim Air Base in southern Israel. Screengrab from a video on X. + This week, Israel bombed Beirut and southern Lebanon. Iran bombed Israeli military bases and intelligence sites. The US and Israel launched interceptor missiles at Iranian rockets. Israel invaded Lebonan with ground troops. The Houthis launched drone attacks on Israel. […]\nTo read this article, log in here or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post The Making of a Wider War appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/05/the-making-of-a-wider-war/",
          "publishedOn": "2024-10-05T16:51:36.000Z",
          "wordCount": null,
          "title": "The Making of a Wider War",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335707",
          "author": "Melvin Goodman",
          "description": "The mainstream media has been largely critical of Russian President Vladimir Putin’s dangerous use of military power, and largely supportive of Israeli Prime Minister Benjamin Netanyahu’s equally dangerous use of military power.  The leading proponents of these contrasting views have been David Ignatius in the Washington Post and Bret Stephens in the New York Times.   More\nThe post Netanyahu’s Dangerous Militarism appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/04/netanyahus-dangerous-militarism/",
          "publishedOn": "2024-10-04T06:03:34.000Z",
          "wordCount": null,
          "title": "Netanyahu’s Dangerous Militarism",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335511",
          "author": "Henry Giroux",
          "description": "At a campaign rally in Erie, Pennsylvania, Trump invoked a chilling convergence of law, order, and violence—a cornerstone of what can only be described as his politics of disposability. By referencing The Purge, a dystopian film where the government legalizes all forms of violence, including murder, for 12 hours, Trump escalates his rhetoric to a dangerous metaphor. In his hands, “the purge” becomes more than just a narrative device; it embodies a vision in which state-sanctioned violence reaches its grotesque climax. More\nThe post Trump, The Purge, Black Nazis and the Language of Apocalyptic Lies and Violence appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/04/trump-the-purge-black-nazis-and-the-language-of-apocalyptic-lies-and-violence/",
          "publishedOn": "2024-10-04T06:00:40.000Z",
          "wordCount": null,
          "title": "Trump, The Purge, Black Nazis and the Language of Apocalyptic Lies and Violence",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335814",
          "author": "Nathaniel St. Clair",
          "description": "Please support our annual fund drive.\nThe post Capitalism and Journalism Don’t Mix appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/04/capitalism-and-journalism-dont-mix/",
          "publishedOn": "2024-10-04T05:59:53.000Z",
          "wordCount": null,
          "title": "Capitalism and Journalism Don’t Mix",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335619",
          "author": "Jeffrey St. Clair",
          "description": "This week’s vice-presidential debate, one of the most tedious and dull in US history, was praised by the punditocracy for its civility. Is civility in politics what we want when the current government is arming a genocide and the rival campaign wants to arrest 15 million people and deport them? More\nThe post Notes From a Phony Campaign: The Great Un-Debate appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/04/notes-from-a-phony-campaign-the-great-un-debate/",
          "publishedOn": "2024-10-04T05:59:43.000Z",
          "wordCount": null,
          "title": "Notes From a Phony Campaign: The Great Un-Debate",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335279",
          "author": "Matthew Stevenson",
          "description": "Vance walked off the stage holding his wife’s hand, with the look of a man who had just learned that he is the legal heir to a vast, if dissipated political fortune, and that to cash it in all he has to do is to mouth clichés and deceptions about illegal immigrants streaming across the southern border or alternatives theories of January 6. More\nThe post JD Vance: Mob Lawyer appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/04/jd-vance-mob-lawyer/",
          "publishedOn": "2024-10-04T05:58:34.000Z",
          "wordCount": null,
          "title": "JD Vance: Mob Lawyer",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335567",
          "author": "Marjorie Hecht",
          "description": "Humans have had relationships with their pets for thousands of years, talking to them, coddling them, and imbuing them with human attributes. But are these animals “thinking,” and do nonhuman animals have the same sorts of feelings that humans have? Most people with pets would say “yes.” What does the science say? In recent decades,  More\nThe post Do Other Animals Have Consciousness? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/04/do-other-animals-have-consciousness/",
          "publishedOn": "2024-10-04T05:57:37.000Z",
          "wordCount": null,
          "title": "Do Other Animals Have Consciousness?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335833",
          "author": "Iain Boal",
          "description": "At three o’clock on a spring afternoon in 1949, in a sixth floor studio above University Avenue in Berkeley, volunteer sound-proofers, “hammering down the carpet at the last moment”, paused in their work. Lewis Hill stepped to a microphone and in his distinctive baritone announced for the first time: “This is KPFA, listener-sponsored radio in Berkeley.” It  More\nThe post The Revolution Will Not Be Podcast: Pacifica Radio at 75 appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/04/the-revolution-will-not-be-podcast-pacifica-radio-at-75/",
          "publishedOn": "2024-10-04T05:57:36.000Z",
          "wordCount": null,
          "title": "The Revolution Will Not Be Podcast: Pacifica Radio at 75",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335383",
          "author": "Daniel Warner",
          "description": "Israeli ground troops enter Lebanon. Iran sends missiles into Israel and Prime Minister Benjamin Netanyahu promises to retaliate. Violence in the Middle East escalates, but this didn’t have to happen. In another example of the bizarre co-dependent nature of U.S./Israel relation, last week news sources reported that Israel was ready to agree to a U.S.  More\nThe post No More Bro Hugs: Time to Reset U.S./Israel Relations appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/04/no-more-bro-hugs-time-to-reset-u-s-israel-relations/",
          "publishedOn": "2024-10-04T05:57:08.000Z",
          "wordCount": null,
          "title": "No More Bro Hugs: Time to Reset U.S./Israel Relations",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335286",
          "author": "Eve Ottenberg",
          "description": "For the first time since Bill Clinton’s 1996 re-election campaign, the 1.3-million member Teamsters union declined to endorse a Democrat running for president. Buit while Teamsters chieftain Sean O’Brien, known to hobnob with Trump at Mar-A-Lago, is busy not endorsing anyone, unions have plenty to do that’s more mundane and more important: namely strikes and  More\nThe post Elections, War and What They Mean for Labor (With or Without Presidential Endorsements) appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/04/elections-war-and-what-they-mean-for-labor-with-or-without-presidential-endorsements/",
          "publishedOn": "2024-10-04T05:56:05.000Z",
          "wordCount": null,
          "title": "Elections, War and What They Mean for Labor (With or Without Presidential Endorsements)",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335557",
          "author": "Robert Hunziker",
          "description": "Consumer pocketbooks are taking the heat. Climate change is no longer a theoretical issue that will happen at some distant point in the future, like 2050 or 2100. Already, unprecedented climate change is happening on a regular basis and clobbering the American capitalistic system via consumer pocketbooks. People can’t afford ordinary life. They’re priced out  More\nThe post Can You Afford Climate Change? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/04/can-you-afford-climate-change/",
          "publishedOn": "2024-10-04T05:55:37.000Z",
          "wordCount": null,
          "title": "Can You Afford Climate Change?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335703",
          "author": "Rick Baum",
          "description": "“…he [Biden] has been the most effective president in the modern history of our country…” Senator Bernie Sanders “We know that most people say that they think the economy has performed poorly under the Biden-Harris administration. However, we also know that by standard economic measures the administration has been an incredible success story.” Dean Baker  More\nThe post Wealth, Income, Poverty, Homelessness, and Hunger: Biden’s Record appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/04/wealth-income-poverty-homelessness-and-hunger-bidens-record/",
          "publishedOn": "2024-10-04T05:55:32.000Z",
          "wordCount": null,
          "title": "Wealth, Income, Poverty, Homelessness, and Hunger: Biden’s Record",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335219",
          "author": "Roy Eidelson",
          "description": "It is irony at its most bitter. Not so very long ago, hundreds of white supremacists marched in Charlottesville, Virginia. With tiki-torches held high, they chanted “Jews will not replace us!” And yet here we are, seven years later, and apparently these fanatical card-carrying antisemites have indeed been “replaced” in the minds of many Americans. Why? Because  More\nThe post Weaponizing Antisemitism 101: A Back-to-School Special appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/04/weaponizing-antisemitism-101-a-back-to-school-special/",
          "publishedOn": "2024-10-04T05:55:26.000Z",
          "wordCount": null,
          "title": "Weaponizing Antisemitism 101: A Back-to-School Special",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335561",
          "author": "HELEN BENEDICT",
          "description": "With the first anniversary of the October 7th Hamas attack on Israel approaching, the death toll in Gaza climbing to more than 41,500, and Israel inflicting ever more extreme violence on the West Bank and now on Lebanon as well, something very different happened recently in a poky classroom at Columbia University. Two young men, one Palestinian and one Israeli, both of whom  More\nThe post “What Should I Do With This Pain?” appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/04/what-should-i-do-with-this-pain/",
          "publishedOn": "2024-10-04T05:54:52.000Z",
          "wordCount": null,
          "title": "“What Should I Do With This Pain?”",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335471",
          "author": "John Feffer",
          "description": "Israel has assassinated the leader of Hezbollah and killed many of its members by way of booby-trapped pagers and walky-talkies. After a blitzkrieg bombing campaign, Israel once again invaded Lebanon this week to escalate its campaign against the paramilitary-cum-political party. Meanwhile, it continues to wage war against Hamas in Gaza. It has bombed various locations  More\nThe post Target: Iran appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/04/target-iran-2/",
          "publishedOn": "2024-10-04T05:53:52.000Z",
          "wordCount": null,
          "title": "Target: Iran",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335690",
          "author": "Jack Rasmus",
          "description": "Yesterday’s Vice Presidential debate between Republican J.D. Vance and Democrat Tim Walz might have been called the ‘First Presidential Debate of 2028’. Based on the reasonable debate performances by both, Vance and Walz are clearly now the front runners as presidential candidates for their parties in the next 2028 national election. Of course, the bar  More\nThe post The First Vice-Presidential Debate appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/04/the-first-vice-presidential-debate/",
          "publishedOn": "2024-10-04T05:53:03.000Z",
          "wordCount": null,
          "title": "The First Vice-Presidential Debate",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=335671",
          "author": "Kim C. Domenico",
          "description": "Faced with a rapid disintegration of the class equilibrium due to the developing structural crisis of capital, key sectors of monopoly-finance capital—including fossil capital, the new tech-finance elite, and the military-industrial complex—turned to neoliberalism, and then when that began to fail, increasingly to neofascism.   – Gerald Home, writer for Monthly Review The present oneness of the totality  More\nThe post Workin’ Out at the Misfitness Gym, or, Dreaming Big appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/10/04/workin-out-at-the-misfitness-gym-or-dreaming-big/",
          "publishedOn": "2024-10-04T05:51:53.000Z",
          "wordCount": null,
          "title": "Workin’ Out at the Misfitness Gym, or, Dreaming Big",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": [
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=30970",
          "author": "Natalia Emanuel and Emma Harrington",
          "description": "With the rise of generative AI (genAI) tools such as ChatGPT, many worry about the tools’ potential displacement effects in the labor market and the implications for income inequality. In supplemental questions to the February 2024 Survey of Consumer Expectations (SCE), we asked a representative sample of U.S. residents about their experience with genAI tools. We find that relatively few people have used genAI, but that those who have used it have a bleaker outlook on its impacts on jobs and future inequality.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/10/exposure-to-generative-ai-and-expectations-about-inequality/",
          "publishedOn": "2024-10-02T13:00:00.000Z",
          "wordCount": 3828,
          "title": "Exposure to Generative AI and Expectations About Inequality",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/10/LSE_2024_exposure-to-gen_AI_emanuel_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=31733",
          "author": "Andres Aradillas Fernandez, Martin Hiti, and Asani Sarkar",
          "description": "Recent events have heightened awareness of systemic risk stemming from nonbank financial sectors. For example, during the COVID-19 pandemic, liquidity demand from nonbank financial entities caused a “dash for cash” in financial markets that required government support. In this post, we provide a quantitative assessment of systemic risk in the nonbank sectors. Even though these sectors have heterogeneous business models, ranging from insurance to trading and asset management, we find that their systemic risk has common variation, and this commonality has increased over time. Moreover, nonbank sectors tend to become more systemic when banking sector systemic risk increases.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/10/are-nonbank-financial-institutions-systemic/",
          "publishedOn": "2024-10-01T11:44:51.000Z",
          "wordCount": 4589,
          "title": "Are Nonbank Financial Institutions Systemic?",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/10/LSE_2024_systemic-nonbank_sarkar_460.jpg"
        }
      ]
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45619",
          "author": "deanbaker1",
          "description": "from Dean Baker It is more than a bit bizarre reading pieces that talk about automation or job-killing AI as something new and alien. These are forms of productivity growth. They allow more goods and services to be produced for each hour of human labor. Productivity growth is usually thought of as a good thing. […]",
          "link": "https://rwer.wordpress.com/2024/10/07/automation-is-called-productivity-growth/",
          "publishedOn": "2024-10-07T00:34:00.000Z",
          "wordCount": 4399,
          "title": "Automation is called “productivity growth”",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45613",
          "author": "Asad Zaman",
          "description": "from Asad Zaman and WEA Pedagogy Blog Introduction: Beyond the Jungle For centuries, capitalism has told us that land is a commodity to be bought, sold, and exploited for profit. It has also sold us a dangerous myth: that humans are inherently competitive, isolated individuals, destined to fight for survival in a brutal world. According […]",
          "link": "https://rwer.wordpress.com/2024/10/04/escaping-the-jungle-rethinking-land-ownership-for-a-sustainable-future/",
          "publishedOn": "2024-10-04T16:33:39.000Z",
          "wordCount": 4979,
          "title": "Escaping the jungle: Rethinking land ownership for a sustainable Future",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=279902",
          "author": "Yves Smith",
          "description": "A extensive report from North Carolina gives an idea of the extent of damage and the (largely community and informal so far) recovery efforts.",
          "link": "https://www.nakedcapitalism.com/2024/10/scenes-from-helene-a-report-from-north-carolina.html",
          "publishedOn": "2024-10-07T05:39:59.000Z",
          "wordCount": 5110,
          "title": "Scenes from Helene: A Report from North Carolina",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279901",
          "author": "Yves Smith",
          "description": "Michael Hudson recounts how he was there when the US decided to rely on proxies like Israel and Ukraine after the draft become a third rail.",
          "link": "https://www.nakedcapitalism.com/2024/10/richard-d-wolff-michael-hudson-middle-east-exploding-ukraine-crumbling-the-us-take-action.html",
          "publishedOn": "2024-10-07T05:28:01.000Z",
          "wordCount": 11802,
          "title": "Richard D. Wolff & Michael Hudson: Middle East Exploding, Ukraine Crumbling! The US Take Action?",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279905",
          "author": "Lambert Strether",
          "description": "As bad as you would expect. Yellow wader time!",
          "link": "https://www.nakedcapitalism.com/2024/10/new-cdc-respiratory-virus-dashboard-caves-to-covid-minimizers-deceives-those-who-want-to-stay-safe.html",
          "publishedOn": "2024-10-06T20:25:30.000Z",
          "wordCount": 7010,
          "title": "New CDC Respiratory Virus “Community Snapshot” Caves to Covid Minimizers, Deceives Those Who Want to Stay Safe",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/10/1_cdc.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279884",
          "author": "Lambert Strether",
          "description": "Our colossal daily links",
          "link": "https://www.nakedcapitalism.com/2024/10/links-10-6-2024.html",
          "publishedOn": "2024-10-06T10:58:27.000Z",
          "wordCount": 24206,
          "title": "Links 10/6/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/10/helene_ga.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279897",
          "author": "Lambert Strether",
          "description": "FTC’s latest findings bolster claims of collusion among shale producers raised in ongoing Congressional probes and major class-action lawsuits.",
          "link": "https://www.nakedcapitalism.com/2024/10/evidence-ceos-tried-to-illegally-boost-oil-prices-grows-as-ftc-bars-hess-from-chevrons-board.html",
          "publishedOn": "2024-10-06T10:55:45.000Z",
          "wordCount": 4319,
          "title": "Evidence CEOs Tried to Illegally Boost Oil Prices Grows as FTC Bars Hess from Chevron’s Board",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279823",
          "author": "Yves Smith",
          "description": "Our thunderous daily links: Thai turtle rescue, viruses correlated with Alzheimers, Covid heart damage, Oz real estate as Ponzi, Cape of Good Horn crisis? Israel pounds Lebanon cities, Iran warns of oil destruction, US spying on political affiliations, Kamala courts Visa, Biden warns of election violence, censorship coalition",
          "link": "https://www.nakedcapitalism.com/2024/10/links-10-5-2024.html",
          "publishedOn": "2024-10-05T10:55:34.000Z",
          "wordCount": 22889,
          "title": "Links 10/5/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/10/00-bee.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279863",
          "author": "Yves Smith",
          "description": "A catalogue of the displacement all over the Middle East that has resulted from Israel's campaign in Gaza and Lebanon.",
          "link": "https://www.nakedcapitalism.com/2024/10/a-year-of-escalating-conflict-in-the-middle-east-has-ushered-in-a-new-era-of-regional-displacement.html",
          "publishedOn": "2024-10-05T09:10:41.000Z",
          "wordCount": 9445,
          "title": "A Year of Escalating Conflict in the Middle East Has Ushered in a New Era of Regional Displacement",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279850",
          "author": "Yves Smith",
          "description": "New and revised labor market data suddenly says the US economy is just fine. Mr. Market's continued rate cuts look off the table for now.",
          "link": "https://www.nakedcapitalism.com/2024/10/ok-forget-it-false-alarm-labor-market-is-fine-bad-stuff-last-month-was-revised-away-wages-jumped-no-more-rate-cuts-needed.html",
          "publishedOn": "2024-10-05T08:35:51.000Z",
          "wordCount": 6347,
          "title": "OK, Forget it, False Alarm, Labor Market Is Fine, Bad Stuff Last Month Was Revised Away, Wages Jumped. No More Rate Cuts Needed?",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/10/00-labor-.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279816",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Poltiics, syndemics; New RCP chart (it's tied) and new Covid charts (not worsening); Kamala to throw Khan, Gensler under the bus (ka-ching); Boeing strike continues, Warren and Blumenthal call for criminal investigations of executives ~",
          "link": "https://www.nakedcapitalism.com/2024/10/200pm-water-cooler-10-4-2024.html",
          "publishedOn": "2024-10-04T18:00:55.000Z",
          "wordCount": 15151,
          "title": "2:00PM Water Cooler 10/4/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/10/mcgurk_1.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=279812",
          "author": "Yves Smith",
          "description": "Looking at some information limits and biases in the ever-intensifying Israel-Axis of Resistance conflict.",
          "link": "https://www.nakedcapitalism.com/2024/10/israel-axis-of-resistance-escalation-and-the-importance-of-the-minority-report.html",
          "publishedOn": "2024-10-04T15:53:22.000Z",
          "wordCount": 16445,
          "title": "Israel-Axis of Resistance Escalation and the Importance of the Minority Report",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/10/Screen-Shot-2024-10-04-at-11.44.49-PM.png"
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "4j6QWqeVFn6qzs0Md0LK7h",
          "author": "Manish Arora",
          "description": "Over the past couple of weeks, Cloudflare's DDoS protection systems have automatically and successfully mitigated multiple hyper-volumetric L3/4 DDoS attacks exceeding 3 billion packets per second (Bpps). Our systems also automatically mitigated multiple attacks exceeding 3 terabits per second (Tbps), with the largest ones exceeding 3.65 Tbps. The scale of these attacks is unprecedented.",
          "link": "https://blog.cloudflare.com/how-cloudflare-auto-mitigated-world-record-3-8-tbps-ddos-attack",
          "publishedOn": "2024-10-02T13:00:00.000Z",
          "wordCount": 2681,
          "title": "How Cloudflare auto-mitigated world record 3.8 Tbps DDoS attack",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7pofsKkChZMjVLdvsjg7s8/c4bf9589d3009ccae318a828f7f52784/BLOG-2586_OG.png"
        },
        {
          "id": "2dMuW3phhA9ClF8ROOAYPH",
          "author": "David Belson",
          "description": "On Monday, September 30, customers on Verizon’s mobile network in multiple cities across the United States reported experiencing a loss of connectivity. HTTP request traffic data from Verizon’s mobile ASN (AS6167) showed nominal declines across impacted cities.",
          "link": "https://blog.cloudflare.com/impact-of-verizons-september-30-outage-on-internet-traffic",
          "publishedOn": "2024-10-01T00:32:00.000Z",
          "wordCount": 1184,
          "title": "Impact of Verizon’s September 30 outage on Internet traffic",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4riEx6QIoNCWbIgsLUfY6r/0ae5b09c779aad3c2167e29d41f6251a/BLOG-2587_OG.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": [
        {
          "id": "https://medium.com/p/eaf62b27fbc1",
          "author": "Capital One Tech",
          "description": "Discover how Capital One uses Web NFC to authenticate customers on Android mobile devices.",
          "link": "https://medium.com/capital-one-tech/using-web-nfc-for-authentication-on-android-mobile-devices-eaf62b27fbc1?source=rss----3db3a67cb648---4",
          "publishedOn": "2024-10-02T13:51:01.000Z",
          "wordCount": 2781,
          "title": "Using Web NFC for authentication on Android mobile devices",
          "imageUrl": "https://miro.medium.com/v2/resize:fit:1200/0*UzFVzZR5nlbW21PQ.png"
        }
      ]
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": [
        {
          "id": "https://kubernetes.io/blog/2024/10/02/steering-committee-results-2024/",
          "author": null,
          "description": "The 2024 Steering Committee Election is now complete. The Kubernetes Steering Committee consists of 7 seats, 3 of which were up for election in 2024. Incoming committee members serve a term of 2 years, and all members are elected by the Kubernetes Community.\nThis community body is significant since it oversees the governance of the entire Kubernetes project. With that great power comes great responsibility. You can learn more about the steering committee’s role in their charter.\nThank you to everyone who voted in the election; your participation helps support the community’s continued health and success.\nResults\nCongratulations to the elected committee members whose two year terms begin immediately (listed in alphabetical order by GitHub handle):\nAntonio Ojea (@aojea), Google\nBenjamin Elde…",
          "link": "https://kubernetes.io/blog/2024/10/02/steering-committee-results-2024/",
          "publishedOn": "2024-10-02T20:10:00.000Z",
          "wordCount": 4296,
          "title": "Announcing the 2024 Steering Committee Election Results",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": [
        {
          "id": "https://code.visualstudio.com/updates/v1_94",
          "author": null,
          "description": "Learn what is new in the Visual Studio Code September 2024 Release (1.94)\nRead the full article",
          "link": "https://code.visualstudio.com/updates/v1_94",
          "publishedOn": "2024-10-03T17:00:00.000Z",
          "wordCount": 6074,
          "title": "Visual Studio Code September 2024",
          "imageUrl": "https://code.visualstudio.com/assets/updates/1_94/release-highlights.png"
        }
      ]
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=21793",
          "author": null,
          "description": "Data for Good at Meta is open-sourcing the data used to train our AI-powered population maps.  We’re hoping that researchers and other organizations around the world will be able to leverage these tools to assist with a wide range of projects including those on climate adaptation, public health and disaster response. The dataset and code [...]\nRead More...\nThe post How open source AI can improve population estimates, sustainable energy, and the delivery of climate change interventions appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/10/03/ml-applications/open-source-ai-population-maps-meta/",
          "publishedOn": "2024-10-03T16:00:14.000Z",
          "wordCount": 2541,
          "title": "How open source AI can improve population estimates, sustainable energy, and the delivery of climate change interventions",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/10/Meta-open-source-population-maps-1-1.png"
        },
        {
          "id": "https://engineering.fb.com/?p=21703",
          "author": null,
          "description": "At Meta, React and React Native are more than just tools; they are integral to our product development and innovation. With over five thousand people at Meta building products and experiences with React every month, these technologies are fundamental to our engineering culture and our ability to quickly build and ship high quality products. In [...]\nRead More...\nThe post React at Meta Connect 2024 appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/10/02/android/react-at-meta-connect-2024/",
          "publishedOn": "2024-10-02T16:00:47.000Z",
          "wordCount": 3159,
          "title": "React at Meta Connect 2024",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/10/React-Meta-Connect-2024-hero-compressed.jpg"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=41759223",
          "author": "kelnos",
          "description": "To be clear here, we don't have a compositor yet. I've done a little work on it, but it won't be usable for at least a year, maybe (probably) longer.\n4.20 will let you run some of our components on another compositor. We mostly test with Wayfire and Labwc, as our compositor will also be using wlroots.",
          "link": "https://news.ycombinator.com/item?id=41759223",
          "publishedOn": "2024-10-06T18:53:00.000Z",
          "wordCount": 1111,
          "title": "New comment by kelnos in \"XFCE 4.20 aims to bring preliminary Wayland support\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41752304",
          "author": "mmoustafa",
          "description": "> \"In the end, Sable agreed to pay Cloudflare $225,000, grant Cloudflare a royalty-free license to its entire patent portfolio, and to dedicate its patents to the public, ensuring that Sable can never again assert them against another company,\"\nHoly cow, that’s incredible. Cloudflare has single-handedly shut down one of the biggest tech patent trolls. I don’t know how they possibly got Sable to agree to those terms, but kudos to Cloudflare counsel.",
          "link": "https://news.ycombinator.com/item?id=41752304",
          "publishedOn": "2024-10-05T19:31:12.000Z",
          "wordCount": 2486,
          "title": "New comment by mmoustafa in \"Cloudflare beats patent troll so badly it basically gives up\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41751944",
          "author": "bbow-resp",
          "description": "Hey: it's this story again. As someone who's around my 30s now with Duchenne Muscular Dystrophy and who has friends with the condition, I've always found it a bit too bleak about the quality of our lives (probably for drama's sake). Yes, I need a wheelchair and full time care attendants, but also:\n* I went to university and had a great time there\n* I had a pretty normal social life growing up, and made some life-long real life friends in college who I still visit regularly.\n* I talk to women and have had romantic relationships.\n* I've had and continue to have what I consider a pretty successful career in software.\n* While I like video games and played a lot of them in high school, I'd say I prefer going out and having interactions with friends more, however challenging it can be logistically.\nI know DMD severity varies between patients, but I don't want this article to discourage people with DMD or with children that have DMD. It can be tough, but I think that modern treatments allow us to lead fairly rich lives outside of Warcraft.",
          "link": "https://news.ycombinator.com/item?id=41751944",
          "publishedOn": "2024-10-05T18:38:10.000Z",
          "wordCount": 865,
          "title": "New comment by bbow-resp in \"The Remarkable Life of Ibelin\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41751062",
          "author": "sonofhans",
          "description": "FWIW Jeffrey Zeldman is a living legend. He was one of the first print designers to transition to the web, did it well, and wrote about it constantly. He designed the “Batman Forever” website in 1995; it was visited by something like one-third of all Internet users.\nHe created the Web Standards Project, hugely influential in getting browser manufacturers to support standards rather than pee in the pool. And if you think cross-browser support today is rough, at the time you could reliably crash production browsers with valid CSS.\nNever mind A List Apart, one of the best early mailing lists on the web, a kind of transitionary form between Usenet and forums/Discord. And A Book Apart, which published lots of high-quality stuff.\nIf you develop for the web today, every time a browser behaves as the spec describes, thank Jeffrey Zeldman.",
          "link": "https://news.ycombinator.com/item?id=41751062",
          "publishedOn": "2024-10-05T16:36:50.000Z",
          "wordCount": null,
          "title": "New comment by sonofhans in \"I Stayed\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41749960",
          "author": "lolinder",
          "description": "To recap OpenAI's decisions over the past year:\n* They burned up the hype for GPT-5 on 4o and o1, which are great step changes but nothing the competition can't quickly replicate.\n* They dissolved the safety team.\n* They switched to for profit and are poised to give Altman equity.\n* All while hyping AGI more than ever.\nAll of this suggests to me that Altman is in short-term exit preparation mode, not planning for AGI or even GPT-5. If he had another next generation model on the way he wouldn't have let the media call his \"discount GPT-4\" and \"tree of thought\" models GPT-5. If he sincerely thought AGI was on the horizon he wouldn't be eyeing the exit, and he likely wouldn't have gotten rid of the superalignment team. His actions are best explained as those of a startup CEO who sees the hype cycle he's been riding coming to an end and is looking to exit before we hit the trough of disillusionment.\nNone of this is to say that AI hasn't already changed a lot about the world we live in and won't continue to change things more. We will eventually hit the slope of enlightenment, but my bet is that Altman will have exited by then.",
          "link": "https://news.ycombinator.com/item?id=41749960",
          "publishedOn": "2024-10-05T14:06:21.000Z",
          "wordCount": null,
          "title": "New comment by lolinder in \"It's Time to Stop Taking Sam Altman at His Word\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41746610",
          "author": "famahar",
          "description": "I've kinda given up on the internet at this point. It's sad but comforting. My social networks are just my friends and I've started to get back into reading books and long form blogs. Don't want to be exposed to this endless slop. Every day it gets harder to find something that was so easy before. It's all being buried by endless content. I'm hoping some non AI generative content branch of the internet will be created. Don't know if something like that is possible. Curation seems like the next best step.",
          "link": "https://news.ycombinator.com/item?id=41746610",
          "publishedOn": "2024-10-04T23:57:51.000Z",
          "wordCount": 8916,
          "title": "New comment by famahar in \"Meta Movie Gen\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41741275",
          "author": "lopis",
          "description": "I assure you that's not enough. These are high quality videos. Once they get uploaded to social media, compression mostly makes imperfections go away. And it's been shown that when people are not expecting AI content, they are much less likely to realize they are looking at AI. I would 100% believe most of these videos were real if caught off guard.",
          "link": "https://news.ycombinator.com/item?id=41741275",
          "publishedOn": "2024-10-04T13:40:13.000Z",
          "wordCount": 5041,
          "title": "New comment by lopis in \"Meta Movie Gen\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41738834",
          "author": "mattnewton",
          "description": "The strings used for debugging at Google were supposed to include “DO NOT SUBMIT” which, a bot to check for this was added after a debug strings made it to production (It was before my time but I believe it was after the legendary WD incident- “western digital” was remapped to “woodly doodly” in test code that accidentally shipped for those curious)",
          "link": "https://news.ycombinator.com/item?id=41738834",
          "publishedOn": "2024-10-04T07:41:33.000Z",
          "wordCount": null,
          "title": "New comment by mattnewton in \"Why does man print \"gimme gimme gimme\" at 00:30? (2017)\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41737881",
          "author": "IgorPartola",
          "description": "Sorry time: years ago I worked on a telemedicine web app before telemedicine was nearly as popular as it is today. Part of the application had patients filling out questionnaires online to show answers to the doctors. We were onboarding different parts of a large healthcare system throughout all this (cardio, GI, etc.) and each had questionnaires that required different logic for when and how to display the questions, so the application had a fairly powerful system for driving the conditional logic of when questions do and do not show up.\nWell one day I am working on a new set of features to help support the new clinic that’s coming online and for whatever reason the question that should by all rights show up, does not. As I am getting deeper into debugging why, I pepper the code with nonsensical and slightly angry debug statements that show up alongside the questions. After solving the problem I happily clean up and commit the fixed code and move onto the next thing.\nWell, it turns out I didn’t clean up all the debug statements. The statement I left in said I SEE YOU!!! in big red letters if you answered a particular set of questions in a particular way. This was discovered by a patient. Of the psychiatric clinic that just came online. On the questionnaire meant to evaluate paranoia.\nSince then I have started using things like aaa and 111 as my debug markers.",
          "link": "https://news.ycombinator.com/item?id=41737881",
          "publishedOn": "2024-10-04T04:43:00.000Z",
          "wordCount": 11422,
          "title": "New comment by IgorPartola in \"Why does man print \"gimme gimme gimme\" at 00:30? (2017)\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41736630",
          "author": "userbinator",
          "description": "a gigabit customer who was paying $50 extra per month for unlimited data was flagged by Cox because he was using 8TB to 12TB a month\n\"Unlimited data\" should mean you can saturate the connection 24/7. Anything less is deceptive advertising. For a gigabit connection, that would mean around 300TB per month.",
          "link": "https://news.ycombinator.com/item?id=41736630",
          "publishedOn": "2024-10-04T00:40:03.000Z",
          "wordCount": 5215,
          "title": "New comment by userbinator in \"Cox slows Internet speeds in entire neighborhoods to punish any heavy users (2020)\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41734573",
          "author": "xyst",
          "description": "They say this now. But in 12 months (or the next layoff period), they will move from hybrid to full RTO.\nStill a shitty move to mandate RTO. Most people (IT folks) have spoke with do this routine:\n0) daily routine to prepare for day\n1) 1 hr commute to shitty office\n2) login to computer, do calls with cross regional (and international) teams over Zoom/Teams/Webex or whatever conferencing system\n3) teleconferencing with boss or manager\n4) teleconferencing with company stakeholders\n5) work on features and push code to remote systems (VCS, CI/CD…)\n6) eat shitty food at nearby places, or use the low quality vending machines or cafeteria\n7) logoff\n8) 1 hr commute back home\nThere are _some_ roles which may require in-person. But those were mostly sales folks. Some IT folks that deal with physical assets did require RTO (ie, data center / network engineers).",
          "link": "https://news.ycombinator.com/item?id=41734573",
          "publishedOn": "2024-10-03T20:22:40.000Z",
          "wordCount": 9761,
          "title": "New comment by xyst in \"Google won't be mandating a strict return-to-office plan\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41734439",
          "author": "joshstrange",
          "description": "The issue I continue to have with many AI coding tools is they want me to use their own editor (\"native\", aka VSCode fork, or in the browser like this). I have zero intention of moving away from IDEA and nothing I've seen so far is good enough to make me want to switch. I really with there was more of \"bringing AI into your existing tools/workflows\" instead of \"here is a new tool with AI baked in\".",
          "link": "https://news.ycombinator.com/item?id=41734439",
          "publishedOn": "2024-10-03T20:08:27.000Z",
          "wordCount": 5396,
          "title": "New comment by joshstrange in \"Canvas is a new way to write and code with ChatGPT\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41734113",
          "author": "recursivedoubts",
          "description": "My comment from the other thread:\nThe CEO of gumroad mentioned on twitter that he had tried out htmx for a project but decided to go with NextJS instead. I asked him if he was willing to write up his experience and he graciously agreed to do so. I have been looking for a thoughtful negative experience with htmx to host on the htmx website and I am very thankful he was willing to put in the work to produce one.",
          "link": "https://news.ycombinator.com/item?id=41734113",
          "publishedOn": "2024-10-03T19:33:36.000Z",
          "wordCount": null,
          "title": "New comment by recursivedoubts in \"Why Gumroad Didn't Choose Htmx\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41733104",
          "author": "ahartmetz",
          "description": "Almost all multi-player gaming is competitive and involves dealing with occasional (or frequent, depending on the game) jerks. If I want stress and occasional jerks, I can just do things in the real world. Single-player gaming is more comfy.",
          "link": "https://news.ycombinator.com/item?id=41733104",
          "publishedOn": "2024-10-03T17:57:48.000Z",
          "wordCount": null,
          "title": "New comment by ahartmetz in \"Most gamers prefer single-player games\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41732580",
          "author": "eastdakota",
          "description": "Having talked with several of them, most of the people who submit the prior art as part of Project Jengo would do so even if there were no payout. Several winners have actually asked that the payout be donated back to other organizations fighting patent trolls. This isn't intended to be anyone's full time job. It is intended to reward technical people with industry knowledge who may be able to help surface prior art and are as sick of patent trolls as we are.",
          "link": "https://news.ycombinator.com/item?id=41732580",
          "publishedOn": "2024-10-03T17:02:43.000Z",
          "wordCount": 10243,
          "title": "New comment by eastdakota in \"Patent troll Sable pays up, dedicates all its patents to the public\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41732034",
          "author": "bogtog",
          "description": "I do MRI work, and my gut is that none of the claims about dance vs. exercise would replicate. The behavioral data suggests that activity of some type will improve cognitive function (main effects of time). Such beneficial effects of activity on the brain have been shown before, and this is generally accepted. However, the authors' behavioral data doesn't show any difference between the dance vs. exercise groups. This means that the study is overall off to a pretty bad start if their goal is to study dance vs. exercise differences...\nThe brain data claims to show that the dance vs. exercise groups showed different levels of improvement in various regions. However, the brain effects are tiny and are probably just random noise (I'm referring to those red spots, which are very small and almost certainly don't reflect proper correction for multiple hypotheses given that the authors effectively tested 1000s or 10000s of different areas). The authors' claims about BDNF are supported by a p-value of p = .046, and having main conclusions hinge on p-values of p > .01 usually means the conclusions are rubbish.\nIn general, my priors on \"we can detect subtle changes in brain matter over a 6-week period\" are also very low. Perhaps, a study with this sample size could show that activity of some kind influences the brain over such a short length, but I am extremely skeptical that this type of study could detect differences between dance vs. exercise effects.",
          "link": "https://news.ycombinator.com/item?id=41732034",
          "publishedOn": "2024-10-03T16:10:53.000Z",
          "wordCount": 4267,
          "title": "New comment by bogtog in \"Dance training superior to physical exercise in inducing brain plasticity (2018)\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41731476",
          "author": "bityard",
          "description": "Reading between the lines, my uneducated guess is that Sable knew they were going out of business either way and had to chose between paying ALL of Cloudflare's legal fees (possibly in the millions) or paying a token amount and giving up their (now or soon-to-be worthless) patents. The latter results in fewer financial loses for Sable and makes for excellent Cloudflare PR.\nEdit: Also, it's entirely likely that Sable still made a tidy profit overall when it settled with the other big networking companies and decided to quit while they were ahead.",
          "link": "https://news.ycombinator.com/item?id=41731476",
          "publishedOn": "2024-10-03T15:07:02.000Z",
          "wordCount": null,
          "title": "New comment by bityard in \"Patent troll Sable pays up, dedicates all its patents to the public\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41731141",
          "author": "aduffy",
          "description": "These patent trolls are greedy, extractive, and contribute nothing to society while wasting vast public and private legal resources.\nFuck. Them. Excellent work to the entire litigation team at Cloudflare.",
          "link": "https://news.ycombinator.com/item?id=41731141",
          "publishedOn": "2024-10-03T14:30:34.000Z",
          "wordCount": null,
          "title": "New comment by aduffy in \"Patent troll Sable pays up, dedicates all its patents to the public\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41730140",
          "author": "amiga386",
          "description": "Nothing, because .io was operated by some wheeler-dealer without the authority of the UK. Apparently he just dumped money into the bank accounts of the various overseas territories he was selling the domain names for and they were OK with it?\nHe's since sold it on and now a hedge fund owns it.\nhttps://en.wikipedia.org/wiki/.io\nOfficially, the British Indian Ocean Territories will cease to exist, therefore so would the ISO 2-letter country code. However, ccTLDs have outlasted countries before, notably \".su\" for the no longer existing USSR. I suspect that IANA would prioritise not breaking millions of domain names over trying to police ccTLDs.\nGoogle's view on the matter is that .io is already effectively a gTLD rather than a ccTLD, like with .nu, .to, .tv, as most of the registrants run websites with a global audience or at least an audience other than the island nations whose ccTLDs they are.",
          "link": "https://news.ycombinator.com/item?id=41730140",
          "publishedOn": "2024-10-03T12:32:30.000Z",
          "wordCount": 4004,
          "title": "New comment by amiga386 in \"Ask HN: What happens to \".io\" TLD after UK gives back the Chagos Islands?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41729862",
          "author": "awestroke",
          "description": "Related: my favorite HN comment ever from a similar submission a year ago:\n> There's lots of very exciting work going on around the fully mapped fruit fly connectome. For example, I'm a CTO of a stealth startup that aims to do for utilitarianism what carbon credits did for environmentalism. We are selling 'utility credits' which translates directly into us simulating trillions and trillions of fruit fly brains in a state of constant orgasmic bliss, which you can then buy to offset any actions your company has undertaken that damage global happiness or well-being. We've seen a lot of interest from some pretty large industry players.\nhttps://news.ycombinator.com/item?id=36584130",
          "link": "https://news.ycombinator.com/item?id=41729862",
          "publishedOn": "2024-10-03T12:00:34.000Z",
          "wordCount": 1184,
          "title": "New comment by awestroke in \"An adult fruit fly brain has been mapped\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41728513",
          "author": "frereubu",
          "description": "This sounds like hocus pocus to me, along the lines of the claim that phone alert tones activate the \"love centre\" of the brain. Just so happens that the \"love centre\" is also the \"vomiting centre\" along with a load of other stuff. I'd treat this hand-wavy claim with the same kind of skepticism - your counter-example is an excellent one. I agree that looking at a phone first thing in the morning is a bad idea, but for very different reasons.",
          "link": "https://news.ycombinator.com/item?id=41728513",
          "publishedOn": "2024-10-03T08:30:30.000Z",
          "wordCount": 1295,
          "title": "New comment by frereubu in \"What excessive screen time does to the adult brain\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41728469",
          "author": "MrJagil",
          "description": "“One of the biggest issues with picking up the phone right away in the morning is that when you have an object close to your face, it’s registered as a threat,” says Loeffler. “You wouldn’t want to wake up and look a bear in the face every morning. On a physiological level, it’s the same thing.”\nThis is interesting to me. It does make some evolutionary sense but at the same time, i wake up every morning and look at my girlfriends face, hopefully that does not subconsciously trigger the same response.\nThat said,  the \"sky before screens\" idea has been rummaging in my mind since i first heard about it https://www.cyclingweekly.com/news/sky-before-screens-has-ma...",
          "link": "https://news.ycombinator.com/item?id=41728469",
          "publishedOn": "2024-10-03T08:23:08.000Z",
          "wordCount": 3151,
          "title": "New comment by MrJagil in \"What excessive screen time does to the adult brain\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41727216",
          "author": "vishnugupta",
          "description": "The change in question if you don’t want to read through half way across the article.\n“In iOS 18, however, users who agree to give an app access to their contacts are shown a second message, allowing them to select which contacts to share. Users can opt to share just a handful of contacts by selecting them one by one, rather than forking over their entire address book.”",
          "link": "https://news.ycombinator.com/item?id=41727216",
          "publishedOn": "2024-10-03T03:50:44.000Z",
          "wordCount": 1599,
          "title": "New comment by vishnugupta in \"A subtle change to the iPhone’s contact-sharing permissions\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41727032",
          "author": "safety1st",
          "description": "Hi Matt, great that you're participating here and I'm broadly supportive regarding your concerns with the trademark and WP Engine's conduct.\nHowever I do not understand why you chose to make 1.5 million enemies in the WordPress community in one weekend by shutting down their ability to update plugins with zero warning and consequently reducing the security of their websites.\nTo be entirely blunt it's all damage control for us at this point when your name comes up, and it's because of that one singular mistake, if this was just WPE and Automattic duking it out in court no one would really care, but now the reliability of the WPOrg infrastructure is being questioned by a big chunk of the people who depend on WordPress and they will probably be inclined to walk away from your infrastructure and deeper into the arms of someone like WPEngine when they get the chance.\nIf you care about the broad perception of your efforts and your business practices I think you need to address this. Again I see that there are plenty of reasons to take issue with WPE's conduct but this singular decision you made has people calling for you to step aside and let someone else run WordPress. It's not going to go away on its own.",
          "link": "https://news.ycombinator.com/item?id=41727032",
          "publishedOn": "2024-10-03T03:13:40.000Z",
          "wordCount": 6377,
          "title": "New comment by safety1st in \"Filed: WP Engine Inc. v Automattic Inc. and Matthew Charles Mullenweg [pdf]\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41726928",
          "author": "DannyBee",
          "description": "Matt - i'm not your lawyer, but you should shut up.\nEmployers generally have an obligation to keep personal data confidential, especially sensitive information like a job application.\nWhether that applies in this particular case or not, i'm not going to offer an opinion, but you really should shut up.\nI get that it's particularly frustrating and hard to feel like you are being unfairly treated or whatever, but shut up anyway.",
          "link": "https://news.ycombinator.com/item?id=41726928",
          "publishedOn": "2024-10-03T02:56:49.000Z",
          "wordCount": null,
          "title": "New comment by DannyBee in \"Filed: WP Engine Inc. v Automattic Inc. and Matthew Charles Mullenweg [pdf]\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41726656",
          "author": "photomatt",
          "description": "Howdy, Matthew Charles Mullenweg from the lawsuit here.\nOne thing I'm surprised they disclosed is on page 35 that Heather Brunner at WP Engine was interviewing for a job at Automattic. That's why we were spending so much time together 1:1 without her team there in the meetings I posted here: https://automattic.com/2024/10/01/wpe-terms/\nThey lied that it was to run WordPress.com, though, she wanted to be the Executive Director of WordPress.org for Automattic, a position that was held by Josepha.",
          "link": "https://news.ycombinator.com/item?id=41726656",
          "publishedOn": "2024-10-03T02:08:31.000Z",
          "wordCount": null,
          "title": "New comment by photomatt in \"Filed: WP Engine Inc. v Automattic Inc. and Matthew Charles Mullenweg [pdf]\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41723916",
          "author": "rkp8000",
          "description": "Connectome-adjacent neuroscientist here. Definitely not a dead end! But also definitely not the whole picture.\nOne of the main open questions in neuroscience right now is how network structure, dynamics, and function are related in the brain. Connectomes provide tremendous insight into structure, but as mentioned this does not generically solve either the dynamics or function problem. For example, for many of these neurons we don't have a good understanding of their input-output relationship, and the nature of this relationship can strongly affect the dynamics that emerge in a highly connected network. Individual variability across connectomes, and how connectomes change over development are also a significant issue, but at least for the fly it's thought that many of the basic structures are pretty conserved across adult animals, even if many of the details could differ.\nModulo these caveats, knowing the physical network structure of the brain does still impose huge constraints on what kinds of models we should be using for gaining insight into dynamics and function. For example, there are well known areas (the \"mushroom bodies\") with specific feed-forward connectivity patterns that are very different from a random recurrent network. Further, there are at least some areas in the fly brain where we think there are indeed quite clean structure-function relationships, e.g. in the central complex of the fly brain, which contains a physical ring of neurons and is thought to support a \"bump\" of activity that acts as a sort of compass that helps flies navigate via a ring-attractor-like dynamical system. Thus, even though it has many missing pieces, a wiring diagram like this can be tremendously useful for generating hypotheses to guide more targeted experiments and theoretical studies.",
          "link": "https://news.ycombinator.com/item?id=41723916",
          "publishedOn": "2024-10-02T18:58:39.000Z",
          "wordCount": 1236,
          "title": "New comment by rkp8000 in \"An adult fruit fly brain has been mapped\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41722337",
          "author": "pizlonator",
          "description": "Always cool to see new mutex implementations and shootouts between them, but I don’t like how this one is benchmarked. Looks like a microbenchmark.\nMost of us who ship fast locks use very large multithreaded programs as our primary way of testing performance. The things that make a mutex fast or slow seem to be different for complex workloads with varied critical section length, varied numbers of threads contending, and varying levels of contention.\n(Source: I wrote the fast locks that WebKit uses, I’m the person who invented the ParkingLot abstraction for lock impls (now also used in Rust and Unreal Engine), and I previously did research on fast locks for Java and have a paper about that.)",
          "link": "https://news.ycombinator.com/item?id=41722337",
          "publishedOn": "2024-10-02T16:29:37.000Z",
          "wordCount": null,
          "title": "New comment by pizlonator in \"The Fastest Mutexes\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41722129",
          "author": "ortusdux",
          "description": "Link to the video - https://www.youtube.com/watch?v=O9GDn-cl1og",
          "link": "https://news.ycombinator.com/item?id=41722129",
          "publishedOn": "2024-10-02T16:13:30.000Z",
          "wordCount": null,
          "title": "New comment by ortusdux in \"American WWII bomb explodes at Japanese airport, causing large crater in taxiway\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41721788",
          "author": "kccqzy",
          "description": "> The reason why Cosmopolitan Mutexes are so good is because I used a library called nsync. It only has 371 stars on GitHub, but it was written by a distinguished engineer at Google called Mike Burrows.\nIndeed this is the first time I've heard of nsync, but Mike Burrows also wrote Google's production mutex implementation at https://github.com/abseil/abseil-cpp/blob/master/absl/synchr... I'm curious why this mutex implementation is absent from the author's benchmarks.\nBy the way if the author farms out to __ulock on macOS, this could be more simply achieved by just using the wait(), notify_one() member functions in the libc++'s atomic library.\nA while ago there was also a giant thread related to improving Rust's mutex implementation at https://github.com/rust-lang/rust/issues/93740#issuecomment-.... What's interesting is that there's a detailed discussion of the inner workings of almost every popular mutex implementation.",
          "link": "https://news.ycombinator.com/item?id=41721788",
          "publishedOn": "2024-10-02T15:42:37.000Z",
          "wordCount": 836,
          "title": "New comment by kccqzy in \"The Fastest Mutexes\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=53254",
          "author": "Chris Bertram",
          "description": "Visit the post for more.",
          "link": "https://crookedtimber.org/2024/10/06/sunday-photoblogging-salt-at-gruissan/",
          "publishedOn": "2024-10-06T06:58:07.000Z",
          "wordCount": 1770,
          "title": "Sunday photoblogging: Salt at Gruissan",
          "imageUrl": "https://live.staticflickr.com/65535/54046223378_99d0558e5d.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53250",
          "author": "Eric Schliesser",
          "description": "Back in 1991 my co-blogger here at Crooked Timber, Elizabeth S. Anderson, reminded every one of the significance of John Stuart Mill and Experiments in Living (Ethics, 102(1): 4-26). She situated Mill’s views on the matter in the context of a debate with Bentham (and Parfit) over the nature of the good in which Mill wanted […]",
          "link": "https://crookedtimber.org/2024/10/02/on-robert-owen-and-the-history-of-experiments-in-living/",
          "publishedOn": "2024-10-02T08:48:01.000Z",
          "wordCount": 4383,
          "title": "On Robert Owen and the History of Experiments in Living",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53225",
          "author": "Miriam Ronzoni",
          "description": "I work at a very large University. I am the parent of a child who has just started secondary school, and of one in the middle of their primary school journey. I am currently taking what in the UK is called a Level 2 Adult Education course. In all four of those domains – and […]",
          "link": "https://crookedtimber.org/2024/10/01/shambles-but-make-it-digital/",
          "publishedOn": "2024-10-01T08:50:27.000Z",
          "wordCount": 7546,
          "title": "Shambles, But Make It Digital",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/PRC-75-today",
          "author": "Michael Roberts",
          "description": "Today is the 75th anniversary of the founding of the People's Republic of China (PRC). The survival of the PRC is now longer than the Soviet Union, which lasted 74 years. China has nearly one-fifth of the world's population and on some measures is the largest economy in the world, although per person national income is only 30% of that of the US. \nEnglish\n\n/ \nChina, \nCapitalism",
          "link": "https://www.cadtm.org/PRC-75-today",
          "publishedOn": "2024-10-01T20:00:00.000Z",
          "wordCount": 1137,
          "title": "PRC 75 today",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L800xH420/752c2bbacfd8e3c4da4fd91c660936-b8ac4.jpg"
        },
        {
          "id": "https://www.cadtm.org/The-Blessing-for-genocide",
          "author": "Patrick Bond",
          "description": "The Biden-Harris genocide-facilitation team is celebrating about wanting a conflict-free world and post-Western geopolitical arrangements, including a two-state solution for Israel and Palestine. So this public recognition by Netanyahu of their usefulness should be humiliating enough. (At the United Nations, among BRICS+ members only Ethiopia typically joins Axis-of-Genocide powers by abstaining on resolutions criticising Israel, including a September 18 enforcement of the International (...)\nEnglish\n\n/ \nSouth Africa, \nWTO, \nIsrael, \nBRICS",
          "link": "https://www.cadtm.org/The-Blessing-for-genocide",
          "publishedOn": "2024-10-01T12:14:05.000Z",
          "wordCount": 3143,
          "title": "‘The Blessing' for genocide",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L624xH328/6b7cab7714a257c63a22239dafc619-49c5c.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=8631",
          "author": "disassociated.com",
          "description": "No posts about sport, hardly ever, then two in a week. But the NRL football (rugby league) grand final (Penrith Panthers versus Melbourne Storm) is on this long weekend, and since I wrote about the AFL the other day, this seems right. More a personality/psychology post though: a profile of Nathan Cleary, the Panthers halfback, […]",
          "link": "https://disassociated.com/grand-final-day-some-introverts-must-leave-house/",
          "publishedOn": "2024-10-04T21:00:27.000Z",
          "wordCount": 282,
          "title": "Grand final day: when some introverts must leave the house",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8628",
          "author": "disassociated.com",
          "description": "Evan Sheehan, writing at The Darth Mall: I think Jeremy Keith is right, that all that really matters is having your own website. However big or small, however you make it, whatever you choose to put on it. I just don’t think that this is what the IndieWeb is actually focused on. The IndieWeb feels […]",
          "link": "https://disassociated.com/indieweb-participants-vocal-not-developers/",
          "publishedOn": "2024-10-04T20:30:30.000Z",
          "wordCount": 472,
          "title": "All IndieWeb participants need to be vocal, not just developers",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8621",
          "author": "disassociated.com",
          "description": "Louis Menand, writing for The New Yorker. How familiar does this sound: Between 1998 and 2020, more than half of the independent bookstores in the United States went out of business. It was a similar story for personal websites and blogs, though definitely across different timeframes. Maybe from 2010 — later even — as social […]",
          "link": "https://disassociated.com/independent-bookshops-independent-web-tale-two-cities/",
          "publishedOn": "2024-10-03T21:00:33.000Z",
          "wordCount": 462,
          "title": "Independent bookshops, independent web, a tale of two cities",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8611",
          "author": "disassociated.com",
          "description": "This Halifax Examiner article, by Philip Moscovitch, which features a number of quotes by Matt Pearce, a Los Angeles Times journalist, recorded on a recent episode of the Tech Won’t Save Us podcast, has been doing the rounds. The upshot being hyperlinks, links from one webpage to another, are in danger of becoming obsolete. Extinct. […]",
          "link": "https://disassociated.com/independent-websites-vital-survival-hyperlinks/",
          "publishedOn": "2024-10-02T21:00:48.000Z",
          "wordCount": 527,
          "title": "Independent websites: vital for the survival of the hyperlink",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8607",
          "author": "disassociated.com",
          "description": "Juice is the latest novel by Australian author Tim Winton, which was published yesterday. From this synopsis, Juice sounds like it blends elements of the Max Mad saga, with Winton’s own environmental and climate change concerns: Two fugitives, a man and a child, drive all night across a stony desert. As dawn breaks, they roll […]",
          "link": "https://disassociated.com/juice-new-cli-fi-novel-australian-author-tim-winton/",
          "publishedOn": "2024-10-01T21:00:34.000Z",
          "wordCount": 357,
          "title": "Juice: the new cli-fi novel by Australian author Tim Winton",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8602",
          "author": "disassociated.com",
          "description": "I’m not very sporty as regular readers will have gathered. Of the approximate sixteen-hundred posts here at present, less than half a dozen are sport related. Of these, the majority relate to the Matildas, the Australian women’s football/soccer team, which I wrote during last year’s World Cup tournament. To think it’s been over a year […]",
          "link": "https://disassociated.com/mullets-great-australian-football-league-teams/",
          "publishedOn": "2024-09-30T21:00:10.000Z",
          "wordCount": 296,
          "title": "Do mullets make for great Australian Football League teams?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20241002",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20241002",
          "publishedOn": "2024-10-02T22:00:00.000Z",
          "wordCount": 638,
          "title": "Week Ending September 29, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/national-lockstep",
          "author": null,
          "description": "On Belgium.",
          "link": "https://newleftreview.org/sidecar/posts/national-lockstep",
          "publishedOn": "2024-10-04T17:35:15.000Z",
          "wordCount": 2077,
          "title": "Anton Jäger: &ldquo;National Lockstep?&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/10/Thierry-De-Cordier-Artwork-detail.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/asperity-and-delight",
          "author": null,
          "description": "Richard Serra (1938-2024).",
          "link": "https://newleftreview.org/sidecar/posts/asperity-and-delight",
          "publishedOn": "2024-10-01T15:53:46.000Z",
          "wordCount": 1675,
          "title": "Hal Foster: &ldquo;Asperity and Delight&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/10/kd10lipn7kj41.jpg"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://thebirdhouse.bearblog.dev/on-blogging-every-day/",
          "author": null,
          "description": "Since discovering my favorite types of blog posts are essay-like in anatomy and length, I've dedicated a lot of time to both writing and reading such posts. Every morning, before I go on my phone and while I drink my coffee, I'll hop onto Bear Blog and start writing. About what? Well, anything! Usually, the first topic that pops into my head is the one I'll write about, and I can usually pop out a decently sized post within an hour. I have the luxury of working from home and my classes are all later than 10am, so I've really enjoyed crafting this relaxing and productive morning routine for myself. I don't always post what I write, but I always make sure to write every day, if only for a few minutes.\nWhen I post something in the morning, I'll check back periodically to reread my post or look at the toasts. I don't have an email attached to this account as of yet, so the only feedback I get on the site (or evidence that my post reached anyone at all) is from the toasts. Seeing the number tick up can really make my day when it's a post I spent a lot of time on, or if it covers a subject I care about. I want to attach more functionality to my blog that makes it easier for people to reach me and interact with my writing, but I've also really enjoyed feeling like typing in this little blue box is something I only do for me. I feel really good after blogging, and I don't ever want that to change.\nʚ ═══･୨ ꕤ ୧･═══ ɞ",
          "link": "https://thebirdhouse.bearblog.dev/on-blogging-every-day/",
          "publishedOn": "2024-10-06T12:30:00.000Z",
          "wordCount": 705,
          "title": "on blogging every day",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://birming.com/writing-meditation/",
          "author": null,
          "description": "I'm sitting at one of my favorite coffee shops here in Stockholm. A friend reached out and asked if I wanted to meet up. She was just about to meditate first.\nI've meditated myself in periods. I'm actually doing it right now. The meditation I practice is called writing.\nFew things in life make me as present in the moment as writing. I've tried different types of meditation, gone on retreats around the world, read books on the subject, done online courses, tested various apps... Nothing has come close to the mindful presence I experience while writing.\nAm I saying that traditional meditation is bad? No, of course not. I still do it myself occasionally, and I know that my dear friend finds it incredibly rewarding and valuable.\nWhat I'm trying to say is that the \"technique\" isn't so important. The important thing is that it aligns with what suits us, whether it means sitting cross-legged or being out in the woods picking mushrooms.\nIf meditation becomes something that \"should be done\" - a task, an achievement - how much do we really get out of it? One conscious breath can be more precious than spending 30 minutes checking off the task 'meditation' on the to-do list.\nI leave you with that to meditate on.",
          "link": "https://birming.com/writing-meditation/",
          "publishedOn": "2024-10-06T11:18:00.000Z",
          "wordCount": 1972,
          "title": "Writing as Meditation",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert/writing-meditation.webp"
        },
        {
          "id": "https://sylvia.bearblog.dev/email-obfuscation/",
          "author": null,
          "description": "{{ post_last_modified }} ago\nI detest email spam and have been looking into tried & true solutions for obfuscating email addresses. Contact forms are great for hiding email addresses, but I don't love relying on yet another service for something so simple as email.\nIt turns out a simple CSS \"display: none\" blocks 100% of spam! I'll be using this method to list my email address moving forward — you can see how it looks on my About page.\nThe symbol substitution method seems to still be effective, but I want my email address to be easy to copy-paste.\nHere are the HTML and CSS snippets for anyone interested in hiding their email address from spam bots.\nHTML for email address\nAdd this to where you want your email to display. Update username and domain.com with your actual information.\n<span class=\"email\">username@<b>mail.</b>domain.com</span>\n\nTheme CSS\nspan.email b {\n    display: none;\n}",
          "link": "https://sylvia.bearblog.dev/email-obfuscation/",
          "publishedOn": "2024-10-05T22:26:00.000Z",
          "wordCount": 2138,
          "title": "Keeping email addresses hidden from spam bots",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://birming.com/unlikely-upvote-button/",
          "author": null,
          "description": "Unlikely Upvote Button for Bear\nDo you want to keep the upvote button on your Bear blog but find it stressful to see how many people have liked, or haven't liked, your posts?\nSay hello to the \"unlikely\" button. It works like the standard button but doesn't display the upvote count. No more sleepless nights worrying about your post's popularity, but still keeping that trending post dream alive.\nIn your Beraming Theme, simply replace the current button with the following styles:\n/* Unlikely button */\n.upvote-button svg,\n.upvote-count {\n  display: none; \n}\nbutton.upvote-button { \n  display: block !important;\n  padding: 4px 9px;\n  font-family: var(--font-secondary);\n  font-size: 13px;\n  color: var(--link-color);\n  border: 1px solid var(--link-color);\n  border-radius: 6px;\n  cursor: pointer;\n}\n.upvote-button::before {\n  content: \"☆\";\n}\n.upvote-button::after {\n  content: \"Like it?\";\n}\n.upvote-button[disabled]::before {\n  content: \"★\";\n}\n.upvote-button[disabled]::after {\n  content: \"Thank you!\";\n  cursor: default;\n}\n.upvote-button.upvoted {\n  color: var(--link-color) !important;\n  background-color: var(--accent-color);\n}\n.upvote-button:hover {\n  background-color: var(--accent-color);\n}\n\nSee the add-ons page for more Bear customizations.\nUpdate: If you're not using the Bearming Theme or simply want a lighter version, ReedyBear has you covered. Thanks for the highlighting tip!",
          "link": "https://birming.com/unlikely-upvote-button/",
          "publishedOn": "2024-10-05T18:59:00.000Z",
          "wordCount": 1939,
          "title": "Unlikely Upvote Button for Bear",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert/button-likes.webp"
        },
        {
          "id": "https://yordi.me/the-subtle-art-of-always-quitting-your-hobbies/",
          "author": null,
          "description": "So, it's been a while. Where do I start?\nLet’s start at the beginning.\nI’ve been writing for most of my life. As a kid, I wrote stories, though they never went beyond a few pages. I even started a neighborhood newspaper, but that didn’t last long. I wrote about football matches during big tournaments like the World Cup, but once the tournament ended, so did my writing. Not that I felt really sad about that, by the way. Most of the time I was glad it was over, because I could finally stop the forced writing.\nI also wrote for a fairly big gaming website for a couple of years, but I always dreaded writing long reviews. Enjoyment was far away.\nThen, in June of this year, I rediscovered my love for writing — this time, on my personal blog. I found a community of fellow writers on Mastodon and r…",
          "link": "https://yordi.me/the-subtle-art-of-always-quitting-your-hobbies/",
          "publishedOn": "2024-10-04T16:17:00.000Z",
          "wordCount": 1713,
          "title": "The Subtle Art of Always Quitting Your Hobbies",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/yordi/the-background-shows-a-simple-room-wi.webp"
        },
        {
          "id": "https://blog.avas.space/microblog/",
          "author": null,
          "description": "Since Robert Birming released his Timeline design, I've been playing around with it and including it in some of my pages.\nBut I was also curious on how I could include it to make a microblog out of a typical Bearblog. Not that you can't make short posts on here in a default look, but most of the design of Bearblog and its themes is decidedly for longform content. I wanted something that looks more like a microblogging/short post platform.\n==Some goals I had in mind for my own microblog:==\nI didn't want these low effort posts to be in the Discovery section; make_discoverable has to be false in the Post preset.\nThe posts need to mention when they were made; I need to include {{ post_published_date }} in the h4 of the Timeline code.\nI want the main page you land on to display the most recent …",
          "link": "https://blog.avas.space/microblog/",
          "publishedOn": "2024-10-04T03:23:00.000Z",
          "wordCount": 2115,
          "title": "turning a bearblog into a microblog",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/avas-1709500835-0.png"
        },
        {
          "id": "https://austinmwav.com/the-art-you-cannot-see/",
          "author": null,
          "description": "When I was a child, I grew up in a hoarder home. My mother had me at 16. We lived with my grandmother and her then wife, who kept everything she ever received. I have vivid memories of two things in that house.\nThe first is the kitchen table. There were no chairs around the table, it was never used to eat meals. Instead it was filled to the edges with things left unused.\n \n\nThe second was the piano. It was old, out of tune. The wood was peeling and no one in the home knew how to play the instrument. It sat in the front of the house and I was the only one to ever touch it. Like the table, the top of the piano was a menagerie of unwanted items and dust. I would toy around on it, pressing the keys down and creating out of tune melodies that have been lost to time.\n \n\nWhen I was 11, my mother …",
          "link": "https://austinmwav.com/the-art-you-cannot-see/",
          "publishedOn": "2024-10-04T02:26:00.000Z",
          "wordCount": 1016,
          "title": "The Art You Cannot See",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://kelsey.bearblog.dev/holy-cow/",
          "author": null,
          "description": "I momentarily forgot I had a blog, which means there is no monthly recap for September. I think I’m going to stop writing monthly recaps. It was fun for a little while, but I’m running out of contrived bullshit to write for “themes.”\nRecently I bought a Tamagotchi and a Hello Kitty shaped compact mirror and a Bad Badtz-Maru purse and 2 notebooks and 3 pens (gave one pen to a friend) and a tshirt and a small case for an A5 sized notebook and a notebook cover and tacos and makeup remover wipes and",
          "link": "https://kelsey.bearblog.dev/holy-cow/",
          "publishedOn": "2024-10-03T04:44:00.000Z",
          "wordCount": 654,
          "title": "holy cow",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://notes.jeddacp.com/our-homeowners-association-saga/",
          "author": null,
          "description": "I've lived in neighborhoods with a Homeowners Association1 all my life. There were times I found having one to be advantageous, but these days it's just plain annoying.\nThe house I grew up in had an HOA. You could tell that the neighborhood had an HOA because our neighborhood was the typical-ish middle class cul-des-sac neighborhood. It was surrounded by a huge man-made pond that was well kept, with a park that got upgraded throughout the years. It used to be an orchard that became what it is today. As far as I knew, there were no strict rules enforced by our HOA. I'm assuming the money went to the upkeep of that pond and park, and little things around the neighborhood.\nWhen I bought my first house in 2012, that house also had an HOA. The fees were super minimal, and I paid once a year. Th…",
          "link": "https://notes.jeddacp.com/our-homeowners-association-saga/",
          "publishedOn": "2024-10-02T21:19:00.000Z",
          "wordCount": 1457,
          "title": "Our Homeowners Association Saga",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/jedda/hoa.webp"
        },
        {
          "id": "https://theiqrafiles.com/notes-on-sufic-rewilding/",
          "author": null,
          "description": "Dawah Inc is dying. Tumblr e-girl intrigue, the notoriety of public celebrity, the psy-slop of attention hacking economics and industrial scale mediocrity is tearing down the aura, prestige and myth of Islamicate civilization in cyber. The latent iconoclastic potential of Islamicate art has been squandered and instead we have meatspace media empires, fools who have tried to make gold off the back of other fools. In the process we have a contagion of functional illiteracy, cultural apocalypse and no real vibrancy. The Muhammadan spirit is missing from Dawah Inc. There is no real transgression, when Dawah Inc positions itself as a menu item that also includes Ben Shapiro and Jordan Peterson.\nThere must be consideration for what comes next. Part of what must come next, must grasp the iconocla…",
          "link": "https://theiqrafiles.com/notes-on-sufic-rewilding/",
          "publishedOn": "2024-10-02T15:12:00.000Z",
          "wordCount": 1530,
          "title": "Notes on Sufic Rewilding",
          "imageUrl": "https://i.imgur.com/MRTdHhJ.jpeg"
        },
        {
          "id": "https://jeddacp.me/a-day-in-carmel-by-the-sea-ca/",
          "author": null,
          "description": "Carmel by the Sea is such a cute little town—super quaint and dog-friendly! We spent the day here for my birthday back in August.\nAlready trying to figure out when we can go again to continue exploring since we didn't get a chance to do the Fairy Tale Houses tour.\nThankfully walking around town was a fairy tale in itself.\n\n\n\nThere were a ton of cute alleyways like this.\n\nOne of the libraries we visited so I could sign up for a library card to add to my collection.\n\nHere's another library. Unfortunately we didn't go inside to get a library card here.\n\nPlenty of artwork gems to discover like this.\n\nand this.\n\nWe event found a nice little dog shop where we almost bought a bag for Cocoa.\n\n🎂 Related (Birthday Weekend Series):\nSan Francisco in a Frame\nIncoming Fog Down the PCH\nAn August Morning",
          "link": "https://jeddacp.me/a-day-in-carmel-by-the-sea-ca/",
          "publishedOn": "2024-10-02T15:11:47.091Z",
          "wordCount": 1016,
          "title": "A Day in Carmel-by-the-Sea, CA",
          "imageUrl": "https://live.staticflickr.com/65535/54036934688_26be8415f4_c.jpg"
        },
        {
          "id": "https://ninecoffees.blog/the-calm-before-the-storm/",
          "author": null,
          "description": "At the time of writing this post, Typhoon Krathon will hit the populated west side of Taiwan in four hours.\nI was feeling rather cooped up earlier so I went out for a walk. Smack in the pouring rain. Thankfully, my sneakers were worn and in need of replacing so getting them soaked wasn't the biggest deal; still, one is forced to ask oneself if they're capable of making good life decisions when the wind starts howling against your umbrella. By the time I got to the halfway point of my walk, lightning was flashing furiously. Like I said, not a good life decision.\nAlmost every store was closed today. The only things left running were big corporate: convenience stores and chain cafes. I stopped by a Louisa (Taiwan's Starbucks equivalent) and saw that there was only the barista inside.\nI asked …",
          "link": "https://ninecoffees.blog/the-calm-before-the-storm/",
          "publishedOn": "2024-10-02T04:22:00.000Z",
          "wordCount": 849,
          "title": "The Calm Before the Storm",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://alexandrawolfe.ca/inktober-01-peas-in-a-pod/",
          "author": null,
          "description": "I know there is a prompt sheet available for the challenge, but I'm going rogue as I kind of tend to scribble stuff that pops into my head at any given time. And, so ... here's my first offering.",
          "link": "https://alexandrawolfe.ca/inktober-01-peas-in-a-pod/",
          "publishedOn": "2024-10-01T18:24:09.452Z",
          "wordCount": 990,
          "title": "Inktober #01 : Peas in a Pod",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/notebook/peas.webp"
        },
        {
          "id": "https://azhdarchid.com/goodbye-cohost/",
          "author": null,
          "description": "Alright, I'm a little sick, and I have something of a headache, and I'm emotional for more reasons than just Cohost, but here goes.\nI've been writing on the internet for most of the time that I've been alive. I've done it on blogs, I've done it on social media. I've done it for money and I've done it for free. I've done it on Tumblr and on more than one defunct media vertical and in interactive fiction.\nCohost was the first place where it felt like, consistently, someone was always reading. Something about the site's design and user culture created a magical space where people approached things with openness and curiosity and willingness to give their time and attention.\nThis felt like a place where you could write about anything and people would care. I've talked about the Put your Helmet…",
          "link": "https://azhdarchid.com/goodbye-cohost/",
          "publishedOn": "2024-10-01T00:17:00.000Z",
          "wordCount": 888,
          "title": "Goodbye, Cohost",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/azhdarchid/1024px-arambourgiania_philadelphiae.jpg"
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/wulfinna-black-and-red-rags?v=1728159612",
          "author": null,
          "description": "Author: Wulfinna\nTitle: Black and Red Rags\nDate: 3 Oct 2024\nSource: https://ignitedindark.wordpress.com/2024/10/03/black-red-rags/\n\n For me, I take the black rag over the red rag because I refuse to spill my blood for the right to be a worker, and instead practice negativity against every parcel of the world we have known for generations. \n The black rag represents fighting spirit, critical self-thought and innovative audacity. The red rag represents a conservative principle of Work taken to its most political extreme wherein workers own and police their own sorrow. The red rag means sacrifice for the re-constitution of sacrifice for the economy and politics. The black one cannot soundly be joined with the red. \n The black rag represents the potent intellect of midnight fury which prefaces…",
          "link": "https://theanarchistlibrary.org/library/wulfinna-black-and-red-rags?v=1728159612",
          "publishedOn": "2024-10-05T20:20:12.000Z",
          "wordCount": 718,
          "title": "Wulfinna - Black and Red Rags",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "5109",
            "url": "https://theanarchistlibrary.org/library/wulfinna-black-and-red-rags.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/last-journals-and-writings-of-sehid-tekoser-piling?v=1728158761",
          "author": null,
          "description": "Author: Ş. Tekoşer Piling\nLorenzo Orsetti\nTitle: Last Journals and Writings of Şehîd Tekoşer Piling\nDate: 2024\nSource: <tekosinaanarsist.noblogs.org/last-journals-and-writings-of-s-tekoser-piling-lorenzo-orsetti-5-years-anniversary>\n\nPreface\n 18th March 2019 Heval Tekoşer Piling fell şehîd in battle\n in Baghouz Fawqani, in Deir Ezzor region. \n He was a great friend to all of us and an incredibly brave soldier.\n From Afrin to Deir Ezzor, he was always the last to leave. \n We all carry the legacy of struggle from past times.\n Realizing our connection to our history and to fallen comrades\n gives us strength in present day. \n Şehîd Tekoşer will always remind us of the fallen comrades,\n the beauty of struggle and the price of the defense of freedom.\n With our grief, we celebrate Lorenzo’s life …",
          "link": "https://theanarchistlibrary.org/library/last-journals-and-writings-of-sehid-tekoser-piling?v=1728158761",
          "publishedOn": "2024-10-05T20:06:01.000Z",
          "wordCount": 9313,
          "title": "Ş. Tekoşer PilingLorenzo Orsetti - Last Journals and Writings of Şehîd Tekoşer Piling",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "2636032",
            "url": "https://theanarchistlibrary.org/library/last-journals-and-writings-of-sehid-tekoser-piling.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/uploads/en/thumbnails/l-j-last-journals-and-writings-of-sehid-tekoser-pi-1.jpg.large.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/logan-marie-glitterbomb-communizing-society-with-consumer-cooperatives?v=1728125462",
          "author": null,
          "description": "Author: Logan Marie Glitterbomb\nTitle: Communizing Society With Consumer Cooperatives\nDate: September 28th, 2024\nSource: https://c4ss.org/content/59900\n\n Within anarchist circles, there is a split between those who advocate markets and those who advocate forms of decentralized planning such as participatory economics or federated communes. While the work of Ludwig von Mises and Friedrich Hayek has pointed out the numerous issues with centralized state planning, much of the same criticisms can apply to decentralized planning as well. Decentralized planning attempts to avoid the knowledge problem by including participation from both producers and consumers directly in the planning process rather than relying on centralized planners to make decisions on their behalf. While worker cooperatives…",
          "link": "https://theanarchistlibrary.org/library/logan-marie-glitterbomb-communizing-society-with-consumer-cooperatives?v=1728125462",
          "publishedOn": "2024-10-05T10:51:02.000Z",
          "wordCount": 1068,
          "title": "Logan Marie Glitterbomb - Communizing Society With Consumer Cooperatives",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "5999",
            "url": "https://theanarchistlibrary.org/library/logan-marie-glitterbomb-communizing-society-with-consumer-cooperatives.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/elisha-moon-williams-feet-on-the-ground?v=1728106421",
          "author": null,
          "description": "Author: Elisha Moon Williams\nTitle: Feet On The Ground!\nSubtitle: Anarchism and the Labor Struggle Today\nDate: October 2nd, 2024\nSource: https://medium.com/@elisha1542/feet-on-the-ground-3182bd113c6f\n\n When I first started my journey as an anarchist, I was incredibly privileged in both my environment and upbringing. I had grown up in a very upper-middle class suburb, neither knowing economic struggle nor of want when it came to my basic needs. I was, at that point in my life, a young 20 year old ‘man’ living with their parents as I started my doomed college career. That was when I got into the package industry. \n Being a warehouse worker within the package industry was the most radicalizing job you could have given me. The sheer amount of naked disregard for safety and the well-being of my…",
          "link": "https://theanarchistlibrary.org/library/elisha-moon-williams-feet-on-the-ground?v=1728106421",
          "publishedOn": "2024-10-05T05:33:41.000Z",
          "wordCount": 1960,
          "title": "Elisha Moon Williams - Feet On The Ground!",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "88642",
            "url": "https://theanarchistlibrary.org/library/elisha-moon-williams-feet-on-the-ground.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/uploads/en/thumbnails/e-m-elisha-moon-williams-feet-on-the-ground-2.jpg.large.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}