{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "601196434e43e79993b9d6b3fc9bcffdf6c5b9af",
          "author": "Danilo Poccia",
          "description": "Map enterprise controls to AWS data sources effortlessly with predefined, pre-mapped controls based on auditor reviews. Automatically inherit improvements as Audit Manager updates.",
          "link": "https://aws.amazon.com/blogs/aws/simplify-risk-and-compliance-assessments-with-the-new-common-control-library-in-aws-audit-manager/",
          "publishedOn": "2024-06-06T18:59:12.000Z",
          "wordCount": 1788,
          "title": "Simplify risk and compliance assessments with the new common control library in AWS Audit Manager",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/04/17/CommonControls-feat-img2.png"
        },
        {
          "id": "064422b90ddb5c6a2f9e1679e220258b147e6e10",
          "author": "Taylor Jacobsen",
          "description": "The vibrant AWS community is made up of millions of builders worldwide. Within this global audience, there are technical enthusiasts who are going above and beyond to solve problems and generously share their learnings and best practices to empower others—the AWS Heroes. These inspirational leaders make significant contributions, and the AWS Heroes program is our […]",
          "link": "https://aws.amazon.com/blogs/aws/our-brand-new-cohort-of-aws-heroes-has-arrived-june-2024/",
          "publishedOn": "2024-06-05T17:01:57.000Z",
          "wordCount": 1445,
          "title": "Our brand-new cohort of AWS Heroes has arrived – June 2024",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/10/AWS-Heroes-program_RGB_Social-blog.png"
        },
        {
          "id": "3f19c95f29bda37b6717aedaa8d5a6566eb2061e",
          "author": "Channy Yun",
          "description": "Life is not always happy, there are difficult times. However, we can share our joys and sufferings with those we work with. The AWS Community is no exception. Jeff Barr introduced two members of the AWS community who are dealing with health issues. Farouq Mousa is an AWS Community Builder and fighting brain cancer. Allen […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-ec2-u7i-instances-bedrock-converse-api-aws-world-ipv6-day-and-more-june-3-2024/",
          "publishedOn": "2024-06-03T14:59:34.000Z",
          "wordCount": 1712,
          "title": "AWS Weekly Roundup: Amazon EC2 U7i Instances, Bedrock Converse API, AWS World IPv6 Day and more (June 3, 2024)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/08/13/AWS-WIR-default.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": [
        {
          "id": "68a73badc4128fca45f9a02fca4a40354c43ba89",
          "author": "Rostislav Markov",
          "description": "Genomics workflows process petabyte-scale datasets on large pools of compute resources. In this blog post, we discuss how life science organizations can use Amazon Web Services (AWS) to run transcriptomic sequencing data analysis using public datasets. This allows users to quickly test research hypotheses against larger datasets in support of clinical diagnostics. We use AWS […]",
          "link": "https://aws.amazon.com/blogs/architecture/genomics-workflows-part-7-analyze-public-rna-sequencing-data-using-aws-healthomics/",
          "publishedOn": "2024-06-05T15:46:19.000Z",
          "wordCount": 2259,
          "title": "Genomics workflows, Part 7: analyze public RNA sequencing data using AWS HealthOmics",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fc074d501302eb2b93e2554793fcaf50b3bf7291/2024/06/04/ARCHBLOG-1026-rna-sequencing-using-healthomics-1260x587.png"
        }
      ]
    },
    {
      "title": "The GitHub Blog: Engineering News and Updates",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/category/engineering/",
      "articles": [
        {
          "id": "https://github.blog/2024-06-03-how-github-reduced-testing-time-for-ios-apps-with-new-runner-features/",
          "author": null,
          "description": "<p>Learn how GitHub used macOS and Apple Silicon runners for GitHub Actions to build, test, and deploy our iOS app faster.</p>\n<p>The post <a href=\"https://github.blog/2024-06-03-how-github-reduced-testing-time-for-ios-apps-with-new-runner-features/\">How GitHub reduced testing time for iOS apps with new runner features</a> appeared first on <a href=\"https://github.blog\">The GitHub Blog</a>.</p>",
          "link": "https://github.blog/2024-06-03-how-github-reduced-testing-time-for-ios-apps-with-new-runner-features/",
          "publishedOn": "2024-06-03T16:45:06.000Z",
          "wordCount": 1755,
          "title": "How GitHub reduced testing time for iOS apps with new runner features",
          "imageUrl": "https://github.blog/wp-content/uploads/2024/01/Productivity-DarkMode-3.png?fit=1200%2C630"
        }
      ]
    },
    {
      "title": "AWS DevOps Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": [
        {
          "id": "e266f15f4c44e10267e7203bc95772d1893f4740",
          "author": "Brendan Jenkins",
          "description": "Operators, administrators, developers, and many other personas leveraging AWS come across multiple common issues when it comes to troubleshooting in the AWS Console. To help alleviate this burden, AWS released Amazon Q. Amazon Q is AWS’s generative AI-powered assistant that helps make your organizational data more accessible, write code, answer questions, generate content, solve problems, […]",
          "link": "https://aws.amazon.com/blogs/devops/five-troubleshooting-examples-with-amazon-q/",
          "publishedOn": "2024-06-07T11:05:29.000Z",
          "wordCount": 2631,
          "title": "Five troubleshooting examples with Amazon Q",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/05/30/Slide4.png"
        },
        {
          "id": "164df924bc95becc32ff082f3115d9fb5a422c33",
          "author": "Matt Laver",
          "description": "AWS CodeBuild now supports managed self-hosted GitHub Action runners, allowing you to build powerful CI/CD capabilities right beside your code and quickly implement a build, test and deploy pipeline. Last year AWS announced that customers can define their GitHub Actions steps within any phase of a CodeBuild buildspec file but with a self-hosted runner, jobs […]",
          "link": "https://aws.amazon.com/blogs/devops/aws-codebuild-managed-self-hosted-github-action-runners/",
          "publishedOn": "2024-06-07T10:52:45.000Z",
          "wordCount": 2558,
          "title": "AWS CodeBuild Managed Self-Hosted GitHub Action Runners",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/7719a1c782a1ba91c031a682a0a2f8658209adbf/2024/06/06/Screenshot-2024-06-06-at-22.23.01-1121x630.png"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/fd78328ee0bb",
          "author": "Netflix Technology Blog",
          "description": "At Netflix, we want to ensure that every current and future member finds content that thrills them today and excites them to come back for…",
          "link": "https://netflixtechblog.com/round-2-a-survey-of-causal-inference-applications-at-netflix-fd78328ee0bb?source=rss----2615bd06b42e---4",
          "publishedOn": "2024-06-06T20:10:54.000Z",
          "wordCount": 5149,
          "title": "Round 2: A Survey of Causal Inference Applications at Netflix",
          "imageUrl": "https://miro.medium.com/v2/da:true/resize:fit:823/0*e8IMSJf7p60mk-WG"
        }
      ]
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "3c3360f277065058342fa8bc314bed62983bcb6b",
          "author": "Rajdeep Saha",
          "description": "Introduction Freddie Mac has a mission to provide a stable US housing Market. Freddie Mac identified the need for faster application delivery, scalable performance, increased resiliency, and cost optimization of their existing application portfolio. To achieve their mission goals, Freddie Mac undertook a migration from on-premises Kubernetes to Amazon Elastic Kubernetes Service (Amazon EKS). As […]",
          "link": "https://aws.amazon.com/blogs/containers/how-freddie-mac-used-amazon-eks-to-modernize-their-platform-and-migrate-applications/",
          "publishedOn": "2024-06-03T16:08:46.000Z",
          "wordCount": 3251,
          "title": "How Freddie Mac used Amazon EKS to modernize their platform and migrate applications",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/05/17/Featured-images-for-Containers-Blog-7-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=324793",
          "author": "Jeffrey St. Clair",
          "description": "Rasha Kareem wasn’t hiding from the police. She didn’t think she’d done anything wrong. And she hadn’t done anything wrong. Not by any reasonable standard. Rasha was simply going about her day. She owned a beauty salon in Majd Al-Krum, a town in the Galilee. She was running routine errands when Israeli police pulled her over. Rasha is tall and elegant. She has the face of a model and long, shimmering black hair. She was wearing a sleek black dress. She tried to maintain her composure as Israeli police swarmed around her. There is a look of confusion and then a flash of fear on her face as she is told she’s being arrested.  More\nThe post Snatch-and-Grab Israeli Style: Disappearing into the Gulag appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/snatch-and-grab-israeli-style-disappearing-into-the-gulag/",
          "publishedOn": "2024-06-07T06:00:14.000Z",
          "wordCount": null,
          "title": "Snatch-and-Grab Israeli Style: Disappearing into the Gulag",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324833",
          "author": "Vijay Prashad",
          "description": "The neoliberal attack on government expenditure in poorer countries was a key driver of international migration. Even by 1990, it had become clear that the migrants had become an essential force in providing foreign exchange to their countries through increasing remittance payments to their families. By 2015, remittances—mostly by the international working class—outstripped the volume of Official Development Assistance (ODA) by three times and Foreign Direct Investment (FDI). ODA is the aid money provided by states, whereas FDI is the investment money provided by private companies. For some countries, such as Mexico and the Philippines, remittance payments from working-class migrants prevented state bankruptcy. More\nThe post Migrating Workers Provide Wealth for the World appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/migrating-workers-provide-wealth-for-the-world/",
          "publishedOn": "2024-06-07T05:59:39.000Z",
          "wordCount": null,
          "title": "Migrating Workers Provide Wealth for the World",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324797",
          "author": "Matthew Stevenson",
          "description": "I am not saying that Judge Merchan should lock Trump away in some KGB mental hospital, as happened to the political opposition in Stalin’s Soviet Union. But I am pointing out that while New York State court has jurisdiction over convicted felon Trump, the judge has both the right and the obligation—before issuing a sentence—to find out if the defendant has understood the charges that were brought against him. (From his endless press conferences during his trials, Trump sounds clueless about the facts in his own cases.) More\nThe post Send Trump to Bedlam, Not Rikers appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/324797/",
          "publishedOn": "2024-06-07T05:58:09.000Z",
          "wordCount": null,
          "title": "Send Trump to Bedlam, Not Rikers",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324818",
          "author": "Daniel Falcone",
          "description": "Introduction This writing discusses the importance of teaching the Israeli-Palestinian conflict and attempts to explain the barriers and obstacles associated with teaching it. After providing 9/11 as a case study, I emphasize why school leaders and teachers hesitate to address, or outright ignore the conflict. Additionally, it is important to understand what can be avoided  More\nThe post Teaching Palestine: The Causes and Consequences of Organized Forgetting appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/teaching-palestine-the-causes-and-consequences-of-organized-forgetting/",
          "publishedOn": "2024-06-07T05:57:43.000Z",
          "wordCount": null,
          "title": "Teaching Palestine: The Causes and Consequences of Organized Forgetting",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324906",
          "author": "Quincy Saul",
          "description": "“When you write about our adventure in Nepal, make sure it doesn’t read like a tourist guide” – Satyajit Ray (The Criminals of Kathmandu) I return from the World Social Forum in Nepal with a haystack full of notes, a head full of a thousand threads, asking my heart how to find and thread the  More\nThe post The World Social Forum in Nepal appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/the-world-social-forum-in-nepal/",
          "publishedOn": "2024-06-07T05:56:35.000Z",
          "wordCount": null,
          "title": "The World Social Forum in Nepal",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324719",
          "author": "Eve Ottenberg",
          "description": "The whole phony case against Assange stinks of corruption and abuse of power. Corruption because the CIA under Mike “Get Assange” Pompeo plotted to kidnap or murder the journalist and also, corruptly, listened in on his privileged conversations with his attorney in the Ecuadoran embassy. Corruption because bogus charges were cooked up against him by a pliant Swedish prosecutor, the sole purpose of which was to toss Assange into the clutches of the furious U.S. government. Assange did not rape those two women in Sweden, and the prosecutor eventually dropped the case. But the damage was done: to Assange’s reputation and to his freedom, because once he sought refuge in the Ecuadoran embassy, he was trapped. More\nThe post How Long Must He Wait? Assange Wins Right to Appeal appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/how-long-must-he-wait-assange-wins-right-to-appeal/",
          "publishedOn": "2024-06-07T05:56:07.000Z",
          "wordCount": null,
          "title": "How Long Must He Wait? Assange Wins Right to Appeal",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324750",
          "author": "Binoy Kampmark",
          "description": "Australia’s modest sovereign wealth fund, modestly standing at A$272.3 billion, has crawled into some trouble of late.  Investors, morally twinged, are keeping an eye on where the money of the Australian Future Fund goes.  Inevitably, a good slice of it seems to be parked in the military-industrial complex, a sector that performs on demand. Filed last October,  More\nThe post Inexplicable Investments: Elbit Systems and Australia’s Future Fund appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/inexplicable-investments-elbit-systems-and-australias-future-fund/",
          "publishedOn": "2024-06-07T05:55:11.000Z",
          "wordCount": null,
          "title": "Inexplicable Investments: Elbit Systems and Australia’s Future Fund",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324713",
          "author": "Kathleen Wallace",
          "description": "What to do when your home country fits all the criteria in the DSM-5 for Narcissistic Personality Disorder? That’s a tough one. If a nation can allow corporations to be persons, I think it is only fair that the nation itself be subject to the same mental scrutiny that a person behaving in a deranged  More\nThe post Narcissistic Personality Disorder in the USA appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/narcissistic-personality-disorder-in-the-usa/",
          "publishedOn": "2024-06-07T05:55:08.000Z",
          "wordCount": null,
          "title": "Narcissistic Personality Disorder in the USA",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324807",
          "author": "William Astore",
          "description": "As a late-stage baby boomer, a child of the 1960s, I grew up dreaming about America’s nuclear triad. You may remember that it consisted of strategic bombers like the B-52 Stratofortress, land-based intercontinental ballistic missiles (ICBMs) like the Minuteman, and submarine-launched ballistic missiles (SLBMs) like the Poseidon, all delivery systems for what we then called  More\nThe post Nuclear Armageddon Is Us appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/nuclear-armageddon-is-us/",
          "publishedOn": "2024-06-07T05:55:04.000Z",
          "wordCount": null,
          "title": "Nuclear Armageddon Is Us",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324802",
          "author": "Robert Hunziker",
          "description": "“Whiskey’s for drinking and water’s for fighting,” a popular adage from the chronicles of the American West that’s starting to come back into vogue. The world’s megacities are on a knife’s edge of water stress. Climate change is clobbering water resources and testing the nerves of the world, especially megacities, e.g., Mexico City (pop. 22  More\nThe post Where’s the Water? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/wheres-the-water/",
          "publishedOn": "2024-06-07T05:55:03.000Z",
          "wordCount": null,
          "title": "Where’s the Water?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324929",
          "author": "David Yearsley",
          "description": "We met in Minot. My father came from Seattle on the “Empire Builder” Amtrak train with the rifle—a Winchester 1886. I flew in from New York with a Reiseklavier—a travel clavichord modeled on the portable instruments virtuosos such as Mozart used when on the road back in Europe in the 18th century. The gun hasn’t  More\nThe post Bang for Your Bach appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/bang-for-your-bach/",
          "publishedOn": "2024-06-07T05:54:48.000Z",
          "wordCount": null,
          "title": "Bang for Your Bach",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324706",
          "author": "Daniel Warner",
          "description": "Russia and its president have become pariahs in the West. Politically, several Western countries, companies and the European Union sanctioned Russian President Vladimir Putin, members of his government and Russian citizens as well as Russian banks with various forms of economic boycotts and embargoes following Russia’s invasion of Ukraine. Legally, the International Court of Justice  More\nThe post Make Israel and Netanyahu Pariahs Like Russia and Putin appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/make-israel-and-netanyahu-pariahs-like-russia-and-putin/",
          "publishedOn": "2024-06-07T05:54:37.000Z",
          "wordCount": null,
          "title": "Make Israel and Netanyahu Pariahs Like Russia and Putin",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324722",
          "author": "Ariel Dorfman",
          "description": "On May 4, as war and famine raged in Gaza, Amsterdam marked Remembrance Day, an annual commemoration of those who resisted the Nazi occupation, with special emphasis from the city’s organizing committee on the Jews who perished in the onslaught. Among the dozens of ceremonies that crisscrossed the city, I joined one at the Centrale  More\nThe post Remembering the Holocaust as Gaza Starves appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/remembering-the-holocaust-as-gaza-starves/",
          "publishedOn": "2024-06-07T05:53:52.000Z",
          "wordCount": null,
          "title": "Remembering the Holocaust as Gaza Starves",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324795",
          "author": "Eric Mann",
          "description": "How a Black United Front in Harlem, the Students’ Afro American Society, and Students for a Democratic Society took on the Columbia University Ruling Class, Mayor John Lindsay, the New York Times, the NYPD—and won! “There are decades where nothing happens; and there are weeks when decades happen.” – V.I. Lenin This article was written  More\nThe post The Historic 1968 Struggle Against Columbia University appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/the-historic-1968-struggle-against-columbia-university-2/",
          "publishedOn": "2024-06-07T05:50:36.000Z",
          "wordCount": null,
          "title": "The Historic 1968 Struggle Against Columbia University",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324815",
          "author": "Mel Gurtov",
          "description": "South Africa, India, and Mexico just held general elections. Britain will hold a general election July 4. The US will hold one Nov. 5. Record-setting demonstrations in Israel may yet lead to a general election there. Five of these six elections reveal the precarious hold on power of the incumbents, and the threats to democracy  More\nThe post The Elections‑Democracy Gap appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/the-elections%e2%80%91democracy-gap/",
          "publishedOn": "2024-06-07T05:50:16.000Z",
          "wordCount": null,
          "title": "The Elections‑Democracy Gap",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324733",
          "author": "Joseph Grosso",
          "description": "A serious look at the state of global energy presents something of a double-edged sword. On one hand, 2023 was another record year for renewable installations worldwide. An estimated 507 GW (gigawatts) of new generation capacity was installed a 50 percent increase from 2022. On the other hand, according to estimates by the International Energy  More\nThe post The Necessary State: the Market Can’t Deliver the Energy Transition appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/the-necessary-state-the-market-cant-deliver-the-energy-transition/",
          "publishedOn": "2024-06-07T05:50:07.000Z",
          "wordCount": null,
          "title": "The Necessary State: the Market Can’t Deliver the Energy Transition",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324746",
          "author": "Manuel Perez-Rocha",
          "description": "Earlier this year, El Salvadoran president Nayib Bukele won reelection by a wide margin. His Nuevas Ideas party also won 54 of the 60 seats in the Legislative Assembly and the vast majority of the country’s mayorships. His power is now almost absolute. But the elections were marred by a large number of irregularities documented  More\nThe post El Salvador Braces for Five More Years of the World’s Self-Proclaimed “Coolest Dictator” appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/el-salvador-braces-for-five-more-years-of-the-worlds-self-proclaimed-coolest-dictator/",
          "publishedOn": "2024-06-07T05:49:45.000Z",
          "wordCount": null,
          "title": "El Salvador Braces for Five More Years of the World’s Self-Proclaimed “Coolest Dictator”",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324875",
          "author": "Michael Hudson",
          "description": "Roman land tenure was based increasingly on the appropriation of conquered territory, which was declared public land, the ager publicus populi. The normal practice was to settle war veterans on it, but the wealthiest and most aggressive families grabbed such land for themselves in violation of early law. Cassius’ Indecent Proposal The die was cast  More\nThe post Roman Oligarchs Avoided Tax Liability and Restrictions on Land Size appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/roman-oligarchs-avoided-tax-liability-and-restrictions-on-land-size/",
          "publishedOn": "2024-06-07T05:48:18.000Z",
          "wordCount": null,
          "title": "Roman Oligarchs Avoided Tax Liability and Restrictions on Land Size",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324712",
          "author": "Richard Klin",
          "description": "That Little Weirdo Next Door  Tommy, the little boy next door, likes sparkly things and show tunes. What is the best way to shame and shun him? An accessible, step-by-step guide for kids. Bye-bye! Easy as Pie! It’s easy for little ones to detect a foreign accent—and just as easy to turn those illegals over  More\nThe post Moms for Liberty’s Book Roundup!  Upcoming, Appropriate Books for Children appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/moms-for-libertys-book-roundup-upcoming-appropriate-books-for-children/",
          "publishedOn": "2024-06-07T05:46:32.000Z",
          "wordCount": null,
          "title": "Moms for Liberty’s Book Roundup!  Upcoming, Appropriate Books for Children",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324652",
          "author": "Ron Jacobs",
          "description": "In 1976, the philosopher Herbert Marcuse wrote that “American fascism will probably be the first which comes to power by democratic means and with democratic support.” A few years earlier, in a series of letters between Black Panther George Jackson, Angela Davis and Jackson’s attorney John Thorne, Jackson wrote: “Fascism was the product of class  More\nThe post Fascism in the 2020s appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/fascism-in-the-2020s/",
          "publishedOn": "2024-06-07T05:45:27.000Z",
          "wordCount": null,
          "title": "Fascism in the 2020s",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324747",
          "author": "David Swanson",
          "description": "That is the question, and it’s not very different from Hamlet’s: Should we exist or not? When you watch Congressional hearings on COVID, please ignore every other question. The question is not whether Marjorie Taylor Green could find her ass with a map and two hands, or why it’s left to her to oppose torturing  More\nThe post Should Low-Brain-Cell Sociopaths Play With Bioweapons? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/should-low-brain-cell-sociopaths-play-with-bioweapons/",
          "publishedOn": "2024-06-07T05:44:33.000Z",
          "wordCount": null,
          "title": "Should Low-Brain-Cell Sociopaths Play With Bioweapons?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324828",
          "author": "Sovaida Maani Ewing",
          "description": "We live in a global family of more than 190 countries. Disputes and squabbles inevitably arise in all families; what matters is how we settle them. Just as immature families might see bullying and violence, at the global level we see countries threatening and waging war, paying dearly in unnecessary death and suffering. By contrast,  More\nThe post Fixing Our Broken International System of Justice appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/fixing-our-broken-international-system-of-justice/",
          "publishedOn": "2024-06-07T05:44:16.000Z",
          "wordCount": null,
          "title": "Fixing Our Broken International System of Justice",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324731",
          "author": "Jerry Long",
          "description": "While there’s been a lot of analysis over who won the negotiations for the Biden – Trump debate, who lost should be obvious. As expected, the American people’s stipulation that nominees of major parties be able to convey a minimum appearance of coherence has been spectacularly ignored. But although democracy remains a thing best aspired  More\nThe post The Perfect Format for a Biden/Trump Debate appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/the-perfect-format-for-a-biden-trump-debate/",
          "publishedOn": "2024-06-07T05:43:55.000Z",
          "wordCount": null,
          "title": "The Perfect Format for a Biden/Trump Debate",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324820",
          "author": "Paul Street",
          "description": "Imagine how asinine the United States — the self-proclaimed “world’s greatest democracy” — must look to much of the world in the wake of Donald Trump’s 34-count felony conviction last week. If the nation wasn’t such a lethal menace to life on Earth, it might almost be amusing. A System That Offers You the Choice  More\nThe post A Sick System Long Past Its Overthrow Date appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/a-sick-system-long-past-its-overthrow-date/",
          "publishedOn": "2024-06-07T05:37:30.000Z",
          "wordCount": null,
          "title": "A Sick System Long Past Its Overthrow Date",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324692",
          "author": "Steven Krichbaum",
          "description": "Hatchling Wood Turtle emerging from a roadside nest in Virginia It’s that time of year, maybe you’ve already noticed. Animals are back and moving about and trying to reproduce. But in this age of hundreds of millions of motor vehicles going everywhere at high speeds, anybody who’s slow is vulnerable. And one of the most  More\nThe post Give Turtles a Brake! appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/give-turtles-a-brake-3/",
          "publishedOn": "2024-06-07T05:36:16.000Z",
          "wordCount": null,
          "title": "Give Turtles a Brake!",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324844",
          "author": "Steve Early",
          "description": "In some unions, the traditional way of winning approval for a proposed contract with management, that’s not popular with the members, is to hold a series of votes on essentially the same “tentative agreement.”  Rank-and-file militants urging a “No” vote get worn down and demoralized by the prolonged ratification process. By a narrow margin, their less  More\nThe post Democracy Thwarted: VT Council Delegates Must Keep Voting… Until Results Please AFL Headquarters? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/democracy-thwarted-vt-council-delegates-must-keep-voting-until-results-please-afl-headquarters/",
          "publishedOn": "2024-06-07T05:35:24.000Z",
          "wordCount": null,
          "title": "Democracy Thwarted: VT Council Delegates Must Keep Voting… Until Results Please AFL Headquarters?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324835",
          "author": "Richard Schulman",
          "description": "Imagine fifteen thousand blinks per day: 15000 moments in which I have missed a photograph, 15000 snaps I think about. Each day, every day I ask: so now what? So now what must I do? How do I recapture time and imagery that has been lost in my mind or absconded by thieves in the  More\nThe post Architecture of Cities: Just a Dream appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/architecture-of-cities-just-a-dream/",
          "publishedOn": "2024-06-07T05:35:22.000Z",
          "wordCount": null,
          "title": "Architecture of Cities: Just a Dream",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324592",
          "author": "Nicky Reid",
          "description": "“The ‘Enlightenment’, which discovered the liberties, also invented the disciplines.” -Michel Foucault I’ve been called some pretty heinous things in my life, and I’ll proudly own most of them with a smile, but every time I get called a liberal someone has to die. Call me a faggot, call me a shemale, call me a  More\nThe post There is Nothing Queer About Liberalism appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/there-is-nothing-queer-about-liberalism/",
          "publishedOn": "2024-06-07T05:30:03.000Z",
          "wordCount": null,
          "title": "There is Nothing Queer About Liberalism",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324824",
          "author": "Evaggelos Vallianatos",
          "description": "Prologue Nick Bryant and I love America. We are both historians. He received his Ph.D. in American history from Oxford and I in Greek and European history from Wisconsin. We migrated to America, he to report for BBC, and I to go to school and work on Capitol Hill and the US Environmental Protection Agency.  More\nThe post In Empire, Billionaires, and Wars We Trust appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/in-empire-billionaires-and-wars-we-trust/",
          "publishedOn": "2024-06-07T05:26:48.000Z",
          "wordCount": null,
          "title": "In Empire, Billionaires, and Wars We Trust",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=324872",
          "author": "Alice Slater",
          "description": "It is quite astonishing and clearly insane, that Manfred Weber, the German leader of the European Union’s center-right European People’s Party, now expected to come in first in the European Parliament election scheduled on June 6-9th, is calling for the EU’s own nuclear “deterrent”—arguing that the US-stationed nuclear weapons in five NATO states, Germany, Italy,  More\nThe post European Nuclear Deterrent a Harebrained Illegal Proposal appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/06/07/european-nuclear-deterrent-a-harebrained-illegal-proposal/",
          "publishedOn": "2024-06-07T04:35:12.000Z",
          "wordCount": null,
          "title": "European Nuclear Deterrent a Harebrained Illegal Proposal",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": []
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45403",
          "author": "Lars Syll",
          "description": "from Lars Syll In practice, what math does is let macro-economists locate the FWUTVs [facts with unknown truth values] farther away from the discussion of identification … Relying on a micro-foundation lets an author say, “Assume A, assume B, … blah blah blah … And so we have proven that P is true. Then the […]",
          "link": "https://rwer.wordpress.com/2024/06/04/post-real-economics-a-severe-case-of-mathiness/",
          "publishedOn": "2024-06-04T16:31:32.000Z",
          "wordCount": 4478,
          "title": "Post-real economics — a severe case of mathiness",
          "imageUrl": "https://larspsyll.wordpress.com/wp-content/uploads/2017/05/blah_blah.jpg"
        },
        {
          "id": "http://rwer.wordpress.com/?p=45399",
          "author": "Editor",
          "description": "from Jayati Ghosh The international-development sector has become fixated on calculating financing gaps. Hardly a day goes by without new estimates of the funds low- and middle-income countries (LMICs) need to meet their climate targets and achieve the United Nations Sustainable Development Goals (SDGs). The Independent High-Level Expert Group on Climate Finance, for example, estimates that developing […]",
          "link": "https://rwer.wordpress.com/2024/06/03/the-billions-to-trillions-charade/",
          "publishedOn": "2024-06-03T19:57:10.000Z",
          "wordCount": 4655,
          "title": "The ‘Billions to Trillions’ charade",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=272933",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, pandemics; Trump, Trump, Trump; many new Covid numbers, some irritating; Vivian Maier's first exhibition; steroids: is everybody really taking them? ~",
          "link": "https://www.nakedcapitalism.com/2024/06/200pm-water-cooler-6-7-2024.html",
          "publishedOn": "2024-06-07T18:00:38.000Z",
          "wordCount": 7389,
          "title": "2:00PM Water Cooler 6/7/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/06/rcp_2024-06-07.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272922",
          "author": "Yves Smith",
          "description": "The US does not look to have come out well from its latest dominance display against Russia.",
          "link": "https://www.nakedcapitalism.com/2024/06/the-cautious-us-escalation-against-russia-is-developing-not-necessarily-to-us-advantage.html",
          "publishedOn": "2024-06-07T16:24:42.000Z",
          "wordCount": 5644,
          "title": "The Cautious US Escalation Against Russia Is Developing Not Necessarily to US Advantage",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/06/00-kiev-power.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272919",
          "author": "Lambert Strether",
          "description": "",
          "link": "https://www.nakedcapitalism.com/2024/06/links-6-7-2024.html",
          "publishedOn": "2024-06-07T10:58:45.000Z",
          "wordCount": 14223,
          "title": "Links 6/7/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/06/Pseudomallada_edwardsi.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272829",
          "author": "Nick Corbishley",
          "description": "“The personal data processed by this X subcontractor includes data of a sovereign nature. An identity document is a sensitive document. This raises a number of questions...\"",
          "link": "https://www.nakedcapitalism.com/2024/06/x-premium-users-face-stark-choice-hand-over-biometric-identitifiers-id-to-israeli-intelligence-linked-company-or-lose-monetisation.html",
          "publishedOn": "2024-06-07T10:45:43.000Z",
          "wordCount": 7247,
          "title": "X Premium Users Face Stark Choice: Hand Over Biometric Identitifiers to “Spooky” Israeli Firm or Get Demonetised",
          "imageUrl": "https://pbs.twimg.com/media/GO3lLnOXAAAefiS?format=jpg&name=medium"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272914",
          "author": "Yves Smith",
          "description": "The problem with the EV as a climate change remedy is that it is still a car.",
          "link": "https://www.nakedcapitalism.com/2024/06/when-it-comes-to-the-environment-there-really-is-no-such-thing-as-a-good-car.html",
          "publishedOn": "2024-06-07T07:02:56.000Z",
          "wordCount": 9988,
          "title": "When It Comes to the Environment, There Really Is No Such Thing as a “Good” Car",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/06/00-car.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272863",
          "author": "Yves Smith",
          "description": "La Niña will most likely quell a stretch of global record heat, but human-produced greenhouse gases loom as large as ever.",
          "link": "https://www.nakedcapitalism.com/2024/06/research-on-earths-raging-heat-of-2023-24-is-picking-up.html",
          "publishedOn": "2024-06-07T05:02:52.000Z",
          "wordCount": 6845,
          "title": "Research on Earth’s Raging Heat of 2023-24 Is Picking Up",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/06/00-heat.webp"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272867",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, Syndemics; Trump Georgia case delayed; Joe and Jill Biden at Omaha Beach; don't try this at home! ~",
          "link": "https://www.nakedcapitalism.com/2024/06/200pm-water-cooler-6-6-2024.html",
          "publishedOn": "2024-06-06T18:00:44.000Z",
          "wordCount": 16363,
          "title": "2:00PM Water Cooler 6/6/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/rcp_2024_05-31.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272858",
          "author": "Yves Smith",
          "description": "Does a critique of EU migration policies reveal more than it intended to?",
          "link": "https://www.nakedcapitalism.com/2024/06/the-eus-outsourced-migration-control-is-violent-expensive-and-ineffective.html",
          "publishedOn": "2024-06-06T14:12:36.000Z",
          "wordCount": 5919,
          "title": "The EU’s Outsourced Migration Control Is Violent, Expensive and Ineffective",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272837",
          "author": "Lambert Strether",
          "description": "Our bearish daily links",
          "link": "https://www.nakedcapitalism.com/2024/06/links-6-6-2024.html",
          "publishedOn": "2024-06-06T10:58:14.000Z",
          "wordCount": 15616,
          "title": "Links 6/6/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/06/kodiak_bear.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272844",
          "author": "Yves Smith",
          "description": "With electric demand from data centers skyrocketing, the state considers how to meet its goal of decarbonizing the grid.",
          "link": "https://www.nakedcapitalism.com/2024/06/in-virginia-data-centers-collide-with-zero-carbon-goals.html",
          "publishedOn": "2024-06-06T10:54:27.000Z",
          "wordCount": 5246,
          "title": "In Virginia, Data Centers Collide with Zero-Carbon Goals",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "66620b31e955c4000a8b4b51",
          "author": "João Tomé",
          "description": "The 2024 European Parliament election began in the Netherlands on June 6. Cloudflare mitigated several multi-hour DDoS attacks on Dutch political websites on June 5 and 6",
          "link": "https://blog.cloudflare.com/dutch-political-websites-hit-by-cyber-attacks-as-eu-voting-starts",
          "publishedOn": "2024-06-06T19:23:17.000Z",
          "wordCount": 1078,
          "title": "Dutch political websites hit by cyber attacks as EU voting starts",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/06/Dutch-political-websites-hit-by-cyber-attacks-as-EU-voting-starts-OG-1.png"
        },
        {
          "id": "66609308e955c4000a8b49da",
          "author": "Jocelyn Woolbright",
          "description": "In celebration of Project Galileo's 10th anniversary, we want to give you a snapshot of what organizations that work in the public interest experience on an everyday basis when it comes to keeping their websites online",
          "link": "https://blog.cloudflare.com/galileo10anniversaryradardashboard",
          "publishedOn": "2024-06-06T10:00:23.000Z",
          "wordCount": 1647,
          "title": "Protecting vulnerable communities for 10 years with Project Galileo",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/06/Protecting-vulnerable-communities-for-10-years-with-Project-Galileo-OG-3.png"
        },
        {
          "id": "6658791a7d1754000b5c0e7a",
          "author": "Petra Arts",
          "description": "Between 6 and 9 June 2024, hundreds of millions of EU citizens will be voting to elect their members of the European Parliament (MEPs). All EU member states have different election processes, institutions and methods, and the security risks are significant",
          "link": "https://blog.cloudflare.com/eu-elections-2024",
          "publishedOn": "2024-06-05T13:00:46.000Z",
          "wordCount": 2268,
          "title": "European Union elections 2024: securing democratic processes in light of new threats",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/06/European-Union-elections-2024--securing-democratic-processes-in-light-of-new-threats-OG-1.png"
        },
        {
          "id": "6659ca91bdbaa8000a84c543",
          "author": "Colin Douch",
          "description": "Recently, Cloudflare's Observability team undertook an effort to migrate our existing syslog-ng backed logging infrastructure to instead being backed by OpenTelemetry Collectors. In this post, we detail the process that we undertook, and the difficulties we faced along the way",
          "link": "https://blog.cloudflare.com/adopting-opentelemetry-for-our-logging-pipeline",
          "publishedOn": "2024-06-03T13:00:41.000Z",
          "wordCount": 2591,
          "title": "Adopting OpenTelemetry for our logging pipeline",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/06/image3-9-1.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": [
        {
          "id": "https://kubernetes.io/blog/2024/06/06/10-years-of-kubernetes/",
          "author": null,
          "description": "Ten (10) years ago, on June 6th, 2014, the\nfirst commit\nof Kubernetes was pushed to GitHub. That first commit with 250 files and 47,501 lines of go, bash\nand markdown kicked off the project we have today. Who could have predicted that 10 years later,\nKubernetes would grow to become one of the largest Open Source projects to date with over\n88,000 contributors from\nmore than 8,000 companies, across\n44 countries.\nThis milestone isn't just for Kubernetes but for the Cloud Native ecosystem that blossomed from\nit. There are close to 200 projects\nwithin the CNCF itself, with contributions from\n240,000+ individual contributors and\nthousands more in the greater ecosystem. Kubernetes would not be where it is today without them, the\n7M+ Developers,\nand the even larger user community that have all hel…",
          "link": "https://kubernetes.io/blog/2024/06/06/10-years-of-kubernetes/",
          "publishedOn": "2024-06-06T00:00:00.000Z",
          "wordCount": 5356,
          "title": "10 Years of Kubernetes",
          "imageUrl": "kcseu2024.jpg"
        }
      ]
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": [
        {
          "id": "https://code.visualstudio.com/blogs/2024/06/07/wasm-part2",
          "author": null,
          "description": "Read the full article",
          "link": "https://code.visualstudio.com/blogs/2024/06/07/wasm-part2",
          "publishedOn": "2024-06-07T00:00:00.000Z",
          "wordCount": 2170,
          "title": "VS Code Extensions and WebAssembly - Part Two",
          "imageUrl": "https://code.visualstudio.com/opengraphimg/opengraph-blog.png"
        },
        {
          "id": "https://code.visualstudio.com/updates/v1_90",
          "author": null,
          "description": "Visual Studio Code May 2024\nRead the full article",
          "link": "https://code.visualstudio.com/updates/v1_90",
          "publishedOn": "2024-06-05T17:00:00.000Z",
          "wordCount": 4026,
          "title": "Visual Studio Code May 2024",
          "imageUrl": "https://code.visualstudio.com/assets/updates/1_90/release-highlights.png"
        }
      ]
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": []
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=40607613",
          "author": "panphora",
          "description": "If you're planning to cancel, here's how to avoid the 50% cancellation fee:\n1. Go to cancel your subscription. You will see a screen with the cancellation fee. Continue.\n2. They will offer you a new plan to avoid the cancellation fee. Choose the cheapest one to switch to a new plan.\n3. Here's the loophole: You can cancel any plan for free within two weeks. Cancel the new plan within this period and get your money back for the first month of the new plan.\nYou've avoided the fee.\nSource: https://www.reddit.com/r/VideoEditing/comments/k9kh6v/how_to...",
          "link": "https://news.ycombinator.com/item?id=40607613",
          "publishedOn": "2024-06-07T11:36:01.000Z",
          "wordCount": 2013,
          "title": "New comment by panphora in \"Cancel Adobe if you are a creative under NDA with your clients\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40605735",
          "author": "kstrauser",
          "description": "Not the submitter, but I installed this a couple days ago to replace Bartender. For those not following along at home, the Bartender author just sold it to some sketchy app mill. It’s an app that legitimately requires screen recording permissions to work. I trusted the old author’s reputation. I have zero trust in the own owner.\nIce isn’t as good yet. It’s not nearly so configurable. For example, you can either hide all icons or none. You can’t decide to show some of them all the time. That’s a bummer. I’ll still happily accept that trade off to replace Bartender, which I’d previously purchased several versions of. It’s dead to me.\nGreat job so far, Ice. I hope you keep improving!",
          "link": "https://news.ycombinator.com/item?id=40605735",
          "publishedOn": "2024-06-07T06:02:58.000Z",
          "wordCount": 1901,
          "title": "New comment by kstrauser in \"Ice - open source bar manager for macOS\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40604233",
          "author": "renaudg",
          "description": "The problem may have more to do with Uganda and having a surveillance state than it has to do with National ID cards.\nMost European countries have them and they are as uncontroversial as passports.\nCountries without national ID cards are not especially more privacy minded : for the purpose of identity verification they just use alternative documents & processes that are less straightforward and at least as intrusive (e.g. driving licenses, utility bills and credit checks in the US and UK).\nIMO it's much more honest to recognize that there's a legitimate need to be able to prove one's identity in a functioning society, and to build a dedicated system for that, instead of tying your existence as a citizen to your ability / willingness to drive a large piece of metal around.",
          "link": "https://news.ycombinator.com/item?id=40604233",
          "publishedOn": "2024-06-07T00:58:36.000Z",
          "wordCount": 8528,
          "title": "New comment by renaudg in \"Uganda's surveillance state is built on national ID cards\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40601827",
          "author": "thegrim33",
          "description": "From the article:\n\"We currently don't understand how to make sense of the neural activity within language models.\"\n\"Unlike with most human creations, we don’t really understand the inner workings of neural networks.\"\n\"The [..] networks are not well understood and cannot be easily decomposed into identifiable parts\"\n\"[..] the neural activations inside a language model activate with unpredictable patterns, seemingly representing many concepts simultaneously\"\n\"Learning a large number of sparse features is challenging, and past work has not been shown to scale well.\"\netc., etc., etc.\nPeople say we don't (currently) know why they output what they output, because .. as the article clearly states, we don't.",
          "link": "https://news.ycombinator.com/item?id=40601827",
          "publishedOn": "2024-06-06T20:11:35.000Z",
          "wordCount": null,
          "title": "New comment by thegrim33 in \"Extracting concepts from GPT-4\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40598887",
          "author": "world2vec",
          "description": "Seeing the Starship's flap visibly burning in the reentry heat and still survive well enough to move around and get to a splashdown was just incredible. Amazing progress in just four test flights.",
          "link": "https://news.ycombinator.com/item?id=40598887",
          "publishedOn": "2024-06-06T15:52:14.000Z",
          "wordCount": 1160,
          "title": "New comment by world2vec in \"Super Heavy has splashed down in The Gulf of Mexico\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40597963",
          "author": "Aurornis",
          "description": "> There's clearly a gap between imaginary noble okupas addressing housing crisis via occupation of unused bank property and reality of weed smoking anarchists and their collaborating deoccupying mafia harassing mostly not-so-rich middle class, who can't afford the security measures the rich can.\nI had a friend who bought a house that needed a lot of work. Before he could get started on the remodel, someone broke in to the empty house, changed the locks, and started occupying it.\nI remember being shocked that someone could do this and be protected under the law. He had to follow a formal eviction process, even though they broke into his house and never had any agreement. The perpetrators were known to the police as professional squatters and they advised him on all the things to avoid doing so they wouldn’t countersue him, which was mind blowing.\nEven weirder was to watch the reaction on his social media when he posted the story. A lot of people, including many of his friends, jumped to defending squatter’s rights or trying to make some broader point about inequality.\nThere’s something about squatting that appeals to people who think it’s always a RobinHood situation: Stealing from the rich, giving to the poor. It’s more fun to imagine these people as noble warriors against an unjust society, rather than seem them as people abusing the laws for personal gain at the expense of random victims. Even here on HN there are comments trying to downplay the issue by portraying the victims as mostly wealthy or landlords, which are presumably acceptable victims to people who like these kind of narratives.",
          "link": "https://news.ycombinator.com/item?id=40597963",
          "publishedOn": "2024-06-06T14:39:16.000Z",
          "wordCount": 17494,
          "title": "New comment by Aurornis in \"Squatting in Spain: Understanding Spain's \"okupas\" problem\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40597934",
          "author": "nerdponx",
          "description": "The original creator's page is: https://sashamaps.net/docs/maps/roman-roads-original/\nThe summary here links right to the original content. I just wanted to highlight the original for the sake of other readers clicking through quickly. There's also a much more detailed (and more interesting) writeup on the creator's page.",
          "link": "https://news.ycombinator.com/item?id=40597934",
          "publishedOn": "2024-06-06T14:37:24.000Z",
          "wordCount": null,
          "title": "New comment by nerdponx in \"Roman Roads (2017)\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40597819",
          "author": "michaelt",
          "description": "I think there are qualitative differences that arise from incremental, quantitative changes in privacy.\nSure, in the 1970s the cops could follow you around any time you were out in public. But they needed 6+ cops to provide round-the-clock surveillance, with an annual cost in the high six figures.\nSo the average citizen's privacy was protected not by law or high-minded ideals about privacy, but by simple numbers. There weren't enough cops to follow even 0.1% of the population.\nBut in the modern age of smartphones and license plate recognition and credit reference agencies? I think there's a strong argument to be made that we need new laws and new rights to reflect the new reality, where tracking people around the clock is several orders of magnitude cheaper.",
          "link": "https://news.ycombinator.com/item?id=40597819",
          "publishedOn": "2024-06-06T14:27:17.000Z",
          "wordCount": null,
          "title": "New comment by michaelt in \"The right not to be subjected to AI profiling based on publicly available data\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40597517",
          "author": "themgt",
          "description": "That was seriously some of the most dramatic television I've ever watched. Video of Starship being melted/torn apart by supersonic plasma, the broadcast stream dying multiple times maybe due to ship destruction, then finally back online, peeking through the cracked camera to see the nearly destroyed grid fin STILL ACTUATING. The announcers laughing about the ship being \"maybe held together by some nuts and bolts\" and then it still pulled off the fucking landing burn!\nAbsolutely wild and historic.",
          "link": "https://news.ycombinator.com/item?id=40597517",
          "publishedOn": "2024-06-06T14:04:30.000Z",
          "wordCount": null,
          "title": "New comment by themgt in \"Super Heavy has splashed down in The Gulf of Mexico\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40597475",
          "author": "delichon",
          "description": "Watching pieces of the ship melt off, but then seeing it make a relatively controlled landing, is perversely confidence building. If it can survive that kind of damage on a control surface maybe it's a quite robust craft.",
          "link": "https://news.ycombinator.com/item?id=40597475",
          "publishedOn": "2024-06-06T14:01:17.000Z",
          "wordCount": null,
          "title": "New comment by delichon in \"Super Heavy has splashed down in The Gulf of Mexico\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40597426",
          "author": "pixl97",
          "description": "What the hell, half melted starship actually did the landing flip and hit the ocean slow!!!\nThat was amazing!",
          "link": "https://news.ycombinator.com/item?id=40597426",
          "publishedOn": "2024-06-06T13:57:10.000Z",
          "wordCount": null,
          "title": "New comment by pixl97 in \"Super Heavy has splashed down in The Gulf of Mexico\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40596897",
          "author": "bearjaws",
          "description": "The rate of descent is absolutely astonishing, 8km -> 1km in 20 seconds, then just hovers above the water. Absolutely incredible work by the SpaceX team.\nLiving in central Florida I cannot wait for the new launch facility to come online. We're going to have lines of spectators into the space coast like we did for the shuttle.\nIf any of you are heading to Disney World you should stop by the NASA Kennedy Visitor Complex, it is so well done and not that expensive (it takes less time than 1 line at Disney world to get to :) ). It has the original launch control room for Apollo that you can tour, a Saturn V rocket that is laid horizontally and you can walk under, the crew module for the moon landing.  My favorite part is the Atlantis shuttle suspended from the ceiling, they left it in its \"raw\" landed format with scorch marks and tiles, it looks absolutely amazing.",
          "link": "https://news.ycombinator.com/item?id=40596897",
          "publishedOn": "2024-06-06T13:04:37.000Z",
          "wordCount": null,
          "title": "New comment by bearjaws in \"Super Heavy has splashed down in The Gulf of Mexico\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40595807",
          "author": "rudnevr",
          "description": "I live in Spain and own property in Spain. There's clearly a gap between imaginary noble okupas addressing housing crisis via occupation of unused bank property and reality of weed smoking anarchists and their collaborating deoccupying mafia harassing mostly not-so-rich middle class, who can't afford the security measures the rich can. It's not a small problem, there's like 12K cases per year last time I checked. Everybody knows the problem exists, most people take extra, otherwise not necessary measures against it. The leftist govt adds to the problem somehow rationalizing it and trying to channel poor's frustration onto middle-class, while the actual abusers, who are well aware of the problem, stay safe.",
          "link": "https://news.ycombinator.com/item?id=40595807",
          "publishedOn": "2024-06-06T10:36:04.000Z",
          "wordCount": null,
          "title": "New comment by rudnevr in \"Squatting in Spain: Understanding Spain's \"okupas\" problem\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40594791",
          "author": "alvah",
          "description": "\"The implicit assumption central to this way of organising the economy is that anything legally on sale is \"safe\". That it has been checked and approved by experts that know what they are doing and have the consumer interest as top priority.\nPeople will not rush back home to their chemistry labs to check what is in their purchased food, whether it corresponds to the label (assuming that such a label even exists) and what might be the short or long term health effects. They dont have the knowledge, resources and time to do that for all the stuff they get exposed to.\"\nWhat you describe is a feature of a high-trust society, where you don't have to double-check every single transaction or interaction you enter into, but can take most statements on trust. This allows people to get on with the fundamental task at hand, rather than dealing with the overhead of checking their food in the chemistry lab, or whatever the equivalent is for the specific transaction.\nI have read suggestions that this was a major contributor to the growth of the Western economies, relative to other low-trust societies. If this was the case, we are in for a bumpy ride, as we seem to be rapidly changing from a high-trust to a low-trust society.",
          "link": "https://news.ycombinator.com/item?id=40594791",
          "publishedOn": "2024-06-06T08:00:34.000Z",
          "wordCount": 3891,
          "title": "New comment by alvah in \"Microsoft AI spying scandal: time to rethink privacy standards\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40593986",
          "author": "openrisk",
          "description": "Trying to understand consumer privacy behaviors outside the prevalent social contract that the vast majority of people operate under is bound to missinterpret what is happening and why.\nWe live in a regulated \"supermarket\" economy. What surfaces on a screen is entirely analogous to what surfaces on a shelf: People check the price and make their choices based on taste, budget etc. They are not idiots, they operate under a simplifying assumption that makes life in a complex world possible.\nThe implicit assumption central to this way of organising the economy is that anything legally on sale is \"safe\". That it has been checked and approved by experts that know what they are doing and have the consumer interest as top priority.\nPeople will not rush back home to their chemistry labs to check what is in their purchased food, whether it corresponds to the label (assuming that such a label even exists) and what might be the short or long term health effects. They dont have the knowledge, resources and time to do that for all the stuff they get exposed to.\nWhat has drifted in the digital economy is not consumer standards, it is regulatory standards. Surfacing digital products with questionable short and long term implications for individuals and society has become a lucrative business, has captured its regulatory environment and will keep exploiting opportunities and blind spots until there is pushback.\nUltimately regulators only derive legitimacy from serving their constituencies, but that feedback loop can be very slow and it gets tangled with myriad other unrelated political issues.",
          "link": "https://news.ycombinator.com/item?id=40593986",
          "publishedOn": "2024-06-06T05:58:27.000Z",
          "wordCount": null,
          "title": "New comment by openrisk in \"Microsoft AI spying scandal: time to rethink privacy standards\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40593750",
          "author": "vlovich123",
          "description": "The thing with monopoly laws is it doesn’t matter how you got into pole position. The point is that you’re illegally utilizing tangential benefits of the pole position to maintain that position as well as enter new markets.\n> including how the company’s software locks customers into using its chips, as well as how Nvidia distributes those chips to customers.\nThe lock-in is probably a losing argument on technical merits unless NVIDIA is doing something nefarious there (which the lawsuit will potentially reveal). If nVidia is distributing chips in preferred ways to partners it wants to succeed (e.g. those partnered with MSFT which it has a very cozy and tight-knit relationship), that could be an anti trust thing.\n> Microsoft structured its minority stake in OpenAI in part to avoid antitrust scrutiny, The Times has reported. Microsoft also reached a deal in March to hire most of the staff of Inflection AI, another A.I. start-up, and license its technology. Because the deal was not a standard acquisition, it may be harder for regulators to scrutinize.\nSo there is an argument to be made that MSFT is acutely self-aware its behavior could be viewed as engaging in antitrust. If there’s a law against structuring financial transactions, why isn’t similar behavior in the business world viewed similarly as trying to bypass the spirit of the law?",
          "link": "https://news.ycombinator.com/item?id=40593750",
          "publishedOn": "2024-06-06T05:13:35.000Z",
          "wordCount": null,
          "title": "New comment by vlovich123 in \"U.S. clears way for antitrust inquiries of Nvidia, Microsoft and OpenAI\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40593519",
          "author": "roenxi",
          "description": "Nvidia solved a hard problem and their competitors all failed. I spent years with an AMD card growing progressively more annoyed at their self-inflicted apparent inability to multiply matrices on demand. Nvidia had nothing to do with their failure, unless they had some sort of high-level mole in AMD's driver teams.\nHitting the only successful company in a difficult field with legal assaults is not the obvious path to success. Nvidia has nothing close to a monopoly; there is no moat and they operate in a commodity space that will behave like a normal competitive market. It just happens that their competitors were wall-to-wall complacent about how quickly the hardware world can change and they stupidly thought graphics cards were for displaying graphics. It turns out graphics cards are for building AI and crypto markets.",
          "link": "https://news.ycombinator.com/item?id=40593519",
          "publishedOn": "2024-06-06T04:32:07.000Z",
          "wordCount": 11749,
          "title": "New comment by roenxi in \"U.S. clears way for antitrust inquiries of Nvidia, Microsoft and OpenAI\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40592884",
          "author": "kristianp",
          "description": "> published in Nature in 2006\nSo around 18 years ago. That’s a long time for researchers that believed in this papar's conclusions to be going down the wrong rabbit hole.  What a huge waste of effort and the lives of those with Alzheimer's.",
          "link": "https://news.ycombinator.com/item?id=40592884",
          "publishedOn": "2024-06-06T02:44:17.000Z",
          "wordCount": null,
          "title": "New comment by kristianp in \"Researchers to retract landmark Alzheimer's paper containing doctored images\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40589501",
          "author": "cletus",
          "description": "SLS is a jobs program. It's not economically viable at over $1 billion per launch.\nAs for Blue Origin and New Glenn, this is an object lesson that simply throwing money at the problem doesn't necessarily solve it. Did you know Blue Origin was founded ~18 months before SpaceX?\nFor the longest time (up until ~9 months ago), Bezos had the former Honeywell CEO in charge of Blue Origin, which to me was such an odd choice. You see, this guy seems to embody everything wrong with corporate America: he was completely focused on not failing rather than succeeding. So there were constant delays with New Glenn and the BE-4 engine, which is years behind schedule. You can't fail if you don't launch.\nAnd the new CEO (David Limp) used to be in charge of Kindles.",
          "link": "https://news.ycombinator.com/item?id=40589501",
          "publishedOn": "2024-06-05T19:37:29.000Z",
          "wordCount": null,
          "title": "New comment by cletus in \"Boeing Starliner launches first crewed mission\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40589260",
          "author": "ukoki",
          "description": "Employers don't reward long-term employees because they don't need to. Even though everyone knows you make more by job-hopping, companies are following a rational strategy because too few people \"walk the walk\" despite wanting more salary. Arguably unethical, but rational.\nAt the cost of losing a minority of job-hoppers they retain the cheap majority that:\n    - finds job interviews exhausting, or is anxious about being rejected\n\n    - dislikes conflict or negotiation\n\n    - has good relationships with colleagues they don't want to lose\n\n    - has a comfortable commute or WFH arrangement they don't want to change\n\n    - is proud of becoming an expert / go-to-person in some part of the business and doesn't want to lose that source of social capital\n\n    - is proud of product or service they have made a big contribution to and wants to \"see it through to the end\"\n\n    - believes leaving would place an unfair burden on other team-members or would be disloyal to a manager they consider a friend\n\n    - (US only) cannot risk losing healthcare\n\nIt's the same reason why your phone/insurance/whatever provider puts up the prices year-after-year: although some people leave, enough people simply put up with it that they make more money this way. \"Do nothing\" is an easy choice and companies are banking on enough people making that choice.",
          "link": "https://news.ycombinator.com/item?id=40589260",
          "publishedOn": "2024-06-05T19:23:48.000Z",
          "wordCount": null,
          "title": "New comment by ukoki in \"Employees who stay in companies longer than two years get paid 50% less (2014)\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40588626",
          "author": "mbonnet",
          "description": "Good. The diamond industry has destroyed multiple countries, one of which I lived in (Sierra Leone). Screw em.",
          "link": "https://news.ycombinator.com/item?id=40588626",
          "publishedOn": "2024-06-05T18:35:05.000Z",
          "wordCount": null,
          "title": "New comment by mbonnet in \"Diamond industry 'in trouble' as lab-grown gemstones tank prices further\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40588400",
          "author": "CobrastanJorji",
          "description": "I've always been confused by how these decisions go. Everybody agrees that the user has the right to make a copy, so when the company puts a \n\"digital lock\" on it, the fight is whether the user has a right to break the lock. But if I have a right to go through my door, and somebody has put a padlock on the door to keep me out, the right question shouldn't be whether I'm allowed to pick the lock, it should be why the padlock is legal.\nIf customers may legally make a copy of the e-book you sell to them, it should be on you the merchant to ensure customers are able to do so.",
          "link": "https://news.ycombinator.com/item?id=40588400",
          "publishedOn": "2024-06-05T18:18:03.000Z",
          "wordCount": null,
          "title": "New comment by CobrastanJorji in \"Win for copyright user rights in Canada: Digital locks do not trump fair dealing\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40587170",
          "author": "fiftyfifty",
          "description": "It's crazy the US could soon have up to 5 different spacecraft/launch systems that can take humans to orbit with 2 more in development:\nFalcon 9 + Dragon, SLS + Orion, Atlas V (Vulcan Centaur) + Starliner\nClose to orbital payload launch, likely human rated in the future: Vulcan Centaur + Dream Chaser, Superheavy + Starship\nUnder development: New Glenn + Space Vehicle (?), Neutron",
          "link": "https://news.ycombinator.com/item?id=40587170",
          "publishedOn": "2024-06-05T16:43:25.000Z",
          "wordCount": null,
          "title": "New comment by fiftyfifty in \"Boeing Starliner launches first crewed mission\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40586859",
          "author": "talldayo",
          "description": "There will be a small bit of irony if the gaming experience on Asahi ends up easier and more straightforward than MacOS.\nReally just drives home how big of a mistake it was ignoring Vulkan for the past decade on Apple's behalf, but lord knows they won't admit that until it's too late.",
          "link": "https://news.ycombinator.com/item?id=40586859",
          "publishedOn": "2024-06-05T16:22:00.000Z",
          "wordCount": null,
          "title": "New comment by talldayo in \"Vulkan1.3 on the M1 in one month\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40584968",
          "author": "fifafu",
          "description": "In case you are already using my BetterTouchTool app: I have created a little tutorial & example preset here on how to use it for status item management: https://community.folivora.ai/t/bartender-controversy-tutori...\nYou can add feature requests there, it should be pretty simple to extend BTT to support the remaining required features.\nI have also recently been approached by shady companies trying to buy my app (I'd never do that) - maybe they are currently targeting apps that require special permissions?",
          "link": "https://news.ycombinator.com/item?id=40584968",
          "publishedOn": "2024-06-05T14:07:20.000Z",
          "wordCount": null,
          "title": "New comment by fifafu in \"Popular Mac app 'Bartender' acquired by new unknown developer\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40581759",
          "author": "yashap",
          "description": "This is bad advice.\nSay I have a user table, and the email is unique and required, and we don’t let users update their email, and we don’t have user deletion. If I’m going natural PK, I make email the primary key.\nBut … then we add the ability for users to update their email. But it should still be the same user! This is trivial if we have a surrogate primary key, a nightmare if we made email the natural primary key.\nOr building on that example, maybe at first we always require an email from our users. But later we also allow phone auth, and you just need an email OR a phone number. And later we add user name auth, SSO, etc. Again, all good with surrogate primary keys, a nightmare with natural primary keys.\nThere are countless examples like this. You brought up cars, same thing with licence plates, for example. Or even Social Security Numbers/Social Insurance Numbers - in Canada SINs are generally permanent, but temporary residents can have their SIN change if they later become permanent residents, but they’re still the same person.\nYou want your entities to have stable identity, even if things you at one time thought gave them identity change. Surrogate primary keys do that, natural primary keys do not. Don’t use natural primary keys, use surrogate primary keys with unique constraints/indexes.\nI challenge you to come up with a single plausible example where you’re screwing yourself by choosing surrogate PK + unique constraints/indexes. Meanwhile there are endless examples where you’re screwing yourself by choosing natural PK.",
          "link": "https://news.ycombinator.com/item?id=40581759",
          "publishedOn": "2024-06-05T05:49:49.000Z",
          "wordCount": null,
          "title": "New comment by yashap in \"You'll regret using natural keys\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40581197",
          "author": "crabmusket",
          "description": "The surrogate key uniquely identifies a row in your database, which is an entity just as real and significant as the car or the employee or what-have-you. Don't confuse the two!\nI agree with you that having a surrogate key isn't going to save you from the reasons why natural keys can be difficult. The complexity has to go somewhere. But not having a unique identifier for each row is going to make things extra difficult.",
          "link": "https://news.ycombinator.com/item?id=40581197",
          "publishedOn": "2024-06-05T03:49:01.000Z",
          "wordCount": null,
          "title": "New comment by crabmusket in \"You'll regret using natural keys\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40580076",
          "author": "mullen",
          "description": "If someone in China starts harassing you or threatening you, just start sending messages that the two of you are conspiring to overthrow the Chinese government and the messages will stop real quick.\nThese Chinese mafia types talk tough until you start sending anti-Chinese government copy-pasta to them and they shut up real quick.",
          "link": "https://news.ycombinator.com/item?id=40580076",
          "publishedOn": "2024-06-04T23:47:50.000Z",
          "wordCount": null,
          "title": "New comment by mullen in \"Things the guys who stole my phone have texted me to try to get me to unlock it\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40578911",
          "author": "bnchrch",
          "description": "Honestly. This is a pretty good advertisement for Apple.\nI appreciate the effort that they've put into making my device less valuable to thiefs.",
          "link": "https://news.ycombinator.com/item?id=40578911",
          "publishedOn": "2024-06-04T21:03:34.000Z",
          "wordCount": null,
          "title": "New comment by bnchrch in \"Things the guys who stole my phone have texted me to try to get me to unlock it\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40578886",
          "author": "Xylakant",
          "description": "The police state is interested in maintaining the power structure in the police state. As long as petty or even organized crime does not upset the balance of power, the authorities couldn’t care less - crime against Americans is no danger to them. Just as the  Russian government has no interest in cracking down on its blackhat population, as long as they target non-Russian orgs.",
          "link": "https://news.ycombinator.com/item?id=40578886",
          "publishedOn": "2024-06-04T21:00:57.000Z",
          "wordCount": null,
          "title": "New comment by Xylakant in \"Things the guys who stole my phone have texted me to try to get me to unlock it\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=52745",
          "author": "Harry",
          "description": "It’s more than 5 years since Erik died which, for those who knew him, is quite hard to believe, as he is still a strong voice in many of our heads. Because I know many of our readers knew and admired him or his work (or both!) I thought I’d let you know that a […]",
          "link": "https://crookedtimber.org/2024/06/06/engaging-erik-olin-wright-between-class-analysis-and-real-utopias/",
          "publishedOn": "2024-06-06T14:45:47.000Z",
          "wordCount": 1932,
          "title": "Engaging Erik Olin Wright: Between Class Analysis and Real Utopias",
          "imageUrl": "https://crookedtimber.org/wp-content/uploads/2024/06/getimage_11eb0385-db5c-4818-818e-16d1e9820871.webp"
        },
        {
          "id": "https://crookedtimber.org/?p=52738",
          "author": "John Q",
          "description": "Brad DeLong (in a recent post summarising a joint podcast with Noah Smith) walks back his previous suggestion that it was time for neoliberals, among whom he had numbered himself, to pass the baton to “the Left”. The political basis for this is that 20 or so Senate Republicans have been willing to pass legislation […]",
          "link": "https://crookedtimber.org/2024/06/03/the-left-and-the-left-responding-to-the-crisis-of-soft-neoliberalism/",
          "publishedOn": "2024-06-03T01:44:23.000Z",
          "wordCount": 14652,
          "title": "The Left and THE LEFT: Responding to the crisis of soft neoliberalism",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52736",
          "author": "Chris Bertram",
          "description": "Visit the post for more.",
          "link": "https://crookedtimber.org/2024/06/02/sunday-photoblogging-lunchtime/",
          "publishedOn": "2024-06-02T07:04:20.000Z",
          "wordCount": 1816,
          "title": "Sunday photoblogging: lunchtime",
          "imageUrl": "https://live.staticflickr.com/65535/53762524650_7e4113a2ee.jpg"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/The-ETERNAL-Norita",
          "author": "CADTM International, Eric Toussaint, Maria Elena Saludas",
          "description": "At 6:41 p. m. on Thursday, May 30, at the age of 94, our beloved Nora Cortiñas left us; we will miss her so much. Barely a few seconds after this sad news, which we didn't want to hear, was announced, someone had already shouted “ETERNAL Norita!” at this iconic Plaza de Mayo location. \nEnglish\n\n/ \nSocial movements, \nArgentina, \nHuman Rights",
          "link": "https://www.cadtm.org/The-ETERNAL-Norita",
          "publishedOn": "2024-06-07T16:43:37.000Z",
          "wordCount": 2843,
          "title": "The ETERNAL Norita!",
          "enclosure": {
            "url": "https://www.cadtm.org/IMG/jpg/la_deuda_es_terminar_con_la_pobreza.jpg",
            "length": "11752",
            "type": "image/jpeg"
          },
          "imageUrl": "https://www.cadtm.org/IMG/jpg/la_deuda_es_terminar_con_la_pobreza.jpg"
        },
        {
          "id": "https://www.cadtm.org/When-the-new-South-Africa-of-the-betrayed-expectations-also-betrays-its-hero",
          "author": "Yorgos Mitralias",
          "description": "“You are guilty not only when you commit a crime, but also when you do nothing to prevent it when you have the chance”. (Dimitri Tsafendas) \nEnglish\n\n/ \nSouth Africa, \nSouth",
          "link": "https://www.cadtm.org/When-the-new-South-Africa-of-the-betrayed-expectations-also-betrays-its-hero",
          "publishedOn": "2024-06-07T12:01:43.000Z",
          "wordCount": 1965,
          "title": "When the new South Africa of the betrayed expectations, also betrays its hero Dimitri Tsafendas!",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/c908f4b7c9a1ec1e8883076aaca18d-ef115.jpg"
        },
        {
          "id": "https://www.cadtm.org/The-6th-International-Eco-socialist-Meeting-and-the-1st-Latin-American-and",
          "author": "Maria Elena Saludas",
          "description": "Over three days (9-11 May), the city of Buenos Aires received over 250 activists from 30 nations. After more than a year of planning, we were able to assemble in the auditorium of the ATE (Association of State Workers) to discuss and attempt to create strategies for developing resistance to the capitalist system. \nEnglish\n\n/ \nSocial movements, \nArgentina, \nAgriculture and Food Sovereignty, \nEcology/Climate",
          "link": "https://www.cadtm.org/The-6th-International-Eco-socialist-Meeting-and-the-1st-Latin-American-and",
          "publishedOn": "2024-06-07T07:30:54.000Z",
          "wordCount": 3077,
          "title": "The 6th International Eco-socialist Meeting and the 1st Latin American and Caribbean Eco-socialist Meeting concluded successfully",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1200xH630/a601858ea5394d476d91c2804b6a42-e6e86.jpg"
        },
        {
          "id": "https://www.cadtm.org/The-Drums-of-War-are-Banging-in-Europe",
          "author": "Eric Toussaint, Miguel Urbán Crespo, Paul Murphy",
          "description": "These weeks see the end of the term for an ineffectual European legislature which served during the worst pandemic of this century, during Vladimir Putin's invasion of Ukraine, and with it, the outbreak of a war on European soil that evokes the worst memories of the world wars of the last century. And as we witness the televised genocide of the Palestinian people, it appears that the international system of liberal governance seems to be collapsing like a house of cards. \nEnglish\n\n/ \nAusterity/Structural Adjustment, \nEurope, \nUkraine, \nNorth",
          "link": "https://www.cadtm.org/The-Drums-of-War-are-Banging-in-Europe",
          "publishedOn": "2024-06-06T16:37:23.000Z",
          "wordCount": 6717,
          "title": "The Drums of War are Banging in Europe",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/78d3d638c0b18c1b9ff77c46815d04-2b616.jpg"
        },
        {
          "id": "https://www.cadtm.org/The-World-Bank-s-accounts",
          "author": "Eric Toussaint",
          "description": "In July 2024, the World Bank and the IMF will be 80 years old. 80 years of financial neo-colonialism and the imposition of austerity policies in the name of debt repayment. 80 years is enough! The Bretton Woods institutions must be abolished and replaced by democratic institutions serving an ecological, feminist and anti-racist bifurcation. To mark these 80 years, we are republishing a series of articles every Wednesday until July, looking in detail at the history and damage caused by these (...)\nEnglish\n\n/ \nIMF, \nWorld Bank, \nFinance against people, \n80 ans BM FMI FR",
          "link": "https://www.cadtm.org/The-World-Bank-s-accounts",
          "publishedOn": "2024-06-05T07:30:00.000Z",
          "wordCount": 3293,
          "title": "The World Bank's accounts",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L792xH416/0e8842dd05df7c7ac89669eb940b50-d0fb9.png"
        },
        {
          "id": "https://www.cadtm.org/Mexico-from-AMLO-to-Sheinbaum",
          "author": "Michael Roberts",
          "description": "Mexico has its general election this Sunday. With a population of over 130 million, Mexico is among the 15 largest economies in the world and the second-largest economy in Latin America. \nEnglish\n\n/ \nMexico, \nPrivate debt, \nInequality, \nPrecarity",
          "link": "https://www.cadtm.org/Mexico-from-AMLO-to-Sheinbaum",
          "publishedOn": "2024-06-01T16:07:44.000Z",
          "wordCount": 2547,
          "title": "Mexico: from AMLO to Sheinbaum",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1200xH630/432e2750db2768903979a319f5fd8d-26d1a.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=7778",
          "author": "disassociated.com",
          "description": "Best I keep this brief, especially after complaining about film franchises continually rebooting and retelling the same story. Alien: Romulus (isn’t Romulus a planet in the Star Trek universe? Yeah, I thought so), is a story about some people on a spaceship, whose lives are threatened by a sinister alien stowaway. Reminds me a lot […]",
          "link": "https://disassociated.com/alien-romulus-alien-story-continues-great-poster/",
          "publishedOn": "2024-06-06T21:00:12.000Z",
          "wordCount": 328,
          "title": "Alien: Romulus, the Alien story continues. Great poster though",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7775",
          "author": "disassociated.com",
          "description": "Great news for fans of 2019 thriller/comedy/whodunit, Knives Out… a follow up is on the way. Daniel Craig will reprise his role as private detective Benoit Blanc, in Wake Up Dead Man, due for cinematic release sometime in 2025. Check out the teaser/trailer, though it’s more teaser than trailer. Good to hear CSI KFC’s voice […]",
          "link": "https://disassociated.com/wake-up-dead-man-rian-johnson-daniel-craig-benoit-blanc-returns/",
          "publishedOn": "2024-06-06T20:30:25.000Z",
          "wordCount": 243,
          "title": "Wake Up Dead Man, by Rian Johnson, with Daniel Craig: Benoit Blanc returns",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7769",
          "author": "disassociated.com",
          "description": "There has been talk of the four-day workweek for as long as I can remember. We were told about it when I started school. Yet it’s to fully, properly, officially, arrive. The work week is still, for the most part, in many places, five days: Monday to Friday. We don’t live in an age where […]",
          "link": "https://disassociated.com/four-day-workweeks-nigh-zero-day-workweeks/",
          "publishedOn": "2024-06-05T21:00:53.000Z",
          "wordCount": 418,
          "title": "Four-day workweeks are nigh, followed by zero-day workweeks",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7764",
          "author": "disassociated.com",
          "description": "Colonel Sanders founded KFC at age sixty-two. Anna Mary Robertson Moses AKA Grandma Moses, started painting when she was seventy-six, and had an illustrious career spanning twenty-five years. American actor Kathryn Joosten began her Hollywood career aged fifty-six. These are just a few examples of people who are considered to be late bloomers. Those who […]",
          "link": "https://disassociated.com/extremely-simple-way-detect-potential-late-bloomers/",
          "publishedOn": "2024-06-04T21:00:31.000Z",
          "wordCount": 521,
          "title": "An extremely simple way to detect potential late bloomers",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7761",
          "author": "disassociated.com",
          "description": "Tangentially related to the last post. Longer novels might pose a challenge to certain readers, especially those who require apps to do the reading for them. But, longer titles are more likely to win literary awards: Judgment and decision-making research suggests several causes of the apparent bias. One is the representativeness heuristic: longer novels resemble […]",
          "link": "https://disassociated.com/people-not-read-longer-novels-but-win-literary-awards/",
          "publishedOn": "2024-06-03T21:00:25.000Z",
          "wordCount": 218,
          "title": "People may not read longer novels, but they do win literary awards",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7758",
          "author": "disassociated.com",
          "description": "Such apps don’t exactly read novels in fifteen minutes, but they scan through them, and produce relatively short summaries. Seems like cheating to me, don’t we read books to be taken along on a journey? Still, I imagine these apps have their uses. Like, where were they when I was at high school? Especially when […]",
          "link": "https://disassociated.com/conquer-tbr-apps-read-books-fifteen-minutes/",
          "publishedOn": "2024-06-03T20:30:53.000Z",
          "wordCount": 182,
          "title": "Conquer your TBR with apps that read books in fifteen minutes",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7753",
          "author": "disassociated.com",
          "description": "The Daily Aus (TDA), Friday, 31 May 2024: Rain is forecast across 90% of the country over the coming days as a 5,000km ‘cloudband’ makes its way from WA‘s north to south-east Australia. According to the Bureau of Meteorology (BOM), a ‘northwest cloudband’ is an extensive layer of air and moisture from over the Indian […]",
          "link": "https://disassociated.com/five-thousand-kilometre-cloud-band-across-australia/",
          "publishedOn": "2024-06-02T21:00:17.000Z",
          "wordCount": 262,
          "title": "Five-thousand kilometre long cloud-band across Australia",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7747",
          "author": "disassociated.com",
          "description": "I’m not exactly a fan of large-chain food and beverage outlets. But Sydney based Mexican cuisine fast food restaurant Guzman y Gomez, AKA GYG (to me, anyway) is not quite large-chain. Not at the moment, though there are near to two-hundred stores in Australia, sixteen in Singapore, and a handful in Japan, and the United […]",
          "link": "https://disassociated.com/guzman-y-gomez-ipo-eyes-burrito-world-domination/",
          "publishedOn": "2024-06-02T20:30:10.000Z",
          "wordCount": 235,
          "title": "Guzman y Gomez goes to IPO, eyes burrito world domination",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20240603",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20240603",
          "publishedOn": "2024-06-03T10:30:00.000Z",
          "wordCount": 658,
          "title": "Week Ending June 2nd, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/rule-of-law",
          "author": null,
          "description": "Trump and the courts.",
          "link": "https://newleftreview.org/sidecar/posts/rule-of-law",
          "publishedOn": "2024-06-07T14:39:07.000Z",
          "wordCount": 4114,
          "title": "JoAnn Wypijewski: &ldquo;Rule of Law?&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/06/08-gettyimages-2147829397.webp"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/all-or-nothing",
          "author": null,
          "description": "Jiajun ‘Oscar’ Zhang’s first feature.",
          "link": "https://newleftreview.org/sidecar/posts/all-or-nothing",
          "publishedOn": "2024-06-07T10:56:18.000Z",
          "wordCount": 1781,
          "title": "Trevor Clarke: &ldquo;All or Nothing&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/06/Zhang.jpeg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/wartime-lithuania",
          "author": null,
          "description": "Jingoism and discontent.",
          "link": "https://newleftreview.org/sidecar/posts/wartime-lithuania",
          "publishedOn": "2024-06-06T12:09:18.000Z",
          "wordCount": 2250,
          "title": "Michael Casper: &ldquo;Wartime Lithuania&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/06/creation-of-the-world-iii.jpg"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://notes.jeddacp.com/settling-into-my-new-notes-home/",
          "author": null,
          "description": "Well, hello there.\nI went back and forth on whether or not I wanted to make the move from my former (Notes) blogging platform to Bear blog. I listed out some pros and cons in one of my previous posts1, and I really thought I was going to stay put for a little bit. After all, I wanted to look away from the new and shiny temptation and really think about what it would mean to switch. Moving sucks, and I hate having to pack, and unpack.\nWell, I spent the past few days packing, and then unpacking (aka migrating my blog). I figured this was a good way to test out Bear to see if writing in all markdown would bother me. It didn’t. I’m already primarily writing in Markdown on Bear (Notes App) before posting, so there wasn’t much overheard. I found myself enjoying this lightweight yet customizable platform.\nSo, here I am. Things are a little bit scattered. Still have no idea where to put some of my things. I think it will take some time, but I’m already cozying up in my new home.\nIf you’re new here, welcome! If you’ve been following me from the beginning, I’m so glad to have you on here. Grab a seat, and enjoy my Notes about anything and everything.\nUntil then, go read some posts from some awesome bloggers I have listed here for JUnited. They're all pretty great!\n🐘 Reply on Mastodon // 📧 Reply by email\nSubscribe via RSS\noriginally posted on the other platform, and imported here.↩",
          "link": "https://notes.jeddacp.com/settling-into-my-new-notes-home/",
          "publishedOn": "2024-06-06T23:07:00.000Z",
          "wordCount": 827,
          "title": "Settling into my new (notes) home",
          "imageUrl": "https://img.playbook.com/wc-ZAFWUGsBrQe1jJqZ8i7Vo0ts1sUIU8xNzIe6ehGo/Z3M6Ly9wbGF5Ym9v/ay1hc3NldHMtcHVi/bGljL2U3ZTRlMzM1/LWQ0NDEtNDNhYS1h/YTk5LTAxZjk0M2Rl/ODU5Ng"
        },
        {
          "id": "https://meowen.bearblog.dev/assumption-of-availability/",
          "author": null,
          "description": "Throughout my life, I have met both delightful and less pleasant human beings. I am most annoyed by those who stubbornly view that cats like me, who do not have a formal job, are less \"busy\" than any of them. This species believes that just because I have no \"family\" therefore they are entitled to my free time outside my posted job hours.\nThey assume that we only live to eat, play, and sleep.\nMy free time belongs to me.\nWhatever I do in my free time is nobody's business.",
          "link": "https://meowen.bearblog.dev/assumption-of-availability/",
          "publishedOn": "2024-06-06T12:25:00.000Z",
          "wordCount": 724,
          "title": "Assumption of Availability",
          "imageUrl": null
        },
        {
          "id": "https://kartikay.bearblog.dev/attracting-similar-people/",
          "author": null,
          "description": "The point of this blog was to put myself out there. Why? I stopped filling my mind with content and the resulting silence led to an outpour of content in my head. I needed an outlet to express the thoughts in my head. Something I cover in my essay on writing here. Also who wants to miss out on being part of the future AGI training set?\nYet I never thought of one huge perk. Attracting like-minded people. The internet is amazing. You put out slivers of your consciousness and watch as like-minded people gather around. I have got DMS asking such specific things. Relating to my essays, to my impact page. People I looked up to on x. People who inspired me. It feels nice to interact with your tribe.\nI have already got many people writing and sharing on Twitter. Especially through bearblog. I would urge more people to do the same. Be you. Even if you don't get many views. Just share your thoughts. You will attract similar-minded people. Find friends, business partners, and\nmaybe life partners. That is the hidden perk no one tells you about.\nSo if you are on the fence, start writing and sharing. Best of luck!",
          "link": "https://kartikay.bearblog.dev/attracting-similar-people/",
          "publishedOn": "2024-06-05T22:21:00.000Z",
          "wordCount": 655,
          "title": "Attracting Similar People",
          "imageUrl": null
        },
        {
          "id": "https://paulogpd.bearblog.dev/en-rabbit-r1-its-a-scam/",
          "author": null,
          "description": "It’s not new that the promise of artificial intelligence capable of helping us and solving a series of problems we don't have has emerged. However, it is only from 2022 onwards that large models (LLM, LAM, and others) are gaining traction and attention worldwide. It started with OpenAI and ChatGPT, followed by Humana's AI Pin and Rabbit R1 from Rabbit Inc. Neither delivered on their promises, but the Rabbit R1 has an extra touch.\nWhile Humane's brooch is just an overpriced product that doesn’t work properly, the Rabbit R1 is a mishmash of poorly executed features and a good dose of scams, especially coming from a company previously involved with NFTs and \"pay-to-win\" games (which use NFTs). Most of the instructions are hardcoded into the device, meaning that most actions are predefined acc…",
          "link": "https://paulogpd.bearblog.dev/en-rabbit-r1-its-a-scam/",
          "publishedOn": "2024-06-05T18:55:10.692Z",
          "wordCount": 1183,
          "title": "[en] rabbit r1 it's a SCAM",
          "imageUrl": null
        },
        {
          "id": "https://tiramisu.bearblog.dev/nothing-nonnegotiable/",
          "author": null,
          "description": "Vegetating aside, the last few days before big moves usually also brings lots of appointments. This week I get my teeth cleaned and eyes checked before I leave, scheduling follow-ups in a year and making plans to be back for them.\nGoing to these appointments is one of the few activities I actually prefer my parents come along. Not because I enjoy their company (it's hit or miss), but because I'm no good at doing the things they usually do. (And by 'they' I mean my mom.)\nToday before I leave for the optometrist Mom tells me I shouldn't agree to pay more than $110 for my visit, the same amount we paid last year. Upon arrival, the receptionist informs me that the fee for checkups is $250 now. $250? I thought it was supposed to be $110, I say. She shows me a packet with the price printed in bo…",
          "link": "https://tiramisu.bearblog.dev/nothing-nonnegotiable/",
          "publishedOn": "2024-06-05T18:41:00.000Z",
          "wordCount": 1023,
          "title": "nothing nonnegotiable",
          "imageUrl": null
        },
        {
          "id": "https://kartikay.bearblog.dev/feedback-loops/",
          "author": null,
          "description": "Everything is dependent on feedback loops. Video games/reels have short exciting feedback loops. That is why they are so addictive. Real life often has long feedback loops. Anything you do, it will take time to see the results.\nYou will have to grind hard at something and for a sufficiently long amount of time to achieve something meaningful. Yet if your brain is trained to enjoy short feedback loops it becomes hard to do something for long without seeing exciting results.\nYou either train yourself to enjoy long feedback loops or you shorten the loop through regular rewards. Maybe break down the huge task into small chunks.\nIt is often good to run both a long and short feedback loop on a task. The long loop keeps you aware of the bigger picture so the setbacks don't seem as bad. The short loop keeps you on track and gives that constant nudge in the right direction.\nYou are already in a feedback loop whether you are aware of it or not. Better off being in a feedback loop that helps you grow. One of your own making.",
          "link": "https://kartikay.bearblog.dev/feedback-loops/",
          "publishedOn": "2024-06-05T18:30:00.000Z",
          "wordCount": 622,
          "title": "Feedback Loops",
          "imageUrl": null
        },
        {
          "id": "https://krueger.ink/a-new-digital-home-etc/",
          "author": null,
          "description": "My blog was housed on Scribbles since February, but I recently started playing around with Bear, another Indie Web blogging platform. it offers light customization and uses Markdown — two things I’d really been missing on Scribbles.\nWell, here I am — permanently blogging on Bear now. I’ve also changed the name of my blog and have a new domain. It feels a bit like starting over, but not quite because I brought some old posts over with me. I’m certainly looking forward to this new adventure, though.\nMy old blog is still online and still available to visit, if anyone has an inkling to do so. I’m also not leaving the Scribbles platform entirely. My Camp Snap Chronicle photo blog will still remain there. And since that camera arrived yesterday, I’m hoping to maybe have some photos to post by the weekend. We’ll see. It’s been a busy few days for me.\nAnyway, feel free to add this new blog to your RSS reader of choice. I apologize for changing things, but I did what I felt was best for me. Stay tuned for all of the weird rambles you’ve come to expect, haha.",
          "link": "https://krueger.ink/a-new-digital-home-etc/",
          "publishedOn": "2024-06-04T16:33:23.439Z",
          "wordCount": 617,
          "title": "💻 A New Digital Home, Etc.",
          "imageUrl": null
        },
        {
          "id": "https://birming.com/nothing-to-write/",
          "author": null,
          "description": "Today is one of those days when I feel I have nothing to write.\nThen I started thinking...\nWhat is it that says you have to have something to write to start writing? It's just an idea, an idea of how things work.\nYou have something to write.\nYou write it.\nIt doesn't have to be like that. It's perfectly possible to just start writing without having anything to write about. Or, as one writer put it, sit down at the typewriter and just bleed.\nThere are so many things in life that we have preconceptions about...\nIt should be sunny on Midsummer day (it's a Swedish thing), everyone should be happy on Christmas Eve and the slice of cheese should be on top of the hamburger (ok, bad example – it should always be on top).\nWhen life doesn't go the way it's “supposed to” (read: the way we demand) - which of course is often the case - the whole world is turned upside down.\nWhat if we slow down a bit when it comes to how things \"should be”? What if we face the day with a little \"let's see what this day (or blank sheet of paper) brings\"?\nIt's worth trying.",
          "link": "https://birming.com/nothing-to-write/",
          "publishedOn": "2024-06-04T15:43:00.000Z",
          "wordCount": 481,
          "title": "I have nothing to write",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1717515752-0.jpg"
        },
        {
          "id": "https://kartikay.bearblog.dev/pain/",
          "author": null,
          "description": "This is a short story I wrote a while back :\nIt was warm and cozy in his room.The walls, adorned with peeling wallpaper, seemed to hug him in a comforting embrace. He was safe here, cocooned in this familiar space. As long as he didn’t open the door, he could pretend. Pretend that everything was okay, that the world outside was just as gentle and forgiving as his secluded corner.\nSometimes, he heard loud, jarring knocks on the door. Bang Bang. Each knock sounded like a thunderclap, threatening to shatter his illusion. The door, scarred from previous assaults, was almost giving way. He remembered being afraid, trembling as he went to the door and pressing his body weight against it to lend it support. After all, it was his sole protector from the outside world, a barrier between him and the…",
          "link": "https://kartikay.bearblog.dev/pain/",
          "publishedOn": "2024-06-04T15:03:00.000Z",
          "wordCount": 1370,
          "title": "Pain",
          "imageUrl": null
        },
        {
          "id": "https://mgx.me/invisible-struggles/",
          "author": null,
          "description": "Cape Cod Morning by Edward Hopper, 1950, via the Smithsonian.\nWhat triggers this feeling of being overwhelmed for no reason? From an outside perspective, there is no objective reason things should feel so heavy. My circumstances have not markedly changed. There are no notable stressors present. Yet, internally, everything seems foggy, fuzzy, and oppressive. On these overwhelming days, I want so badly to grasp why I feel this way or make sense of some cause, yet no cause or reason can be found. The only reasonable response is rebellion through persistent, passionate, and lucid living despite it all.",
          "link": "https://mgx.me/invisible-struggles/",
          "publishedOn": "2024-06-04T07:52:17.097Z",
          "wordCount": 1160,
          "title": "invisible struggles",
          "imageUrl": "https://static.mgx.me/images/2024/cape-cod-morning.webp"
        },
        {
          "id": "https://tiramisu.bearblog.dev/lame-duck/",
          "author": null,
          "description": "Only a few days remain before I move to New York, which means I am firmly in my lame duck era. \"Lame duck\" is what you call a politician in the final stretch of their term who already knows that they won't be re-elected. Lame ducks can mess around and get away with a lot of things they might not otherwise if they were facing re-election.\nI like to use that term to describe the habit I have of completely abandoning my usual routine before big life changes like going to college or starting a new job. This week I've replaced my usual routine of exercise and healthy eating with junk food binges and late bedtimes. Instead of reading and writing before bed I play videogames. I don't so much consciously decide to do this as much as I fall into it without meaning to: I think my brain knows that th…",
          "link": "https://tiramisu.bearblog.dev/lame-duck/",
          "publishedOn": "2024-06-04T01:08:00.000Z",
          "wordCount": 1298,
          "title": "in my lame duck era (& when does the frog jump out of the pot?)",
          "imageUrl": null
        },
        {
          "id": "https://meadow.bearblog.dev/i-wasnt-able-to-sing-before-having-a-son/",
          "author": null,
          "description": "I was never what you would considered a singer or even an outgoing person (not that the two are the same). When singing was involved I would usually remain silent, worrying that I would sound off key, or that I wouldn't know the words and people would notice, or any other myriad of possible scenarios which are common to those who worry endlessly about stuff. In some way, I perceived the act of singing as something very intimate and I never managed to break through that barrier I had imposed upon myself. That is, until I had a son, but it wasn't that easy.\nAfter he was born, my wife used to sing to him all the time. She has beautiful voice, knows lots of songs, and is so confident in her ability that she doesn't really think about it. I, however, shied away from the act, as if a panel of ju…",
          "link": "https://meadow.bearblog.dev/i-wasnt-able-to-sing-before-having-a-son/",
          "publishedOn": "2024-06-02T16:40:05.477Z",
          "wordCount": 1275,
          "title": "I wasn't able to sing before having a son",
          "imageUrl": null
        },
        {
          "id": "https://birming.com/writing-unfiltered-speech/",
          "author": null,
          "description": "I saw a documentary about the Swedish singer-songwriter and poet Cornelis Vreeswijk. In one of the scenes, someone tells Cornelis that writing seems to be necessary for him.\nHe replies:\nYes, it is. I can panic if I'm not allowed to write.\nI think many of us can relate to that, at least to some extent. I know that I can. That’s why we write.\nIf I don't write in one form or another, it's like a blockage in the system. To get that shit out, I need to write in one form or another. Blog, journal, napkin - it doesn't matter. Just get it out of the system.\nI think it was Stephen King who said something like:\n\"If you don't have time to read, how will you have time to write?”\nFor me, it's the other way around. If I don't write, there's no way I can be fully present and absorb what I'm reading.\nWriting is a valve, a way to release the pressure of repetitive thoughts. Writing is a way to give words to the wordless. Writing is an unfiltered way of speaking.",
          "link": "https://birming.com/writing-unfiltered-speech/",
          "publishedOn": "2024-06-01T17:16:00.000Z",
          "wordCount": 449,
          "title": "Writing is unfiltered speech",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert-1717262142-0.jpg"
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/john-creaghe-the-argentine-republic-and-english-radical-reformers?v=1717513259",
          "author": null,
          "description": "Author: John Creaghe\nTitle: The Argentine Republic and English Radical Reformers\nDate: January 1890\nNotes: Original Title: 'The Argentine Republic and English Radical Reformers' in Commonweal Bibliography Creaghe, John, 'The Argentine Republic and English Radical Reformers' in Commonweal, Vol. 6, No. 208, (London, 1890), pg. 2-3 Creaghe, John, 'The Argentine Republic and English Radical Reformers' in Commonweal, Vol. 6, No. 209, (London, 1890), pg. 10 Creaghe, John, 'The Argentine Republic and English Radical Reformers' in Commonweal, Vol. 6, No. 210, (London, 1890), pg. 20-21\nSource: Retreived on 4 June 2024 from https://www.marxists.org/history/international/social-democracy/commonweal/1890/index.htm\n\nThe writer of the following pages, having lived for many years in the Argentine Republi…",
          "link": "https://theanarchistlibrary.org/library/john-creaghe-the-argentine-republic-and-english-radical-reformers?v=1717513259",
          "publishedOn": "2024-06-04T15:00:59.000Z",
          "wordCount": 5484,
          "title": "John Creaghe - The Argentine Republic and English Radical Reformers",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "15832",
            "url": "https://theanarchistlibrary.org/library/john-creaghe-the-argentine-republic-and-english-radical-reformers.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/colin-ward-the-child-in-the-city?v=1717335517",
          "author": null,
          "description": "Author: Colin Ward\nTitle: The Child in the City\nDate: 1978\nNotes: Pictures and captions are not included in this version due to them being very faded in the source book scan, but the book has been republished by AK Press, so they may get added in the future. First published by The Architectural Press in 1978. This version is an OCR from a Penguin Books version from 1979.\nSource: <archive.org/details/childincity00wardrich>\n\nSynopsis\n How can the link between city and child be made more fruitful and enjoyable for both the child and the city? \n At a time when a significant proportion of the city’s children are at war with their environment, the question raised by this book becomes ever more urgent for teachers and parents, citizens and policy makers. Through an enormously rich range of refere…",
          "link": "https://theanarchistlibrary.org/library/colin-ward-the-child-in-the-city?v=1717335517",
          "publishedOn": "2024-06-02T13:38:37.000Z",
          "wordCount": 83249,
          "title": "Colin Ward - The Child in the City",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "667719",
            "url": "https://theanarchistlibrary.org/library/colin-ward-the-child-in-the-city.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/uploads/en/thumbnails/c-w-colin-ward-the-child-in-the-city-2.jpg.large.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/eva-x-moberg-international-workers-aid-to-bosnia?v=1717325359",
          "author": null,
          "description": "Author: Eva X Moberg\nTitle: International Workers Aid To Bosnia\nSubtitle: Syndicalists truck flour directly to Bosnia unions\nDate: December 1994\nNotes: This article, from a presentation on June 1993 at the European Syndicalist Conference, appeared in Nov.-Dec. 1994 Industrial Worker newspaper\nSource: Retrieved on 2nd June 2024 from www.spunk.org\n\n I’d like to present to you a very concrete example of international solidarity and proof that it really works. I’m here as spokeswoman for International Workers Aid but I’m also a member of SAC which played an important role in developing this idea to reality. \n International Workers Aid started last summer with a plea for help from mine workers in Tuzla, a mining town in central Bosnia, to comrades in Britain. The miners of Tuzla have a long his…",
          "link": "https://theanarchistlibrary.org/library/eva-x-moberg-international-workers-aid-to-bosnia?v=1717325359",
          "publishedOn": "2024-06-02T10:49:19.000Z",
          "wordCount": 1877,
          "title": "Eva X Moberg - International Workers Aid To Bosnia",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "10136",
            "url": "https://theanarchistlibrary.org/library/eva-x-moberg-international-workers-aid-to-bosnia.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}