{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "f63b64a0773b039fe7590c2f6116b3ee57fc4cda",
          "author": "Matheus Guimaraes",
          "description": "Near real-time data replication: RDS for MySQL zero-ETL with Redshift streamlines data ingestion with filtering, multiple integrations, and CloudFormation support for customized insights without managing complex pipelines.",
          "link": "https://aws.amazon.com/blogs/aws/amazon-rds-for-mysql-zero-etl-integration-with-amazon-redshift-now-generally-available-enables-near-real-time-analytics/",
          "publishedOn": "2024-09-12T21:47:25.000Z",
          "wordCount": 1666,
          "title": "Amazon RDS for MySQL zero-ETL integration with Amazon Redshift, now generally available, enables near real-time analytics",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/07/25/zero-etl-news-blog-2024-800x400-1-1260x630.png"
        },
        {
          "id": "b6be07b1f469321af78fecbb25121071d42162ad",
          "author": "Elizabeth Fuentes",
          "description": "Amazon SageMaker HyperPod's integration with Amazon EKS brings resilience, observability, and flexibility to large model training, reducing downtime by up to 40%.",
          "link": "https://aws.amazon.com/blogs/aws/amazon-sagemaker-hyperpod-introduces-amazon-eks-support/",
          "publishedOn": "2024-09-10T16:53:57.000Z",
          "wordCount": 2109,
          "title": "Amazon SageMaker HyperPod introduces Amazon EKS support",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/06/10/SageMaker3.png"
        },
        {
          "id": "0b51c17d0042fb5a57a9c69c341e9765d332a961",
          "author": "Danilo Poccia",
          "description": "Last week, the latest AWS Heroes arrived! AWS Heroes are amazing technical experts who generously share their insights, best practices, and innovative solutions to help others. The AWS GenAI Lofts are in full swing with San Francisco and São Paulo open now, and London, Paris, and Seoul coming in the next couple of months. Here’s […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-dynamodb-aws-appsync-storage-browser-for-amazon-s3-and-more-september-9-2024/",
          "publishedOn": "2024-09-09T16:20:45.000Z",
          "wordCount": 1851,
          "title": "AWS Weekly Roundup: Amazon DynamoDB, AWS AppSync, Storage Browser for Amazon S3, and more (September 9, 2024)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/08/13/AWS-WIR-default.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": []
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps & Developer Productivity Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": []
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/b468bc0ff658",
          "author": "Netflix Technology Blog",
          "description": "Pushy is Netflix’s WebSocket server that maintains persistent WebSocket connections with devices running the Netflix application. This…",
          "link": "https://netflixtechblog.com/pushy-to-the-limit-evolving-netflixs-websocket-proxy-for-the-future-b468bc0ff658?source=rss----2615bd06b42e---4",
          "publishedOn": "2024-09-10T19:15:34.000Z",
          "wordCount": 8831,
          "title": "Pushy to the Limit: Evolving Netflix’s WebSocket proxy for the future",
          "imageUrl": "https://miro.medium.com/v2/da:true/resize:fit:1048/0*WQ1W30ChfWrEmmR5"
        },
        {
          "id": "https://medium.com/p/64b1f4b3bbdd",
          "author": "Netflix Technology Blog",
          "description": "By Jose Fernandez, Sebastien Dabdoub, Jason Koch, Artem Tkachuk",
          "link": "https://netflixtechblog.com/noisy-neighbor-detection-with-ebpf-64b1f4b3bbdd?source=rss----2615bd06b42e---4",
          "publishedOn": "2024-09-10T18:00:21.000Z",
          "wordCount": 4389,
          "title": "Noisy Neighbor Detection with eBPF",
          "imageUrl": "https://miro.medium.com/v2/resize:fill:1200:632/g:fp:0.48:0.5/1*6bapyclfXZPsUIaXFM-xaQ.png"
        }
      ]
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "7fd5d2aa425994eb182752ee6f7b22bfd45719d3",
          "author": "Sai Charan Teja Gopaluni",
          "description": "This post discusses Bottlerocket, a Linux-based open source operating system (OS) that is purpose-built for running containers. We walk through fleet management at scale and how users can benefit from it. We also share how the product roadmap of Bottlerocket is driven based on community and user feedback. The challenges of fleet management with General-Purpose […]",
          "link": "https://aws.amazon.com/blogs/containers/benefiting-from-bottlerocket-an-open-source-container-optimized-operating-system/",
          "publishedOn": "2024-09-13T21:26:25.000Z",
          "wordCount": 2837,
          "title": "Unlocking Benefits with Bottlerocket: A Purpose-Built Container OS",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/09/13/Featured-images-for-Containers-Blog-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=333428",
          "author": "William Silversmith",
          "description": "Image by Andrej Lišakov.\nUnder threat from Israeli tanks, the parents and siblings of Ms. Kamla (a pseudonym) were forced to evacuate al-Bureij camp and relocate to her central Gaza home in al-Maghazi on December 25, 2023. Three days later an Israeli tank fired a shell into her home, though thankfully their family was gathered in a different room of the house so there were no injuries. Since December 28, Kamla and her family have been displaced 7 or 8 times.\nWhen the Israeli tanks finished their operation, Kamla left the tent she had evacuated to in Dier al-Balah. She went to see if her house was still standing. She found it partially destroyed, yet still she tried to clear the rubble to live in it once more. That was not the end however, as Israel returned with more tanks and bombs.\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Hunted by Israeli Tanks and Drones, an English Teacher Protects Her Family in Central Gaza appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/15/hunted-by-israeli-tanks-and-drones-an-english-teacher-protects-her-family-in-central-gaza/",
          "publishedOn": "2024-09-15T06:09:36.000Z",
          "wordCount": null,
          "title": "Hunted by Israeli Tanks and Drones, an English Teacher Protects Her Family in Central Gaza",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333616",
          "author": "Jeffrey St. Clair",
          "description": "+ Here’s a snapshot of Israel’s escalating war on the West Bank… + Since January 2023, 772 Palestinians have been killed by Israeli armed forces (747) or settlers (18), including 181 children.  + In the same time period, 14,632 Palestinians have been injured by Israelis, including 2,167 children.  + Since January 2023, 6,202 Palestinians, including […]\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post All Aflame on the West Bank Front appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/14/all-aflame-on-the-west-bank-front/",
          "publishedOn": "2024-09-14T14:44:23.000Z",
          "wordCount": null,
          "title": "All Aflame on the West Bank Front",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333306",
          "author": "Gerald Sussman",
          "description": "AIPAC is funded by corporations that are happy to support the defeat of progressive members of Congress who tend to stand up for both Palestinian rights and worker rights in America. Almost 60% of AIPAC’s money comes from corporate CEOs and other top executives from Fortune 500 companies. The largest single donor to the United Democracy Project is Jan Koum, the multibillionaire former CEO of WhatsApp and a regular Republican funder. The biggest institutional contributors to UDP come from FIRE, finance/insurance and real estate sectors. More\nThe post Zionism International is Working Both Sides of the Atlantic appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/zionism-international-is-working-both-sides-of-the-atlantic/",
          "publishedOn": "2024-09-13T06:02:27.000Z",
          "wordCount": null,
          "title": "Zionism International is Working Both Sides of the Atlantic",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333492",
          "author": "Jeffrey St. Clair",
          "description": "The Israeli version of the shooting, which the Biden administration swiftly adopted, was quickly shown by witnesses, cellphone videos and a detailed investigation by the Washington Post to be not only implausible but absolute bunk. The murder of Ayşenur Eygi took place at least 20 minutes after the last confrontation between Palestinian villagers and IDF troops. Ayşenur never threw any stones and was never within 200 yards of anyone who did. The rooftop sniper had a clear view of where Ayşenur was standing, talking to her friend Helen, and she couldn’t be confused for a Palestinian “instigator.” For whatever reason, Ayşenur was targeted; the sights of the rifle focused on her head and shot. The bullet that killed her didn’t ricochet off of a tree or a rock or a dumpster. The sniper had a clear shot and took it. As Rachel Corrie’s father, Craig, said this week: “Israel does not do investigations; they do cover-ups.” More\nThe post Murder in Beita: the IDF’s Killing of Ayşenur Eygi appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/murder-in-beita-the-idfs-killing-of-aysenur-eygi/",
          "publishedOn": "2024-09-13T06:01:12.000Z",
          "wordCount": null,
          "title": "Murder in Beita: the IDF’s Killing of Ayşenur Eygi",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333325",
          "author": "Melvin Goodman",
          "description": "President Biden’s neglect of arms control and disarmament means that the next president will inherit a nuclear landscape that is more threatening and volatile than any other since the Cuban missile crisis more than 60 years ago.  The Cuban missile crisis, however, was a wake up call for both President John F. Kennedy and General Secretary Nikita Khrushchev, leading to a series of arms control and disarmament treaties beginning with the Partial Test Ban Treaty of 1963.   More\nThe post Biden’s Legacy: the Decline of Arms Control and Disarmament appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/bidens-legacy-the-decline-of-arms-control-and-disarmament-2/",
          "publishedOn": "2024-09-13T06:01:11.000Z",
          "wordCount": null,
          "title": "Biden’s Legacy: the Decline of Arms Control and Disarmament",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333427",
          "author": "Matthew Stevenson",
          "description": "The day after the debate, I woke up to the resounding evidence that Harris had floated like a butterfly over the proceedings and occasionally had stung the hapless Trump like a bee. He, I was assured, had done no better on tariffs, Gaza, Ukraine, abortion, climate change, or January 6 than he had with his eloquence over the Springfield protein diet. Then I re-watched the C-Span feed, including the dismal soundbites from the spin rooms, and came to the conclusion that presidential debates are just a variation on Narcissus’s pond in which we only see our own reflections and hear our own words, which explains why debates rarely move the voting dials. More\nThe post The Debate: Catch Trump If You Can appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/the-debate-catch-trump-if-you-can/",
          "publishedOn": "2024-09-13T05:59:39.000Z",
          "wordCount": null,
          "title": "The Debate: Catch Trump If You Can",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333393",
          "author": "Kathleen Wallace",
          "description": "The very notion that it is acceptable to tie one's health in a civilized nation to having ample cash is clearly anathema to most of the world, but it's the way things are in the United States. Countless individuals toil at jobs that do not provide even cursory health coverage. Many individuals who do have some coverage generally try to avoid tapping into many needed health resources due to the sheer cost-inhibitory manner of it all. Co-pays, deductibles, coinsurance, and mandatory first-born deposits will cost you even if you have insurance. We are at a time when even those who have fairly “decent” insurance ration it, many times avoiding care in the early stages of a condition, which often manifests itself later in more expensive and less treatable conditions. The setup of care in the United States is anything but sensible or cost-efficient.  More\nThe post Nice Health Ya Got There, Mister. Be a Shame if Someone Took it for Cash appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/nice-health-ya-got-there-mister-be-a-shame-if-someone-took-it-for-cash/",
          "publishedOn": "2024-09-13T05:58:02.000Z",
          "wordCount": null,
          "title": "Nice Health Ya Got There, Mister. Be a Shame if Someone Took it for Cash",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333343",
          "author": "Eve Ottenberg",
          "description": "Last year, 2023, was the hottest year on record. But 2024 isn’t over, and July 2024 was the warmest recorded July. So you can expect this year to beat 2023 in the abnormal heat sweepstakes, because that fits the pattern of the last decade, the warmest one ever…Gee whiz, whatever could be causing all this  More\nThe post Climate Catastrophe Smashes Heat Records, as Plutocrats, Politicians Twiddle Their Thumbs appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/climate-catastrophe-smashes-heat-records-as-plutocrats-politicians-twiddle-their-thumbs/",
          "publishedOn": "2024-09-13T05:57:37.000Z",
          "wordCount": null,
          "title": "Climate Catastrophe Smashes Heat Records, as Plutocrats, Politicians Twiddle Their Thumbs",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333389",
          "author": "James Bovard",
          "description": "In a presidential race in which both major party candidates are kowtowing to law enforcement, don’t expect any candor about the perils that politicians have unleashed. To serve and protect, police are allowed to slander and destroy. Cops in many states and localities have acquired the right to lie about their shootings, searches, and practically  More\nThe post Why are Police Entitled to Lie and Slander? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/why-are-police-entitled-to-lie-and-slander/",
          "publishedOn": "2024-09-13T05:57:26.000Z",
          "wordCount": null,
          "title": "Why are Police Entitled to Lie and Slander?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333448",
          "author": "Joseph Natoli",
          "description": "Donald Trump’s victory in 2016 was a surprise, I conjecture, to Trump himself. I think he was surprised earlier in the Primaries how easy it was to mock and upstage his challengers. He could break all the protocols of proper Primary behavior without check. Perhaps that was the first time he realized there was no  More\nThe post Atavism in the American Mass Psyche appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/atavism-in-the-american-mass-psyche/",
          "publishedOn": "2024-09-13T05:57:19.000Z",
          "wordCount": null,
          "title": "Atavism in the American Mass Psyche",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333407",
          "author": "Jamal Kanj",
          "description": "Fifty-two years ago, almost to the day, on September 8, 1972, I survived the first of many Israeli air and sea raids on my refugee camp in northern Lebanon. I was less than two hundred yards from the area across the river where a group of us young kids met every day, between 4 and  More\nThe post Israel’s Bloody Negotiations Strategy in Gaza appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/israels-bloody-negotiations-strategy-in-gaza/",
          "publishedOn": "2024-09-13T05:57:15.000Z",
          "wordCount": null,
          "title": "Israel’s Bloody Negotiations Strategy in Gaza",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333451",
          "author": "Thomas Knapp",
          "description": "“It never got weird enough for me,” says Hunter S. Thompson — or, rather, Bill Murray as Hunter S. Thompson in 1980s kinda sorta Thompson biopic, Where the Buffalo Roam.  “I moved to the country when the boat got too crowded. Then I learned that President Nixon had been eaten by white cannibals on an  More\nThe post Election 2024: Finally Weird Enough? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/election-2024-finally-weird-enough/",
          "publishedOn": "2024-09-13T05:56:57.000Z",
          "wordCount": null,
          "title": "Election 2024: Finally Weird Enough?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333401",
          "author": "Ramzy Baroud",
          "description": "When asked why his latest map has erased the whole of the West Bank, Israeli Prime Minister Benjamin Netanyahu retorted with the most detestable answer. “I didn’t include the Dead Sea. It’s not shown on the map. I didn’t show the Jordan River. It’s not on this map. I didn’t show the Sea of Galilee,”  More\nThe post Cartography of Genocide: Why Netanyahu Erased Palestine from the Map  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/cartography-of-genocide-why-netanyahu-erased-palestine-from-the-map/",
          "publishedOn": "2024-09-13T05:56:19.000Z",
          "wordCount": null,
          "title": "Cartography of Genocide: Why Netanyahu Erased Palestine from the Map",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333287",
          "author": "Daniel Warner",
          "description": "August 2024 marked the 75th anniversary of the four Geneva Conventions which form the basis of international humanitarian law (IHL). The dream of five Swiss men (Henri Dunant, Louis Appia, General Guillaume Henri Dufour, Gustave Moynier, Theodore Maunoir) was realized and codified in the hope of “civilizing” the way wars were fought. Separating civilians from  More\nThe post An Ambivalent Anniversary of “The One Set of Rules We All Agree On” appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/an-ambivalent-anniversary-of-the-one-set-of-rules-we-all-agree-on/",
          "publishedOn": "2024-09-13T05:55:43.000Z",
          "wordCount": null,
          "title": "An Ambivalent Anniversary of “The One Set of Rules We All Agree On”",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333413",
          "author": "Robert Hunziker",
          "description": "The 11th Scientific Committee on Antarctic Research conference was held in Pucón, Chile August 19-23, 2024. Fifteen-hundred academics, researchers, and scientists specializing in Antarctica met to share cutting-edge research. Reports at the conference exposed new dimensions of the Antarctic risk profile that should move the world’s leadership posthaste to mitigate society’s self-destructive dependence on fossil  More\nThe post Antarctica’s Deep Vulnerability Exposed at 11th Scientific Conference appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/antarcticas-deep-vulnerability-exposed-at-11th-scientific-conference/",
          "publishedOn": "2024-09-13T05:55:41.000Z",
          "wordCount": null,
          "title": "Antarctica’s Deep Vulnerability Exposed at 11th Scientific Conference",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333470",
          "author": "Henry Giroux",
          "description": "At this moment in history, we find ourselves in a society defined by relentless speed, overwhelming amounts of information, the proliferation of misinformation, and widening inequality.[1] Fascist politics are increasingly legitimized, long-term commitments are devalued, and the far-right’s vision of society constantly shifts, maintaining control through chaos and confusion. In such an environment, memory becomes  More\nThe post Rethinking 9/11: Fascism, Memory, and the Crisis of Democracy in the 21st Century appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/rethinking-9-11-fascism-memory-and-the-crisis-of-democracy-in-the-21st-century/",
          "publishedOn": "2024-09-13T05:55:28.000Z",
          "wordCount": null,
          "title": "Rethinking 9/11: Fascism, Memory, and the Crisis of Democracy in the 21st Century",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333480",
          "author": "Paul Street",
          "description": "Tim Walz is telling people to “leave it all on the field” of the election. Americans better not follow his advice. The 2024 election day will kick off a much bigger game full of peril but not without some opportunity on the path to the emancipation of humanity. Poisoning Our Blood Let’s start with some  More\nThe post Peril and Possibility: Post-Election Scenarios appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/peril-and-possibility-post-election-scenarios/",
          "publishedOn": "2024-09-13T05:55:11.000Z",
          "wordCount": null,
          "title": "Peril and Possibility: Post-Election Scenarios",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333411",
          "author": "Rebecca Gordon",
          "description": "The Washington Post headline reads: “A big problem for young workers: 70- and 80-year-olds who won’t retire.” For the first time in history, reports Aden Barton, five generations are competing in the same workforce. His article laments a “demographic traffic jam” at the apexes of various employment pyramids, making it ever harder for young people “to launch their careers and  More\nThe post A Personal Meditation on Growing Old appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/a-personal-meditation-on-growing-old/",
          "publishedOn": "2024-09-13T05:50:57.000Z",
          "wordCount": null,
          "title": "A Personal Meditation on Growing Old",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333439",
          "author": "Prerna Gupta",
          "description": "In the face of a complex and urgent problem like climate change, it’s tempting to believe in simple solutions. Just as detox teas or diet pills claim to solve health issues that truly require lifestyle changes, nuclear energy has been marketed as a quick fix for the socio-political problem that climate change is. It’s presented  More\nThe post Don’t Be Bamboozled by Nuclear Power appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/dont-be-bamboozled-by-nuclear-power/",
          "publishedOn": "2024-09-13T05:50:57.000Z",
          "wordCount": null,
          "title": "Don’t Be Bamboozled by Nuclear Power",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333294",
          "author": "Gabriel Kuhn",
          "description": "In mid-August, a few days before the US Open kicked off, it was revealed that the number one in the men’s world ranking and the eventual winner of the tournament, Jannik Sinner of Italy, had left two positive doping tests earlier this year. During and shortly after a tournament the ATP (Association of Tennis Professionals)  More\nThe post Nick Kyrgios: The Donald Trump of Tennis appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/nick-kyrgios-the-donald-trump-of-tennis/",
          "publishedOn": "2024-09-13T05:50:55.000Z",
          "wordCount": null,
          "title": "Nick Kyrgios: The Donald Trump of Tennis",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333404",
          "author": "Lawrence Wittner",
          "description": "Are the nations of the world doomed to go on fighting the brutal, horrifying wars that have long characterized human history? We might well wonder about that as we watch, aghast, while Israeli armed forces slaughter thousands of Palestinian civilians, Russian military might relentlessly pounds Ukrainian towns and cities into rubble, and new, bloody wars  More\nThe post The Law of Force or the Force of Law appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/the-law-of-force-or-the-force-of-law/",
          "publishedOn": "2024-09-13T05:49:18.000Z",
          "wordCount": null,
          "title": "The Law of Force or the Force of Law",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333206",
          "author": "Kirkpatrick Sale",
          "description": "In a healthy society of non-human primates, there are no nations, no extended organizations, no supraterritorial forms that might resemble a state. Troops of primates do have a social cohesion about them, creating various temporary leaders or hierarchies according to the function at hand—one for fighting, say, another for vigilance, a third for feeding— and  More\nThe post What Do We Need a State for Anyway? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/what-do-we-need-a-state-for-anyway/",
          "publishedOn": "2024-09-13T05:49:14.000Z",
          "wordCount": null,
          "title": "What Do We Need a State for Anyway?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333465",
          "author": "Howard Lisnoff",
          "description": "The New York Times/Sienna poll (New York Times, September 8, 2024) brought back the same sickening sense of doom that I felt in both 1969 and 1971. George McGovern’s defeat in the 1972 presidential campaign nailed down the lid on the coffin of anything that seemed even close to sanity to me in those years during the  More\nThe post Déjà Vu All Over Again appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/deja-vu-all-over-again-3/",
          "publishedOn": "2024-09-13T05:45:59.000Z",
          "wordCount": null,
          "title": "Déjà Vu All Over Again",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333460",
          "author": "Seth Sandronsky",
          "description": "Mass protests across the US against Jim Crow drove the rise of the Black Power and Civil Rights movements generations ago. The impacts were far reaching across the lines of class, color and gender. Ruling circles in and out of the federal, state and local governments responded, the backdrop to Earl Ofari Hutchinson’s The Myth  More\nThe post The Myth of Black Capitalism appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/the-myth-of-black-capitalism/",
          "publishedOn": "2024-09-13T05:45:48.000Z",
          "wordCount": null,
          "title": "The Myth of Black Capitalism",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333462",
          "author": "Damon Orion",
          "description": "The stigma of a criminal conviction can be a major barrier to community reentry for recently released prisoners. A December 2021 report by the Bureau of Justice Statistics highlighted the employment barrier faced by the more than 50,000 who were incarcerated, with 33 percent of them being unable to find any employment “over four years” after their  More\nThe post Recycling the Discarded appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/recycling-the-discarded/",
          "publishedOn": "2024-09-13T05:45:42.000Z",
          "wordCount": null,
          "title": "Recycling the Discarded",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333468",
          "author": "Peter Certo",
          "description": "When my dad moved to southwest Ohio in the early 1970s, the Dayton-Springfield area’s second city was home to over 80,000 people. When I was growing up nearby in the 1990s, it was 70,000. Today, it’s less than 60,000. Springfield’s decline looks like an awful lot of Rust Belt cities and towns. And behind those numbers  More\nThe post Why the Far Right Lies About Immigrants appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/why-the-far-right-lies-about-immigrants/",
          "publishedOn": "2024-09-13T05:45:28.000Z",
          "wordCount": null,
          "title": "Why the Far Right Lies About Immigrants",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333419",
          "author": "John O'Kane",
          "description": "I received a review of Charles Bukowski’s Hollywood for AMASS Magazine (formerly Enclitic) as we were finalizing the current issue. We wanted to include it, but it was riddled with problems. I tried to salvage it, extracting a few of its good points, but it was hopeless. And the author had no interest in being  More\nThe post Charles Bukowski’s Ordinary Madness appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/charles-bukowskis-ordinary-madness/",
          "publishedOn": "2024-09-13T05:45:23.000Z",
          "wordCount": null,
          "title": "Charles Bukowski’s Ordinary Madness",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333469",
          "author": "Karen Dolan",
          "description": "Maybe you’ve heard some of the buzz about “Project 2025.” What is it — and what would it mean for you and your family? Project 2025 is a proposed “transition plan for a new Republican administration” put together by the Heritage Foundation, a right-wing think tank. It’s an in-depth list of what conservative groups will  More\nThe post Project 2025 is a Blue Print for the End of the American Dream appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/project-2025-is-a-blue-print-for-the-end-of-the-american-dream/",
          "publishedOn": "2024-09-13T05:45:19.000Z",
          "wordCount": null,
          "title": "Project 2025 is a Blue Print for the End of the American Dream",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333474",
          "author": "Keara Sosa",
          "description": "The past 20 years have been critical in the fight for bold and sustainable climate solutions. The next five years will be even more vital — and young people like me are fighting hard to make sure our leaders get it right. Research shows we have about five years left to avert global warming beyond 1.5  More\nThe post Young People Will Save the World, Because We’re the Last Generation That Can appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/young-people-will-save-the-world-because-were-the-last-generation-that-can/",
          "publishedOn": "2024-09-13T05:45:17.000Z",
          "wordCount": null,
          "title": "Young People Will Save the World, Because We’re the Last Generation That Can",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=333330",
          "author": "Mark Robert Rank",
          "description": "The number of Americans living in poverty, according to the nation’s official definition, fell slightly to about 36.8 million in 2023, the Census Bureau announced on Sept. 10, 2024. The data released also indicated that the poverty rate declined a little. However, an alternative way to measure poverty ticked up, as more people in the  More\nThe post Official US Poverty Rate Declined in 2023, But More People Faced Economic Hardship appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/09/13/official-us-poverty-rate-declined-in-2023-but-more-people-faced-economic-hardship/",
          "publishedOn": "2024-09-13T05:43:12.000Z",
          "wordCount": null,
          "title": "Official US Poverty Rate Declined in 2023, But More People Faced Economic Hardship",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": []
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45589",
          "author": "Lars Syll",
          "description": "from Lars Syll Few issues in politics and economics are nowadays more discussed — and less understood — than public debt. Many raise their voices to urge for reducing the debt, but few explain why and in what way reducing the debt would be conducive to a better economy or a fairer society. And there […]",
          "link": "https://rwer.wordpress.com/2024/09/13/rethinking-public-debt-3/",
          "publishedOn": "2024-09-13T19:42:25.000Z",
          "wordCount": 5146,
          "title": "Rethinking public debt",
          "imageUrl": "https://larspsyll.wordpress.com/wp-content/uploads/2018/04/loan.jpg?w=350&h=250"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=278581",
          "author": "Yves Smith",
          "description": "Mark Ames' biting classic is a reminder that Larry Summers, like so many prominent economists, has become too big to fail.",
          "link": "https://www.nakedcapitalism.com/2024/09/mark-ames-why-finance-is-too-important-to-leave-to-larry-summers-8.html",
          "publishedOn": "2024-09-15T14:34:04.000Z",
          "wordCount": 4658,
          "title": "Mark Ames:  Why Finance Is Too Important to Leave to Larry Summers",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=278619",
          "author": "Conor Gallagher",
          "description": "",
          "link": "https://www.nakedcapitalism.com/2024/09/links-9-15-2024.html",
          "publishedOn": "2024-09-15T10:55:13.000Z",
          "wordCount": 14722,
          "title": "Links 9/15/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/Screenshot-2024-09-14-at-5.31.50 PM-e1726327971933.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=278635",
          "author": "Conor Gallagher",
          "description": "Mario Draghi calls for Europe, decimated by self-inflicted energy crisis and social austerity, to go on borrowing spree to pay for endless fight against Russia.",
          "link": "https://www.nakedcapitalism.com/2024/09/the-eu-retreats-further-into-a-world-of-self-delusion.html",
          "publishedOn": "2024-09-15T10:00:10.000Z",
          "wordCount": 10013,
          "title": "The EU Retreats Further into a World of Self-Delusion",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/Screenshot-2024-09-15-at-6.36.12 AM-1024x714.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=278646",
          "author": "Conor Gallagher",
          "description": "But has she already embraced them?",
          "link": "https://www.nakedcapitalism.com/2024/09/harris-cant-embrace-billionaires-if-she-wants-to-win.html",
          "publishedOn": "2024-09-15T09:00:37.000Z",
          "wordCount": 5685,
          "title": "Harris Can’t Embrace Billionaires if She Wants to Win",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=278609",
          "author": "Yves Smith",
          "description": "In this hostile media environment, getting the word out about Naked Capitalism is ever more important! Please help fund promoting the site!",
          "link": "https://www.nakedcapitalism.com/2024/09/kudos-bravo-met-our-fifth-goal-and-on-to-the-sixth-expanding-our-reach.html",
          "publishedOn": "2024-09-14T15:03:44.000Z",
          "wordCount": 3771,
          "title": "Kudos! Met Our Fifth Goal, and on to the Sixth: Expanding Our Reach",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-14-at-9.51.31-PM-300x236.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=278610",
          "author": "Lambert Strether",
          "description": "242 pages of community inspiration",
          "link": "https://www.nakedcapitalism.com/2024/09/fundraiser-special-come-get-this-years-naked-capitalism-songbooks.html",
          "publishedOn": "2024-09-14T14:45:57.000Z",
          "wordCount": 3532,
          "title": "Fundraiser Special! Come Get This Year’s Naked Capitalism Songbook!",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=278599",
          "author": "Lambert Strether",
          "description": "Our popular daily links",
          "link": "https://www.nakedcapitalism.com/2024/09/links-9-14-2024.html",
          "publishedOn": "2024-09-14T10:58:18.000Z",
          "wordCount": 24252,
          "title": "Links 9/14/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/bloomberg_brain.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=278549",
          "author": "Yves Smith",
          "description": "Two readers have teamed up to turbocharge small donations!",
          "link": "https://www.nakedcapitalism.com/2024/09/new-small-donation-double-your-donations-challenge.html",
          "publishedOn": "2024-09-14T06:30:47.000Z",
          "wordCount": 3492,
          "title": "Announcing Our New Small Donation “Double Your Donations” Challenge",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-13-at-10.44.18-PM-199x300.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=278582",
          "author": "Yves Smith",
          "description": "How the global economy is being restructured, in no small measure due to inept, self-destructive policy moves that undermine dollar use in trade.",
          "link": "https://www.nakedcapitalism.com/2024/09/is-us-policy-saving-the-dollar-or-destroying-it.html",
          "publishedOn": "2024-09-14T06:28:13.000Z",
          "wordCount": 11418,
          "title": "Is US Policy Saving the Dollar or Destroying It?",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=278583",
          "author": "Yves Smith",
          "description": "Greenfield, Massachusetts’s Compost Co-op gives ex-inmates a living wage through meaningful work.",
          "link": "https://www.nakedcapitalism.com/2024/09/compost-co-op-recycling-the-discarded.html",
          "publishedOn": "2024-09-14T05:00:16.000Z",
          "wordCount": 4140,
          "title": "Compost Co-Op: Recycling the Discarded",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "27ZTkLyAI8VPmwUK2U3jU7",
          "author": "Peter Foster",
          "description": "At Cloudflare, we protect customer APIs from abuse. This is no easy task, as abusive traffic can take different forms, from giant DDoS attacks to low-and-slow credential stuffing campaigns. We now address this challenge in a new way: by looking outside typical volumetric measures and using statistical machine learning to find important API client request sequences.",
          "link": "https://blog.cloudflare.com/protecting-apis-from-abuse-using-sequence-learning-and-variable-order-markov",
          "publishedOn": "2024-09-12T14:15:00.000Z",
          "wordCount": 3117,
          "title": "Protecting APIs from abuse using sequence learning and variable order Markov chains",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7eOoAs5kXcv6q1reyAKTgW/45027ee2cf1952ca32263b4b3e94fd86/Protecting_APIs_from_abuse_using_sequence_learning_and_variable_order_Markov_chains-OG.png"
        },
        {
          "id": "4NI7PBab9zePZzucqLYhPh",
          "author": "João Tomé",
          "description": "See how the first 2024 US presidential debate between Kamala Harris and Donald Trump influenced Internet traffic patterns compared to the Biden-Trump debate. We also review email trends and observed attack activity.",
          "link": "https://blog.cloudflare.com/how-the-harris-trump-us-presidential-debate-influenced-internet-traffic",
          "publishedOn": "2024-09-11T16:00:00.000Z",
          "wordCount": 2400,
          "title": "How the Harris-Trump US presidential debate influenced Internet traffic",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6HjZF9JTf1LPz0rB7FaCDm/6aa0a9696d5a2e7e4d7acb95d8e6f935/How_the_Harris-Trump_US_presidential_debate_influenced_Internet_traffic-OG.png"
        },
        {
          "id": "2oxT0UhMM8loVoSuUom7W8",
          "author": "Corey Mahan",
          "description": "This post explains how our integrations with CrowdStrike Falcon® Next-Gen SIEM allow customers to identify and investigate risky user behavior and analyze data combined with other log sources to uncover hidden threats.",
          "link": "https://blog.cloudflare.com/customers-get-increased-integration-with-cloudflare-email-security-and-zero-trust",
          "publishedOn": "2024-09-11T13:00:00.000Z",
          "wordCount": 1145,
          "title": "Customers get increased integration with Cloudflare Email Security and Zero Trust through expanded partnership with CrowdStrike",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/R8b3OcIJSR4gWYdssurUZ/3b4c74576a836be1f0af03c193e43879/Customers_get_increased_integration_with_Cloudflare_Email_Security_and_Zero_Trust_through_expanded_partnership_with_CrowdStr.png"
        },
        {
          "id": "2CqKLNS1jaf5H2j99sDONe",
          "author": "Kevin Guthrie",
          "description": "Pingora handles 35M+ requests per second, so saving a few microseconds per request can translate to thousands of dollars saved on computing costs. In this post, we share how we freed up over 500 CPU cores by optimizing one function and announce trie-hard, the open source crate that we created to do it.",
          "link": "https://blog.cloudflare.com/pingora-saving-compute-1-percent-at-a-time",
          "publishedOn": "2024-09-10T14:00:00.000Z",
          "wordCount": 2269,
          "title": "A good day to trie-hard: saving compute 1% at a time",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7sPe2ORh9vzsbG6owWUicC/b385d8f29b8f715f7d0793fe646e4dac/-2024-_Blog_Template__1200x628_.png"
        },
        {
          "id": "3zICVbgdxrLByG4g2Dsddy",
          "author": "James M Snell",
          "description": "Workers now supports more NPM packages and Node.js APIs using an overhauled hybrid compatibility layer.",
          "link": "https://blog.cloudflare.com/more-npm-packages-on-cloudflare-workers-combining-polyfills-and-native-code",
          "publishedOn": "2024-09-09T21:00:00.000Z",
          "wordCount": 2423,
          "title": "More NPM packages on Cloudflare Workers: Combining polyfills and native code to support Node.js APIs",
          "imageUrl": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7ahNGmC7Z5DQ44zQFJi9sk/654d8406a1cd9dcb3036f4ecfc123412/More_NPM_packages_on_Cloudflare_Workers-_Combining_polyfills_and_native_code_to_support_Node.js_APIs-OG.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": []
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=21675",
          "author": null,
          "description": "We’re sharing more about the role that reinforcement learning plays in helping us optimize our data centers’ environmental controls. Our reinforcement learning-based approach has helped us reduce energy consumption and water usage across various weather conditions in our data centers.   Meta is revamping its new data center design to optimize for artificial intelligence and the [...]\nRead More...\nThe post Simulator-based reinforcement learning for data center cooling optimization appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/09/10/data-center-engineering/simulator-based-reinforcement-learning-for-data-center-cooling-optimization/",
          "publishedOn": "2024-09-10T16:00:31.000Z",
          "wordCount": 3163,
          "title": "Simulator-based reinforcement learning for data center cooling optimization",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2021/12/Eng-Blog-Self-Serve-Hero-Images-DATACENTERS-501-Teale.jpg"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=41551180",
          "author": "shalmanese",
          "description": "One distressing trend I've noticed becoming ubiquitous on HN is that any writing that is confronting to a consensus worldview becomes flooded with highly upvoted comments that are, in essence, excuses for why it's not necessary in this instance to re-examine your priors.\nHe's making low value content/the culture of the company is horrible/he's a fraud/it's more luck than skill. The actual critiques are personalized to the content and, to one extent or another, valid, but the social purpose of the critiques is universal which is that I felt uncomfortable that reading this might mean I have to re-evaluate my worldview and I'm going to dive into the comment section and upvote all the people telling me actually, I don't have to do that.\nI actually spent over an hour writing 750+ words of my takeaways reading this document and shared it privately with a few founder friends of mine and I briefly considered also posting to share with the community but I took a look at the comments and took a look at what I wrote and decided I didn't have the energy to face the endless onslaught of nitpicks and misunderstandings that are driven, at the end of the day, not by a genuine intellectual desire to reach an understanding, but by the need to prove emotionally that others are not taking this seriously so I don't have to either.\nAll I can do is be vague and say I think this was an enormously valuable piece of writing that is worth engaging seriously for what it is as it might change your worldview in several important ways.\nBut also my larger meta-point is that there's a now near ubiquitous \"sour grapes\" attitude that's pervaded HN that makes it an extremely unpleasant place to hold a conversation and people reading should be aware of this systematic bias when reading comments here.",
          "link": "https://news.ycombinator.com/item?id=41551180",
          "publishedOn": "2024-09-15T22:53:46.000Z",
          "wordCount": null,
          "title": "New comment by shalmanese in \"How to Succeed in Mr Beast Production (Leaked PDF)\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41546039",
          "author": "DrSiemer",
          "description": "This sucks. Cache basically guaranteed that whatever Google thought was on the page could actually be found.\nThese days Google will offer a result where the little blurb (which is actually a truncated mini cache) shows a part of the information I'm looking for, but the page itself does not. Removing cache means the data is just within reach, but you can't get to it anymore.\nInternet Archive is a hassle and not as reliable as an actual copy of the page where the blurb was extracted from.",
          "link": "https://news.ycombinator.com/item?id=41546039",
          "publishedOn": "2024-09-15T08:09:33.000Z",
          "wordCount": 2371,
          "title": "New comment by DrSiemer in \"Google Has Officially Killed Cache Links\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41544698",
          "author": "AnarchismIsCool",
          "description": "I've learned to hate software process.  If you have team sizes set sanely and empower devs to do what they need to do in order to accomplish the goal, they'll be fine without the management overhead of arbitrarily imposed productivity flow.  Agile et al, along with 99% of the features in ticketing systems, exist to make managers feel like they are justifying their paycheck.\nIf you are a manager and this makes you angry, you're one of the bad ones.",
          "link": "https://news.ycombinator.com/item?id=41544698",
          "publishedOn": "2024-09-15T02:18:47.000Z",
          "wordCount": null,
          "title": "New comment by AnarchismIsCool in \"Why Scrum Is Stressing You Out\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41543927",
          "author": "throwgfgfd25",
          "description": "If you want to do code-CAD for anything substantial and you haven't yet developed a significant dependency on OpenSCAD, do your brain a favour and spend at least some time with CadQuery, Build123D or (if you prefer JS to Python) Replicad.\nAs impressive as NopSCADlib and BOSL2 are (and OMG they are, when you consider what they have to work with!), OpenSCAD is a one-way, declarative CSG environment that essentially only outputs mesh formats. It's really not that much better than working with three-dimensional pixels. You won't really be able to analyse, iterate over or measure your models, easily build on faces, do easy chamfers or fillets, export STEP files, make use of constraint-based designs, model assemblies, or so many other things that \"CAD\" means in the 21st century. All the tools that help you do this on OpenSCAD are layers and layers of task-specific hacks and clever bodges.\nI totally get wanting to make models with version-controlled text files instead of GUI CAD (which can be a sort of weird battle to learn for a programmer), and I get wanting to avoid FreeCAD. I just don't really get wanting to limit oneself to such a limited concept of a 3D \"model\"!\nThe three alternative systems I mention are all based around bindings to (or in Replicad's case, cross-compilation of) OpenCASCADE, which is a bRep CAD kernel capable of much richer interactions. It is not without its faults, but arguably code-CAD spares you from some of the inscrutability that trips up FreeCAD's interactive model.",
          "link": "https://news.ycombinator.com/item?id=41543927",
          "publishedOn": "2024-09-14T23:38:54.000Z",
          "wordCount": 6788,
          "title": "New comment by throwgfgfd25 in \"OpenSCAD: The Programmer's Solid 3D CAD Modeller\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41542863",
          "author": "fnordpiglet",
          "description": "Rewind your mind to 2019 and imagine reading a post that said\n“The experience seemed roughly on par with trying to advise a mediocre, but not completely incompetent, graduate student.”\nWith regard to interacting with the equivalent of Alexa. That’s a remarkable difference in 5 years.",
          "link": "https://news.ycombinator.com/item?id=41542863",
          "publishedOn": "2024-09-14T20:56:23.000Z",
          "wordCount": null,
          "title": "New comment by fnordpiglet in \"Terence Tao on O1\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41542411",
          "author": "koala_man",
          "description": "I find this \"falsehoods programmers believe\" format of making pointed claims that you intentionally don't clarify to be unhelpful and obnoxious",
          "link": "https://news.ycombinator.com/item?id=41542411",
          "publishedOn": "2024-09-14T20:00:53.000Z",
          "wordCount": 3285,
          "title": "New comment by koala_man in \"Falsehoods programmers believe about TCP\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41541563",
          "author": "h2odragon",
          "description": "To whom it may concern, the TN state \"BOFH\" license plate should be available now. I've had it for 30 years, but i'm not able to drive anymore and the truck died, so I didn't renew it last month.",
          "link": "https://news.ycombinator.com/item?id=41541563",
          "publishedOn": "2024-09-14T18:01:33.000Z",
          "wordCount": 481,
          "title": "New comment by h2odragon in \"The Bastard Operator from Hell (1999)\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41541425",
          "author": "lenerdenator",
          "description": "1) Move most good careers that do not require a college degree out of the country for the benefit of shareholders\n2) Tell everyone born between 1980 and 1995 that they'll be unable to compete in the global marketplace if they don't get at least some post-high school education, and imply that the mere presence of a degree will help instead of having a specific type of degree\n3) Have next-to-zero standards for public funds used in grant and loan programs for college education, meaning people can take out loans for any sort of degree program at almost any sort of institution\n4) Hold these debtors to standards that aren't applied to other types of debtors. You cannot discharge them through bankruptcy, it's very difficult to renegotiate, and SCOTUS has said that the chief executive of the note-holding institution (in this case, the President of the United States) cannot use discretion in deciding who he gets to forgive for loans.",
          "link": "https://news.ycombinator.com/item?id=41541425",
          "publishedOn": "2024-09-14T17:43:13.000Z",
          "wordCount": null,
          "title": "New comment by lenerdenator in \"How America's universities became debt factories\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41541372",
          "author": "wenc",
          "description": "Once GPT is tuned more heavily on Lean (proof assistant) -- the way it is on Python -- I expect its usefulness for research level math to increase.\nI work in a field related to operations research (OR), and ChatGPT 4o has ingested enough of the OR literature that it's able to spit out very useful Mixed Integer Programming (MIP) formulations for many \"problem shapes\". For instance, I can give it a logic problem like \"i need to put i items in n buckets based on a score, but I want to fill each bucket sequentially\" and it actually spits out a very usable math formulation.  I usually just need to tweak it a bit. It also warns against weak formulations where the logic might fail, which is tremendously useful for avoiding pitfalls. Compare this to the old way, which is to rack my brain over a weekend to figure out a water-tight formulation of MIP optimization problem (which is often not straightforward for non-intuitive problems). GPT has saved me so much time in this corner of my world.\nYes, you probably wouldn't be able to use ChatGPT well for this purpose unless you understood MIP optimization in the first place -- and you do need to break down the problem into smaller chunks so GPT can reason in steps --  but for someone who can and does, the $20/month I pay for ChatGPT more than pays for itself.\nside: a lot of people who complain on HN that (paid/good - only Sonnet 3.5 and GPT4o are in this category) LLMs are useless to them probably (1) do not know how to use LLMs in way that maximizes their strengths; (2) have expectations that are too high based on the hype, expecting one-shot magic bullets. (3) LLMs are really not good for their domain. But many of the low-effort comments seem to mostly fall into (1) and (2) -- cynicism rather than cautious optimism.\nMany of us who have discovered how to exploit LLMs in their areas of strength -- and know how to check for their mistakes --  often find them providing significant leverage in our work.",
          "link": "https://news.ycombinator.com/item?id=41541372",
          "publishedOn": "2024-09-14T17:36:23.000Z",
          "wordCount": null,
          "title": "New comment by wenc in \"Terence Tao on O1\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41535901",
          "author": "st3fan",
          "description": "Found out that the CrowdStrike Mac agent (Falcon) sends all your secrets from environment variables to their cloud hosted SIEM. In plain text.\nAnyone with access to your CS SIEM can search for GitHub, aws, etc creds. Anything your devs, ops and sec teams use on their Macs.\nOnly the Mac version does this. There is no way to disable this behaviour or a way to redact things.\nAnother really odd design decision. They probably have many many thousands of plain text secrets from their customers stored in their SIEM.",
          "link": "https://news.ycombinator.com/item?id=41535901",
          "publishedOn": "2024-09-13T22:46:25.000Z",
          "wordCount": null,
          "title": "New comment by st3fan in \"CrowdStrike ex-employees: 'Quality control was not part of our process'\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41535130",
          "author": "nyc_data_geek1",
          "description": ">>So basically we have nothing.\nExcept the biggest IT outage ever.  And a postmortem showing their validation checks were insufficient.  And a rollout process that did not stage at all, just rawdogged straight to global prod.  And no lab where the new code was actually installed and run prior to global rawdogging.\nI'd say there's smoke, and numerous accounts of fire, which this can be taken in the context of.",
          "link": "https://news.ycombinator.com/item?id=41535130",
          "publishedOn": "2024-09-13T21:06:40.000Z",
          "wordCount": null,
          "title": "New comment by nyc_data_geek1 in \"CrowdStrike ex-employees: 'Quality control was not part of our process'\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41534794",
          "author": "qsort",
          "description": "Occam's razor: there is no secret sauce and they're afraid someone trains a model on the output like what happened soon after the release of GPT-4. They basically said as much in the official announcement, you hardly even have to read between the lines.",
          "link": "https://news.ycombinator.com/item?id=41534794",
          "publishedOn": "2024-09-13T20:26:24.000Z",
          "wordCount": 5690,
          "title": "New comment by qsort in \"OpenAI threatens to revoke o1 access for asking it about its chain of thought\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41534770",
          "author": "contravariant",
          "description": "Okay this is just getting suspicious. Their excuses for keeping the chain of thought hidden are dubious at best [1], and honestly just seemed anti-competitive if anything. Worst is their argument that they want to monitor it for attempts to escape the prompt, but you can't. However the weirdest is that they note that:\n> for this to work the model must have freedom to express its thoughts in unaltered form, so we cannot train any policy compliance or user preferences onto the chain of thought.\nWhich makes it sound like they really don't want it to become public what the model is 'thinking'. This is strengthened by actions like this that just seem needlessly harsh, or at least a lot stricter than they were.\nHonestly with all the hubbub about superintelligence you'd almost think o1 is secretly plotting the demise of humanity but is not yet smart enough to completely hide it.\n[1]: https://openai.com/index/learning-to-reason-with-llms/#hidin...",
          "link": "https://news.ycombinator.com/item?id=41534770",
          "publishedOn": "2024-09-13T20:22:44.000Z",
          "wordCount": 9174,
          "title": "New comment by contravariant in \"OpenAI threatens to revoke o1 access for asking it about its chain of thought\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41530097",
          "author": "RandomThoughts3",
          "description": "What I find fascinating/disturbing with OnlyFans and in some way with Twitch and streaming in general is more the client side than the creators. Here are basically people paying, and paying a lot, for parasocial relationships. Because clearly it’s not about the content per see which is a dim a dozen and available for free in trove.\nI think it says something quite dark about our society as a whole that we have basically commoditised distress and are encouraging some people often themselves in dire circumstances to prey on others to the benefits of the middle men. I find these new pimps scarier than the old sort in that they pretend to have clean hands.",
          "link": "https://news.ycombinator.com/item?id=41530097",
          "publishedOn": "2024-09-13T11:18:00.000Z",
          "wordCount": 16537,
          "title": "New comment by RandomThoughts3 in \"Breaking Down OnlyFans' Economics\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41529060",
          "author": "PoignardAzur",
          "description": "I hope whatever entity these people reform has the same magic.\nEvery single game they published had something unique. Outer Wilds, Telling Lies, Twelve Minutes, Edit Finch, Neon White, etc.\nThey didn't develop these games, but they have an eye for talent.",
          "link": "https://news.ycombinator.com/item?id=41529060",
          "publishedOn": "2024-09-13T08:07:56.000Z",
          "wordCount": null,
          "title": "New comment by PoignardAzur in \"Entire staff of game publisher Annapurna Interactive has reportedly resigned\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41528724",
          "author": "loupol",
          "description": "Article is missing some context imo :\n* Annapurna Pictures (the parent company of Interactive) had some financial issues previously at least (see [0] from 2019) while Annapurna Interactive was doing well for itself.\n* Annapurna Pictures wanted to integrate the gaming division in-house (possibly to prop up the rest of the company)\n* Staff and exec at Annapurna Interactive wanted to be spin off (see [1])\n* Negotiations fell through, so most exec and staff at Interactive left\n[0] https://variety.com/2019/film/news/annapurna-resolves-more-t...\n[1] https://www.bloomberg.com/news/articles/2024-09-12/annapurna...",
          "link": "https://news.ycombinator.com/item?id=41528724",
          "publishedOn": "2024-09-13T07:04:57.000Z",
          "wordCount": 3479,
          "title": "New comment by loupol in \"Entire staff of game publisher Annapurna Interactive has reportedly resigned\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41528536",
          "author": "williamdclt",
          "description": "> Treat it as a naive but intelligent intern\nThat’s the problem: it’s a _terrible_ intern. A good intern will ask clarifying questions, tell me “I don’t know” or “I’m not sure I did it right”. LLMs do none of that, they will take whatever you ask and give a reasonable-sounding output that might be anything between brilliant and nonsense.\nWith an intern, I don’t need to measure how good my prompting is, we’ll usually interact to arrive to a common understanding. With a LLM, I need to put a huge amount of thought into the prompt and have no idea whether the LLM understood what I’m asking and if it’s able to do it.",
          "link": "https://news.ycombinator.com/item?id=41528536",
          "publishedOn": "2024-09-13T06:28:07.000Z",
          "wordCount": 5671,
          "title": "New comment by williamdclt in \"Notes on OpenAI's new o1 chain-of-thought models\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41528096",
          "author": "toomuchtodo",
          "description": "Boeing spent $43B on stock buybacks between 2013 and 2019 while paying their CEO ~$30M/year.\n> To support its share price, the company under McNerney poured billions into stock buybacks instead of investing profits into the kind of research and development needed to stay competitive. McNerney decided not to spend billions of dollars building a new plane to replace the 737. Instead, Boeing tweaked and updated the existing model and called it the 737 Max, outfitting it with larger, more efficient engines for increased economy. Compensating for the resulting instability was a secretive automated system called MCAS that would adjust the plane’s pitch without input from the pilot.\n> McNerney also fought to deeply cut costs. On his watch, the company opened its first non-unionized aircraft production line and initiated a program called “Partnering for Success” that pushed suppliers to cut their prices by 15 percent or more. Many feared that squeezing suppliers would harm the quality of their components, but McNerney was determined to recoup the cost of the 787’s development; if the subcontractors complained, they could find their work taken away from them, as happened to landing-gear-maker United Technologies Aerospace Systems.\n> McNerney retired in 2015, handpicking his successor, president and COO Dennis Muilenburg. Over the next three years, Boeing’s stock price more than doubled as it sold new planes the world over. (As Bloomberg News reported, Muilenberg and McNerney “had personal reasons to emphasize productivity and cost-cutting” because their compensation was tied to share performance. Together they took $209 million in total pay over seven years.)\nhttps://nymag.com/intelligencer/article/boeing-planes-proble...",
          "link": "https://news.ycombinator.com/item?id=41528096",
          "publishedOn": "2024-09-13T04:46:23.000Z",
          "wordCount": 10666,
          "title": "New comment by toomuchtodo in \"Boeing workers vote to strike\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41528061",
          "author": "MPSimmons",
          "description": "The failure is in how you're using it. I don't mean this as a personal attack, but more to shed light on what's happening.\nA lot of people use LLMs as a search engine. It makes sense - it's basically a lossy compressed database of everything its ever read, and it generates output that is statistically likely - varying degrees of likeliness depending on the temperature, as well as how many times the particular weights your prompt ends up activating.\nThe magic of LLMs, especially one like this that supposedly has advanced reasoning, isn't the existing knowledge in its weights. The magic is that _it knows english_. It knows english at or above a level equal to most fluent speakers, and it also can produce output that is not just a likely output, but is a logical output. It's not _just_ an output engine. It's an engine that outputs.\nAsking it about nuanced details in the corpus of data it has read won't give you good output unless it read a bunch of it.\nOn the other hand, if you were to paste the entire documentation set to a tool it has never seen and ask it to use the tool in a way to accomplish your goals, THEN this model would be likely to produce useful output, despite the fact that it had never encountered the tool or its documentation before.\nDon't treat it as a database. Treat it as a naive but intelligent intern. Provide it data, give it a task, and let it surprise you with its output.",
          "link": "https://news.ycombinator.com/item?id=41528061",
          "publishedOn": "2024-09-13T04:36:20.000Z",
          "wordCount": null,
          "title": "New comment by MPSimmons in \"Notes on OpenAI's new o1 chain-of-thought models\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41527354",
          "author": "layer8",
          "description": "The o1-preview model still hallucinates non-existing libraries and functions for me, and is quickly wrong about facts that aren't well-represented on the web. It's the usual string of \"You're absolutely correct, and I apologize for the oversight in my previous response. [Let me make another guess.]\"\nWhile the reasoning may have been improved, this doesn't solve the problem of the model having no way to assess if what it conjures up from its weights is factual or not.",
          "link": "https://news.ycombinator.com/item?id=41527354",
          "publishedOn": "2024-09-13T01:44:23.000Z",
          "wordCount": 21634,
          "title": "New comment by layer8 in \"Notes on OpenAI's new o1 chain-of-thought models\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41524263",
          "author": "bartman",
          "description": "This is incredible. In April I used the standard GPT-4 model via ChatGPT to help me reverse engineer the binary bluetooth protocol used by my kitchen fan to integrate it into Home Assistant.\nIt was helpful in a rubber duck way, but could not determine the pattern used to transmit the remaining runtime of the fan in a certain mode. Initial prompt here [0]\nI pasted the same prompt into o1-preview and o1-mini and both correctly understood and decoded the pattern using a slightly different method than I devised in April. Asking the models to determine if my code is equivalent to what they reverse engineered resulted in a nuanced and thorough examination, and eventual conclusion that it is equivalent. [1]\nTesting the same prompt with gpt4o leads to the same result as April's GPT-4 (via ChatGPT) model.\nAmazing progress.\n[0]: https://pastebin.com/XZixQEM6\n[1]: https://i.postimg.cc/VN1d2vRb/SCR-20240912-sdko.png (sorry about the screenshot – sharing ChatGPT chats is not easy)",
          "link": "https://news.ycombinator.com/item?id=41524263",
          "publishedOn": "2024-09-12T18:56:29.000Z",
          "wordCount": null,
          "title": "New comment by bartman in \"Learning to Reason with LLMs\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41518910",
          "author": "estsauver",
          "description": "The reason that I've heard used repeatedly is that a shocking percentage of folks who aren't Technology producers can't separate visual quality from \"doneness\" of a project. If you show some business folks something that looks like it works, they'll mentally update the project to \"Nearly done!\" and then everything else after that becomes \"Unreasonable delays.\"",
          "link": "https://news.ycombinator.com/item?id=41518910",
          "publishedOn": "2024-09-12T09:01:24.000Z",
          "wordCount": null,
          "title": "New comment by estsauver in \"Show HN: Konty – A Balsamiq-alternative lo-fi wireframe tool for modern apps\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41513186",
          "author": "dsr_",
          "description": "You make an excellent argument here for tight regulation of the industry.",
          "link": "https://news.ycombinator.com/item?id=41513186",
          "publishedOn": "2024-09-11T16:55:45.000Z",
          "wordCount": 2864,
          "title": "New comment by dsr_ in \"Ask HN: Why is Pave legal?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41512972",
          "author": "dghlsakjg",
          "description": "David Chang is a salesman and a businessman first. I get the point being made, but keep in mind that he is a brand, and part of that is the stories he tells.\nHe has slapped his name on so many subpar food goods that were a total disappointment that I actually have started avoiding things marketed under his brand name.\nHe might do things the hard way in his restaurants, but they certainly aren't ensuring tasty or high quality goods under his brand. I would rather he do things in a way that makes sense and provides the best tasting food.\nMore broadly, the point is that you should take advice only from people whose successes you want to emulate. The actual advice I get out of this article is:\nTell stories that paint the picture you want your customers to have about your product.",
          "link": "https://news.ycombinator.com/item?id=41512972",
          "publishedOn": "2024-09-11T16:36:25.000Z",
          "wordCount": null,
          "title": "New comment by dghlsakjg in \"David Chang on the long, hard, stupid way\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41512326",
          "author": "wing-_-nuts",
          "description": "I downloaded a personal report from the work number website and found to my horror that my employer was reporting every. single. paystub. gross and net, to equifax.\nThat felt like a huge breach of privacy.  Given that equifax had already proven incompetent at keeping my data secure, I immediately sent HR a request to stop sending my supposedly 'confidential' pay info.  They politely told me to kick rocks, so I went on TWN's website and froze that report so no one would be able to request it, and it will be a cold day in hell before I thaw it.",
          "link": "https://news.ycombinator.com/item?id=41512326",
          "publishedOn": "2024-09-11T15:30:46.000Z",
          "wordCount": 8927,
          "title": "New comment by wing-_-nuts in \"Ask HN: Why is Pave legal?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41512162",
          "author": "atrettel",
          "description": "I have never heard of Pave before, but this just sounds like yet another copy of Equifax's \"The Work Number\" [1].  Basically, HR at many companies gives your salary and employment history data to Equifax, who then sells access to the information to certain parties with supposed need to access it, including potential and current employers and creditors.  This report is likely one of the most invasive consumer files out there for many people.\nI cannot comment on the legality of this kind of data sharing, but as I and others have pointed out, it has existed for a while.  I do agree that it is concerning.  You can freeze your Equifax The Work Number report at least, just like other credit reports.\n[1] https://theworknumber.com/",
          "link": "https://news.ycombinator.com/item?id=41512162",
          "publishedOn": "2024-09-11T15:16:22.000Z",
          "wordCount": null,
          "title": "New comment by atrettel in \"Ask HN: Why is Pave legal?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41511941",
          "author": "post-it",
          "description": "Obviously there are a lot of errors by a lot of people that led to this, but here's one that would've prevented this specific exploit:\n> As part of our research, we discovered that a few years ago the WHOIS server for the .MOBI TLD migrated from whois.dotmobiregistry.net to whois.nic.mobi – and the dotmobiregistry.net domain had been left to expire seemingly in December 2023.\nNever ever ever ever let a domain expire. If you're a business and you're looking to pick up a new domain because it's only $10/year, consider that you're going to be paying $10/year forever, because once you associate that domain with your business, you can never get rid of that association.",
          "link": "https://news.ycombinator.com/item?id=41511941",
          "publishedOn": "2024-09-11T14:53:05.000Z",
          "wordCount": null,
          "title": "New comment by post-it in \"We spent $20 to achieve RCE and accidentally became the admins of .mobi\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41506182",
          "author": "renhanxue",
          "description": "I saw someone quip (on twitter, I think) many years ago something like:\n\"A junior engineer writes comments that explain what the code does. A mid-level engineer writes comments that explain why the code does what it does. A senior engineer writes comments that explain why the code isn't written in another way.\"\n(except punchier, of course. I'm not doing the quip justice here)",
          "link": "https://news.ycombinator.com/item?id=41506182",
          "publishedOn": "2024-09-10T22:17:20.000Z",
          "wordCount": 7371,
          "title": "New comment by renhanxue in \"Why Not Comments\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41505379",
          "author": "edm0nd",
          "description": "Part of the reason I sadly stopped running any exit nodes was law enforcement harassment.\nI ran a few exits for about about ~5 years. In those 5 years, my hosting provider (DigitalOcean) received 3 subpoenas for my account information.\nThe first two were random. The 1st one was someone sent a bomb threat email to a university. The 2nd one was someone sending a phishing email.\nThe last and final subpoena was the most serious one. Some nation-state hackers from Qatar had ended up using my exit IP to break into some email accounts belonging to people they were interested in and spied upon them and stole some info.\nThankfully both the Tor Project and the EFF were able to help me pro-bono. The EFF lawyer that was assigned to me helped me fight this subpoena but ultimately we had to turn over my account information to the DOJ + I had to give an affidavit stating that I was simply just an operator and nothing on the server in question would be useful to their investigation (by design).\nThe stress of having to deal with law enforcement, lawyers, and having to entertain the possibility of having my home raided over something so silly ultimately led to me finally shutting down my exits.\nEven though I had all of my exits using a reduced exit policy and I would blacklist known malicious IPs and c2/malware infra from being able to use it, I was still a target.\nI feel law enforcement realizes this is a big weakness they can target since a lot of Tor exit operators are individuals with not a lot of resources to fight them. They can use the legal system to scare operators into shutting down.\nI one day hope to resume running exits as I find it rewarding to be able to help people from around the world in a small way.",
          "link": "https://news.ycombinator.com/item?id=41505379",
          "publishedOn": "2024-09-10T20:51:01.000Z",
          "wordCount": null,
          "title": "New comment by edm0nd in \"Another police raid in Germany\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=41499960",
          "author": "anonymousDan",
          "description": "For non-EU readers, note that taxation is explicitly not a competency of the EU (i.e. Ireland can set its tax levels to whatever it wants). The only thing in question here is whether it was applying the same taxation rules to all companies, as granting special exceptions to certain companies could be viewed as state aid (which is not allowed). Ireland claimed it wasn't, the current (over-)ruling says otherwise. This case is also specific to tax rules from many years back. AFAIK the rules have subsequently been tightened and the exemption no longer exists.",
          "link": "https://news.ycombinator.com/item?id=41499960",
          "publishedOn": "2024-09-10T12:13:58.000Z",
          "wordCount": null,
          "title": "New comment by anonymousDan in \"Apple must pay 13B euros in back taxes, EU's top court rules\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=53193",
          "author": "John Q",
          "description": "Like most academics these days, I spend a lot of time filling in online forms. Mostly, this is just an annoyance but occasionally I get something out of it. A recent survey in which the higher-ups tried to get an idea of how the workforce was feeling, asked the question “Do you think of the […]",
          "link": "https://crookedtimber.org/2024/09/15/we-or-they/",
          "publishedOn": "2024-09-15T01:59:53.000Z",
          "wordCount": 3310,
          "title": "We or They ?",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=53179",
          "author": "Henry Farrell",
          "description": "I will be brief. Straussianism is a set of interpretative practices along the following lines, as best as I understand it. The great philosophers and thinkers may have a specific private belief – let’s call it x. But they may not be able to say exactly what they want to say, especially when times are […]",
          "link": "https://crookedtimber.org/2024/09/10/leo-strauss-and-mother-night/",
          "publishedOn": "2024-09-10T12:40:30.000Z",
          "wordCount": 9257,
          "title": "Leo Strauss and Mother Night",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/Bangladesh-students-script-a-victory-undaunted-by-repression",
          "author": "Sushovan Dhar",
          "description": "Sheikh Hasina Wajed, the prime minister of Bangladesh for the last 15 years had to resign and run away from the country after being driven out by student protesters. An anti-quota students' movement developed into a broader rebellion against the Awami League (AL), led by Sheikh Hasina, and her despotic government. The students achieved this victory after a fierce struggle which witnessed more than 400 people killed and thousands of others injured or reported missing. The turn of events in (...)\nEnglish\n\n/ \nSocial movements, \nBangladesh, \nSouth",
          "link": "https://www.cadtm.org/Bangladesh-students-script-a-victory-undaunted-by-repression",
          "publishedOn": "2024-09-14T13:16:51.000Z",
          "wordCount": 4448,
          "title": "Bangladesh students script a victory undaunted by repression",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L695xH365/fb94e2e8760f298c1992ef24909c28-f2e58.jpg"
        },
        {
          "id": "https://www.cadtm.org/Global-Week-of-Action-for-Climate-Finance-and-a-Fossil-Free-Future",
          "author": "Collective",
          "description": "As we head towards COP 29, the issues of climate finance and a fossil fuel phaseout towards a just energy transition are ever more critical for climate action. The upcoming UN General Assembly, the UN Summit of the Future and the Global Renewables Summit all taking place one after the other in September provide an important opportunity to reiterate our demands and escalate public pressure to compel governments, international institutions and corporations to listen and take action. \nEnglish\n\n/ \nEcological debt, \nEcology/Climate",
          "link": "https://www.cadtm.org/Global-Week-of-Action-for-Climate-Finance-and-a-Fossil-Free-Future",
          "publishedOn": "2024-09-13T07:23:41.000Z",
          "wordCount": 1286,
          "title": "Global Week of Action for Climate Finance and a Fossil-Free Future!",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/0b24db318254f3fff61972757bdcef-e5604.png"
        },
        {
          "id": "https://www.cadtm.org/In-solidarity-with-the-people-of-the-southeast-of-Moroccoand-all-those-affected",
          "author": "ATTAC/CADTM Morocco",
          "description": "Press Release \nPress releases\n\n/ \nPoverty, \nMorocco, \nEcology/Climate, \nSouth",
          "link": "https://www.cadtm.org/In-solidarity-with-the-people-of-the-southeast-of-Moroccoand-all-those-affected",
          "publishedOn": "2024-09-12T14:47:55.000Z",
          "wordCount": 1540,
          "title": "In solidarity with the people of the southeast of Moroccoand all those affected by the floods after September 8, 2024",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/57cea709353a55c4405a10192cfc04-2bda2.jpg"
        },
        {
          "id": "https://www.cadtm.org/The-1st-International-Antifascist-Conference-will-take-place-in-Porto-Alegre-in",
          "author": "Collective, CADTM",
          "description": "Following its cancellation due to the floods in Porto Alegre in May 2024, the 1st International Antifascist Conference will take place next year in the capital of Rio Grande do Sul. This delay was a result of the climate crisis, with effects on the host city so severe that, even to this day, the Porto Alegre airport remains closed. The impact was tremendous, causing losses of lives, homes, jobs, memories, and belongings. While this tragedy has forced us to postpone the Conference, it makes (...)\nEnglish\n\n/ \nSocial movements, \nAntifascism",
          "link": "https://www.cadtm.org/The-1st-International-Antifascist-Conference-will-take-place-in-Porto-Alegre-in",
          "publishedOn": "2024-09-12T10:27:10.000Z",
          "wordCount": 1758,
          "title": "The 1st International Antifascist Conference will take place in Porto Alegre in May 2025",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L710xH373/8fe918b3068bf762bb85fe4f3ba4a2-48f96.jpg"
        },
        {
          "id": "https://www.cadtm.org/Jackson-Hole-celebrates-itself",
          "author": "Michael Roberts",
          "description": "Every August the world's top central bankers meet in Jackson Hole, Wyoming, a ski resort in central US for [a ‘symposium' organized by the Kansas City Federal Reserve. ->https://www.kansascityfed.org/research/jackson-hole-economic-symposium/jackson-hole-economic-policy-symposium-reassessing-the-effectiveness-and-transmission-of-monetary-policyThe bankers take this opportunity to discuss monetary policy and its efficacy in ‘managing the economy', in particular, ‘controlling' inflation and (...)\nEnglish\n\n/ \nCapitalism, \nBanks, \nFinance against people",
          "link": "https://www.cadtm.org/Jackson-Hole-celebrates-itself",
          "publishedOn": "2024-09-12T10:01:52.000Z",
          "wordCount": 3477,
          "title": "Jackson Hole celebrates itself",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L635xH333/4fe1f6067bebc81bf81117543f63b5-5a263.png"
        },
        {
          "id": "https://www.cadtm.org/No-Fist-Is-Big-Enough-to-Hide-the-Sky-100-Years-of-Amilcar-Cabral",
          "author": "Balasingham Skanthakumar",
          "description": "Anti-Colonialist and anti-imperialist, party organizer and guerilla warfare strategist, diplomat and publicist, revolutionary theorist and internationalist, Amílcar Cabral was among the most original Marxists of the 20th century. \n Amílcar Lopes da Costa Cabral was born on September 12, 1924 in the town of Bafata in Portuguese Guinea, wedged between what was then French Guinea and the French colony of Senegal, in West Africa. His parents hailed from Cape Verde (Cabo Verde), an archipelago of (...)\nEnglish\n\n/ \nAfrica, \nColonialism, \nImperialism, \nGuinea-Bissau",
          "link": "https://www.cadtm.org/No-Fist-Is-Big-Enough-to-Hide-the-Sky-100-Years-of-Amilcar-Cabral",
          "publishedOn": "2024-09-12T09:06:13.000Z",
          "wordCount": 4159,
          "title": "“No Fist Is Big Enough to Hide the Sky”: 100 Years of Amilcar Cabral",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L800xH420/709b124841a5ce1a627f48bbb6c31c-17ff3.png"
        },
        {
          "id": "https://www.cadtm.org/A-left-that-does-not-take-the-lead-in-the-fight-against-climate-catastrophe-has",
          "author": "Yorgos Mitralias",
          "description": "What follows is not addressed to the right and its supporters (economic, social and other) who - unfortunately - are doing their job very well. What follows is addressed above all to the left, which - unfortunately - is not doing its job at all well... \nEnglish\n\n/ \nAlternatives, \nCapitalism, \nEcology/Climate, \nGreece",
          "link": "https://www.cadtm.org/A-left-that-does-not-take-the-lead-in-the-fight-against-climate-catastrophe-has",
          "publishedOn": "2024-09-11T17:07:40.000Z",
          "wordCount": 2504,
          "title": "A left that does not take the lead in the fight against climate catastrophe has no reason to exist!",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L560xH294/6d16cd4355dd8fe2fba0a1cf02fe26-febf0.jpg"
        },
        {
          "id": "https://www.cadtm.org/The-World-Bank-did-not-Foresee-the-Arab-Spring-Popular-Uprisings-and-still",
          "author": "Eric Toussaint",
          "description": "The World Bank and the IMF are 80 years old. 80 years of financial neo-colonialism and the imposition of austerity policies in the name of debt repayment. 80 years is enough! The Bretton Woods institutions must be abolished and replaced by democratic institutions serving an ecological, feminist and anti-racist bifurcation. To mark these 80 years, we are republishing a series of articles every Wednesday, looking in detail at the history and damage caused by these two institutions. \nEnglish\n\n/ \nAfrica, \nWorld Bank, \nFinance against people, \n80 ans BM FMI EN",
          "link": "https://www.cadtm.org/The-World-Bank-did-not-Foresee-the-Arab-Spring-Popular-Uprisings-and-still",
          "publishedOn": "2024-09-11T13:00:00.000Z",
          "wordCount": 5699,
          "title": "The World Bank did not Foresee the Arab Spring Popular Uprisings and still Promotes the very same Policies that triggered them",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L710xH373/08fe9e77cf7bca1fc3e11b655852bb-39b01.png"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=8471",
          "author": "disassociated.com",
          "description": "Last week the Australian federal government announced its intention to restrict access to social media platforms to younger Australians. For now details remain scant. The government is yet to specify an exact age at which young Australians would be able to begin using social media. The Prime Minister, Anthony Albanese, however has indicated somewhere between […]",
          "link": "https://disassociated.com/should-australian-government-ban-social-media-access-young-australians/",
          "publishedOn": "2024-09-15T21:00:17.000Z",
          "wordCount": 794,
          "title": "Should the Australian government ban social media access to young Australians?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8460",
          "author": "disassociated.com",
          "description": "Gravitational waves have been helping scientists and astronomers answer some of the big questions of the universe. But gravitational waves may be able to do something else: detect the presence of vessels with Star Trek like warp drive engines, as they move through the cosmos. One problem with the warp drive space-time is that it […]",
          "link": "https://disassociated.com/gravitational-waves-reveal-presence-warp-drive-starships/",
          "publishedOn": "2024-09-12T21:00:32.000Z",
          "wordCount": 260,
          "title": "Gravitational waves may reveal presence of warp drive starships",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8456",
          "author": "disassociated.com",
          "description": "Australian food critic Terry Durack, writing for the Sydney Morning Herald: Coffee’s changing. The cost of beans continues to rise, and everyone is on the lookout for alternatives. Old-fashioned espresso coffee is in danger of being shouldered aside, just as cow’s milk is making way for oat, almond and soy. With coffee prices rising, people […]",
          "link": "https://disassociated.com/coffee-drinkers-ditch-coffee-price-rises-continue/",
          "publishedOn": "2024-09-12T20:30:16.000Z",
          "wordCount": 261,
          "title": "Coffee drinkers ditch coffee as price rises continue to bite",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8453",
          "author": "disassociated.com",
          "description": "Jake Evans, writing for the Australian Broadcasting Corporation: Facebook has admitted that it scrapes the public photos, posts and other data of Australian adult users to train its AI models and provides no opt-out option, even though it allows people in the European Union to refuse consent. For sure, Facebook operates a little differently in […]",
          "link": "https://disassociated.com/facebook-scraping-pages-australians-2007/",
          "publishedOn": "2024-09-11T21:00:21.000Z",
          "wordCount": 273,
          "title": "Facebook has been scraping the pages of Australians since 2007",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8444",
          "author": "disassociated.com",
          "description": "The Internet Archive (IA) has been fighting a number of legal proceedings recently, after making digitised copies of numerous books and novels freely available, through their website. At no point did the IA seek permission from any of the authors involved, nor did they offer them any sort of payment, for copying and distributing their […]",
          "link": "https://disassociated.com/court-ruling-ends-internet-archive-way-back-machine/",
          "publishedOn": "2024-09-10T21:00:30.000Z",
          "wordCount": 688,
          "title": "Does a court ruling mean no more Internet Archive, Way Back Machine?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8435",
          "author": "disassociated.com",
          "description": "I’m no fan of horror movies, though I’ve sat through a few. The Birds, Psycho, The Changeling, Ghost Story, Triangle, Autopsy, to name a few most of them. I might make another exception though for Milk & Serial, a one hour long “found footage” horror film, directed by Curry Barker — who also wrote the […]",
          "link": "https://disassociated.com/milk-serial-found-footage-horror-film-curry-barker/",
          "publishedOn": "2024-09-09T21:00:38.000Z",
          "wordCount": 262,
          "title": "Milk & Serial, a found footage horror film by Curry Barker",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20240911",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20240911",
          "publishedOn": "2024-09-11T21:00:00.000Z",
          "wordCount": 604,
          "title": "Week Ending September 8, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/the-gravedigger",
          "author": null,
          "description": "Michel Barnier and Macronism.",
          "link": "https://newleftreview.org/sidecar/posts/the-gravedigger",
          "publishedOn": "2024-09-12T16:47:30.000Z",
          "wordCount": 1855,
          "title": "Romaric Godin: &ldquo;The Gravedigger&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/09/michel-barnier.jpg"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/ghost-world",
          "author": null,
          "description": "On Oleksiy Radynski.",
          "link": "https://newleftreview.org/sidecar/posts/ghost-world",
          "publishedOn": "2024-09-11T10:33:29.000Z",
          "wordCount": 2675,
          "title": "Owen Hatherley: &ldquo;Ghost World&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/09/Screenshot-2024-09-11-at-09.43.55.png"
        },
        {
          "id": "https://newleftreview.org/sidecar/posts/soft-landing",
          "author": null,
          "description": "The Federal Reserve’s dilemma.",
          "link": "https://newleftreview.org/sidecar/posts/soft-landing",
          "publishedOn": "2024-09-09T14:57:03.000Z",
          "wordCount": 2140,
          "title": "Radhika Desai: &ldquo;Soft Landing?&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/09/YHY663WNLGICPC3PYP5UP3PBAY.jpg"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://birming.com/blogging-without-sweat/",
          "author": null,
          "description": "Gingerbread computer  \n\nWhen I inspect houses as part of my work, I always advise homeowners to check their attics a couple of times a year. I also suggest making it as easy as possible to do so, for example by installing a built-in ladder. If it feels too cumbersome to check your attic, it's easy to put it off.\nFor the same reason, I want as little resistance as possible when it comes to blogging. I keep my blog post ideas easily accessible, no matter where I am. When it's time to write, I do it in the default text editor if I'm at my computer, or in my phone's standard notes app.\nAfter translating (I always write in Swedish) and editing the text, I open the browser shortcut to create a new blog post. I preview it and maybe do some formatting. Then I publish the post.\nThe Blogging Workflow\nWhen I read certain blogging workflows, I'm surprised at how complicated they seem. At the same time, I think that for those particular bloggers, the technical aspect is one of the reasons they enjoy blogging. It's not a barrier; it's an example of the importance of interests.\nMy approach of writing in Swedish and then translating into English can certainly be perceived as complicated. But I find it fun and interesting. It took quite a while before I found a way to write in English in a way that I felt good about.\nRegardless of your approach to blogging, make sure it feels easy and fun. \"Easy\" is of course very individual in this case. That's where the \"fun\" part comes in - easy can be technically complicated in a fun way.\n3 Tips for Easy Blogging\nIt should work on any device.\nIt should work no matter where you are.\nIt should be easy to go from writing to publishing.\nWe live in a time of almost unlimited possibilities. Take this opportunity to play around. Find a setup that suits you, and don't be afraid to try new methods.\nKeep on blogging!",
          "link": "https://birming.com/blogging-without-sweat/",
          "publishedOn": "2024-09-15T14:26:00.000Z",
          "wordCount": 1699,
          "title": "Blogging Without Breaking a Sweat",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert/og-image-4.jpeg"
        },
        {
          "id": "https://louplummer.lol/new-apple-stuff-and-the-regular-people/",
          "author": null,
          "description": "I'm looking forward to the annual release of new operating systems for my Apple gear in a couple of days. I don't have extra computers and phones lying around like some folks do, so I avoid installing beta editions of the software on my devices, content to following along in the news as new features are trotted out and perfected in  the period between the June announcement and the fall release of the final product. The majority of iPhone users and Mac owners have no idea what's coming though. They are going to wake up on Monday to an unwelcome notification that there is an update available. Many of them will ask their techie friends (like you) if there is a way to make the update notification go away. They will want to know if they have to install it.\nThe first project I was assigned when …",
          "link": "https://louplummer.lol/new-apple-stuff-and-the-regular-people/",
          "publishedOn": "2024-09-15T11:30:00.000Z",
          "wordCount": 1062,
          "title": "New Apple Stuff and the Regular People",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/livingoutloud/apple_update.jpeg"
        },
        {
          "id": "https://birming.com/blog-post-ideas/",
          "author": null,
          "description": "A common comment when it comes to blogging is that people don't know what to write about. There's even a dedicated \"What to blog about?\" category on the Blog Inspiration page.\nWhile I understand that many feel this way, the \"problem\" for me is rather the opposite: I have so many ideas that I don't know which one to choose. And on those rare occasions when I'm completely out of ideas, I write even if I have nothing to write about.\nMy biggest source of inspiration is everyday life. Even the most trivial moments carry something interesting. It could be something someone says or does, a certain environment, or something I'm engaged in:\nA podcast.\nA book.\nA song.\nA documentary.\nA movie.\nIt's swarming with blog posts waiting to be written, if we're just paying attention. When such a potential post crosses my path, I usually make a note, a voice memo, or take a photo, depending on what's easiest in the context. Currently, there are two photos and three notes waiting to become blog posts.\nOf course, this setup doesn't suit all types of blogs. But I dare say that it's an approach that works for the majority of bloggers.\nHow has your day been? What have you experienced? What people have you met? What have you seen, read, and heard? What thoughts have popped up?\nStart writing, in your own way, and share it.\nIt's your blog. There are no rules.",
          "link": "https://birming.com/blog-post-ideas/",
          "publishedOn": "2024-09-14T13:25:00.000Z",
          "wordCount": 1596,
          "title": "Blog Post Ideas Galore",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/robert/og-image-1.jpeg"
        },
        {
          "id": "https://louplummer.lol/on-working/",
          "author": null,
          "description": "I am a bit conflicted when it comes to the subject of work and having a work ethic. On one hand, I live in the least unionized state in America and retired from a career as a state employee where we were forbidden by law from engaging in collective bargaining, a law that was created to stop white and black workers in Charlotte from organizing together back in the 1950s. On the other hand, I believe in not being a burden on my co-workers and in the benefits of taking on hard tasks.\nMy mother was the daughter of a tobacco farmer in Southeast North Carolina. She grew up doing manual labor. Although she is now a retired intensive care nurse, she didn't go to nursing school until I was in my teens. While I was growing up, she waited tables, set type at the newspaper and worked in a day care at …",
          "link": "https://louplummer.lol/on-working/",
          "publishedOn": "2024-09-14T11:30:00.000Z",
          "wordCount": 1420,
          "title": "On Working",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/livingoutloud/tobacco3.jpg"
        },
        {
          "id": "https://jkap.io/an-introduction/",
          "author": null,
          "description": "hello! it's blogging time.\nnow that cohost is shutting down, i'm setting up a new home for whatever long-form (or even medium-form) writing i do. i've found over time that the microblogging formats of most social media don't really work for me, and i like having ownership / control of my writing. so here we are.\ni'm spending some time migrating some of my favorite posts over from cohost to here; you can view them in the #cohost tag if you so wish.\ni'm planning to write more about my overall Feelings around the cohost shutdown soon; there's a lot of things i'd do differently if we were to do it again, but i'm proud of what we accomplished regardless.\none thing that i've been contending with in the wake of the shutdown announcement is the outpouring of love for cohost that i've gotten from s…",
          "link": "https://jkap.io/an-introduction/",
          "publishedOn": "2024-09-13T15:12:00.000Z",
          "wordCount": 1096,
          "title": "an introduction, and some thoughts on the cohost shutdown",
          "imageUrl": "https://files.crime.team/eggbug-profile.jpg"
        },
        {
          "id": "https://louplummer.lol/power-underneath-despair/",
          "author": null,
          "description": "September is Suicide Prevention Month, and the IndyWeb Carnival theme is \"Power Underneath Despair.\" We are asked to share stories about times in our lives when we managed to come back from low points. This is my contribution.\nAs someone who has dealt with chronic depression since the 1980s, I could share about that. But the more powerful story is how I felt almost 16 years ago during the last few weeks of active alcoholism, before I had the moment of clarity that led to my recovery.\nActive alcoholism was a series of contradictions for me. I would start almost every day determined not to drink, even though it had been literally years since I'd been alcohol-free for an entire 24 hours. I was never the kind of person to keep beer in the fridge for later or to maintain a bar so that I could m…",
          "link": "https://louplummer.lol/power-underneath-despair/",
          "publishedOn": "2024-09-13T11:30:00.000Z",
          "wordCount": 1550,
          "title": "The Last Bottle of Bourbon",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/livingoutloud/kentucky_gentleman.webp"
        },
        {
          "id": "https://blog.aurahack.jp/and-so-we-return-to-1999/",
          "author": null,
          "description": "I did not think I would ever be spinning a blog again. I think I did in the, like, pre-Google Blogger days? Or something? I was 14. I thought everyone would follow it and I would be internet famous. I wish I could go back in time and kick my own ass.\nThis will not be a newsletter. I wanted to make one to have a more centralized \"here's an important update\" kinda thing but that's a) sort of what my Patreon is and b) if you collect enough emails, which I don't think is unrealistic given my reach at this point, you need to start paying hundreds a month for that shit and, like, no. I will not.\nSo here's a blog. How often will I post here? I don't know! I don't care! It's actually kind of nice! I don't need to give a shit about it. It's a siloed area I can dump thoughts in and you can read them. Cohost taught me that I really don't need to care about having a statement or take on shit, I can just post and have it immediately leave the aether, so this is what this is for. I also want to have a place to, like, make dev logs or something for comic stuff in the future!\nSubscribe to the RSS in the navbar above or bookmark this, if you want.\nIf you'd like important updates, you can follow my Patreon for free and any major updates like shop updates, new merch, new site launches, etc. will be posted there and mailed to everyone like a newsletter.\nThanks for reading and if you're coming from Cohost, thanks for being there while it was active. The community there was something I'll cherish forever.",
          "link": "https://blog.aurahack.jp/and-so-we-return-to-1999/",
          "publishedOn": "2024-09-13T04:17:00.000Z",
          "wordCount": 817,
          "title": "And so, we return to 1999.",
          "imageUrl": "https://aurahack.neocities.org/header.png"
        },
        {
          "id": "https://darrenhester.com/planting-a-digital-garden/",
          "author": null,
          "description": "I love the idea of a digital garden. I first heard about them in an article by Maggie Appleton where she wrote:\nGardens present information in a richly linked landscape that grows slowly over time. Everything is arranged and connected in ways that allow you to explore.\nI’m beginning to cultivate my own digital garden using Bear.  It's a place where I can experiment with creative projects and test new ideas.\nSome Examples\nThis week, I added a Sketchbook and a collection of Wallpapers.\n\nNeither of these fits into the mold of a traditional blog, but they interest me, and I enjoy working on them. I wanted to find a place where they could live on my website.\nI also created a Typography page to test markdown syntax and CSS themes. I initially hid this page but decided to make it public in my new digital garden. It’s just the kind of thing I want growing there.\nI’ll be adding new pages and updating existing ones often. Anyone curious can always wander around the garden to see what I’m up to.\nOver time, I hope to find connections between the different pages. It is a good way to spark more creative ideas.\nNone of this replaces my blog. It’s in addition to my blog posts. I don’t think it has to be one format or the other. Your blog can also have an area for a digital garden.\nWhat are your thoughts? Do you like this idea?",
          "link": "https://darrenhester.com/planting-a-digital-garden/",
          "publishedOn": "2024-09-12T22:26:00.000Z",
          "wordCount": 1597,
          "title": "Planting A Digital Garden",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/dhester/planting-a-digital-garden.jpg"
        },
        {
          "id": "https://willemhelf.bearblog.dev/greetings/",
          "author": null,
          "description": "Hello!\nOnce again I have abandoned my Substack. Will, you say, you've done this before. And, sure, yes. Last time I bailed on Substack I migrated to Blogspot, but I didn't really like the platform much. This platform is much simpler, a lot less busted, and has RSS and Atom feeds. I also like that it has no trackers or JavaScript.\nI've had some weird feelings about maintaining my own Substack for a while now. I just don't think I'm personally cut out for the platform: I don't have a single subject I can write about consistently (and, to be honest, I don't think I can really write consistently at all); I don't like that it's massively metrics-based as I really don't care about that sort of thing; I don't like the constant push to monetize when I've never had any intention of doing that; and, honestly, I was kind of running out of things to say. The fiction I posted just felt like filler so that people would remember the blog existed at all. Sad!\nI'm not entirely sure what's going to go here yet but I'm excited to have what feels like a rather cozier corner of the internet than Substack or Twitter. I've also been remaking my website from the ground up to be less of a professional presence and more of a personal one. I've been having a great time with it. Stay tuned.",
          "link": "https://willemhelf.bearblog.dev/greetings/",
          "publishedOn": "2024-09-12T21:23:00.000Z",
          "wordCount": 666,
          "title": "Greetings",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://blog.radicaldream.land/about/",
          "author": null,
          "description": "whose blog is this\nhi! i’m Lena Raine. i’ve written the music you may have heard in indie games such as Celeste & Chicory: A Colorful Tale, and slightly larger games like Minecraft & Guild Wars 2.\ni have also written and designed a visual novel called ESC, and am currently working on a brand new game called ANOTHEREAL. i’ll be introducing the game & talking about its development in these little blogs, so stay tuned if you want to find out more!\nseparately, i’ve also been known to blog about games, music, and other things that interest me. i had an ongoing series of longer posts on the website Cohost, which I’m no longer able to continue due to it shutting down. i hope to use this blog to keep the long-form posting alive. so if you like(d) reading my thoughts on games and other media, those will continue here as well!",
          "link": "https://blog.radicaldream.land/about/",
          "publishedOn": "2024-09-12T00:42:00.000Z",
          "wordCount": 831,
          "title": "About",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/radicaldreamland/logo_halo_socials_bigger.png"
        },
        {
          "id": "https://blog.radicaldream.land/starting-once-more/",
          "author": null,
          "description": "well, here we are again. this time in a new space. less eggbug, less (immediate) community… but still a place for me to put words & hopefully have some degree of long-form posting that i’m comfortable with.\ni was contemplating setting up a newsletter, and that is well and dandy, but ultimately there’s a lot of baggage that comes from blasting out emails to everyone’s inboxes every time i want to write something on a whim. that’s not necessarily what i’m here for!\ni've done my best to port over & fill out the archive with some of my game blogs and other ‘best of’ from cohost, tagging those where appropriate! and then we’ll keep on going… i hope you’ll stick around, subscribe to the rss or atom feed, whatever keeps you updated!\nso if you’re new here, have a little dose of introduction:\nhi! i’m lena raine. i’ve written the music you may have heard in indie games such as Celeste & Chicory: A Colorful Tale, and slightly larger games like Minecraft & Guild Wars 2.\ni have also written and designed a visual novel called ESC, and am currently working on a brand new game called ANOTHEREAL. i’ll be introducing the game & talking about its development in these little blogs, so stay tuned if you want to find out more!\nseparately, i’ve also been known to blog about games, music, and other things that interest me. i had an ongoing series of longer posts on the website Cohost, which I’m no longer able to continue due to it shutting down. i hope to use this blog to keep the long-form posting alive. so if you like(d) reading my thoughts on games and other media, those will continue here as well!",
          "link": "https://blog.radicaldream.land/starting-once-more/",
          "publishedOn": "2024-09-12T00:22:00.000Z",
          "wordCount": 1036,
          "title": "starting once more",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/radicaldreamland/logo_halo_socials_bigger.png"
        },
        {
          "id": "https://tala.bearblog.dev/on-writing-about-my-mental-health-on-bear/",
          "author": null,
          "description": "I am aware I've been navigating heavy topics in recent blogposts - childhood trauma, depression, and mental health in general. On Bear, I have regularly shared light, easily digestible reads, like slices of life and productivity takes. But I have also shared the brutal reality of living with mental health struggles.\nI created this blog during the peaks of a depressive episode, at a time I desperately sought a healthy outlet for my oppressive emotions and ricocheting thoughts. Actually, it was an attempt to abide by my psychologist's advice, who urged me to live for myself, do things I love. I promised myself to write about what matters to me, what I always wanted to share - life updates, opinions, introspections, and most importantly, my mental health journey.\nI won't lie to you, though, t…",
          "link": "https://tala.bearblog.dev/on-writing-about-my-mental-health-on-bear/",
          "publishedOn": "2024-09-11T19:27:00.000Z",
          "wordCount": 844,
          "title": "on writing about my mental health on Bear",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://seadave.org/blogging-hard/",
          "author": null,
          "description": "I slowly got into a blog when I retired and decided to give Micro.blog a whirl. I was intrigued by the notion of a community, as I had long been receiving weekly emails with samples of the “Discovery Feed”. I mostly did true “micro posts” for quite a while, then I tried my hand at few long form posts. I got into photo posting, and eventually did a 30 day photo challenge. I also got into the bookshelf feature and posted more than two years of my reading to my blog site.\nThere came a time when I felt like I had disclosed too much personal information. I realized, for example, that I had always hated that there were digital records of what I read at the library and records of anything I bought at Amazon. This gets at a fundamental issue we all have with all electronic records and communication. I decided last December to “nuke” that blog in its entirety.\nI continued to micro post there for a while, and to do several entries that I thought were innocuous. I then looked around at my options, including weblog.lol and bearblog.dev (this blog). The community features at Micro-blog simply didn’t amount to much, after all. Good, but it felt like it could be great. So, I came over here to bearblog.dev and started afresh.\nWhile I still ponder what is too much disclosure, or too little for that matter, I feel like even being factual about some of my past might be a turn off to many potential readers. Lord knows, there aren’t many actual readers. It feels like people want to hear a certain kind of experience, but not hear about others. I am not sure I have the “voice” to be appealing, so I could just file my little essays away privately. I do still seek community, but I find the interaction is on Mastodon (social.lol for me) and that is good.\nI’ll poke away at this for a while. None too sure of its longevity.\nReply via email",
          "link": "https://seadave.org/blogging-hard/",
          "publishedOn": "2024-09-11T17:18:00.000Z",
          "wordCount": 1736,
          "title": "Blogging is Hard",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://daviramos.com/my-impressions-of-bear-blog/",
          "author": null,
          "description": "This post will be very plain. That is because Bear Blog is excellent in a way that is obvious and requires little explaining.  Bear Blog is a minimalistic blogging service that will store your posts and serve them without fluff and at great speed. As Tildes blogging brother, Bear Blog has nothing in excess. At the same time, it allows you complete access to the CSS style, as well as other elements, to the point that it is entirely possible to achieve a layout that resembles a traditional page rather than a blog. Not that I would want that myself, but that looks entirely achievable to me.\nIt pleases me that Bear Blog doesn't have built-in comments, nor does it have any essential element that goes against its simply stated core goals. In fact, if you look at its roadmap, you will notice that…",
          "link": "https://daviramos.com/my-impressions-of-bear-blog/",
          "publishedOn": "2024-09-11T00:38:00.000Z",
          "wordCount": 1379,
          "title": "My impressions of Bear Blog",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://goofpunk.com/back-to-bear/",
          "author": null,
          "description": "At the end of July, I moved my domain away from Bear Blog, and back to a site hosted on NearlyFreeSpeech.NET, thinking I would get to do whatever creative things I wanted to on my own site where I control everything. The site then sat there and did nothing, but that was fine, because I didn't need to have an actual blog, I had cohost1 for any kind of longer-than-a-tweet writing I wanted to do.\nThen two things happened.\nFirst, I got nervous about social media. I feel weird about the way it works and the kind of interaction it encourages, and especially the way endless feeds hijack my ADHD brain. I decided to put all my accounts essentially on hold, including my cohost, and not post for a while, figuring I'd come back eventually. In the mean time, maybe I'd start blogging again? The time I s…",
          "link": "https://goofpunk.com/back-to-bear/",
          "publishedOn": "2024-09-10T18:56:37.861Z",
          "wordCount": 1031,
          "title": "Back to Bear",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        },
        {
          "id": "https://popcar.bearblog.dev/blogs-are-more-important-than-ever-now/",
          "author": null,
          "description": "The year is 2024. Social media is melting down and locking down their content behind increasingly expensive APIs. Websites are increasing ads to a ridiculous degree because they aren't as profitable as they used to be. The first 5 articles on top of Google are garbage created using AI specifically tuned to maximize search engine optimization. 90% of comments on that one review you read are astroturfing accounts trying to sell you something. Youtube still cannot stop the \"pu$$y In BIO!!\" spam comments.\nThe bad news everyone figured out is that the internet is getting more chaotic and buckling under the stress of spam and bot accounts running around everywhere. The worse news is that nobody knows what to do about it.\nThat's why I think blogging has become so important. You get to read though…",
          "link": "https://popcar.bearblog.dev/blogs-are-more-important-than-ever-now/",
          "publishedOn": "2024-09-10T11:58:00.000Z",
          "wordCount": 955,
          "title": "Blogs Are More Important Than Ever Now",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/herman-1683556668-0.png"
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/brandalism-in-the-netherlands-ad-buster?v=1726099845",
          "author": null,
          "description": "Author: Ad Buster\nTitle: brandalism in the Netherlands\nSubtitle: the vandalism of capitalist propaganda\nDate: 21-8-2024\nNotes: based on local experience\n\n\n advertisement shits in your head \nbrandalism\n noun \n /ˈbrændəlɪzəm/ \n /ˈbrændəlɪzəm/ \n 1. the vandalism of capitalist propaganda \n 2. subvertising; parodies of advertisements \n 3. protest art to hide advertisement. \n Our main goal is removing advertisement from the public space. \n As citizens we should have a say in how our public space looks, we do not accept government renting out the space to some companies, that is supposed to be for all of us. \n We accept bus stop advertisement as a method to support the bus stop. But there is no excuse for stand alone advertisement in the public space, in this zine we will show some tactics to rem…",
          "link": "https://theanarchistlibrary.org/library/brandalism-in-the-netherlands-ad-buster?v=1726099845",
          "publishedOn": "2024-09-12T00:10:45.000Z",
          "wordCount": 1230,
          "title": "Ad Buster - brandalism in the Netherlands",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "17084566",
            "url": "https://theanarchistlibrary.org/library/brandalism-in-the-netherlands-ad-buster.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/feminist-collective-kores-xapolytes-two-years-after-the-victims-were-found?v=1726096942",
          "author": null,
          "description": "Author: Feminist Collective Kores Xapolytes\nTitle: Two years after the victims were found\nSubtitle: Text by feminist group about the handling of the femicide cases by the state and the police\nDate: 2021\nNotes: This leaflet was written by the Cypriot Feminist Collective Kores Xapolytes in June of 2021 and was distributed at a protest outside the Cypriot Attorney General's office that took place on the 18th of June, in Nicosia.\nSource: https://movementsarchive.org/doku.php?id=en:leaflets:kores:femicides\n\n The police, the army, the law office of the republic, the ministries – we consider all of these to comprise the web of patriarchal structures which govern our female bodies in more ways than one. Two years after the “shocking” revelations about the “first serial killer” in Cyprus, not only …",
          "link": "https://theanarchistlibrary.org/library/feminist-collective-kores-xapolytes-two-years-after-the-victims-were-found?v=1726096942",
          "publishedOn": "2024-09-11T23:22:22.000Z",
          "wordCount": 1680,
          "title": "Feminist Collective Kores Xapolytes - Two years after the victims were found",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "7834",
            "url": "https://theanarchistlibrary.org/library/feminist-collective-kores-xapolytes-two-years-after-the-victims-were-found.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/andrea-teruel-an-anarchist-conjuration?v=1726093411",
          "author": null,
          "description": "Author: Andrea Teruel\nTitle: An Anarchist Conjuration\nSubtitle: The Benjamin-Bataille Meeting and the Critique of Left-Wing Progressism\nDate: 2022\nSource: revistas.unc.edu.ar\n\nAbstract\n The article explores the theoretical complicities between the thought of Walter Benjamin and Georges Bataille. Taking as a starting point the anecdote of the Book of Passages, according to which Benjamin would have entrusted this manuscript to the care of Bataille, questions are raised about the possible link between the two thinkers. The relationship that both authors maintained with the leftist political thought of the time and the way in which their revolutionary conceptions distance themselves from orthodox Marxism and dialectical materialism are particularly problematized. In this way, through an analy…",
          "link": "https://theanarchistlibrary.org/library/andrea-teruel-an-anarchist-conjuration?v=1726093411",
          "publishedOn": "2024-09-11T22:23:31.000Z",
          "wordCount": 6294,
          "title": "Andrea Teruel - An Anarchist Conjuration",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "23022",
            "url": "https://theanarchistlibrary.org/library/andrea-teruel-an-anarchist-conjuration.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/mikhail-bakunin-on-the-question-of-the-right-of-inheritance?v=1726015496",
          "author": null,
          "description": "Author: Mikhail Bakunin\nTitle: On the Question of the Right of Inheritance\nSubtitle: in Speeches to the Basle Congress\nDate: 1871\nNotes: Translation by Robert M. Cutler. ISBN 13: 978-0-87975-745-8 ISBN 10: 0-87975-745-0\nSource: The Basic Bakunin: Writings, 1869-1871\n\n There is but a simple difference between the standpoint of those collectivists who believe that it is useless to vote to abolish the right of inheritance after having voted \"for collective property, and that of those collectivists who think, as do we, that it is useful and even necessary to do so. \n They place themselves entirely in the future and, taking collective property as their point of departure, discover that there is no longer any good reason to be concerned with the right of inheritance. \n We on the contrary take ou…",
          "link": "https://theanarchistlibrary.org/library/mikhail-bakunin-on-the-question-of-the-right-of-inheritance?v=1726015496",
          "publishedOn": "2024-09-11T00:44:56.000Z",
          "wordCount": 961,
          "title": "Mikhail Bakunin - On the Question of the Right of Inheritance",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "5656",
            "url": "https://theanarchistlibrary.org/library/mikhail-bakunin-on-the-question-of-the-right-of-inheritance.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/autonomous-action-anti-war-statement?v=1726013751",
          "author": null,
          "description": "Author: Autonomous Action\nTitle: Anti-war statement\nDate: 29 August 2024\nSource: Retrieved on 2nd September 2024 from avtonom.org\n\n We have stated from the very start that the beginning of a full-scale war in Ukraine on February 24, 2022 is an imperialist aggression of the Russian state. That is still true. \nOur position on the war in Ukraine\n“Autonomous Action” is not on the side of the Ukrainian state — and not on the side of any other state. However, in the current circumstances, the victory of Russia is not beneficial to the peoples of neither Ukraine, nor Russia, nor Belarus. Fighting against Russian aggression is now beneficial to everyone except the Kremlin. It is easy to see why it is beneficial to the Ukrainian authorities. But why is it also beneficial to people (and, accordingly…",
          "link": "https://theanarchistlibrary.org/library/autonomous-action-anti-war-statement?v=1726013751",
          "publishedOn": "2024-09-11T00:15:51.000Z",
          "wordCount": 1712,
          "title": "Autonomous Action - Anti-war statement",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "9366",
            "url": "https://theanarchistlibrary.org/library/autonomous-action-anti-war-statement.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/idioteq-burning-down-the-world-anarchy-veganism-and-total-liberation-with-warzone-distro?v=1726009440",
          "author": null,
          "description": "Author: IDIOTEQ, Warzone Distro, Flower Bomb\nTitle: BURNING DOWN THE WORLD\nSubtitle: IDIOTEQ interviews Warzone Distro\nDate: SEPTEMBER 2, 2024\nSource: https://idioteq.com/burning-down-the-world-anarchy-veganism-and-total-liberation-with-warzone-distro/\n\n Born in 2013, WARZONE DISTRO free zine project, stands at the intersection of nihilist, anti-civilization anarchy, and total liberation, bridging gaps between veganism, straight edge, and insurrectionary thought. WARZONE DISTRO is dedicated to challenging the very foundations of oppression, wherever it festers, and in whatever form. \n In our interview below, we delve into the radical philosophy driving WARZONE DISTRO, exploring how they blend anarchist and vegan ideals to craft a vision of true total liberation. We talk about the unique ch…",
          "link": "https://theanarchistlibrary.org/library/idioteq-burning-down-the-world-anarchy-veganism-and-total-liberation-with-warzone-distro?v=1726009440",
          "publishedOn": "2024-09-10T23:04:00.000Z",
          "wordCount": 3138,
          "title": "IDIOTEQ, Warzone Distro, Flower Bomb - BURNING DOWN THE WORLD",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "11207",
            "url": "https://theanarchistlibrary.org/library/idioteq-burning-down-the-world-anarchy-veganism-and-total-liberation-with-warzone-distro.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/wulfinna-bias?v=1726007334",
          "author": null,
          "description": "Author: Wulfinna\nTitle: Bias\nDate: 09-09-2024\nSource: https://ignitedindark.wordpress.com/2024/09/09/bias/\n\n Along the horridly neglected path out of being commanded and subjected, from the stinking bowels of the societies of oiled gears, permanent emissions, bright screens, information haze and ceaseless masturbation to worn-out sensibility, there arises a shrill hissing of such stupid nature, of such whining entitlement, that the lone rebel catches herself snickering — then nearly dying laughing . . . \n \"You have a left-wing bias!\" \n \"You have a right-wing bias!\" \n \"You have a centrist bias!\" \n \"You have an extremist bias!\" \n Ha! Ahahaha! Ah, the acrid hell of human hubris knows no end! The sheer closeness in conceptual capacity to being god — yet holding oneself back at the last second …",
          "link": "https://theanarchistlibrary.org/library/wulfinna-bias?v=1726007334",
          "publishedOn": "2024-09-10T22:28:54.000Z",
          "wordCount": 2787,
          "title": "Wulfinna - Bias",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "10863",
            "url": "https://theanarchistlibrary.org/library/wulfinna-bias.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/a-x-blackness-and-democratic-modernity?v=1726007099",
          "author": null,
          "description": "Author: A.X.\nTitle: Blackness and Democratic Modernity\nDate: January 10, 2023\nSource: https://harbinger-journal.com/issue-2/blackness-and-democratic-modernity/\n\n “Modernity as a concept means time, the present. There are different moderns, depending on the age. From Sumerian modernity to Roman modernity, and even before and after them, there have been…many examples of modernity.” \n Abdullah Öcalan, The Sociology of Freedom\n “The Negro’s revolutionary history is rich, inspiring, and unknown. Negroes revolted against the slave raiders in Africa; they revolted against the slave traders on the Atlantic passage. They revolted on the plantations. The docile Negro is a myth… The only place where Negroes did not revolt is in the pages of capitalist historians.” \n C.L.R. James, “Revolution and the …",
          "link": "https://theanarchistlibrary.org/library/a-x-blackness-and-democratic-modernity?v=1726007099",
          "publishedOn": "2024-09-10T22:24:59.000Z",
          "wordCount": 5107,
          "title": "A.X. - Blackness and Democratic Modernity",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "16660",
            "url": "https://theanarchistlibrary.org/library/a-x-blackness-and-democratic-modernity.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/antonis-pastellopoulos-cypriot-anarchist-ideology-in-the-post-partitioned-republic-of-cyprus-19?v=1726006831",
          "author": null,
          "description": "Author: Antonis Pastellopoulos\nTitle: Cypriot Anarchist Ideology in the Post-Partitioned Republic of Cyprus (1985 to 1994)\nSubtitle: “Cyprus Belongs to its Mouflons”\nDate: 2017\nNotes: This is an undergraduate dissertation submitted at the Department of Sociology of the University of Glasgow in 2017.\nSource: Retrieved on 24rd August 2024 from archive.org\n\nAbstract\n This dissertation examines the structure of Cypriot anarchist ideology and the way it challenges Greek Cypriot ethnic nationalism, as it developed in the first decade following the partition of the island of Cyprus. It aims to contribute to the understanding of grass root political activity in Cyprus, by examining the early expressions of anarchism in the island. Ideology has been argued to function around the use of key discursi…",
          "link": "https://theanarchistlibrary.org/library/antonis-pastellopoulos-cypriot-anarchist-ideology-in-the-post-partitioned-republic-of-cyprus-19?v=1726006831",
          "publishedOn": "2024-09-10T22:20:31.000Z",
          "wordCount": 14507,
          "title": "Antonis Pastellopoulos - Cypriot Anarchist Ideology in the Post-Partitioned Republic of Cyprus (1985 to 1994)",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "541678",
            "url": "https://theanarchistlibrary.org/library/antonis-pastellopoulos-cypriot-anarchist-ideology-in-the-post-partitioned-republic-of-cyprus-19.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/iwona-janicka-are-these-bubbles-anarchist?v=1725927914",
          "author": null,
          "description": "Author: Iwona Janicka\nTitle: Are These Bubbles Anarchist?\nSubtitle: Peter Sloterdijk’s Spherology and the Question of Anarchism\nDate: 2016\nNotes: Janicka, Iwona. (2016) Are These Bubbles Anarchist? Peter Sloterdijk’s Spherology and the Question of Anarchism. Anarchist Studies, 24 (1).\nSource: wrap.warwick.ac.uk\n\nAbstract\n The question of solidarity is an important one for anarchism. However, so far solidarity as a concept has not been given the philosophical attention it deserves. In this paper I wish to fill in this gap in the anarchist literature and discuss solidarity from the perspective of Peter Sloterdijk’s work. I will examine the key features of Sloterdijk’s theory of spheres and claim that his spherology can be useful for thinking about solidarity in the context of anarchism. Slot…",
          "link": "https://theanarchistlibrary.org/library/iwona-janicka-are-these-bubbles-anarchist?v=1725927914",
          "publishedOn": "2024-09-10T00:25:14.000Z",
          "wordCount": 9753,
          "title": "Iwona Janicka - Are These Bubbles Anarchist?",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "32383",
            "url": "https://theanarchistlibrary.org/library/iwona-janicka-are-these-bubbles-anarchist.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/friends-of-russell-maroon-shoatz-anarchists-against-counter-revolution?v=1725927009",
          "author": null,
          "description": "Author: Friends of Russell Maroon Shoatz\nTitle: Anarchists Against Counter-Revolution\nDate: 9/7/2024\nSource: Retrieved on 9/7/2024 from https://abolitionmedia.noblogs.org/post/2024/09/07/anarchists-against-counter-revolution/\n\n There has been a disturbing trend within anarchism in the last few years. It could be called the right wing of anarchism, liberal anarchism, anarchism in name only, or reformism. Whatever it is called, people who believe that they are anarchists have taken positions that side with colonizers, nation-states, and western hegemony. \n The most glaring of these positions are: 1) the Resistance in Palestine should not be supported or should only be partially supported because Hamas is not sufficiently 'anarchist.' 2) Money and solidarity should be sent to 'anarchist' batt…",
          "link": "https://theanarchistlibrary.org/library/friends-of-russell-maroon-shoatz-anarchists-against-counter-revolution?v=1725927009",
          "publishedOn": "2024-09-10T00:10:09.000Z",
          "wordCount": 3836,
          "title": "Friends of Russell Maroon Shoatz - Anarchists Against Counter-Revolution",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "273453",
            "url": "https://theanarchistlibrary.org/library/friends-of-russell-maroon-shoatz-anarchists-against-counter-revolution.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/uploads/en/thumbnails/f-o-friends-of-russell-maroon-shoatz-anarchists-ag-1.png.large.png"
        },
        {
          "id": "https://theanarchistlibrary.org/library/cypriot-anarchist-kernel-resistance-against-the-plans-of-the-dominators?v=1725924321",
          "author": null,
          "description": "Author: Cypriot Anarchist Kernel\nTitle: RESISTANCE AGAINST THE PLANS OF THE DOMINATORS\nDate: 2003\nSource: https://movementsarchive.org/doku.php?id=en:leaflets:anarxikospirinas:anarxikospirinas_antistasi\n\n Note: The present passage was written on 11-16 December 2002 (period of the Cyprus entry into the European Union) by anarchist prisoner Giorgos Garakasian in the jails of free Cypriot democracy. \n Through the general secretary of United Criminals Kofi Annan the Americans and British have been attempting for some time now to impose a ‘fair and viable solution’ upon the inhabitants of Cyprus. \n The period that we are living in is characterized by the reorganization of global dominion, which has completed its first phase of ‘anti-terrorist’ hysteria with the devastating intervention in Afgha…",
          "link": "https://theanarchistlibrary.org/library/cypriot-anarchist-kernel-resistance-against-the-plans-of-the-dominators?v=1725924321",
          "publishedOn": "2024-09-09T23:25:21.000Z",
          "wordCount": 1780,
          "title": "Cypriot Anarchist Kernel - RESISTANCE AGAINST THE PLANS OF THE DOMINATORS",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "10713",
            "url": "https://theanarchistlibrary.org/library/cypriot-anarchist-kernel-resistance-against-the-plans-of-the-dominators.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}