{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": []
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": []
    },
    {
      "title": "The latest from GitHub's engineering team - The GitHub Blog",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps & Developer Productivity Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": []
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "16e90ff8cb5363cf2d70b6dd873e01b284520e09",
          "author": "pmm",
          "description": "Introduction In 2020, AWS announced Bottlerocket, an open source, container-optimized Linux distribution designed for hosting containers. Each Bottlerocket image, known as a variant, is specialized for a specific combination of container orchestrator and cloud environment. Bottlerocket variants are provided to users as a set of Amazon Machine Images (AMI), currently optimized for either Amazon Elastic Container […]",
          "link": "https://aws.amazon.com/blogs/containers/announcing-bottlerocket-fips-variants/",
          "publishedOn": "2024-12-26T16:51:51.000Z",
          "wordCount": 1461,
          "title": "Announcing Bottlerocket FIPS variants",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/12/26/Featured-images-for-Containers-Blog-1-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=348356",
          "author": "Ramzy Baroud",
          "description": "The story of the Israeli war on Gaza can be epitomized in the story of the Israeli war on Beit Lahia, a small Palestinian town in the northern part of the Strip. When Israel launched its ground operations in Gaza, Beit Lahia was already largely destroyed due to many days of relentless Israeli bombardment which  More\nThe post A Palestinian Year in Review: Genocide, Resistance and Unanswered Questions   appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/30/a-palestinian-year-in-review-genocide-resistance-and-unanswered-questions/",
          "publishedOn": "2024-12-30T07:01:25.000Z",
          "wordCount": null,
          "title": "A Palestinian Year in Review: Genocide, Resistance and Unanswered Questions",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348336",
          "author": "Melvin Goodman",
          "description": "The mainstream media ignored the passing of a beloved former colleague of mine, Ambassador Raymond Garthoff, whose career spanned the most important years of arms control and disarmament between the United States and the Soviet Union.  Over the years, the media have devoted much attention to the opponents of arms control such as George W. Bush, Paul Wolfowitz, John Bolton, and Casper Weinberger, but have done little to explore the importance of its advocates and practitioners.   More\nThe post The Death of Ambassador Raymond Garthoff and Disarmament appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/30/the-death-of-ambassador-raymond-garthoff-and-disarmament/",
          "publishedOn": "2024-12-30T07:01:05.000Z",
          "wordCount": null,
          "title": "The Death of Ambassador Raymond Garthoff and Disarmament",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348392",
          "author": "Michael K. Smith",
          "description": "A pious Sunday school teacher confessing to lust in his heart but swearing never to lie, he came to Washington to reestablish public faith in government just when popular disgust at monstrous U.S. crimes in Indochina had reached unprecedented heights. The big business agenda during his term in office (1977-1981) was to roll back the welfare state, break the power of unions, fan the flames of the Cold War to increase military spending, engineer tax breaks for wealthy corporate interests, and repeal government regulation of business. While portraying himself as a peanut-farming populist, Carter delivered the goods for Wall Street.\nMore\nThe post Jimmy Carter: the False Savoir appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/30/jimmy-carter-the-false-savoir/",
          "publishedOn": "2024-12-30T06:59:53.000Z",
          "wordCount": null,
          "title": "Jimmy Carter: the False Savoir",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348272",
          "author": "Michael Albert",
          "description": "Donald, the idiot, the madman, the consummate cowardly thug is preparing to unleash shock and awe to paint his agenda onto the American and the world stage such as we have never seen before. Day one, two, three…infinity. He will attempt to unleash the hounds of horror. Why? To impose his horrendous agenda—of course. But  More\nThe post Fascism and Radical Left Lunacy appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/30/fascism-and-radical-left-lunacy/",
          "publishedOn": "2024-12-30T06:56:28.000Z",
          "wordCount": null,
          "title": "Fascism and Radical Left Lunacy",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348409",
          "author": "Binoy Kampmark",
          "description": "Mike Pompeo’s role in the first Trump administration as both director of the Central Intelligence Agency and US Secretary of State will be forever associated with the venom and desperation he had in targeting Julian Assange, a publisher who drove him to distraction and engendered mania.  As the chief founder of WikiLeaks, Assange had regularly published  More\nThe post Sinking Mike Pompeo: Tucker Carlson, Assange and Trump appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/30/sinking-mike-pompeo-tucker-carlson-assange-and-trump/",
          "publishedOn": "2024-12-30T06:55:35.000Z",
          "wordCount": null,
          "title": "Sinking Mike Pompeo: Tucker Carlson, Assange and Trump",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348274",
          "author": "Priti Gulati Cox",
          "description": "What follows is the final installment of ‘October 7: A History in Threads,’ which connects the present to the past 141 years of Zionism and Israel’s occupation of Palestine. Please go here to see all of the 11 threads in this series that includes embroidered portraits of the ongoing Palestinian struggle for liberation. According to  More\nThe post October 7: A History in Threads appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/30/october-7-a-history-in-threads/",
          "publishedOn": "2024-12-30T06:45:15.000Z",
          "wordCount": null,
          "title": "October 7: A History in Threads",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348370",
          "author": "Tempest and Posle Media",
          "description": "Tempest’s Ashley Smith and Posle Media’s Ilya Budraitskis interview Georgian activists and scholars Ia Eradze, Luka Nakhutsrishvili and Lela Rekhviashvili about the roots of the uprising, its trajectory, and Georgia’s place in global capitalism and the imperialist order. The country of Georgia, a small nation of 3.8 million people in the Caucasus, has been thrown into a profound crisis. Its people have risen up against  More\nThe post Uprising for Democracy in the Caucasus appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/30/uprising-for-democracy-in-the-caucasus/",
          "publishedOn": "2024-12-30T06:44:46.000Z",
          "wordCount": null,
          "title": "Uprising for Democracy in the Caucasus",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348360",
          "author": "Mel Gurtov",
          "description": "The global citizen agenda for 2025 is very much like that for 2024—and probably for some years afterward. It includes global warming and related environmental crises; US-China tensions; challenges to democracy and peace in Europe and Africa; interstate and intrastate violence in the Middle East; and nuclear weapons upgrading. A new addition to this list  More\nThe post The Year Past and the Year Ahead appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/30/the-year-past-and-the-year-ahead/",
          "publishedOn": "2024-12-30T06:17:15.000Z",
          "wordCount": null,
          "title": "The Year Past and the Year Ahead",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347930",
          "author": "Jeffrey St. Clair",
          "description": "The Bibi Files Dir. Alexis Bloom Dahomey Dir. Mati Diop Ernest Cole: Lost and Found Dir. Raoul Peck Eno Dir. Gary Hustwi The Goldman Case Dir. Cédric Kahn Green Border Dir. Agnieszka Holland The Night Won’t End: Biden’s War on Gaza  Dir. Laila Al Arian and Fault Lines No Other Land Dir. Basel Adra, Yuval  More\nThe post Cinema Beyond Cinemas: the Best Films of 2024 appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/30/cinema-beyond-cinemas-the-best-films-of-2024/",
          "publishedOn": "2024-12-30T06:09:42.000Z",
          "wordCount": null,
          "title": "Cinema Beyond Cinemas: the Best Films of 2024",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348403",
          "author": "Josh Frank",
          "description": "On this episode of CounterPunch Radio, Joshua Frank and Erik Wallenberg talk to Ashley Dawson about his new book, Environmentalism from Below: How Global People's Movements Are Leading the Fight for Our Planet (Haymarket Books).\nAshley is a Professor of English at the Graduate Center / City University of New York and the College of Staten Island. He is the author of several books on key topics in the environmental humanities, including People’s Power: Reclaiming the Energy Commons, Extreme Cities: The Peril and Promise of Urban Life in the Age of Climate Change, and Extinction: A Radical History. A member of the Public Power NY campaign and the founder of the CUNY Climate Action Lab, he is a long-time climate justice activist.  More\nThe post Ashley Dawson: Environmentalism from Below appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/29/ashley-dawson-environmentalism-from-below/",
          "publishedOn": "2024-12-30T00:15:20.000Z",
          "wordCount": null,
          "title": "Ashley Dawson: Environmentalism from Below",
          "itunes": {
            "duration": "1:08:25"
          },
          "enclosure": {
            "url": "https://media.blubrry.com/counterpunch_radio/content.blubrry.com/counterpunch_radio/DawsonInterview.mp3",
            "length": "131351118",
            "type": "audio/mpeg"
          },
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347506",
          "author": "Pete Dolack",
          "description": "Image by Javier Miranda. Image by Javier Miranda. Image by Javier Miranda. Image by Javier Miranda. Image by Javier Miranda. Image by Javier Miranda. Image by Javier Miranda. Image by Javier Miranda. Image by Javier Miranda. Image by Javier Miranda. Image by Javier Miranda. Image by Javier Miranda. Image by Javier Miranda. Image by Javier […]\nTo read this article, log in here or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post It’s the End of the World and I Don’t Feel Fine appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/29/its-the-end-of-the-world-and-i-dont-feel-fine/",
          "publishedOn": "2024-12-29T06:54:53.000Z",
          "wordCount": null,
          "title": "It’s the End of the World and I Don’t Feel Fine",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348265",
          "author": "Peter Bach",
          "description": "Palestinians gather amid the ruins of a residential complex bombed by the Israelis in December. (Screengrab from video posted to X.) Palestinians gather amid the ruins of a residential complex bombed by the Israelis in December. (Screengrab from video posted to X.) Palestinians gather amid the ruins of a residential complex bombed by the Israelis […]\nTo read this article, log in here or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Poetry From Today’s Frontlines appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/29/poetry-from-todays-frontlines/",
          "publishedOn": "2024-12-29T06:38:15.000Z",
          "wordCount": null,
          "title": "Poetry From Today’s Frontlines",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348214",
          "author": "Jeffrey St. Clair",
          "description": "Kamal Adwan Hospital workers, doctors, and staff are being forcibly evicted from the grounds of the hospital by IDF soldiers. (Screengrab from a video posted to X.) Kamal Adwan Hospital workers, doctors, and staff are being forcibly evicted from the grounds of the hospital by IDF soldiers. (Screengrab from a video posted to X.) Kamal […]\nTo read this article, log in here or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post What’s Left to Say? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/28/whats-left-to-say/",
          "publishedOn": "2024-12-28T15:07:43.000Z",
          "wordCount": null,
          "title": "What’s Left to Say?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348069",
          "author": "Michael Schwalbe",
          "description": "Civil discourse is preferable to the alternatives of coerced silence and violence. Coerced silence means that one side has exercised power to end conversation—to say, in effect, there is no point in further discussion; be quiet and accept that our desires will prevail. Violence means that reason has failed and we are reduced to the condition of resolving disputes by means of fang and claw, rock and club, bullet and bomb. More\nThe post Civil Discourse in a Time of Genocide appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/civil-discourse-in-a-time-of-genocide/",
          "publishedOn": "2024-12-27T07:03:54.000Z",
          "wordCount": null,
          "title": "Civil Discourse in a Time of Genocide",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347882",
          "author": "Jeffrey St. Clair",
          "description": "For nearly two days, the NYPD covered up the fact that one of their officers had fired a gun inside Hind Hall, while they were arresting students. Ultimately, the shooting was only revealed by the New York City DA's office. If you call in the NYPD, you can pretty much guarantee there will be bang-bang...Is there any doubt now that the NYPD raid did more damage to the buildings at Columbia than the students? The people who invited these cops on their campus should never be guardians of students again. More\nThe post The Sound of da Police: the Year Criminal Injustice appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/the-sound-of-da-police-the-year-criminal-injustice/",
          "publishedOn": "2024-12-27T06:59:11.000Z",
          "wordCount": null,
          "title": "The Sound of da Police: the Year Criminal Injustice",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348067",
          "author": "John K. White",
          "description": "One can be excused for worrying over what tomorrow might bring as expanded battle lines are redrawn across the globe, the world’s wealthiest nation ever consumes itself in a cataclysm of partisan hate amid a growing digital reformation, and unchecked carbon emissions continue to cause more environmental disaster by the day. Will nuclear conflict, machine control, or climate breakdown ultimately destroy our pale blue dot of a planet or is it all just more apocalyptic blather that never comes to pass? More\nThe post The End Days? World War, Tech Takeover, and Global Warming appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/the-end-days-world-war-tech-takeover-and-global-warming/",
          "publishedOn": "2024-12-27T06:57:59.000Z",
          "wordCount": null,
          "title": "The End Days? World War, Tech Takeover, and Global Warming",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348095",
          "author": "Joshua Frank",
          "description": "I’m not a big fan of these “best of” lists, but of all the new(ish) arts entertainment (or edutainment, as KRS-One would say) I consumed these past twelve months, here’s what helped me most in surviving (and contemplating) the relentless horrors of 2024. FILMS No Other Land, co-directed by Basel Adra, Hamdan Ballal, Yuval Abraham, and  More\nThe post My Favorites of 2024 appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/my-favorites-of-2024/",
          "publishedOn": "2024-12-27T06:57:33.000Z",
          "wordCount": null,
          "title": "My Favorites of 2024",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348087",
          "author": "Robert Hunziker",
          "description": "Major portions of the Arabian Peninsula are already exceeding 2°C above pre-industrial and likely headed for a staggering temperature rise over coming decades. This disturbing news comes via a major new study by Saudi Arabia’s most prestigious university. The epicenter of world oil & gas production is in direct line of fire of unnerving acceleration  More\nThe post The Leading Edge of Global Heat – Arabian Peninsula appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/the-leading-edge-of-global-heat-arabian-peninsula/",
          "publishedOn": "2024-12-27T06:56:40.000Z",
          "wordCount": null,
          "title": "The Leading Edge of Global Heat – Arabian Peninsula",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348153",
          "author": "Binoy Kampmark",
          "description": "Mining magnates seem to have it all.  Far more significant than royalty, such figures are the unelected captains of industry who know that governments will do whatever they can to accommodate their wishes and whims.  True, the official rhetoric might sometimes be sharp and seemingly at odds, especially when it comes to that great irritation known as  More\nThe post Jesting on the Environment: Australian Mining Gets a Present appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/jesting-on-the-environment-australian-mining-gets-a-present/",
          "publishedOn": "2024-12-27T06:56:05.000Z",
          "wordCount": null,
          "title": "Jesting on the Environment: Australian Mining Gets a Present",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348117",
          "author": "Paul Street",
          "description": "New York Times columnist Bret Stephens recently published a widely read opinion piece claiming that Brian Thompson, the United Health Group insurance CEO that Luigi Mangione assassinated, is the “real working-class hero” in the story of Thompson’s murder. By Stephen’s reckoning, Thompson and not Mangione deserves the label because the murder victim came from a  More\nThe post It’s Not About What Class You’re From: It’s About What Class System You Serve appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/its-not-about-what-class-your-from-its-about-what-class-system-you-serve/",
          "publishedOn": "2024-12-27T06:55:57.000Z",
          "wordCount": null,
          "title": "It’s Not About What Class You’re From: It’s About What Class System You Serve",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348021",
          "author": "Daniel Warner",
          "description": "Donald Trump and the Marlboro Man are case studies of branding success. When Philip Morris introduced the cowboy on its ads in 1955, sales were at $5 billion. Two years later, sales were at $20 billion. Ellen Merlo, the vice president of marketing services at Philip Morris, described the cowboy image as “very rugged, individualistic, heroic.” Rugged and individualistic is exactly the image Trump tries to portray. Why else go to WWE Raw events or a college football game? How else to describe his raised fist cry “Fight, fight, fight,” when struck by a bullet during an assassination attempt. Trump’s mythological image has helped him to be re-elected president despite (because of) twice being impeached and convicted of 34 felony accounts. The Marlboro Man and Trump’s image portrayal are fundamental to the American mythology of the pioneer spirit exploring new frontiers which now includes the popular success of tech start-up heroes like Elon Musk. More\nThe post Trump, the Marlboro Man and the New Frontier appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/trump-the-marlboro-man-and-the-new-frontier/",
          "publishedOn": "2024-12-27T06:55:37.000Z",
          "wordCount": null,
          "title": "Trump, the Marlboro Man and the New Frontier",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348172",
          "author": "Kim C. Domenico",
          "description": "Life is not possible without an opening to the transcendent; in other words, human beings cannot live in chaos.  Once contact with the transcendent is lost, existence in the world ceases to be possible. –Mircea Eliade, quoted in The Cross and the Lynching Tree, by James Cone In Hinduism, the term Kali Yuga refers to the last of four  More\nThe post Arrested Grief: Liberal America’s Moral Problem? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/arrested-grief-liberal-americas-moral-problem/",
          "publishedOn": "2024-12-27T06:55:19.000Z",
          "wordCount": null,
          "title": "Arrested Grief: Liberal America’s Moral Problem?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348151",
          "author": "Stewart Lawrence",
          "description": "What do Tiger Woods, Michael Jordan, Charles Barkley and Floyd Mayweather, Jr. have in common? They’re all sports superstars, of course. But they’re also something else: Hard-core gambling addicts. Mayweather, Jr. regularly gambles as much as $400,000 on college football games. He reportedly once won $3 million on a single Orange Bowl contest. But his biggest bet  More\nThe post America’s Invisible Sports Betting Epidemic appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/americas-invisible-sports-betting-epidemic/",
          "publishedOn": "2024-12-27T06:55:15.000Z",
          "wordCount": null,
          "title": "America’s Invisible Sports Betting Epidemic",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348176",
          "author": "Roger D. Harris - John Perry",
          "description": "The progressive regional current, the “Pink Tide,” could be better called “troubled waters” in 2024. The tide had already slackened by 2023 compared to its rise in 2022, when it was buoyed by big wins in Colombia and Brazil. Then, progressive alternatives had sailed into power replacing failed neoliberal policies. Since, they have had to  More\nThe post What’s Left in Latin American and the Caribbean: Year 2024 in Review  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/whats-left-in-latin-american-and-the-caribbean-year-2024-in-review/",
          "publishedOn": "2024-12-27T06:55:02.000Z",
          "wordCount": null,
          "title": "What’s Left in Latin American and the Caribbean: Year 2024 in Review",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348180",
          "author": "Howard Lisnoff",
          "description": "As a Jew in a Catholic college, one of two Jewish students in my class, I had to take lots of philosophy. My motivation for going to this particular school was the high school teachers I admired who had graduated from there and the academic major I wanted to study. The school also had a  More\nThe post A Little Learning Is Not Such a Dangerous Thing appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/a-little-learning-is-not-such-a-dangerous-thing/",
          "publishedOn": "2024-12-27T06:54:27.000Z",
          "wordCount": null,
          "title": "A Little Learning Is Not Such a Dangerous Thing",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=347986",
          "author": "M. Reza Behnam",
          "description": "In these difficult times, the voice of the late Palestinian-American scholar, Edward Said is ever present, “Writing is the final resistance we have against the inhuman practices and injustices that disfigure human history.” For more than fourteen painful months Israel has passed off its inhuman actions against the people of Gaza as “defensive.” We are  More\nThe post Deception and Politics From Washington to Tel Aviv                               appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/deception-and-politics-from-washington-to-tel-aviv/",
          "publishedOn": "2024-12-27T06:54:02.000Z",
          "wordCount": null,
          "title": "Deception and Politics From Washington to Tel Aviv",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348106",
          "author": "Norman Solomon",
          "description": "This week, the New York Times reported that the U.S. government made war in Afghanistan while helping to “recruit, train and pay for lawless bands of militias that pillaged homes and laid waste to entire communities.” Those militias “tortured civilians, kidnapped for ransom, massacred dozens in vendetta killings and razed entire villages, sowing more than  More\nThe post Afghanistan: Now It Can Be Told . . . After All the Harm Has Been Done appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/afghanistan-now-it-can-be-told-after-all-the-harm-has-been-done/",
          "publishedOn": "2024-12-27T06:53:50.000Z",
          "wordCount": null,
          "title": "Afghanistan: Now It Can Be Told . . . After All the Harm Has Been Done",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348147",
          "author": "W. T. Whitney",
          "description": "Cubans numbering hundreds of thousands marched on December 20 along Havana’s emblematic Malecon roadway fronting the Florida Straits. (See photos and video here.)  President Miguel Díaz Canel and former President Raul Castro took the lead in a massive protest against stepped-up U.S. efforts to immiserate Cubans and bring down their socialist government. Earlier that day, President Díaz-Canel addressed this year’s closing session of Cuba’s  More\nThe post Militant Still, Cubans March Against US Blockade and Hybrid War   appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/militant-still-cubans-march-against-us-blockade-and-hybrid-war/",
          "publishedOn": "2024-12-27T06:53:35.000Z",
          "wordCount": null,
          "title": "Militant Still, Cubans March Against US Blockade and Hybrid War",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348079",
          "author": "Diana Block",
          "description": "I can remember clearly the rush of joy I felt when I heard the almost unbelievable news that the last three members of the Cuban 5, Gerardo Hernández, Antonio Guerrero, and Ramón Labañino, had landed in Havana on December 17th, 2014 after sixteen years of unjust incarceration in U.S. prisons. (The other two members of  More\nThe post The Cuban Five Victory: Reflections Ten Years Later appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/the-cuban-five-victory-reflections-ten-years-later/",
          "publishedOn": "2024-12-27T06:53:15.000Z",
          "wordCount": null,
          "title": "The Cuban Five Victory: Reflections Ten Years Later",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=348076",
          "author": "Eve Ottenberg",
          "description": "As inflation ravages the West, Europeans are told by NATO chieftain Mark Rutte to sacrifice more for the glorious cause of tyranny in Ukraine. Pensions must be trimmed, inflation accepted and any other social benefits put on the chopping block. What, you may ask, is the logic here? Well, there isn’t any, unless Rutte believes  More\nThe post Sacrificing Living Standards for War appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/12/27/sacrificing-living-standards-for-war/",
          "publishedOn": "2024-12-27T06:53:14.000Z",
          "wordCount": null,
          "title": "Sacrificing Living Standards for War",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=284785",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, Syndemics; H1B controversy rolls along;  Norovirus surge; Amazon attacks third-party sellers again ~",
          "link": "https://www.nakedcapitalism.com/2024/12/200pm-water-cooler-12-30-2024.html",
          "publishedOn": "2024-12-30T19:00:58.000Z",
          "wordCount": 9995,
          "title": "2:00PM Water Cooler 12/30/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/covid-cdc-ww-natl-4.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284788",
          "author": "Lambert Strether",
          "description": "Trump’s nominees are backed by major players in the world of climate obstruction – from Project 2025 and Koch network fixtures to oil-soaked Christian nationalists.",
          "link": "https://www.nakedcapitalism.com/2024/12/6-fracking-billionaires-and-climate-denial-groups-behind-trumps-cabinet.html",
          "publishedOn": "2024-12-30T17:47:07.000Z",
          "wordCount": 5623,
          "title": "6 Fracking Billionaires and Climate Denial Groups Behind Trump’s Cabinet",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284772",
          "author": "Lambert Strether",
          "description": "",
          "link": "https://www.nakedcapitalism.com/2024/12/links-12-30-2024.html",
          "publishedOn": "2024-12-30T11:58:24.000Z",
          "wordCount": 17066,
          "title": "Links 12/30/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/lion_yawn.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284727",
          "author": "Conor Gallagher",
          "description": "Issues with supplies from Qatar — the world's third largest exporter of LNG — could be a major boon for US gas companies.",
          "link": "https://www.nakedcapitalism.com/2024/12/284727.html",
          "publishedOn": "2024-12-30T11:00:24.000Z",
          "wordCount": 6284,
          "title": "The EU Threatens to Cut Itself off From Another of Its Major Natural Gas Suppliers",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/Screenshot-2024-12-28-at-6.28.48 AM-1024x478.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284746",
          "author": "Lambert Strether",
          "description": "A simple plan....",
          "link": "https://www.nakedcapitalism.com/2024/12/how-maga-can-stuff-doge-back-in-his-box-and-win-the-day-on-h1b.html",
          "publishedOn": "2024-12-29T20:55:58.000Z",
          "wordCount": 13162,
          "title": "How MAGA Can Stuff DOGE Back in Its Box and Win the Day on H1B",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284718",
          "author": "Lambert Strether",
          "description": "Our bearish daily links",
          "link": "https://www.nakedcapitalism.com/2024/12/links-12-29-2024.html",
          "publishedOn": "2024-12-29T11:58:16.000Z",
          "wordCount": 23377,
          "title": "Links 12/29/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/Polar_Bear_AdF.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284715",
          "author": "Lambert Strether",
          "description": "AI's ability to handle complexity and respond rapidly means future crises are likely to be much more sudden and vicious than those we have experienced so far.",
          "link": "https://www.nakedcapitalism.com/2024/12/the-one-in-a-thousand-day-problem.html",
          "publishedOn": "2024-12-29T11:50:47.000Z",
          "wordCount": 6455,
          "title": "The One-in-a-Thousand-Day Problem",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284623",
          "author": "Yves Smith",
          "description": "Our agitating daily links: Milan smoking ban, Covid causes autism? China dam in Tibet, Gaza children freeze, moar Azerbaijan crash, Luttwak on Syria, no paper passports? MAGA v. Musk on H-1Bs, CNN loses viewers, bad AI muzak, Mangione's bad lockup, global fertility trade",
          "link": "https://www.nakedcapitalism.com/2024/12/links-12-28-2024.html",
          "publishedOn": "2024-12-28T11:55:09.000Z",
          "wordCount": 29507,
          "title": "Links 12/28/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/12/00-Squirrel_at_Wollaton.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284707",
          "author": "Yves Smith",
          "description": "Why neoliberalism is a major cause of mental health problems.",
          "link": "https://www.nakedcapitalism.com/2024/12/why-do-we-have-a-mental-health-crisis.html",
          "publishedOn": "2024-12-28T11:54:11.000Z",
          "wordCount": 12343,
          "title": "Why Do We Have a Mental Health Crisis?",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=284709",
          "author": "Yves Smith",
          "description": "Are nature schools an old answer to new childrearing and education challenges?",
          "link": "https://www.nakedcapitalism.com/2024/12/enrollment-in-nature-schools-soars-as-families-rediscover-the-benefits-of-outdoor-learning.html",
          "publishedOn": "2024-12-28T11:50:33.000Z",
          "wordCount": 4938,
          "title": "Enrollment in Nature Schools Soars as Families Rediscover the Benefits of Outdoor Learning",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "2yX9ADcaKBprzyI9BaBoqN",
          "author": "Lucas Pardue",
          "description": "h3i is a command line tool and Rust library designed for low-level testing and debugging of HTTP/3, which runs over QUIC.",
          "link": "https://blog.cloudflare.com/h3i/",
          "publishedOn": "2024-12-30T14:00:00.000Z",
          "wordCount": 5021,
          "title": "Open sourcing h3i: a command line tool and library for low-level HTTP/3 testing and debugging",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/49kGUhFhN2iZIdcgGwDL6l/9f70e5deb1d4148f41be228340633c66/Open_sourcing_h3i-_a_command_line_tool_and_library_for_low-level_HTTP_3_testing_and_debugging-OG.png"
        },
        {
          "id": "1zc4C9M6VIkj5TrfugGxum",
          "author": "Mari Galicer",
          "description": "This roundup blog post shares the latest new features and capabilities at Cloudflare.",
          "link": "https://blog.cloudflare.com/masque-now-powers-1-1-1-1-and-warp-apps-dex-available-with-remote-captures/",
          "publishedOn": "2024-12-27T14:00:00.000Z",
          "wordCount": 1727,
          "title": "What’s new in Cloudflare: MASQUE now powers 1.1.1.1 & WARP apps, DEX now generally available with Remote Captures",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/5zrTvvNWjdNCJGCScEAReA/9934881512fae110663c5de87ea8ffc0/What_s_new_in_Cloudflare-_MASQUE_now_powers_1.1.1.1___WARP_apps__DEX_now_generally_available_with_Remote_Captures-OG.png"
        },
        {
          "id": "4Xek2BRcXVKNsI4vCa3Zuj",
          "author": "Thibault Meunier",
          "description": "If you want to know what cache revalidation is, how it works, and why it can involve rolling a die, read on. This blog post presents a lock-free probabilistic approach to cache revalidation, along",
          "link": "https://blog.cloudflare.com/sometimes-i-cache/",
          "publishedOn": "2024-12-26T14:00:00.000Z",
          "wordCount": 2952,
          "title": "Sometimes I cache: implementing lock-free probabilistic caching",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3IAq3KKuEXijAkIY8E3rgU/b0aa6e8f62c10cd392fa858fcb849169/BLOG-2639_OGa.png"
        },
        {
          "id": "6OAfYNDjjJBccE1gFIVrnu",
          "author": "Taylor Smith",
          "description": "How I used Workers AI to translate Cloudflare Stream’s auto-generated captions and what I learned along the way.",
          "link": "https://blog.cloudflare.com/un-experimento-rapido-translating-cloudflare-stream-captions-with-workers-ai/",
          "publishedOn": "2024-12-24T14:00:00.000Z",
          "wordCount": 2565,
          "title": "Un experimento rápido: translating Cloudflare Stream captions with Workers AI",
          "imageUrl": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/1jxmEMtgmRjqJZ3yvlLlas/af6f9f70fa96b9594e09d412f79be3e0/Un_experimento_ra_pido-_translating_Cloudflare_Stream_captions_with_Workers_AI-OG.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Engineering at Slack",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": []
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": []
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=42553307",
          "author": "davidclark",
          "description": "> Credit card delinquency rates, which are seen as a precursor to write-offs, peaked in July, according to data from Moody’s, but have only fallen slightly and remain nearly a percentage point higher than they were on average in the year before the pandemic.\nThis is a prime example of a style of reporting that really grinds my gears.\nThe citation is clearly to another internet source, so a link should be provided. If it truly cannot be linked because it is private, more context is still needed to understand what this data means.\nI actually can’t find the source myself, but I can find “Delinquency Rate on Credit Card Loans, All Commercial Banks” from the Federal Reserve. [1]\nThe percents from that source somewhat match those referenced in the FT quote. “Peaked in July”\n- 2024Q1 3.15%\n- 2024Q2 3.24%\n- 2024Q3 3.23%\nUsing 2019 as “the year before the pandemic”, the average was 2.5825. Is +0.6475 “nearly a percentage point”? I guess it technically would round up.\nSeemingly important context that the quote doesn’t give is that 3.23% is lower than any time 1991Q3 to 2011Q4. But, maybe the trend matters more for this metric.\n[1] https://fred.stlouisfed.org/series/DRCCLACBS",
          "link": "https://news.ycombinator.com/item?id=42553307",
          "publishedOn": "2024-12-30T20:46:04.000Z",
          "wordCount": 2355,
          "title": "New comment by davidclark in \"US credit card defaults jump to highest level since 2010\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42543338",
          "author": "jmclnx",
          "description": "Looking back, to me he was a much better president then people believed in the 80s.\nI believe if he got re-elected in 1980, the US would be in a much better place.  One thing, it could be argued real work on Climate Change would have begun in 1981 as opposed to where we are now, which is just watching the average probably blowing past 3C in around 70 years from now.\nFor his loss in 1980, I still blame Kennedy.\nRIP, he did a lot to help regular people through his life, far more than our current crop of politicians.",
          "link": "https://news.ycombinator.com/item?id=42543338",
          "publishedOn": "2024-12-29T21:26:37.000Z",
          "wordCount": 23128,
          "title": "New comment by jmclnx in \"Jimmy Carter has died\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42537165",
          "author": "jchw",
          "description": "What I want is very simple: I want software that doesn't send anything to the Internet without some explicit intent first. All of that work to try to make this feature plausibly private is cool engineering work, and there's absolutely nothing wrong with implementing a feature like this, but it should absolutely be opt-in.\nTrust in software will continue to erode until software stops treating end users and their data and resources (e.g. network connections) as the vendor's own playground. Local on-device data shouldn't be leaking out of radio interfaces unexpectedly, period. There should be a user intent tied to any feature where local data is sent out to the network.\nSo why didn't Apple just simply ask for user permission to enable this feature? My cynical opinion is because Apple knows some portion of users would instantly disallow this if prompted, but they feel they know better than those users. I don't like this attitude, and I suspect it is the same reason why there is an increasing discontent growing towards opt-out telemetry, too.",
          "link": "https://news.ycombinator.com/item?id=42537165",
          "publishedOn": "2024-12-29T03:17:21.000Z",
          "wordCount": 15034,
          "title": "New comment by jchw in \"Apple Photos phones home on iOS 18 and macOS 15\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42534096",
          "author": "scosman",
          "description": "\"I don't understand most of the technical details of Apple's blog post\"\nI do:\n- Client side vectorization: the photo is processed locally, preparing a non-reversible vector representation before sending (think semantic hash).\n- Differential privacy: a decent amount of noise is added the the vector before sending it. Enough to make it impossible to reverse lookup the vector. The noise level here is ε = 0.8, which is quite good privacy.\n- OHTTP relay: it's sent through a 3rd party so Apple never knows your IP address. The contents are encrypted so the 3rd party never doesn't learn anything either (some risk of exposing \"IP X is an apple photos user\", but nothing about the content of the library).\n- Homomorphic encryption: The lookup work is performed on server with encrypted data. Apple can't decrypt the vector contents, or response contents. Only the client can decrypt the result of the lookup.\nThis is what a good privacy story looks like. Multiple levels of privacy security, when any one of the latter 3 should be enough alone to protect privacy.\n\"It ought to be up to the individual user to decide their own tolerance for the risk of privacy violations.\" -> The author themselves looks to be an Apple security researcher, and are saying they can't make an informed choice here.\nI'm not sure what the right call is here. But the conclusion \"Thus, the only way to guarantee computing privacy is to not send data off the device.\" isn't true. There are other tools to provide privacy (DP, homomorphic encryption), while also using services. They are immensely complicated, and user's can't realistically evaluate risk. But if you want features that require larger-than-disk datasets, or frequently changing content, you need tools like this.",
          "link": "https://news.ycombinator.com/item?id=42534096",
          "publishedOn": "2024-12-28T20:03:43.000Z",
          "wordCount": null,
          "title": "New comment by scosman in \"Apple Photos phones home on iOS 18 and macOS 15\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42533327",
          "author": "HarHarVeryFunny",
          "description": "Maybe not your company, but it seems hiring companies brought this upon themselves with immediate AI rejects of qualified candidates, ghost jobs, ghosting candidates after interview, etc, etc.\nIf it takes a qualified candidate 100's of applications to land a single interview, then can you blame someone for automating it? I'd say that having the initiative and ability to automate it well would make this guy a great hire, if he hadn't already found a job!",
          "link": "https://news.ycombinator.com/item?id=42533327",
          "publishedOn": "2024-12-28T18:41:49.000Z",
          "wordCount": null,
          "title": "New comment by HarHarVeryFunny in \"I automated my job application process\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42527809",
          "author": "noodlesUK",
          "description": "There are significant downsides to the digitalization of travel documents. The biggest one I can think of is ownership - the UK is moving to an entirely digital visa system and bringing in an ESTA style system called ETA for visa free countries. Unfortunately this means that residency cards for noncitizens are being phased out. This means that when the Home Office messes up and accidentally deletes your immigration status, or you are at an airport with no internet access, you have no evidence whatsoever of what status you hold. It also means you will no longer be in possession of any records that might be useful years in the future when the current database containing immigration records will likely have been replaced. It’s much easier to keep a piece of paper around for 30+ years than it is to make sure a digital record doesn’t rot in that time.\nI feel strongly that any future digital travel credentials that are offered by governments should be able to operate entirely offline, and provide records that can be retained by the data subject. That means that revocation is harder, but IMO that’s a tradeoff that is worth making to avoid another Windrush scandal.\nThis has already become a pain when dealing with countries that don’t stamp passports, because when you need to apply for something that asks for your travel history over the past 10 years, you might not have any records anymore.",
          "link": "https://news.ycombinator.com/item?id=42527809",
          "publishedOn": "2024-12-28T01:40:00.000Z",
          "wordCount": null,
          "title": "New comment by noodlesUK in \"The paper passport's days are numbered\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42527549",
          "author": "dlisboa",
          "description": "Coming from a Latin American the idea of re-starting your life across the country for college and then again for work (multiple times sometimes) while away from family and friends is very foreign.\nA lot of the conversation around modern American youth feeling isolated, lacking socialization and not building strong relationships seems that stem from this drive.\nAnother thing that’s really weird and related is another recurring theme in the American ethos: the cultural shame that comes with living “at home” or staying in the same small town for your whole life. Somehow they made it so living close to your family and friends for your 20s-30s  and maybe forever means you’re a “loser”.",
          "link": "https://news.ycombinator.com/item?id=42527549",
          "publishedOn": "2024-12-28T00:51:31.000Z",
          "wordCount": 17393,
          "title": "New comment by dlisboa in \"Should more of us be moving to live near friends?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42522209",
          "author": "paxys",
          "description": "I don't understand why they are spending so much time and effort trying to put a positive spin on this whole for-profit thing. No one is buying it. We all know what's going on. Just say \"we want to make lots of money\" and move on with your lives.",
          "link": "https://news.ycombinator.com/item?id=42522209",
          "publishedOn": "2024-12-27T14:17:28.000Z",
          "wordCount": null,
          "title": "New comment by paxys in \"Why OpenAI's Structure Must Evolve to Advance Our Mission\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42517852",
          "author": "mitchellh",
          "description": "https://mitchellh.com/writing/ghostty-1-0-reflection",
          "link": "https://news.ycombinator.com/item?id=42517852",
          "publishedOn": "2024-12-26T21:12:10.000Z",
          "wordCount": null,
          "title": "New comment by mitchellh in \"Ghostty 1.0\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42511276",
          "author": "K0nserv",
          "description": "I've been thinking about the notion of \"reasoning locally\" recently. Enabling local reasoning is the only way to scale software development past some number of lines or complexity. When reasoning locally, one only needs to understand a small subset, hundreds of lines, to safely make changes in programs comprising millions.\nI find types helps massively with this. A function with well-constrained inputs and outputs is easy to reason about. One does not have to look at other code to do it. However, programs that leverage types effectively are sometimes construed as having high cognitive load, when it in fact they have low load. For example a type like `Option>` carries a lot of information(has low load): we might not have a set of user ids, but if we do they are unique.\nThe discourse around small functions and the clean code guidelines is fascinating. The complaint is usually, as in this post, that having to go read all the small functions adds cognitive load and makes reading the code harder. Proponents of small functions argue that you don't have to read more than the signature and name of a function to understand what it does; it's obvious what a function called last that takes a list and returns an optional value does. If someone feels compelled to read every function either the functions are poor abstractions or the reader has trust issues, which may be warranted. Of course, all abstractions are leaky, but perhaps some initial trust in `last` is warranted.",
          "link": "https://news.ycombinator.com/item?id=42511276",
          "publishedOn": "2024-12-25T21:26:35.000Z",
          "wordCount": null,
          "title": "New comment by K0nserv in \"Cognitive load is what matters\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42507005",
          "author": "delibaltas",
          "description": "Christmas of 1981 in Athens, Greece. I was 15. Father had died 3 years ago from heart attack at 42. His last words to my mother: \"Educate the kids\".\nShe did her best, given that my grandfather was old fashioned and had stopped her from going to school after she became twelve, although she was among the smartest in her class.\nThat Christmas she had bought me the brand new then Sinclair ZX81 personal computer. We were visiting the grandparents in a small village near Athens.\nI spend the night by the fireplace with a small portable TV and the machine, typing in games published in the UK PC magazines of that time and occasionally watching the Chrstmas shows. Debugging my typos was the way I learned how programming works.\nNothing really interesting here, but I am remembering that night again and again so when I saw the prompt I felt I should share. Merry Christmas everyone.",
          "link": "https://news.ycombinator.com/item?id=42507005",
          "publishedOn": "2024-12-25T05:14:55.000Z",
          "wordCount": null,
          "title": "New comment by delibaltas in \"Merry Christmas Everyone\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42506783",
          "author": "jedberg",
          "description": "I'm Jewish, so all my Christmas's growing up were kinda the same.  Sleep in, have brunch, wander over to my neighbor's house around noon to see what kind of loot they got and help them play with their new toys.  Sometimes we'd go out for Chinese food and a movie.\nBut my favorite was Christmas 1999.  My girlfriend was out of town with her family and there was no reason to go home to mine, so I was alone (my roommates were with their families too).  I decided to go to the movies in Emeryville.\nI was going to see Galaxy Quest, Bicentennial Man, and Man on the Moon.  The timing lined up perfectly to see all three.  About 50 other people were there to do the same thing.  When it was time to go in for the first movie, a staff member came out and told us that it would start about 30 minutes late.  This would of course cause us to miss all the other movies.\nAbout 30 people stepped forward at the same time and asked to speak to the manager. :). We explained to him that it would throw our whole schedule off.  Since it was Christmas, he was kind enough to adjust the schedule so that we could all see all three movies.\nThat was a great day.",
          "link": "https://news.ycombinator.com/item?id=42506783",
          "publishedOn": "2024-12-25T04:14:14.000Z",
          "wordCount": null,
          "title": "New comment by jedberg in \"Merry Christmas Everyone\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42506408",
          "author": "voxelghost",
          "description": "I don't know why, but I imagine a situation where all communication has broken down, and the only working sensor is the one in the piss-tank, and the astronauts have to communicate in morse by modulating the delta in the tank. And some guy  with ADHD, and this menu bar app installed, is going to figure out whats going on what is going on, and  save them all. (Hey, Hollywood - if this turns into a movie - I want my royalties)",
          "link": "https://news.ycombinator.com/item?id=42506408",
          "publishedOn": "2024-12-25T02:22:06.000Z",
          "wordCount": 2369,
          "title": "New comment by voxelghost in \"macOS menu bar app that shows how full the ISS urine tank is in real time\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=42505561",
          "author": "btown",
          "description": "> I found out about the data stream from https://iss-mimic.github.io/Mimic/, which has considerably more and more interesting stats than just how full the piss tank is.\n> I will not be adding any of them.\nThis, right here, is how you communicate non-goals of a project. Just perfect open-source communication best practices. We all stand to learn from this project.\n(Though, predictably, some of us sit to interact with it.)",
          "link": "https://news.ycombinator.com/item?id=42505561",
          "publishedOn": "2024-12-24T22:59:18.000Z",
          "wordCount": 2737,
          "title": "New comment by btown in \"macOS menu bar app that shows how full the ISS urine tank is in real time\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/Personal-endebtment-and-debt",
          "author": "Jean Andreau",
          "description": "The year 2025 is considered by Christians to be a jubilee year under the banner of debt cancellation. To mark the occasion, the CADTM is republishing a series of articles on debt cancellation, the struggles for debt cancellation and the role of debt in political, social and geostrategic conflicts throughout history. \nEnglish\n\n/ \nAlternatives, \nDebt in History, \nHistoire Jubi EN",
          "link": "https://www.cadtm.org/Personal-endebtment-and-debt",
          "publishedOn": "2024-12-30T08:00:00.000Z",
          "wordCount": 5964,
          "title": "Personal endebtment and debt forgivness in the Roman empire",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L153xH80/7d67b536955c2d468284cb35bf57de-31f2b.png"
        },
        {
          "id": "https://www.cadtm.org/Debt-cancellation-in-the-land-of",
          "author": "Isabelle Ponet",
          "description": "The year 2025 is considered by Christians to be a jubilee year under the banner of debt cancellation. To mark the occasion, the CADTM is republishing a series of articles on debt cancellation, the struggles for debt cancellation and the role of debt in political, social and geostrategic conflicts throughout history. \nEnglish\n\n/ \nAlternatives, \nDebt in History, \nHistoire Jubi EN",
          "link": "https://www.cadtm.org/Debt-cancellation-in-the-land-of",
          "publishedOn": "2024-12-27T02:00:00.000Z",
          "wordCount": 4029,
          "title": "Debt cancellation in the land of Canaan in the first millennium BC",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L342xH180/20a7bfba697a4b2b949e4cdf2201ed-c5572.jpg"
        },
        {
          "id": "https://www.cadtm.org/Long-cycles",
          "author": "Michael Roberts",
          "description": "I have long been sympathetic to the concept of long cycles in capitalist production and accumulation. This is the idea that capitalist production moves in cycles, not just in booms and slumps every 8-10 years or so, but also there are longer periods of generally faster accumulation and output growth ie periods of relative prosperity followed by a periods of relatively slower accumulation and growth, with more recessions. These longer cycles or waves last around 50-60 years including the (...)\nEnglish\n\n/ \nCrisis, \nCapitalism",
          "link": "https://www.cadtm.org/Long-cycles",
          "publishedOn": "2024-12-24T14:13:39.000Z",
          "wordCount": 2235,
          "title": "Long cycles",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L429xH225/8afcebe1508c366ad56b02e46cdd2c-22910.png"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=9015",
          "author": "disassociated.com",
          "description": "Code is code, what difference does the font you choose in whatever app you use for coding possibly make? As long as the code works as intended, what does appearance have to do with it? But the conversation I found on the topic — which in fact started months ago — actually relates to a […]",
          "link": "https://disassociated.com/favourite-monospaced-font-coding/",
          "publishedOn": "2024-12-30T20:00:32.000Z",
          "wordCount": 317,
          "title": "Favourite monospaced font for coding, do people have such a thing?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9021",
          "author": "disassociated.com",
          "description": "Literary writers at The Sydney Morning Herald canvassed critics, editors, and writers, including Jane Sullivan, David Free, Gyan Yankovich, and Beejay Silcox, to determine the best ten books of this century, or the last twenty-five years. Producing such a small list from a relatively long time frame, will doubtless generate discussion. Anyway, Praiseworthy by Alexis […]",
          "link": "https://disassociated.com/ten-best-novels-twenty-first-century/",
          "publishedOn": "2024-12-30T19:30:21.000Z",
          "wordCount": 214,
          "title": "The ten best novels of the twenty-first century to date",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9027",
          "author": "disassociated.com",
          "description": "I’m talking about the Australian downtempo electronica music act, not the public broadcaster of India. In the hubbub of the silly season, I forgot to mention a new album, Tranquil Motion, was released earlier this month. Track it down on Bandcamp, or your favourite music streamer. I could use some tranquil motion right now…",
          "link": "https://disassociated.com/music-tranquil-motion-new-album-all-india-radio/",
          "publishedOn": "2024-12-30T19:00:16.000Z",
          "wordCount": 166,
          "title": "Tranquil Motion, a new album from All India Radio",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=8992",
          "author": "disassociated.com",
          "description": "Xavier H.M., writing on his Mastodon page: Your neocities blog is cute but I can’t read the 5pt font and your cursor is the size of a bread crumb. The web page is loading so many gifs my computer sounds like a boeing 747. disassociated once, in a way, looked like a Neocities website. Or, […]",
          "link": "https://disassociated.com/the-web-today-is-not-necessarily-worse-than-the-early-web/",
          "publishedOn": "2024-12-26T20:00:36.000Z",
          "wordCount": 440,
          "title": "The web today is not necessarily worse than the early web",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9004",
          "author": "disassociated.com",
          "description": "Dark energy does not exist, and the universe, while continuing to expand, is not doing so in a uniform fashion. In other words, the cosmos may look more like a potato, rather than a sphere. This according to recent research by astronomers and scientists at the University of Canterbury (UC), based in Christchurch, New Zealand. […]",
          "link": "https://disassociated.com/time-not-dark-energy-causing-universe-expand/",
          "publishedOn": "2024-12-26T19:30:19.000Z",
          "wordCount": 389,
          "title": "Time, not dark energy, may be causing the universe to expand",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=9007",
          "author": "disassociated.com",
          "description": "The introverts among us live almost permanently in a sort of internal exile, or a rich inner life, as Waleed Aly referred to it during the COVID-19 lockdowns. But the idea of getting away from it all, without actually going anywhere, is gaining traction more widely, writes Jacqueline Maley, for The Sydney Morning Herald. This […]",
          "link": "https://disassociated.com/pack-books-internal-exile-2025/",
          "publishedOn": "2024-12-26T19:00:16.000Z",
          "wordCount": 247,
          "title": "Pack plenty of books and take yourself into internal exile in 2025",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": []
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    },
    {
      "title": "News Minimalist",
      "feedUrl": "https://rss.beehiiv.com/feeds/4aF2pGVAEN.xml",
      "siteUrl": "https://newsletter.newsminimalist.com/",
      "articles": [
        {
          "id": "https://newsletter.newsminimalist.com/p/new-ai-tool-will-identify-diabetes-risk-13-years-early-2-more-stories",
          "author": null,
          "description": "NHS launches trial for AI diabetes prediction; Eni unveils €100 million supercomputer for energy; UN Security Council approves peacekeeping in Somalia.",
          "link": "https://newsletter.newsminimalist.com/p/new-ai-tool-will-identify-diabetes-risk-13-years-early-2-more-stories",
          "publishedOn": "2024-12-28T17:44:35.000Z",
          "wordCount": 6692,
          "title": "New AI tool will identify diabetes risk 13 years early + 2 more stories",
          "imageUrl": "https://beehiiv-images-production.s3.amazonaws.com/uploads/publication/thumbnail/d0318cb6-0493-4e34-b055-76456e6c0f76/landscape_template__3_.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}