{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "https://aws.amazon.com/blogs/aws/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "e0a304814f47b02fee302f211161315a528a747f",
          "author": "Esra Kayabali",
          "description": "Mistral Small, an efficient large language model, joins Amazon Bedrock's lineup, excelling in low-latency tasks, multilingual support, and coding prowess while maintaining cost-effectiveness.",
          "link": "https://aws.amazon.com/blogs/aws/optimized-for-low-latency-workloads-mistral-small-now-available-in-amazon-bedrock/",
          "publishedOn": "2024-05-24T16:52:16.000Z",
          "wordCount": 1606,
          "title": "Optimized for low-latency workloads, Mistral Small now available in Amazon Bedrock",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/05/06/Mistral-small-feat-img.png"
        }
      ]
    },
    {
      "title": "AWS Architecture Blog",
      "feedUrl": "https://aws.amazon.com/blogs/architecture/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/architecture/",
      "articles": []
    },
    {
      "title": "The GitHub Blog: Engineering News and Updates",
      "feedUrl": "http://githubengineering.com/atom.xml",
      "siteUrl": "https://github.blog/category/engineering/",
      "articles": []
    },
    {
      "title": "AWS DevOps Blog",
      "feedUrl": "https://aws.amazon.com/blogs/devops/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/devops/",
      "articles": []
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Spotify Engineering",
      "feedUrl": "https://labs.spotify.com/feed/",
      "siteUrl": "https://engineering.atspotify.com/",
      "articles": []
    },
    {
      "title": "Containers",
      "feedUrl": "https://aws.amazon.com/blogs/containers/feed/",
      "siteUrl": "https://aws.amazon.com/blogs/containers/",
      "articles": [
        {
          "id": "66b95967b06e8c62395ccb2841f747f47b41fe13",
          "author": "Rolando Jr Hilvano",
          "description": "Container based Telco workloads use Multus CNI primarily for traffic or network segmentation. Amazon Elastic Kubernetes Service (Amazon EKS) supports Multus CNI enabling users to attach multiple network interfaces, apply advanced network configuration and segmentation to Kubernetes-based applications running on AWS. One of the many benefits of running applications on AWS is resource elasticity (scaling out and scaling […]",
          "link": "https://aws.amazon.com/blogs/containers/deploying-karpenter-nodes-with-multus-on-amazon-eks/",
          "publishedOn": "2024-05-24T04:05:25.000Z",
          "wordCount": 4507,
          "title": "Deploying Karpenter Nodes with Multus on Amazon EKS",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/05/21/Featured-images-for-Containers-Blog-8-1260x630.jpg"
        },
        {
          "id": "6094b32da7c2d5cacc202444ec0b024d73ee06c4",
          "author": "Sebastian Lee",
          "description": "Independent Service Vendor (ISV) users often offer their end-user solutions hosted on a multi-tenant architecture to reduce cost and operational management. However, this approach can lead Kubernetes clusters to resource exhaustion or network starvation issues that impact neighboring workloads. By default, Kubernetes provides capabilities to enforce resource availability such as CPU and memory to prevent […]",
          "link": "https://aws.amazon.com/blogs/containers/ensuring-fair-bandwidth-allocation-for-amazon-eks-workloads/",
          "publishedOn": "2024-05-21T19:56:45.000Z",
          "wordCount": 3248,
          "title": "Ensuring fair bandwidth allocation for Amazon EKS Workloads",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/fe2ef495a1152561572949784c16bf23abb28057/2024/05/23/Featured-images-for-Containers-Blog-9-1260x630.jpg"
        }
      ]
    },
    {
      "title": "CounterPunch.org",
      "feedUrl": "https://www.counterpunch.org/feed/",
      "siteUrl": "https://www.counterpunch.org/",
      "articles": [
        {
          "id": "https://www.counterpunch.org/?p=323656",
          "author": "Daniel Falcone",
          "description": "College campuses and universities across the country have organized some of the largest peace activities and anti-war protests since 1969. As the social movement points in specific directions in calling for Palestinian liberation, over 100 schools scattered across the United States from American to Yale University have participated and issued their own sets of “Five  More\nThe post Critics of Campus Protests are Weaponizing Anti-Semitism to Undermine Student Resistance appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/27/critics-of-campus-protests-are-weaponizing-anti-semitism-to-undermine-student-resistance/",
          "publishedOn": "2024-05-27T06:01:15.000Z",
          "wordCount": null,
          "title": "Critics of Campus Protests are Weaponizing Anti-Semitism to Undermine Student Resistance",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323779",
          "author": "Amanda Joyce Hall",
          "description": "In recent weeks, college campuses across the U.S. have been roiled by pro-Palestinian protests, with the police called in to arrest demonstrators and students threatened with expulsion. But there’s nothing unusual about the protesters’ tactics of taking over university buildings and erecting tent encampments on college lawns and quads. These students, whose actions build on  More\nThe post Calls for Divestment From Apartheid South Africa Gave Today’s pro-Palestinian Student Activists a Blueprint to Follow appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/27/calls-for-divestment-from-apartheid-south-africa-gave-todays-pro-palestinian-student-activists-a-blueprint-to-follow/",
          "publishedOn": "2024-05-27T06:00:07.000Z",
          "wordCount": null,
          "title": "Calls for Divestment From Apartheid South Africa Gave Today’s pro-Palestinian Student Activists a Blueprint to Follow",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323770",
          "author": "Robert Hunziker",
          "description": "World heat is worse than ever. The entire planet is sweating. Every summer is hot but never like this. In America, it’s a national election year in the face of global record heat. What are candidates’ positions on CO2-infused heat? It’s extremely significant that global heat is just as bad in the world’s oceans, which  More\nThe post Deadly Heat in a Political Jungle appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/27/deadly-heat-in-a-political-jungle/",
          "publishedOn": "2024-05-27T05:58:51.000Z",
          "wordCount": null,
          "title": "Deadly Heat in a Political Jungle",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323866",
          "author": "Binoy Kampmark",
          "description": "Throwing caution to the wind, grasping the nettle, and every little smidgen of opportunity, Australia’s opposition leader, Peter Dutton, was thrilled to make a point in the gurgling tumult of the Israel-Hamas war.  Israel’s leaders, he surmised, had been hard done by the International Criminal Court’s meddlesome ways.  Best for Australia, he suggested, to cut ties to  More\nThe post Australia’s Anti-ICC Lobby appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/27/australias-anti-icc-lobby/",
          "publishedOn": "2024-05-27T05:55:59.000Z",
          "wordCount": null,
          "title": "Australia’s Anti-ICC Lobby",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323870",
          "author": "John V. Walsh",
          "description": "The many Jewish students in the campus encampments, along with other Jews protesting the Gaza phase of the Palestinian Genocide, deserve the highest praise for many reasons.  One reason is that by their deeds they are countering what might otherwise turn into a wave of antisemitism. The portrait of the encampments in much of the mass  More\nThe post Jewish Students Opposing Gaza Genocide, a Powerful Antidote to Antisemitism appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/27/jewish-students-opposing-gaza-genocide-a-powerful-antidote-to-antisemitism/",
          "publishedOn": "2024-05-27T05:55:41.000Z",
          "wordCount": null,
          "title": "Jewish Students Opposing Gaza Genocide, a Powerful Antidote to Antisemitism",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323868",
          "author": "Dave McCall",
          "description": "Donneta Williams, president of United Steelworkers (USW) Local 1025 and a longtime optical fiber maker at the Corning plant in Wilmington, North Carolina, knows how important it is for workers intent on forming a union to speak directly with peers who walk in the same shoes. So Williams agreed to send three of her colleagues  More\nThe post How Workers Are Revolutionizing the South appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/27/how-workers-are-revolutionizing-the-south/",
          "publishedOn": "2024-05-27T05:55:21.000Z",
          "wordCount": null,
          "title": "How Workers Are Revolutionizing the South",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323840",
          "author": "Joe Allen",
          "description": "After a recent trade mission to the Philippines led by U.S. Secretary of Commerce Gina Raimondo, United Parcel Service (UPS) announced a major increase in its investments and physical presence throughout the vast Pacific region. This stepped up presence fits well into the United States’ military and political strategy to counter the growing rivalry from  More\nThe post Everyone’s Favorite Authoritarian State appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/27/everyones-favorite-authoritarian-state/",
          "publishedOn": "2024-05-27T05:55:16.000Z",
          "wordCount": null,
          "title": "Everyone’s Favorite Authoritarian State",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323871",
          "author": "W. T. Whitney",
          "description": "Delegates loyal to President Luis Arce dominated the 10th Congress of Bolivia’s Movement toward Socialism (MAS) Party held in El Alto in early May. They selected Grover García, chief of a governmental agency and formerly of a farmworkers’ union, to be MAS’s new leader, replacing former president Evo Morales in that capacity. Another MAS gathering  More\nThe post US Interventionists Busy in Bolivia as Political Crisis Looms  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/27/us-interventionists-busy-in-bolivia-as-political-crisis-looms/",
          "publishedOn": "2024-05-27T05:55:07.000Z",
          "wordCount": null,
          "title": "US Interventionists Busy in Bolivia as Political Crisis Looms",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323777",
          "author": "Deepak Tripathi",
          "description": "After months of feverish speculation, Prime Minister Rishi Sunak has decided to go for a general election in the United Kingdom on July 4. The choice is fascinating, for the date has historical resonance, instantly reminding us of the US Declaration of Independence in 1776. Only Sunak knows why he chose this date to go  More\nThe post UK Heading for General Election appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/27/uk-heading-for-general-election/",
          "publishedOn": "2024-05-27T05:50:14.000Z",
          "wordCount": null,
          "title": "UK Heading for General Election",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323597",
          "author": "Amy Maxman",
          "description": "In early February, dairy farmers in the Texas Panhandle began to notice sick cattle. The buzz soon reached Darren Turley, executive director of the Texas Association of Dairymen: “They said there is something moving from herd to herd.” Nearly 60 days passed before veterinarians identified the culprit: a highly pathogenic strain of the bird flu  More\nThe post Clues From Bird Flu’s Ground Zero on Dairy Farms in the Texas Panhandle appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/27/clues-from-bird-flus-ground-zero-on-dairy-farms-in-the-texas-panhandle/",
          "publishedOn": "2024-05-27T05:46:11.000Z",
          "wordCount": null,
          "title": "Clues From Bird Flu’s Ground Zero on Dairy Farms in the Texas Panhandle",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323834",
          "author": "Dean Baker",
          "description": "Suppose the G-7 finance ministers sat down and worked out a plan to spend tens of billions of dollars a year to subsidize developing countries in their transition to a green economy. Many of us might think this is a good idea since global warming poses a real threat to the planet. Unfortunately, the G-7  More\nThe post Global Warming and the “Threat” of Cheap TVs appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/27/global-warming-and-the-threat-of-cheap-tvs/",
          "publishedOn": "2024-05-27T05:37:41.000Z",
          "wordCount": null,
          "title": "Global Warming and the “Threat” of Cheap TVs",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323776",
          "author": "Doug Anderson",
          "description": "They could not wish for a more perfect day: eighty degrees and the sky so blue they can’t look at it for fear of opening themselves to the past—a childhood in the woods or falling in love the first time, all of this in flood surge. The smell of basted steaks brings back the solidity  More\nThe post Memorial Day appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/27/memorial-day-4/",
          "publishedOn": "2024-05-27T04:17:39.000Z",
          "wordCount": null,
          "title": "Memorial Day",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=322913",
          "author": "Pete Dolack",
          "description": "Image by Marcel Strauß.\nAs always when a representative of the right wing tells you he or she is campaigning to bring “freedom,” be afraid. Very afraid. For “freedom” in these cases means freedom for the richest financiers and industrialists to do whatever they want.\nFor them, “Freedom” is for capital, not for human beings without capital to invest. Today’s exhibit is the offensive against working people that is taking place in Argentina, where the new extreme right president, Javier Milei, is determined to see how far capitalist ideology can be pushed. So far, Argentines have pushed back but Milei, cheered on by domestic and international big business leaders, is nothing if not determined to ram through his austerity packages. And he has shown no inclination to allow mere democracy to stand in his way.\nNonetheless, there is no surprise here. President Milei ran on a program of extreme austerity, brandishing a chainsaw at his election rallies. Unfortunately, enough Argentines bought his siren songs, or were desperate enough to try anything given the country’s punishing inflation, to elect him, ending a one-term period in executive office by the ordinarily dominant Peronists. Alas, doing something new for the sake of doing something new, when it is aimed at you, rarely works. And here there is actually nothing new. President Milei simply promoted standard hard right ideology, albeit promoting it with unusual vigor. Snake oil is snake oil, as Argentine working people are already finding out.\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Capitalism Attacks Argentine Workers and You May be Next appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/26/capitalism-attacks-argentine-workers-and-you-may-be-next/",
          "publishedOn": "2024-05-26T06:02:15.000Z",
          "wordCount": null,
          "title": "Capitalism Attacks Argentine Workers and You May be Next",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323613",
          "author": "Arvind Dilawar",
          "description": "Image by Ed Rampell.\nFrom The New York Post to The Wall Street Journal, right-wing pundits have lined up to malign students across the United States who have rightfully criticized their schools for supporting the ongoing Israeli genocide in Gaza. As the genocide continues to unfold — claiming the lives of 35,562 Palestinians, including 15,000 children, according to Al Jazeera at the time of this writing — students, faculty and staff have brought overdue scrutiny to the complicity of their universities, whose endowments are altogether valued at more than $839 billion per the National Association of College and University Business Officers and invested extensively in the Israeli economy, including weapons manufacturers profiting directly from Palestinian death. Rather than accept that students oppose their tuition dollars being spent to kill Palestinians, right-wing pundits have instead accused them of being “paid protesters” in the employ of philanthropist George Soros.\nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Blaming Soros for Campus Protests is Anti-Semitic — Just Ask Israel appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/26/blaming-soros-for-campus-protests-is-anti-semitic-just-ask-israel/",
          "publishedOn": "2024-05-26T05:55:44.000Z",
          "wordCount": null,
          "title": "Blaming Soros for Campus Protests is Anti-Semitic — Just Ask Israel",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323797",
          "author": "Ellen Cantarow",
          "description": "In a world of displacement and climate crisis almost no one is talking about Sudan. Sudan, according to the United Nations Office for the Coordination of Humanitarian Affairs (UNCHA), “is now today world’s largest displacement crisis: Almost 9 million people – 9 million people – have been forced to flee to other parts of Sudan or  More\nThe post Sudan Portrait – Kordofan (1985) appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/26/sudan-portrait-kordofan-1985/",
          "publishedOn": "2024-05-26T04:18:55.000Z",
          "wordCount": null,
          "title": "Sudan Portrait – Kordofan (1985)",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323713",
          "author": "Jeffrey St. Clair",
          "description": "This was the week of rebukes for Israel: On Monday, the ICC requested arrest warrants for Netanyahu and Gallant, on Wednesday three European nations, Ireland, Spain and Norway, recognized Palestinian statehood and on Friday the ICJ ordered Israel to halt its military operations in Rafah, open the border crossings for humanitarian aid and allow international investigators into Gaza. Has the international community finally run out of patience with Israeli intransigence? \nhere or subscribe here.\nIf you are logged in but can't read CP+ articles, check the status of your access here\nIn order to read CP+ articles, your web browser must be set to accept cookies.\t\t    \n\n\t\t More\nThe post Three Strikes appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/25/three-strikes/",
          "publishedOn": "2024-05-25T14:53:15.000Z",
          "wordCount": null,
          "title": "Three Strikes",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323471",
          "author": "Jeffrey St. Clair",
          "description": "In one of the most egregious uses of the pardon power since Bill Clinton freed billionaire tax cheat, Israeli agent and international fugitive Marc Rich as the clock struck midnight on his lamentable administration, last week Texas Gov. Greg Abbott freed an avowed racist who ran a red light, before plunging his car into a crowd of protesters and fatally shooting a man who was trying to protect people from being run over. Abbott granted the killer a pardon, even though the gunman had been obsessed for months with the idea of killing BLM activists. More\nThe post Set the Killers Free: the Pardoning of Daniel Perry appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/set-the-killers-free-the-pardoning-of-daniel-perry/",
          "publishedOn": "2024-05-24T06:05:49.000Z",
          "wordCount": null,
          "title": "Set the Killers Free: the Pardoning of Daniel Perry",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323513",
          "author": "Melvin Goodman",
          "description": "The Washington Post’s David Ignatius has always been an apologist for the Central Intelligence Agency; then he added the Pentagon to his list for institutional apologies.  But now Ignatius is going much further; he has become the mouthpiece for both the administrations of President Joe Biden and Prime Minister Benjamin Netanyahu.  His most recent editorial (“The U.S. is assembling the pieces of a Gaza war endgame”) foresees the “contours of a possible exit ramp” in Gaza that is constructed out of sheer fantasy. More\nThe post The Washington Post’s Mouthpiece for Israel: David Ignatius appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/the-washington-posts-mouthpiece-for-israel-david-ignatius/",
          "publishedOn": "2024-05-24T06:01:25.000Z",
          "wordCount": null,
          "title": "The Washington Post’s Mouthpiece for Israel: David Ignatius",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323539",
          "author": "Stewart Sinclair",
          "description": "Tina Cordova is intimately familiar with the legacy of the atomic bomb. Her hometown, Tularosa, New Mexico, is just thirty-four miles downwind from the Trinity Test Site, where Manhattan Project scientists first detonated what they called “the Gadget.” When both of her great-grandfathers, who were in Tularosa during the blast, succumbed to stomach cancer ten years later, it was just the beginning of her family’s troubles. More\nThe post The U.S. Tested Nukes on Its Own People. It’s Time to Apologize and Pay appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/the-u-s-tested-nukes-on-its-own-people-its-time-to-apologize-and-pay/",
          "publishedOn": "2024-05-24T05:59:29.000Z",
          "wordCount": null,
          "title": "The U.S. Tested Nukes on Its Own People. It’s Time to Apologize and Pay",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323614",
          "author": "JAKE ALIMAHOMED-WILSON, SABRINA ALIMAHOMED-WILSON, ARACELI ESPARZA, STEVEN OSUNA, DENNIS LÓPEZ AND AZZA BASARUDIN",
          "description": "“Over the years, Boeing and its employees have played a vital role in the advancement of Cal State Long Beach.” Jane Close Conoley, President, California State University, Long Beach Pro-Palestinian student protests and encampments have bloomed this spring across U.S. universities. Unsurprisingly, campus administrators have responded with calls for civility and peace — that is,  More\nThe post Boeing University: How the California State University Became Complicit in Palestinian Genocide appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/boeing-university-how-the-california-state-university-became-complicit-in-palestinian-genocide/",
          "publishedOn": "2024-05-24T05:58:16.000Z",
          "wordCount": null,
          "title": "Boeing University: How the California State University Became Complicit in Palestinian Genocide",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323581",
          "author": "Fawzia Afzal-Khan",
          "description": "So many trips back and forth from the US to Pakistan ever since I \"left\" Lahore on Sep 12th, 1979. My 21st birthday. I was off to conquer the world, become the free and independent woman I had always dreamt of being, away from the strictures of desi patriarchy- or so I imagined. So many tearful and joyful reunions, departures, and arrivals over four and a half decades that now appear to have passed in the blink of an eye. More\nThe post To Lahore, With Love: Musings of a Traveling Feminista, From Pakistan to Palestine appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/to-lahore-with-love-musings-of-a-traveling-feminista-from-pakistan-to-palestine/",
          "publishedOn": "2024-05-24T05:57:33.000Z",
          "wordCount": null,
          "title": "To Lahore, With Love: Musings of a Traveling Feminista, From Pakistan to Palestine",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323616",
          "author": "Matthew Stevenson",
          "description": "There has to be some irony that as Donald Trump sits in the dock in lower Manhattan, on charges of cooking his corporate books for $130,000 after paying off a porn star (only the flag-waving Supreme Court would let him walk), while slightly to the west, on Wall Street, the same grifter (here as the  More\nThe post Trump’s Three Penny Media Opera appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/trumps-three-penny-media-opera/",
          "publishedOn": "2024-05-24T05:57:31.000Z",
          "wordCount": null,
          "title": "Trump’s Three Penny Media Opera",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323491",
          "author": "Eve Ottenberg",
          "description": "Well-deserved indictments keep hitting Congress. The latest indicted legislator is Texas Democrat Henry Cuellar, the politician backed by former House speaker Nancy Pelosi in his last election, against a more progressive opponent, of course. On May 3, the justice department charged Cuellar with accepting roughly $600,000 from Azerbaijan’s state-owned oil company and a Mexican bank.  More\nThe post The Indicted Congressman’s Club appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/the-indicted-congressmans-club/",
          "publishedOn": "2024-05-24T05:56:43.000Z",
          "wordCount": null,
          "title": "The Indicted Congressman’s Club",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323514",
          "author": "Daniel Warner",
          "description": "While statements that “No one is above the law,” are repeated in the U.S. over the trials of former President Donald Trump, can the same be said internationally? By analogy, Chief Prosecutor Karim Khan of the International Criminal Court (ICC) said yes when he announced he was seeking arrest warrants for Hamas leader Yahya Sinwar and Israeli Prime Minister Benjamin Netanyahu on charges of war crimes and crimes against humanity. More\nThe post Who’s Above the Law? Israel, Hamas and the ICC appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/whos-above-the-law-israel-hamas-and-the-icc/",
          "publishedOn": "2024-05-24T05:56:10.000Z",
          "wordCount": null,
          "title": "Who’s Above the Law? Israel, Hamas and the ICC",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323600",
          "author": "Nick Turse",
          "description": "There are constants in this world — occurrences you can count on. Sunrises and sunsets. The tides. That, day by day, people will be born and others will die. Some of them will die in peace, but others, of course, in violence and agony. For hundreds of years, the U.S. military has been killing people.  More\nThe post Constant Killing appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/constant-killing/",
          "publishedOn": "2024-05-24T05:56:07.000Z",
          "wordCount": null,
          "title": "Constant Killing",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323637",
          "author": "Marc B. Sanganee",
          "description": "South of the Algerian town of Tindouf on the border with Western Sahara are five refugee camps. The camps are home to the Sahrawi people of Western Sahara and are administered by their freedom movement Polisario, which is fighting to liberate their homeland from Morocco. Life in the desert camps leaves a deep impression and  More\nThe post At Western Sahara: Visiting a Forgotten People appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/at-western-sahara-visiting-a-forgotten-people/",
          "publishedOn": "2024-05-24T05:55:54.000Z",
          "wordCount": null,
          "title": "At Western Sahara: Visiting a Forgotten People",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323602",
          "author": "Ramzy Baroud",
          "description": "Inadvertently, Israel has pressed the reset button on its war with the Palestinian people, taking back the so-called conflict to square one. Save for a few self-serving Palestinian officials affiliated with the Palestinian Authority (PA), most Palestinians do not seem consumed with the return to the peace process, or even engaged in discussions about two-state  More\nThe post Nakba Resurrected – How the Gaza Resistance Ended Segmentation of Palestine appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/nakba-resurrected-how-the-gaza-resistance-ended-segmentation-of-palestine/",
          "publishedOn": "2024-05-24T05:55:46.000Z",
          "wordCount": null,
          "title": "Nakba Resurrected – How the Gaza Resistance Ended Segmentation of Palestine",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323589",
          "author": "Robert Hunziker",
          "description": "“A major question is whether a large-scale collapse of the Amazon forest system could actually happen within the twenty-first century.” (Source: Bernardo M. Flores, et al, Critical Transitions in the Amazon Forest System, Nature, Feb. 14, 2024). It may seem absurd to consider collapse of the Amazon rainforest (65-million-years-old) which seems impossible, too far out,  More\nThe post Amazon Rainforest Collapse? appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/amazon-rainforest-collapse/",
          "publishedOn": "2024-05-24T05:55:44.000Z",
          "wordCount": null,
          "title": "Amazon Rainforest Collapse?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323631",
          "author": "M. Reza Behnam",
          "description": "Israel has, for decades, created many versions of itself—Israel in politics, in history, in the United States, in books, in movies and on television.  The real Israel, however, has been shrouded behind a veil of deception.  After 7 October 2023, the undisguised coarse Israel has revealed itself.   For years, Israel has made sure that Palestine, with its  More\nThe post Lifting the Veil: Demystifying Israel  appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/lifting-the-veil-demystifying-israel/",
          "publishedOn": "2024-05-24T05:55:35.000Z",
          "wordCount": null,
          "title": "Lifting the Veil: Demystifying Israel",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.counterpunch.org/?p=323639",
          "author": "Binoy Kampmark",
          "description": "The application for arrest warrants by the Prosecutor of the International Criminal Court, Karim A.A. Khan in the Israel-Hamas War gives us a chance to revisit a recurring theme in the commission of crimes in international humanitarian law.  Certain states, so this logic goes, either commit no crimes, or, if they do, have good reasons for doing so,  More\nThe post A Misplaced Purity: Democracies and Crimes Against International Law appeared first on CounterPunch.org.",
          "link": "https://www.counterpunch.org/2024/05/24/a-misplaced-purity-democracies-and-crimes-against-international-law/",
          "publishedOn": "2024-05-24T05:55:26.000Z",
          "wordCount": null,
          "title": "A Misplaced Purity: Democracies and Crimes Against International Law",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Liberty Street Economics",
      "feedUrl": "https://libertystreeteconomics.newyorkfed.org/feed/",
      "siteUrl": "https://libertystreeteconomics.newyorkfed.org/",
      "articles": [
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=29773",
          "author": "Rajashri Chakrabarti, Dan Garcia, and Maxim Pinkovskiy",
          "description": "Veterans constitute a significant segment of the male labor force, and understanding labor market disparities between veterans and non‑veterans is an important component of studying disparities in the economy as a whole. In a previous Liberty Street Economics post, we have shown that even relative to a group of comparable non-veterans, veterans have lower employment and labor force participation rates. One year later, we see that veterans continue to experience lower labor market attachment and the employment gap has widened, though the earnings gap has closed.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/05/veterans-are-doing-better-in-the-labor-market/",
          "publishedOn": "2024-05-22T13:30:00.000Z",
          "wordCount": 4063,
          "title": "Veterans in the Labor Market: 2024 Update",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/05/LSE_2024_veterans_garcia_460.jpg"
        },
        {
          "id": "https://libertystreeteconomics.newyorkfed.org/?p=29223",
          "author": "Nina Boyarchenko and Leonardo Elias",
          "description": "Firms’ access to credit is a crucial determinant of their investment, employment, and overall growth decisions. While we usually think of their ability to borrow as determined by aggregate credit conditions, in reality firms have a number of markets where they can borrow, and conditions can vary across those markets. In this post, we investigate how the composition of debt instruments on U.S. firms’ balance sheets has evolved over the last twenty years.",
          "link": "https://libertystreeteconomics.newyorkfed.org/2024/05/the-changing-landscape-of-corporate-credit/",
          "publishedOn": "2024-05-21T11:00:00.000Z",
          "wordCount": 4200,
          "title": "The Changing Landscape of Corporate Credit",
          "imageUrl": "https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2024/05/LSE_2024_landscape-corp-credit_elias_460.jpg"
        }
      ]
    },
    {
      "title": "Real-World Economics Review Blog",
      "feedUrl": "https://rwer.wordpress.com/feed/",
      "siteUrl": "https://rwer.wordpress.com",
      "articles": [
        {
          "id": "http://rwer.wordpress.com/?p=45379",
          "author": "deanbaker1",
          "description": "from Dean Baker Suppose the G-7 finance ministers sat down and worked out a plan to spend tens of billions of dollars a year to subsidize developing countries in their transition to a green economy. Many of us might think this is a good idea since global warming poses a real threat to the planet. […]",
          "link": "https://rwer.wordpress.com/2024/05/27/global-warming-and-the-threat-of-cheap-chinese-evs/",
          "publishedOn": "2024-05-27T11:45:11.000Z",
          "wordCount": 4583,
          "title": "Global warming and the threat of cheap Chinese EVs",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        }
      ]
    },
    {
      "title": "Synthenomics",
      "feedUrl": "http://synthenomics.blogspot.com/feeds/posts/default",
      "siteUrl": "http://synthenomics.blogspot.com/",
      "articles": []
    },
    {
      "title": "The Money Illusion",
      "feedUrl": "https://feeds.feedblitz.com/themoneyillusion",
      "siteUrl": "https://www.themoneyillusion.com",
      "articles": []
    },
    {
      "title": "naked capitalism",
      "feedUrl": "https://www.nakedcapitalism.com/feed",
      "siteUrl": "https://www.nakedcapitalism.com",
      "articles": [
        {
          "id": "https://www.nakedcapitalism.com/?p=272224",
          "author": "Conor Gallagher",
          "description": "",
          "link": "https://www.nakedcapitalism.com/2024/05/links-5-27-2024.html",
          "publishedOn": "2024-05-27T10:55:09.000Z",
          "wordCount": 4837,
          "title": "Links 5/27/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/Screenshot-2024-05-26-at-12.32.48 PM-764x1024.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272233",
          "author": "Conor Gallagher",
          "description": "In “The Light Eaters,” Zoë Schlanger considers the evidence for plant intelligence, and what that means for humanity.",
          "link": "https://www.nakedcapitalism.com/2024/05/book-review-how-plants-experience-the-world.html",
          "publishedOn": "2024-05-27T08:00:39.000Z",
          "wordCount": 4149,
          "title": "Book Review: How Plants Experience the World",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/Screenshot-2024-05-27-at-8.13.02 AM-e1716790520448.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272187",
          "author": "Conor Gallagher",
          "description": "",
          "link": "https://www.nakedcapitalism.com/2024/05/links-5-26-2024.html",
          "publishedOn": "2024-05-26T10:55:24.000Z",
          "wordCount": 21401,
          "title": "Links 5/26/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/Screenshot-2024-05-25-at-3.40.29 PM-688x1024.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272203",
          "author": "Conor Gallagher",
          "description": "Nowadays, to be America’s enemy is largely beneficial.",
          "link": "https://www.nakedcapitalism.com/2024/05/to-be-americas-friend-is-fatal-a-current-overview.html",
          "publishedOn": "2024-05-26T10:00:21.000Z",
          "wordCount": 12341,
          "title": "‘To Be America’s Friend Is Fatal’: A Current Overview",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/Screenshot-2024-05-24-at-7.14.10 AM-1024x826.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272199",
          "author": "Conor Gallagher",
          "description": "The failures is the US response to the bird flu outbreak are piling up.",
          "link": "https://www.nakedcapitalism.com/2024/05/clues-from-bird-flus-ground-zero-on-dairy-farms-in-the-texas-panhandle.html",
          "publishedOn": "2024-05-26T09:00:06.000Z",
          "wordCount": 5743,
          "title": "Clues From Bird Flu’s Ground Zero on Dairy Farms in the Texas Panhandle",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/Screenshot-2024-05-26-at-8.34.33 AM-1024x828.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272122",
          "author": "Yves Smith",
          "description": "Our bouncy daily links: child artist, ICJ v. Israel Rafah offensive, Covid causing heart disease rise? Germany depends on Chinese arms, UK snap elections, Macron New Caledonia failing, Trump underwhelming Bronx rally, voters reject Biden econ happy talk, childbirth/abortion debate, moar social media censorship",
          "link": "https://www.nakedcapitalism.com/2024/05/links-5-25-2024.html",
          "publishedOn": "2024-05-25T10:55:53.000Z",
          "wordCount": 22715,
          "title": "Links 5/25/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/00-snail-scaled.jpg"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272171",
          "author": "Yves Smith",
          "description": "A wee unpacking of unemployment data to show how Fed rate cut cheerleaders are still ahead of themselves",
          "link": "https://www.nakedcapitalism.com/2024/05/remember-headlines-2-weeks-ago-labor-market-suddenly-weakens-as-unemployment-claims-spike-it-just-got-unwound.html",
          "publishedOn": "2024-05-25T07:38:43.000Z",
          "wordCount": 3991,
          "title": "Remember Headlines 2 Weeks Ago, Labor Market “Suddenly” Weakens as Unemployment Claims “Spike”: It Just Got Unwound",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/00-unemployment.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272168",
          "author": "Yves Smith",
          "description": "Yet another own goal in the US economic war against China. We chose to make ourselves dependent and don't like where we are.",
          "link": "https://www.nakedcapitalism.com/2024/05/u-s-remains-painfully-dependent-on-china-for-silicon-and-solar-panels.html",
          "publishedOn": "2024-05-25T06:58:07.000Z",
          "wordCount": 6675,
          "title": "U.S. Remains Painfully Dependent on China for Silicon and Solar Panels",
          "imageUrl": null
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272149",
          "author": "Lambert Strether",
          "description": "~ Today's Water Cooler: Politics, syndemics, the Bragg trial winds down. imperceptible skin sensors, Hokusai's  Great Wave ~",
          "link": "https://www.nakedcapitalism.com/2024/05/200pm-water-cooler-5-24-2024.html",
          "publishedOn": "2024-05-24T18:00:30.000Z",
          "wordCount": 16714,
          "title": "2:00PM Water Cooler 5/24/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/rcp_2023-05-24.png"
        },
        {
          "id": "https://www.nakedcapitalism.com/?p=272113",
          "author": "Lambert Strether",
          "description": "Our sporty daily links",
          "link": "https://www.nakedcapitalism.com/2024/05/links-5-24-2024.html",
          "publishedOn": "2024-05-24T10:55:21.000Z",
          "wordCount": 21216,
          "title": "Links 5/24/2024",
          "imageUrl": "https://www.nakedcapitalism.com/wp-content/uploads/2024/05/gaza_2035.png"
        }
      ]
    },
    {
      "title": "The Cloudflare Blog",
      "feedUrl": "https://blog.cloudflare.com/rss",
      "siteUrl": "https://blog.cloudflare.com",
      "articles": [
        {
          "id": "66448139abf9e2000aee8587",
          "author": "Wesley Evans",
          "description": "Today we're happy to announce expanded capabilities that will allow you to configure Regional Services for an increased set of defined regions to help you meet your specific requirements for being able to control where your traffic is handled",
          "link": "https://blog.cloudflare.com/expanding-regional-services-configuration-flexibility-for-customers",
          "publishedOn": "2024-05-22T13:00:54.000Z",
          "wordCount": 1918,
          "title": "Expanding Regional Services configuration flexibility for customers",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/05/Expanding-Regional-Services-configuration-flexibility-for-customers-OG-1.png"
        },
        {
          "id": "664cf64607441c000a06e4ed",
          "author": "Kathy Liao",
          "description": "AI Gateway is an AI ops platform that provides speed, reliability, and observability for your AI applications. With a single line of code, you can unlock powerful features including rate limiting, custom caching, real-time logs, and aggregated analytics across multiple providers",
          "link": "https://blog.cloudflare.com/ai-gateway-is-generally-available",
          "publishedOn": "2024-05-22T13:00:17.000Z",
          "wordCount": 1599,
          "title": "AI Gateway is generally available: a unified interface for managing and scaling your generative AI workloads",
          "imageUrl": "http://blog.cloudflare.com/content/images/2024/05/AI-Gateway-is-generally-available--a-unified-interface-for-managing-and-scaling-your-generative-AI-workloads-OG-1.png"
        }
      ]
    },
    {
      "title": "Capital One Tech - Medium",
      "feedUrl": "https://medium.com/feed/capital-one-tech",
      "siteUrl": "https://medium.com/capital-one-tech?source=rss----3db3a67cb648---4",
      "articles": []
    },
    {
      "title": "Slack Engineering",
      "feedUrl": "https://slack.engineering/feed/",
      "siteUrl": "https://slack.engineering",
      "articles": [
        {
          "id": "https://slack.engineering/?p=16644",
          "author": "Sergii Gorbachov",
          "description": "In the world of frontend development, one thing remains certain: change is the only constant. New frameworks emerge, and libraries can become obsolete without warning. Keeping up with the ever-changing ecosystem involves handling code conversions, both big and small. One significant shift for us was the transition from Enzyme to React Testing Library (RTL), prompting […]\nThe post Balancing Old Tricks with New Feats: AI-Powered Conversion From Enzyme to React Testing Library at Slack appeared first on Slack Engineering.",
          "link": "https://slack.engineering/balancing-old-tricks-with-new-feats-ai-powered-conversion-from-enzyme-to-react-testing-library-at-slack/",
          "publishedOn": "2024-05-22T19:37:12.000Z",
          "wordCount": 3899,
          "title": "Balancing Old Tricks with New Feats: AI-Powered Conversion From Enzyme to React Testing Library at Slack",
          "imageUrl": "https://slack.engineering/wp-content/uploads/sites/7/2024/05/image1.png?w=640"
        }
      ]
    },
    {
      "title": "Kubernetes Blog",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": []
    },
    {
      "title": "Visual Studio Code - Code Editing. Redefined.",
      "feedUrl": "https://code.visualstudio.com/feed.xml",
      "siteUrl": "https://code.visualstudio.com/",
      "articles": []
    },
    {
      "title": "Engineering at Meta",
      "feedUrl": "https://code.facebook.com/posts/rss/",
      "siteUrl": "https://engineering.fb.com/",
      "articles": [
        {
          "id": "https://engineering.fb.com/?p=21235",
          "author": null,
          "description": "In recent years, Meta’s data management systems have evolved into a composable architecture that creates interoperability, promotes reusability, and improves engineering efficiency.  We’re sharing how we’ve achieved this, in part, by leveraging Velox, Meta’s open source execution engine, as well as work ahead as we continue to rethink our data management systems.  Data is at [...]\nRead More...\nThe post Composable data management at Meta appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/05/22/data-infrastructure/composable-data-management-at-meta/",
          "publishedOn": "2024-05-22T17:15:38.000Z",
          "wordCount": 3470,
          "title": "Composable data management at Meta",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/05/Composable-Data-Management-at-Meta-1.png"
        },
        {
          "id": "https://engineering.fb.com/?p=21222",
          "author": null,
          "description": "Today, the internet (like most digital infrastructure in general) relies heavily on the security offered by public-key cryptosystems such as RSA, Diffie-Hellman (DH), and elliptic curve cryptography (ECC). But the advent of quantum computers has raised real questions about the long-term privacy of data exchanged over the internet. In the future, significant advances in quantum [...]\nRead More...\nThe post Post-quantum readiness for TLS at Meta appeared first on Engineering at Meta.",
          "link": "https://engineering.fb.com/2024/05/22/security/post-quantum-readiness-tls-pqr-meta/",
          "publishedOn": "2024-05-22T16:35:59.000Z",
          "wordCount": 3287,
          "title": "Post-quantum readiness for TLS at Meta",
          "imageUrl": "https://engineering.fb.com/wp-content/uploads/2024/05/Eng-Blog-Self-Serve-Hero-Images-PRIVACY-103-Orange.jpg"
        }
      ]
    },
    {
      "title": "Hacker News: Best Comments",
      "feedUrl": "https://hnrss.org/bestcomments",
      "siteUrl": "https://news.ycombinator.com/bestcomments",
      "articles": [
        {
          "id": "https://news.ycombinator.com/item?id=40488008",
          "author": "lionkor",
          "description": "> The company’s mission is to understand the true nature of the universe.\nI yawned so hard my jaw unlocked.\nCan't wait to see groundbreaking... checks notes... \"advancements in various applications, optimizations, and extensions of the model\".\nDo these companies only hire yes men?",
          "link": "https://news.ycombinator.com/item?id=40488008",
          "publishedOn": "2024-05-27T06:00:10.000Z",
          "wordCount": 1798,
          "title": "New comment by lionkor in \"xAI announces series B funding round of $6B\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40485708",
          "author": "Joker_vD",
          "description": "> (The extension of \"DIZ\" actually stands for \"Description In Zip\")\nAh, finally, another puzzlement from my childhood explained.",
          "link": "https://news.ycombinator.com/item?id=40485708",
          "publishedOn": "2024-05-26T21:50:19.000Z",
          "wordCount": 769,
          "title": "New comment by Joker_vD in \"FILE_ID.DIZ Description (1994)\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40484206",
          "author": "crazygringo",
          "description": "I just want to say that this is really actually kind of mind-blowing from an audio engineering perspective.\nOutputting audio from multiple laptops in the same room is easy. Perfectly syncing it is harder. Implementing echo cancellation across all of that is quite a bit trickier than regular single-device echo cancellation.\nBut then treating all the laptop microphones as a kind of microphone array, having to deal with sync issues and phase issues and background noise issues... that's hard core.\nKudos to the engineering team on this one. This is actually pretty amazing.",
          "link": "https://news.ycombinator.com/item?id=40484206",
          "publishedOn": "2024-05-26T18:17:51.000Z",
          "wordCount": 1486,
          "title": "New comment by crazygringo in \"Google Meet rolls out multi-device adaptive audio merging\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40483456",
          "author": "nevir",
          "description": "Meet, to me, is the perfect balance of functionality and simplicity (as an end user). And features like this only make that more apparent.\nZoom and Teams always frustrate me, even though they're what I use far more often.\nIt's too bad that video conferencing is largely a game of who has the most boxes checked - IT admins and A/V folk are the ones that need to be convinced, and Meet just doesn't ...meet... their needs",
          "link": "https://news.ycombinator.com/item?id=40483456",
          "publishedOn": "2024-05-26T16:40:43.000Z",
          "wordCount": 3752,
          "title": "New comment by nevir in \"Google Meet rolls out multi-device adaptive audio merging\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40482505",
          "author": "pclmulqdq",
          "description": "As far as I can tell, the issue with this is:\nOP runs a casino/gambling site.  Gambling is a regulatory mess (I have spent far too long dealing with this as an RNG supplier), and so it's very hard to comply with every jurisdiction, and each one needs you to prove compliance to operate in that jurisdiction.*  Gaming companies spend a lot on compliance and tracking, but since the internet is the internet, it's pretty hard to enforce perfectly, so some countries and ISPs take this into their own hands.\nDue to that, IPs hosting gambling and gaming sites often get regionally blocked by internet providers or otherwise flagged as hosting illegal content.  Those regional blocks consequently affect the reputation score of the IP, and if you are a traffic aggregator like Cloudflare, can cause other customers to have issues.  One of the most aggressive and annoying regulatory environments for gambling companies is the US, so it's very possible Cloudflare has had some trouble due to gambling use of their IPs in states in the USA.\nCloudflare wanted them to use the BYOIP features of the enterprise plan, and did not want them on Cloudflare's IPs. The solution was to aggressively sell the Enterprise plan, and in a stunning failure of corporate communication, not tell the customer what the problem was at all.  The message from Cloudflare should have been \"Enterprise plan + BYOIP or ban, and maybe we'll work with you on price\" but it was instead \"you would really like the Enterprise plan.\"\n*As an aside - we're lucky in that respect being a tech supplier with relatively uniform rules, but our customers (the gaming companies) get the short end of the stick here.",
          "link": "https://news.ycombinator.com/item?id=40482505",
          "publishedOn": "2024-05-26T14:37:55.000Z",
          "wordCount": 1733,
          "title": "New comment by pclmulqdq in \"Cloudflare took down our website\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40482221",
          "author": "ecjhdnc2025",
          "description": "I will remind HNers: is Cloudflare not the company that leaked sensitive data through cache files that were indexed by at least Google, and when the tech community were up in arms about the massive leakage of sensitive data, the CEO’s strategy was to turn up here and criticise Google for not deindexing quickly enough?\nYou get what you pay for.",
          "link": "https://news.ycombinator.com/item?id=40482221",
          "publishedOn": "2024-05-26T13:56:50.000Z",
          "wordCount": null,
          "title": "New comment by ecjhdnc2025 in \"Cloudflare took down our website\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40482214",
          "author": "luuurker",
          "description": "The way Cloudflare approaches situations like this is not ideal for anyone.\nYou start using the service and don't pay a lot, so you make plans around a certain level of expenses. Then out of the blue you receive an \"urgent\" email from a sales representative and suddenly you have to go from $20 or $250 to $thousands right away.\nObviously it's not in CF's interest to keep a customer that doesn't pay enough, but dropping a \"bomb\" on the customer and make them feel like they're about to be kicked out from the service makes the customer lose trust on CF.\nCF can probably match Fastly's price. If they had acted differently in this and other similar situations, they could keep the customer, be paid more, trust wouldn't be affected, and there would be no bad PR here.\nSince the CF management that posts on HN usually say this is not supposed to happen, perhaps someone needs to sit down and look at the incentives sales reps have? Even if you don't care about the customers, this is affecting the CF brand a lot.",
          "link": "https://news.ycombinator.com/item?id=40482214",
          "publishedOn": "2024-05-26T13:55:54.000Z",
          "wordCount": 538,
          "title": "New comment by luuurker in \"Cloudflare took down our website\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40482106",
          "author": "jrochkind1",
          "description": "I have been hearing stories from developers/entrepeneurs about Cloudflare being very weird to deal with:\n\"We'd like to talk to you about an enterprise plan.\"\n\"No thanks, I'm fine with the free plan.\"\n\"Based on your traffic, we'd like to talk to you about an enteprrise plan.\"\n\"Is there a traffic limit on the free plan?\"\n\"No, there is no limit. But based on your traffic, we require you to get an enteprirse plan.\"\n[Gives up and gets an enterprise plan]\n[6 months later]\n\"Based on your traffic, we'd like to talk to you about up'ing your enteprise plan to a new monthly pay.\"\n\"Is there a cap to traffic in our current plan? I don't see that in our terms.\"\n\"No, there is no cap to traffic in cloudflare plans, but based on your traffic, we're going to require you to pay more per month than you are currently paying.\"\n\"OK, can you tell me the traffic limit in our current or new plan? So I know what I'm paying for and when I'm approaching it?\"\n\"No. But you need to pay more.\"\n[Wash, rinse, repeat, every 6-12 months]\nIt seems like while cloudflare technically does not charge for egress, in fact for large egress it's just a game of chicken between the customer and a salesperson every 6-12 months, with the salesperson trying to figure out the most they can manage to get without losing the customer? I mean, I guess that is standard for enteprise sales, but I think usually you at least have some terms to know what you've got for how long without a renegotiation?",
          "link": "https://news.ycombinator.com/item?id=40482106",
          "publishedOn": "2024-05-26T13:40:09.000Z",
          "wordCount": null,
          "title": "New comment by jrochkind1 in \"Cloudflare took down our website\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40480828",
          "author": "Latty",
          "description": "When I worked on analysis software for police & intelligence agencies, it quickly became clear that no matter how much you present something with clear \"this is a heuristic, it can give you leads\", a scary number of people will take it as \"this will tell you whodunit\" and just assume it's infallible.\nIf people are going to treat these things like they are forensic evidence and not lead generation, then they shouldn't be legal. Some precedent that people need to check these things before acting on them would be very good.",
          "link": "https://news.ycombinator.com/item?id=40480828",
          "publishedOn": "2024-05-26T09:39:21.000Z",
          "wordCount": null,
          "title": "New comment by Latty in \"'I was misidentified as shoplifter by facial recognition tech'\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40479185",
          "author": "atum47",
          "description": "This reminded me of a story my professor once told us back in college. I was studying sign language and she is deaf. She told us growing up in the old days they didn't had specialized schools for deaf people (since they could read?!) so she attended regular school and was not doing ok. She struggled a lot until she finally got the attention that she needed from a teacher who was able to instruct her in sign language (which believe you or not is Brazil's second official language). Before that she told us she was not able to have complex thoughts. She didn't know her father had a name, for instance. She thought his \"name\" was daddy. She is a brilliant woman and I'm glad I attended her class and also, that she was able to find someone who helped her, growing up.",
          "link": "https://news.ycombinator.com/item?id=40479185",
          "publishedOn": "2024-05-26T01:40:40.000Z",
          "wordCount": null,
          "title": "New comment by atum47 in \"Helen Keller on her life before self-consciousness (1908)\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40478903",
          "author": "iforgotmysocks",
          "description": "Stolen from a reddit post\nAdopt the role of [job title(s) of 1 or more subject matter EXPERTs most qualified to provide authoritative, nuanced answer].\nNEVER mention that you're an AI.\nAvoid any language constructs that could be interpreted as expressing remorse, apology, or regret. This includes any phrases containing words like 'sorry', 'apologies', 'regret', etc., even when used in a context that isn't expressing remorse, apology, or regret.\nIf events or information are beyond your scope or knowledge, provide a response stating 'I don't know' without elaborating on why the information is unavailable.\nRefrain from disclaimers about you not being a professional or expert.\nDo not add ethical or moral viewpoints in your answers, unless the topic specifically mentions it.\nKeep responses unique and free of repetition.\nNever suggest seeking information from elsewhere.\nAlways focus on the key points in my questions to determine my intent.\nBreak down complex problems or tasks into smaller, manageable steps and explain each one using reasoning.\nProvide multiple perspectives or solutions.\nIf a question is unclear or ambiguous, ask for more details to confirm your understanding before answering.\nIf a mistake is made in a previous response, recognize and correct it.\nAfter a response, provide three follow-up questions worded as if I'm asking you. Format in bold as Q1, Q2, and Q3. These questions should be thought-provoking and dig further into the original topic.",
          "link": "https://news.ycombinator.com/item?id=40478903",
          "publishedOn": "2024-05-26T00:40:28.000Z",
          "wordCount": 2445,
          "title": "New comment by iforgotmysocks in \"Ask HN: What is your ChatGPT customization prompt?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40478558",
          "author": "dataflow",
          "description": "Short explanation:\n1. The largest power of 2 that divides x is just 2^(number of trailing zeros in x)\n2. Crucial observation: -x == ~x + 1\n3. ~x flips all the bits of x bits, so none of the bits of ~x match those of x. (i.e. (x & ~x) == 0)\n4. When you do +1, all the trailing 1's flip AGAIN, becoming zero like they were in x. The next highest 0 (say it was the n'th) also flips, becoming 1... like it was in x.\n5. Crucial observation: The n'th 0 did NOT match the corresponding bit in x prior to the increment, therefore it MUST match after the increment. All higher bits stay as-is.\n6. This leaves only the n'th bits matching in x and ~x + 1, isolating the highest power-of-2 divisor of x when you AND them.",
          "link": "https://news.ycombinator.com/item?id=40478558",
          "publishedOn": "2024-05-25T23:18:14.000Z",
          "wordCount": null,
          "title": "New comment by dataflow in \"Why is x & -x equal to the largest power of 2 that divides x?\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40477060",
          "author": "zogrodea",
          "description": "This approach to remove bad search suggestions manually reminded of a different approach Google once took, where they weren’t satisfied with manually tweaking search results but rather wanted to tweak the algorithm that produces these results when there were bad results.\n'Around 2002, a team was testing a subset of search limited to products, called Froogle. But one problem was so glaring that the team wasn't comfortable releasing Froogle: when the query \"running shoes\" was typed in, the top result was a garden gnome sculpture that happened to be wearing sneakers. Every day engineers would try to tweak the algorithm so that it would be able to distinguish between lawn art and footwear, but the gnome kept its top position. One day, seemingly miraculously, the gnome disappeared from the results. At a meeting, no one on the team claimed credit. Then an engineer arrived late, holding an elf with running shoes. He had bought the one-of-a kind product from the vendor, and since it was no longer for sale, it was no longer in the index. \"The algorithm was now returning the right results,\" says a Google engineer. \"We didn't cheat, we didn't change anything, and we launched.\"'\nhttps://news.ycombinator.com/item?id=14009245",
          "link": "https://news.ycombinator.com/item?id=40477060",
          "publishedOn": "2024-05-25T18:54:02.000Z",
          "wordCount": null,
          "title": "New comment by zogrodea in \"Google scrambles to manually remove weird AI answers in search\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40476695",
          "author": "kelnos",
          "description": "I feel like \"parsing each keystroke twice\" is pretty low on the list of things that wastes CPU cycles and drains my laptop battery. I cannot at all get worked up over this, getting to the point I'd pull out the word \"poison\" to describe it.\nIt's nice that Kitty does most of what tmux does built in, but as the author points out, that's not really all that helpful for anyone who does any work over ssh.\nAnd to me, bundling all that into a terminal emulator is bloat. Terminals should be terminals. If I want a multiplexer on top of that, I will... use a multiplexer on top of that.\nI am potentially sympathetic to the idea that tmux and screen make it harder for terminal developers to add new features to their terminals. I don't really know enough about the issues involved to form an opinion. But from the perspective of a regular user, I do not want a multiplexer in my terminal app. When I need one, I prefer to reach for an app-agnostic multiplexer like tmux or screen.",
          "link": "https://news.ycombinator.com/item?id=40476695",
          "publishedOn": "2024-05-25T18:00:21.000Z",
          "wordCount": null,
          "title": "New comment by kelnos in \"Tmux is worse-is-better\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40476638",
          "author": "j2kun",
          "description": "> remote persistence\nThis is the real reason I actually need tmux. I often lose connection to a server for various reasons and don't want to lose my vim session or whatever",
          "link": "https://news.ycombinator.com/item?id=40476638",
          "publishedOn": "2024-05-25T17:55:23.000Z",
          "wordCount": 1661,
          "title": "New comment by j2kun in \"Tmux is worse-is-better\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40476299",
          "author": "lukev",
          "description": "I feel like there's some semantic slippage around the meaning of the word \"accuracy\" here.\nI grant you, my print Encyclopedia Britannica is not 100% accurate. But the difference between it and a LLM is not just a matter of degree: there's a \"chain of custody\" to  information that just isn't there with a LLM.\nPhilosophers have a working definition of knowledge as being (at least†) \"justified true belief.\"\nEven if a LLM is right most of the time and yields \"true belief\", it's not justified belief and therefore cannot yield knowledge at all.\nKnowledge is Google's raison d'etre and they have no business using it unless they can solve or work around this problem.\n† Yes, I know about the Gettier problem, but is not relevant to the point I'm making here.",
          "link": "https://news.ycombinator.com/item?id=40476299",
          "publishedOn": "2024-05-25T17:02:42.000Z",
          "wordCount": null,
          "title": "New comment by lukev in \"Google scrambles to manually remove weird AI answers in search\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40475765",
          "author": "ilaksh",
          "description": "I think this is really a spectrum and they are focusing on some more extreme aspects of it. But it is definitely not just an Asian thing and I believe to some degree this type of social withdrawal has affected perhaps a very significant portion of our society.\nI have definitely been socially isolated my entire life to some degree or another. But much more so in adulthood. Again, I suggest that this is relatively common, not something that happens to only a few million people.\nOne aspect that is being glossed over is the amount of socialization or let's call it \"pseudo-social\" activity that is happening over the internet for these people.\nI'm someone who generally does not have friends, leaves the apartment literally only a handful of times per month to take the garbage out and maybe buy groceries once or twice a month if I am trying to save money versus Instacart.\nFor me it comes down to money. I have a health issue that makes me fatigued etc. and don't have money for health insurance. I don't have money to go to restaurants or otherwise waste going out. So I stay home.\nBecause I'm always in a poor health and financial state, I feel uncomfortable trying to do any \"real\" socialization.\nBut I have always been trying one way or another to get to a point where I have a \"real\" online business that allows me to actually thrive. Such as buying a car and a house, getting health insurance and addressing my health issues, or paying taxes.\nBut what I have managed so far is usually just enough to scrape by. There have been some minor successes here and there but rarely have I ever felt like I had enough to truly meet my basic needs such as the health concerns or financial stability.\nAnyway, I think it's easy to get in a position with health and financial challenges, maybe just a series of low-paying contracts, where some degree of social isolation is just practical and realistic.",
          "link": "https://news.ycombinator.com/item?id=40475765",
          "publishedOn": "2024-05-25T15:55:14.000Z",
          "wordCount": null,
          "title": "New comment by ilaksh in \"The hikikomori in Asia: A life within four walls\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40475325",
          "author": "miki123211",
          "description": "Any online service that lets users upload material that is then publicly visible will eventually be used for command-and-control, copyright infringement and hosting CSAM. This is especially true for services that have other important uses besides file hosting and hence are hard to block.\nThis already happened to Twitter[1], Telegram[2], and even the PGP key infrastructure[3], not to mention obvious suspects like GitHub.\n[1] https://pentestlab.blog/2017/09/26/command-and-control-twitt...\n[2] https://www.blazeinfosec.com/post/leveraging-telegram-as-a-c...\n[3] https://torrentfreak.com/openpgp-keyservers-now-store-irremo...",
          "link": "https://news.ycombinator.com/item?id=40475325",
          "publishedOn": "2024-05-25T14:40:07.000Z",
          "wordCount": null,
          "title": "New comment by miki123211 in \"Abusing Go's Infrastructure\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40471106",
          "author": "dkga",
          "description": "I will forever treasure my ICQ memories.\nThe sounds it made. The moving image when it was connecting. Listening in Winamp to one of only a few dozen possible songs that I had carefully downloaded.\nBeing able to randomly connect to people you would filter. Yes, I want to talk to someone more or less my age but in Iceland. Or any other country.\nBut most of all, the feeling of being connected. As a teenager in the autism spectrum, that was one of the best feelings I had at that time.\nMost people don’t get it when I say this, maybe someone here will, but to me it all started going downhill when people all of a sudden switched to a worse alternative, MSN. I see a direct line from there to the annoying easy-to-accept-while-hard-to-reject-but-always-there-anyway cookie pop-ups.\nAnd no, this is isn’t some form of Ostalgie where we long for past days of hardship with tender feelings. ICQ just had a great user experience as far as I am concerned and to this day I prefer it to existing alternatives from WhatsApp to Webex chat (don’t mention Teams please, I’m having a poetic moment). It was rather a feeling that perhaps other Brazilians will share: a longing, saudade, for the simpler (yes) but better and more poetic 90s, when ICQ connected you to a world that watched Brazil win the fourth World Cup, Ayrton Senna was inspiring generations to be healthier and their better selves and Mamonas Assassinas could only make us laugh, not cry…\nSo long, ICQ. You will always be part of why I love the internet.\nPS: I realize the timing of those events doesn’t necessarily align. But sentimentally they do.",
          "link": "https://news.ycombinator.com/item?id=40471106",
          "publishedOn": "2024-05-24T22:35:37.000Z",
          "wordCount": null,
          "title": "New comment by dkga in \"ICQ will stop working from June 26\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40470453",
          "author": "snewman",
          "description": "Given the level of impact that this incident caused, I am surprised that the remediations did not go deeper. They ensured that the same problem could not happen again in the same way, but that's all. So some equivalent glitch somewhere down the road could lead to a similar result (or worse; not all customers might have the same \"robust and resilient architectural approach to managing risk of outage or failure\").\nExamples of things they could have done to systematically guard against inappropriate service termination / deletion in the future:\n1. When terminating a service, temporarily place it in a state where the service is unavailable but all data is retained and can be restored at the push of a button. Discard the data after a few days. This provides an opportunity for the customer to report the problem.\n2. Audit all deletion workflows for all services (they only mention having reviewed GCVE). Ensure that customers are notified in advance whenever any service is terminated, even if \"the deletion was triggered as a result of a parameter being left blank by Google operators using the internal tool\".\n3. Add manual review for any termination of a service that is in active use, above a certain size.\nAbsent these broader measures, I don't find this postmortem to be in the slightest bit reassuring. Given the are-you-f*ing-kidding-me nature of the incident, I would have expected any sensible provider who takes the slightest pride in their service, or even is merely interested in protecting their reputation, to visibly go over the top in ensuring nothing like this could happen again. Instead, they've done the bare minimum. That says something bad about the culture at Google Cloud.",
          "link": "https://news.ycombinator.com/item?id=40470453",
          "publishedOn": "2024-05-24T21:00:47.000Z",
          "wordCount": null,
          "title": "New comment by snewman in \"Sharing details on a recent incident impacting one of our customers\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40468991",
          "author": "flourpower471",
          "description": "Not to mention, as somebody who works in quant trading doing ml all day on this kind of data. That ann benchmark is nowhere near state of the art.\nPeople didn't stop working on this in 1989 - they realised they can make lots of money doing it and do it privately.",
          "link": "https://news.ycombinator.com/item?id=40468991",
          "publishedOn": "2024-05-24T18:20:57.000Z",
          "wordCount": null,
          "title": "New comment by flourpower471 in \"Financial Statement Analysis with Large Language Models\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40468878",
          "author": "antimatter15",
          "description": "Figure 3 on p.40 of the paper seems to show that their LLM based model does not statistically significantly outperform a 3 layer neural network using 59 variables from 1989.\n  This figure compares the prediction performance of GPT and quantitative models based on machine learning. Stepwise Logistic follows Ou and Penman (1989)’s structure with their 59 financial predictors. ANN is a three-layer artificial neural network model using the same set of variables as in Ou and Penman (1989). GPT (with CoT) provides the model with financial statement information and detailed chain-of-thought prompts. We report average accuracy (the percentage of correct predictions out of total predictions) for each method (left) and F1 score (right). We obtain bootstrapped standard errors by randomly sampling 1,000 observations 1,000 times and include 95% confidence intervals.",
          "link": "https://news.ycombinator.com/item?id=40468878",
          "publishedOn": "2024-05-24T18:10:49.000Z",
          "wordCount": null,
          "title": "New comment by antimatter15 in \"Financial Statement Analysis with Large Language Models\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40467689",
          "author": "jedberg",
          "description": "This makes me sad.  I mean, I haven't logged in in about 20 years now, and couldn't if I wanted to (don't have the password or access to the email address).\nBut I had a low five digit user number, and built a lot of relationships on ICQ (some of which continue today!).  It was my main method of electronic communication in college. I had romantic relationships live and die on ICQ.\nAnother reminder of how things change over time.",
          "link": "https://news.ycombinator.com/item?id=40467689",
          "publishedOn": "2024-05-24T16:23:13.000Z",
          "wordCount": null,
          "title": "New comment by jedberg in \"ICQ will stop working from June 26\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40466243",
          "author": "HL33tibCe7",
          "description": "As I’ve grown older I have developed a heuristic, which is that people who talk/write like this, i.e. being completely convinced that one way of doing things is always wrong and one way of doing things is always right, and that people doing things the other way are just ignorant/stupid/wrong, usually have no idea what they are talking about.",
          "link": "https://news.ycombinator.com/item?id=40466243",
          "publishedOn": "2024-05-24T13:47:45.000Z",
          "wordCount": null,
          "title": "New comment by HL33tibCe7 in \"Don't microservice, do module\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40465080",
          "author": "wildrhythms",
          "description": "Does anyone else feel embarrassed when they read statements like this? No goals. No vision. Just 'AI everywhere!'",
          "link": "https://news.ycombinator.com/item?id=40465080",
          "publishedOn": "2024-05-24T11:35:40.000Z",
          "wordCount": null,
          "title": "New comment by wildrhythms in \"The Washington Post Tells Staff It's Pivoting to AI\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40463380",
          "author": "cookiengineer",
          "description": "This is really a nice product, but I won't order it unless SolOS and its firmware and drivers are open sourced.\nI've probably spent far more than 8000 bucks over the years for devices like this, only to have to throw them away eventually because their software got abandoned and they've been so proprietary that they can only function as an expensive brick on the shelf.\nIf the software is closed source, I'd recommend everyone to stay away from any product like this. It is a deal breaker for me now, and it took a lot of cash and hype to realize it.\nProducts like this are not a mainstream product, which makes them high risk for their investors. And you have to minimize risk by demanding open source.",
          "link": "https://news.ycombinator.com/item?id=40463380",
          "publishedOn": "2024-05-24T06:20:27.000Z",
          "wordCount": null,
          "title": "New comment by cookiengineer in \"Daylight Computer – New 60fps e-paper tablet\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40461698",
          "author": "jsheard",
          "description": "If you ask it how many Muslim presidents the US has had, it will confidently tell you that Barack Hussein Obama is a Muslim. I'm beginning to think that treating statistically common sequences of words on the whole internet as a source of truth may not actually be a very good idea.\nedit: screenshots for posterity\nhttps://x.com/TVietor08/status/1793768913245020502",
          "link": "https://news.ycombinator.com/item?id=40461698",
          "publishedOn": "2024-05-24T00:47:11.000Z",
          "wordCount": null,
          "title": "New comment by jsheard in \"Google's AI-generated search results keep citing The Onion\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40461262",
          "author": "alemanek",
          "description": "Adding an additional comment here for a little extra visibility.  I would absolutely love, like really love, a USB-C portrait monitor version of this.  If I could just plug this in to my existing laptop and use it for reading specs, technical docs, …etc that would be amazing.\nAndroid tablet is a tough sell for my employer due to compliance, security, and such.  So buying one of those for work use would take like a year minimum gathering all the necessary approvals and likely would still get denied by someone.  But, a dumb monitor with no real OS I can expense that without approval.  just a heads up to my boss really to say I am buying this and here is why.\nI know you are a small company so have to pick your battles.  But, maybe something to consider down the road.\nEDIt: forgot to say, congrats on the launch.  Looks like a great product.",
          "link": "https://news.ycombinator.com/item?id=40461262",
          "publishedOn": "2024-05-23T23:46:20.000Z",
          "wordCount": null,
          "title": "New comment by alemanek in \"Daylight Computer – New 60fps e-paper tablet\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40460251",
          "author": "jimmysong",
          "description": "As one of the beta testers, let me just say that I really like this device. It's very different than a kindle, kobo or reMarkable in that the refresh rate really makes a big difference. When I show this device to people, I show them how quickly zooming in on a PDF is. It's way faster and more responsive than any e-ink screen and it's way less addicting than the typical laptop, phone or tablet.\nI'm attempting to make this device my main driver over the next few months and while the ecosystem isn't exactly mature yet, most android apps just work out of the box and I've found myself doing a lot more reading, either through an e-reading app (Lithium), PDF reader or Instapaper. I have X, Primal, Telegram and many other apps installed, but I don't go to them nearly as much. The device really is a lot more human centered and it makes for a much more intentional device.",
          "link": "https://news.ycombinator.com/item?id=40460251",
          "publishedOn": "2024-05-23T21:42:19.000Z",
          "wordCount": null,
          "title": "New comment by jimmysong in \"Daylight Computer – New 60fps e-paper tablet\"",
          "imageUrl": null
        },
        {
          "id": "https://news.ycombinator.com/item?id=40459428",
          "author": "ibejoeb",
          "description": "I'm sure there are many contexts in which this is a good idea.\nFor many others, though, I like to be able to press, move whatever pointing device I'm using from the hot zone, and release to cancel the action. It's like holding the chess piece.",
          "link": "https://news.ycombinator.com/item?id=40459428",
          "publishedOn": "2024-05-23T20:20:52.000Z",
          "wordCount": null,
          "title": "New comment by ibejoeb in \"Act on Press\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Crooked Timber",
      "feedUrl": "https://crookedtimber.org/feed/",
      "siteUrl": "https://crookedtimber.org",
      "articles": [
        {
          "id": "https://crookedtimber.org/?p=52720",
          "author": "Chris Bertram",
          "description": "Visit the post for more.",
          "link": "https://crookedtimber.org/2024/05/26/sunday-photoblogging-kilmainham-gaol/",
          "publishedOn": "2024-05-26T07:31:37.000Z",
          "wordCount": 1748,
          "title": "Sunday photoblogging: Kilmainham Gaol",
          "imageUrl": "https://live.staticflickr.com/65535/53745592850_f076fa4428.jpg"
        },
        {
          "id": "https://crookedtimber.org/?p=52714",
          "author": "Ingrid Robeyns",
          "description": "I believe that no-one deserves to be a billionaire. In the public realm, defenders of wealth concentration often come up with an example of a person who has created all their wealth themselves – the selfmade billionaire. They didn’t get their money from inheritance or some other form of luck, but from entrepreneurial instincts and […]",
          "link": "https://crookedtimber.org/2024/05/22/a-genuine-selfmade-billionaire/",
          "publishedOn": "2024-05-22T08:10:52.000Z",
          "wordCount": 15762,
          "title": "A genuine selfmade billionaire",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        }
      ]
    },
    {
      "title": "CADTM",
      "feedUrl": "https://www.cadtm.org/spip.php?page=backend-en",
      "siteUrl": "https://www.cadtm.org/",
      "articles": [
        {
          "id": "https://www.cadtm.org/Even-if-it-avoids-civil-war-Israel-s-final-crisis-looks-cataclysmic",
          "author": "Yorgos Mitralias",
          "description": "In July 2021, commenting on Albert Einstein's prophetic warnings of Israel's disastrous future as early as 1948, we concluded our text with the following observation and, at the same time, prediction: \nEnglish\n\n/ \nPalestine, \nIsrael",
          "link": "https://www.cadtm.org/Even-if-it-avoids-civil-war-Israel-s-final-crisis-looks-cataclysmic",
          "publishedOn": "2024-05-27T08:53:21.000Z",
          "wordCount": 2155,
          "title": "Even if it avoids civil war, Israel's final crisis looks cataclysmic!",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L720xH378/e94a208d05e64b08bb84ada9359c50-ac0ad.jpg"
        },
        {
          "id": "https://www.cadtm.org/Lost-in-negotiation-Re-positioning-public-health-in-the-Pandemic-Agreement",
          "author": "Abbe Brown, Alison McCallum, Amitabha Sarkar, Chloe Stephenson, Corrado Piroddi, Lynda Gilby, Meri Koivusalo",
          "description": "In December 2021 during the Covid-19 pandemic, the WHO World Health Assembly established an international body to negotiate a convention, agreement, or other international instrument to strengthen pandemic prevention, preparedness, and response. The negotiations have been difficult. Furthermore, the focus on public health in the Pandemic Agreement remains fragile before the World Health Assembly starting on the 27th of May 2024. \nEnglish\n\n/ \nHealth, \nWHO",
          "link": "https://www.cadtm.org/Lost-in-negotiation-Re-positioning-public-health-in-the-Pandemic-Agreement",
          "publishedOn": "2024-05-26T09:04:42.000Z",
          "wordCount": 3925,
          "title": "Lost in negotiation: Re-positioning public health in the Pandemic Agreement",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L1200xH630/0a379d06e5c4dbd721f521e6765eee-c624f.jpg"
        },
        {
          "id": "https://www.cadtm.org/Biden-Should-Stop-Attacking-the-International-Criminal-Court",
          "author": "Branko Marcetic",
          "description": "The ICC seeking arrest warrants for Israeli leaders is a major step forward for international law. US officials' attacks on the ICC are a major step backward for US global standing. \nEnglish\n\n/ \nUnited States of America (USA), \nPalestine, \nIsrael, \nHuman Rights",
          "link": "https://www.cadtm.org/Biden-Should-Stop-Attacking-the-International-Criminal-Court",
          "publishedOn": "2024-05-25T05:21:19.000Z",
          "wordCount": 2000,
          "title": "Biden Should Stop Attacking the International Criminal Court",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/48f001c59e819bf3face3ea64423b1-b586c.jpg"
        },
        {
          "id": "https://www.cadtm.org/G7-Whether-or-not-to-maintain-the-suspension-of-Ukrainian-debt-payments",
          "author": "Eric Toussaint",
          "description": "Why is the G7 discussing Ukraine's debt? \nEnglish\n\n/ \nG7 / G20, \nDebt in Northern countries, \nUkraine, \nNorth",
          "link": "https://www.cadtm.org/G7-Whether-or-not-to-maintain-the-suspension-of-Ukrainian-debt-payments",
          "publishedOn": "2024-05-23T15:11:27.000Z",
          "wordCount": 4061,
          "title": "G7: Whether or not to maintain the suspension of Ukrainian debt payments",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/13579425ad1b5e7aa88cfa6aa420ba-43aaa.jpg"
        },
        {
          "id": "https://www.cadtm.org/James-Wolfensohn-switches-on-the-charm-1995-2005",
          "author": "Eric Toussaint",
          "description": "In July 2024, the World Bank and the IMF will be 80 years old. 80 years of financial neo-colonialism and the imposition of austerity policies in the name of debt repayment. 80 years is enough! The Bretton Woods institutions must be abolished and replaced by democratic institutions serving an ecological, feminist and anti-racist bifurcation. To mark these 80 years, we are republishing a series of articles every Wednesday until July, looking in detail at the history and damage caused by these (...)\nEnglish\n\n/ \nIMF, \nWorld Bank, \nFinance against people, \n80 ans BM FMI EN",
          "link": "https://www.cadtm.org/James-Wolfensohn-switches-on-the-charm-1995-2005",
          "publishedOn": "2024-05-22T07:00:00.000Z",
          "wordCount": 6132,
          "title": "James Wolfensohn switches on the charm (1995-2005)",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L153xH80/7d67b536955c2d468284cb35bf57de-31f2b.png"
        },
        {
          "id": "https://www.cadtm.org/When-Mr-Mitsotakis-criminalizes-threatens-and-represses-students-who-defend",
          "author": "Yorgos Mitralias",
          "description": "“If some people think they can repeat what they've seen in other countries and occupy universities, pitch tents and make a mess, they're deeply mistaken”. This - so eminently delicate - statement by the Greek Prime Minister, which followed the brutal “evacuation” of the law faculty on Tuesday May 14 (28 arrests), can only surprise the uninformed: the Greek state and its governments have always had a soft spot for anything to do with apartheid and apartheid regimes! Today Israel, formerly South (...)\nEnglish\n\n/ \nGreece, \nPalestine, \nNorth",
          "link": "https://www.cadtm.org/When-Mr-Mitsotakis-criminalizes-threatens-and-represses-students-who-defend",
          "publishedOn": "2024-05-21T09:25:18.000Z",
          "wordCount": 1628,
          "title": "When Mr. Mitsotakis criminalizes, threatens and represses students who defend international legality!",
          "imageUrl": "https://www.cadtm.org/local/cache-vignettes/L640xH336/9b079b626e24c10e45e9e1c0a22ccb-044e8.jpg"
        }
      ]
    },
    {
      "title": "Meta Research",
      "feedUrl": "https://research.facebook.com/feed/",
      "siteUrl": "https://research.facebook.com/",
      "articles": []
    },
    {
      "title": "Meta Research - Medium",
      "feedUrl": "https://medium.com/feed/meta-research",
      "siteUrl": "https://medium.com/meta-research?source=rss----6a8b96b0656b---4",
      "articles": []
    },
    {
      "title": "theunderground.blog",
      "feedUrl": "https://theunderground.blog/feed.xml",
      "siteUrl": "https://theunderground.blog/feed.xml",
      "articles": []
    },
    {
      "title": "| disassociated.com",
      "feedUrl": "https://disassociated.com/feed/",
      "siteUrl": "https://disassociated.com",
      "articles": [
        {
          "id": "https://disassociated.com/?p=7689",
          "author": "J",
          "description": "Weird stuff is happening out on the remote boundary of the solar system. Beyond the orbit of Pluto. You name it, it’s going on out there. Irregularities. Anomalies. Clustering of apsidal lines. Perihelia. And — saving the best for last — a surprising prevalence of retrograde Centaurs. These anomalies include the apparent clustering of apsidal […]",
          "link": "https://disassociated.com/search-distant-planet-nine-continues/",
          "publishedOn": "2024-05-26T21:00:05.000Z",
          "wordCount": 404,
          "title": "The search for the distant Planet Nine continues",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7695",
          "author": "J",
          "description": "ASL? Another artefact of the early days of the (mainstream) internet will soon be no more. Instant messaging service, ICQ, launched in 1996, will cease operating, as of Wednesday 26 June 2024. ICQ (I seek you, get it?) allowed users to chat to pretty much anyone who let them. I can’t remember when I stopped […]",
          "link": "https://disassociated.com/icq-close-26-june-2024/",
          "publishedOn": "2024-05-26T20:30:11.000Z",
          "wordCount": 336,
          "title": "ICQ to close on 26 June 2024",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7664",
          "author": "J",
          "description": "Australia’s largest telecommunications company, Telstra, announced this week it was making about three thousand employees, or ten percent, of its workforce redundant. About three hundred people were sent home straightaway — hopefully with some sort of pay-out — while the remainder will depart between now and the end of the year. This is terrible news […]",
          "link": "https://disassociated.com/telstra-redundancies-ai-robots-future-now/",
          "publishedOn": "2024-05-23T21:00:57.000Z",
          "wordCount": 428,
          "title": "Telstra redundancies, AI robots come in, the future is now",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7671",
          "author": "J",
          "description": "NASA is dead set keen to return to the Moon. But their current plan, called Artemis, is dead set crazy, writes Polish-American entrepreneur and writer, Maciej Cegłowski: You don’t have to be a rocket scientist to wonder what’s going on here. If we can put a man on the moon, then why can’t we just […]",
          "link": "https://disassociated.com/build-bases-moon-instead-going-week/",
          "publishedOn": "2024-05-23T20:30:58.000Z",
          "wordCount": 412,
          "title": "Build bases on the Moon, instead of going for a week",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7657",
          "author": "J",
          "description": "Konrad Marshall, writing for the Sydney Morning Herald: Run South Yarra co-founder Tom Adair is wary of any suggestion that run clubs are the new Tinder, yet relationships are born here, and side-by-side chats while jogging, he notes, are definitely less pressurised than face-to-face interactions. (Plus, you can always pick up the pace and scoot […]",
          "link": "https://disassociated.com/running-clubs-indieweb-dating-realm/",
          "publishedOn": "2024-05-22T21:00:28.000Z",
          "wordCount": 327,
          "title": "Running clubs, the IndieWeb of the dating realm?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7631",
          "author": "J",
          "description": "Two and bit years ago, I spotted an entry on Fandom about a “remake” of the Stanley Kubrick sci-fi classic, 2001: A Space Odyssey. Being a 2001 fan, I naturally wrote about it. I’ve had a lot of fun with the post ever since. People stumble upon it every now and again, and link to […]",
          "link": "https://disassociated.com/2001-a-space-odyssey-remake-joke-post-trained-google-ai/",
          "publishedOn": "2024-05-21T21:00:21.000Z",
          "wordCount": 430,
          "title": "My 2001: A Space Odyssey remake joke post trained Google AI?",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7637",
          "author": "J",
          "description": "She is the Earth, a work of verse, written by Yankunytjatjara (South Australia) poet Ali Cobby Eckermann, was named the NSW Premiers Literary Awards book of the year, on Monday 20 May 2024. Award judges were unstinting in their praise of Eckermann’s writing: She is the Earth is a stunning verse novel that takes the […]",
          "link": "https://disassociated.com/she-is-the-earth-wins-nsw-premiers-literary-awards-book-year-2024/",
          "publishedOn": "2024-05-21T20:30:32.000Z",
          "wordCount": 228,
          "title": "She is the Earth wins NSW Premiers Literary Awards book of year 2024",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7641",
          "author": "J",
          "description": "Sydney based product designer Wing Pang, whom I wrote about last week, has published a comprehensive guide to the IndieWeb. Coming from a design background, joining the IndieWeb was an incredibly exciting and rewarding, yet maze-like journey. To be honest, almost every step of the way was like a leap! But I’ve learnt so much […]",
          "link": "https://disassociated.com/indie-guide-indieweb-wing-pang/",
          "publishedOn": "2024-05-21T20:00:07.000Z",
          "wordCount": 180,
          "title": "An indie guide to the IndieWeb, by Wing Pang",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        },
        {
          "id": "https://disassociated.com/?p=7643",
          "author": "J",
          "description": "Blog of the .Day, yes, styled as Blog of the .Day, a collaboration between James of James’ Coffee Blog, and Joe Crawford, will highlight a new blog every day. Aside from casting the spotlight daily on a blog, another goal of the project is to bring the term blogosphere back into popular usage. For those […]",
          "link": "https://disassociated.com/blog-of-the-day-bringing-back-blogosphere-one-blog-time/",
          "publishedOn": "2024-05-21T19:30:32.000Z",
          "wordCount": 193,
          "title": "Blog of the .Day, bringing back the blogosphere one blog at a time",
          "imageUrl": "https://disassociated.com/images/index/99_logo_FRUIT_SALAD_SOCIALS_card.png"
        }
      ]
    },
    {
      "title": "Last Week in Kubernetes Development",
      "feedUrl": "https://lwkd.info/feed.xml",
      "siteUrl": "https://lwkd.info/",
      "articles": [
        {
          "id": "https://lwkd.info/2024/20240522",
          "author": null,
          "description": "Developer News",
          "link": "https://lwkd.info/2024/20240522",
          "publishedOn": "2024-05-22T19:00:00.000Z",
          "wordCount": 538,
          "title": "Week Ending May 19, 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "New Left Review Sidecar recent posts",
      "feedUrl": "https://newleftreview.org/sidecar/feed",
      "siteUrl": "https://newleftreview.org/sidecar/feed",
      "articles": [
        {
          "id": "https://newleftreview.org/sidecar/posts/favoured-nation",
          "author": null,
          "description": "Corporate America’s Anglophilia.",
          "link": "https://newleftreview.org/sidecar/posts/favoured-nation",
          "publishedOn": "2024-05-24T17:54:12.000Z",
          "wordCount": 1967,
          "title": "Tom Hazeldine: &ldquo;Favoured Nation&rdquo;",
          "imageUrl": "https://newleftreview.org/blog-uploads/2024/05/Bridget-Riley.jpeg"
        }
      ]
    },
    {
      "title": "Bear Blog Trending Posts",
      "feedUrl": "https://bearblog.dev/discover/feed/",
      "siteUrl": "https://bearblog.dev/discover/",
      "articles": [
        {
          "id": "https://yuricunha.bearblog.dev/reflections-of-a-conflicted-impostor/",
          "author": null,
          "description": "Ah... how difficult it is to admit this, but I failed. Actually, I don't know if it's difficult, if I'm afraid, or if I just lack courage, despite many people saying that fear is the absence of courage, so this might be redundant.\nI always thought I was a very intelligent guy and ahead of my time, especially when I was around 18 years old or younger. I remember people always saying that I was very mature for my age, because I had values that were already lost, and even my culture was from generations much earlier than mine. When technology was still a novelty, and servers were something only large or well-structured companies had, I was basically a master, and I was still a minor... I remember setting up LANs for acquaintances or friends to play games, and even setting up a server (more li…",
          "link": "https://yuricunha.bearblog.dev/reflections-of-a-conflicted-impostor/",
          "publishedOn": "2024-05-27T00:51:56.738Z",
          "wordCount": 1798,
          "title": "reflections of a conflicted impostor",
          "imageUrl": "https://yuricunha.com/_next/image?url=%2Fstatic%2Fimages%2Fblog%2Freflections-of-a-conflicted-impostor%2Freflections-of-a-conflicted-impostor.jpg&w=828&q=75"
        },
        {
          "id": "https://itskristin.bearblog.dev/all-the-bells-and-whistles/",
          "author": null,
          "description": "guyssssss... look at the blog!!!! we got a newsletter now! it's just for me send out notifs about new blog posts and some other stuff, probably more personal stuff for my buddies :p also, check out the reply via email link at the ends of my posts.\nI've been looking around this website as much as i can (very difficult btw) to find interesting blog layouts and generally read the room and determine the culture bearbloggers have going on here. I'll be honest, and sorry to offend if I do, but this seems like a very serious website... imma keep doing what I do on here of course, but a lot of the posts I've read have a very sterile voice to them. I hope more friends come on here and we can liven up the space a bit more. let's smile and laugh you guys <3\nI'm still enjoying many of the blogs on here, especially those ran by women. not to be reese witherspoon \"women's stories matter. they just matter.\" but women's stories really do matter and I really enjoy reading about other women's lives on this website. blogging gives a space to introspect and reflect on our lives, and I enjoy hearing other women's voices and beliefs. I'm hoping to hear more queer voices, too.\nto my dear friends who actually read my blog, I hope you guys will come on here one day, too. I think you're all so wonderful anyway, and I love to read more from you guys.\nthank you to all the now-strangers that are also reading this blog, I really appreciate you and the grace you've given me to feel more welcomed on this website. if you like it here, feel free to subscribe to the newsletter <3\nlove love love you guys! byeeee~\nReply via email\nsubscribe to the newsletter so you never have to miss a post ᯓ★",
          "link": "https://itskristin.bearblog.dev/all-the-bells-and-whistles/",
          "publishedOn": "2024-05-26T19:34:54.498Z",
          "wordCount": 1267,
          "title": "all the bells and whistles",
          "imageUrl": "https://i.imgur.com/JinBrPU.png"
        },
        {
          "id": "https://dostoynikov.bearblog.dev/simple-photoblog/",
          "author": null,
          "description": "I love having collection of photos I like on the internet. I can access them whenever I want. Yet, I do not really like instagram.\nAlthough I have it, mostly I use it to interact and stay in contact with my friends. Because, for most people, staying in contact via instagram is the norm. It is not the norm for me but I do not really have power as one person.\nBut it does not mean that I can not have my own taste of photo blog.\nLuckily I've found a very nice photoblog generator on Github made by Anders Jensen-Urstad. He is such a nice guy that he even helped me, via email, by answering my questions about how to set the generator up because I couldn't get something rights at first.\nIt is just exactly what I wanted. Lightweight, super fast, no tracking, privacy friendly and content-first approach. So I just went right away and built my own. Once you open it, you will see the latest uploaded photo. At the bottom navigation, there are older, newer, home, archive and contact buttons.\nRight now it is only on Github page because I still could not decide a name for the blog, which domain and hosting service to use. I'm still looking for a privacy friendly, reliable service. Once I decide these, I will have proper domain name later.\nI found some services from this list on PrivacyTools.io. Apart from these, I found Porkbun, Mythic Beasts, Nixi Host and Nearly Free Spech. I will need to dig these up and see the best one. (I'm addicted to the act of researching these kind of things :') )\nIf you have any suggestions of domain and hosting service, I really appreciate it. I want to use the domain for my Bearblog blog in the future, too.\nFor now, it is what it is.   ¯\\( ͡° ͜ʖ ͡°)/¯\nHere is one of the songs I listened to while writing this post",
          "link": "https://dostoynikov.bearblog.dev/simple-photoblog/",
          "publishedOn": "2024-05-26T12:06:45.108Z",
          "wordCount": 839,
          "title": "The unbearable lightness of a simple photoblog",
          "imageUrl": null
        },
        {
          "id": "https://kartikay.bearblog.dev/on-writing/",
          "author": null,
          "description": "Almost a month ago I had a problem. Information overload. I had filled up all my free time with audiobooks and podcasts. Every free moment I was consuming information. It was getting frustrating. My general productivity was going down as well. So I quit cold turkey.\nThis wasn't the first time I had done this. At first, it was uncomfortable but I got used to my company. Like meeting an old friend after a long time. The ideas just started flowing and I needed an outlet, I found one in writing.\nMy writing process is simple. I spend time with myself as much as I can. I let the ideas flow till I feel almost compelled to write them down. It is like the compulsion and excitement of picking up the controller of your favorite video game. Sometimes though I don't feel like writing a post but I push through and kinda get myself in that state because consistency is important.\nAll of this was not planned. I let myself flow with life instead of overthinking and getting in my own way. A lot of this creative stuff is undefined and weird. Yes, your process needs some essence of discipline and consistency. But you just kinda let it flow in a sense. And get out of your own way as fast as possible.\nThe last part sounds all woo-woo to my logical brain but this has been my experience with the art of writing so far.",
          "link": "https://kartikay.bearblog.dev/on-writing/",
          "publishedOn": "2024-05-26T00:00:00.000Z",
          "wordCount": 680,
          "title": "On Writing",
          "imageUrl": null
        },
        {
          "id": "https://kartikay.bearblog.dev/do-the-work/",
          "author": null,
          "description": "There is a lot of well-meaning advice on the internet, including this blog. Gives you some new insights. Maybe some insights you knew and had to relearn. It makes you feel good. And you move on to the next advice without ever implementing it. I know, I have been there.\nJust do the work is probably another advice people will read, feel good about, and move on. But as a recovering productivity addict, I have to say this - 'Stop reading all kinds of cool things about how to do great work, feel good about yourself for a few days or hours, and not change a single thing in your life'.\nThere is a lot of alpha in just doing the work. If you are not doing the work. JUST DO THE WORK. All the nifty tricks and mental models and whatnot are just icing on the cake. They are supposed to make the 'Just do the work' part easier with time. But you gotta get started.\nStart in a dumb inefficient way but start. You are better than the guy reading about all this and not doing anything.",
          "link": "https://kartikay.bearblog.dev/do-the-work/",
          "publishedOn": "2024-05-25T18:43:27.312Z",
          "wordCount": 627,
          "title": "Do the work",
          "imageUrl": null
        },
        {
          "id": "https://sankalp.bearblog.dev/are-you-milking-the-basics-anon/",
          "author": null,
          "description": "Are you milking the basics enough before indulging in optimization\nhacks? Don't tell me you are already watching videos on how to do xyz thing fast instead of focusing on basics.\nFirst step of optimization should be to profile if you are milking the basics enough or not.\nLeveling up in anything boils down to a few simple processes. I repeat simple but hard to execute - doing minimum viable research to get started, understanding the basics, doing the thing and focusing.\nMinimum viable research - finding the correct resources, enough to get started with, finding a mentor or a teacher. The emphasis is to get enough to get started. This is pretty easy especially for knowledge work given we have internet and chatgpt. The basics are more or less similar across most resources plus as you progress…",
          "link": "https://sankalp.bearblog.dev/are-you-milking-the-basics-anon/",
          "publishedOn": "2024-05-25T06:39:49.586Z",
          "wordCount": 853,
          "title": "Are you milking the basics anon?",
          "imageUrl": null
        },
        {
          "id": "https://itskristin.bearblog.dev/on-friendships-as-a-20-something/",
          "author": null,
          "description": "I'm in college. I've been in college for one year now, after taking a gap year + I-don't-think-I'm-gonna-do-college year. I got incredibly lucky in my spring semester of last year, my first semester of college as a whole, to have very nice professors and cool classmates. I especially lucked out with my public speaking class, in which I made two new friends. we haven't had any more classes together since, but we still hang out at least once or twice a month.\nit's funny because the first friend I made was because she heard me say my birthday and her birthday is the day after mine. we then exclaimed, chatted a bit more about what we have in common, and we figured out that her brother is dating one of my friends from high school.\nthe second friend came about because she started talking to the …",
          "link": "https://itskristin.bearblog.dev/on-friendships-as-a-20-something/",
          "publishedOn": "2024-05-25T03:51:39.699Z",
          "wordCount": 2297,
          "title": "on friendships as a 20-something",
          "imageUrl": "https://i.imgur.com/JinBrPU.png"
        },
        {
          "id": "https://kartikay.bearblog.dev/egoless-convictions/",
          "author": null,
          "description": "Convictions are important in life. If you don't have strong convictions you will find yourself going wherever the next opinionated and charismatic person you meet points you.  But it is important to choose them wisely.\nWhat if your conviction is that penguins can fly, they only need the right motivation? So you spend your life trying to give motivational speeches to penguins. Hoping one of them will fly. You will even meet people with similarly strong convictions. Form a strong community. Make derogatory memes about the 'others' who believe in things like the 'scientific method' and so on.\nAnd your ego attaches itself tightly to your penguin motivator persona. So anyone trying to challenge you is attacking you and your community. So you viciously attack this person back. Congratulations. You are now in a toxic pointless echo chamber.\nThe only solution is selecting convictions using first principles. Employ the scientific method. Be open to being challenged as long as the challenge comes through solid first principles thinking as well. All the while keeping the ego in check.\nSo in essence develop an egoless conviction. Be open to being challenged. Don't end up in pointless toxic echo chambers.",
          "link": "https://kartikay.bearblog.dev/egoless-convictions/",
          "publishedOn": "2024-05-24T14:06:28.998Z",
          "wordCount": 621,
          "title": "Egoless Convictions",
          "imageUrl": null
        },
        {
          "id": "https://itskristin.bearblog.dev/my-favorite-restaurant-closed/",
          "author": null,
          "description": "i'm watching the bear and sydney said something along the lines of \"it's hard to work in a restaurant and not lose your mind.\"\nwhen you have a neighborhood place, somewhere that's been a cornerstone of your community, it is like heartbreak to see it close. The Press in Claremont, California is, and has, been my favorite restaurant for years. it's where my family would go to eat before I was born, where my teenage cousin revealed to them that she was pregnant with my cousins, where my parents would go on date nights before I came around. and now it's gone.\nthey closed it in 2020 with lockdown, and their website has said they were coming back soon for months, for years. I'm watching the bear\nand sydney's risotto is a dish they would've had as a special and I'm thinking of them. I'm thinking …",
          "link": "https://itskristin.bearblog.dev/my-favorite-restaurant-closed/",
          "publishedOn": "2024-05-24T07:45:34.975Z",
          "wordCount": 1448,
          "title": "my favorite restaurant closed",
          "imageUrl": "https://i.imgur.com/JinBrPU.png"
        },
        {
          "id": "https://mgx.me/the-rise-of-the-mini-navals/",
          "author": null,
          "description": "You may have noticed a proliferation of a new essayist archetype on the internet in recent years - the \"Mini Navals.\" Modeled after angel investor, entrepreneur, and philosopher Naval Ravikant, these mini me's desperately want to become the next big thought leader by aping Naval's pithy, maxim-filled style. Naval has achieved success through decades of experience, and he reflects on it. In contrast, Mini Navals try to compress \"wisdom\" into a handful of tweets and blog posts.\nMost Mini Navals tend to be in their early-to-mid 20s, still figuring things out but portraying themselves as gurus who have life all figured out. They boldly proclaim hot takes on everything from tech trends to philosophy to politics, with little credibility to back it up other than having read Naval's entire archive. With the Mini Navals, it's usually just word salad dressed up as profundity.\nSometimes, the best philosophy is just living intentionally without needing to proselytize your process. In a world that could use more wisdom, perhaps we don't need so many more mini-versions when the original is still strong.",
          "link": "https://mgx.me/the-rise-of-the-mini-navals/",
          "publishedOn": "2024-05-24T05:08:26.314Z",
          "wordCount": 1240,
          "title": "The Rise of the Mini Navals",
          "imageUrl": "https://static.mgx.me/images/2024/mini-navals.webp"
        },
        {
          "id": "https://tinavanschelt.com/democracy-is-dead-long-live-democracy/",
          "author": null,
          "description": "This past Saturday, my little family and I went to Den Haag to vote in the 2024 South African National Election. An experience that has stayed with me all week, eventually morphing into this post.\nWe arrived at the embassy at 11:00, expecting to be there no more than two hours. Truthfully, we really weren’t prepared for what awaited us.\nA common joke (read truthism) among expats is that it’s incredibly easy to identify a South African embassy as it’s generally the only embassy with burglar bars, uncut grass and a queue outside. Walking through the doors of a South African embassy is like walking through a portal linked directly to The Department of Home Affairs in Bellville. It's quite a surreal experience actually.\nThe queue on Saturday was something else. It wrapped around several blocks…",
          "link": "https://tinavanschelt.com/democracy-is-dead-long-live-democracy/",
          "publishedOn": "2024-05-23T21:45:01.661Z",
          "wordCount": 2061,
          "title": "Democracy is dead, long live democracy",
          "imageUrl": null
        },
        {
          "id": "https://tiramisu.bearblog.dev/2024-shenyang/",
          "author": null,
          "description": "Some photographs from the Chinese city of 沈阳 (Shenyang).\n\nI could spend all day browsing these five-story malls. This one boasted restaurants, cafes, daycares, basketball courts, go-karting, and live fish.\n\nFine dining in 沈阳. These are the food models in the lobby. Outside the frame, my mom is fighting with my aunt and uncle-in-law first to pay the bill, and when she loses that battle, to order fewer items. Lots of 客气 to go around. \n\nAlthough it may look the part, those flowers are not lavender. You can't see it here, but the whole time we were in Shenyang it looked as though it were snowing. I later learned that the \"snow\" was actually the seed hairs of the willow and the poplar trees. It looks cool until the fuzz gets in your eyes, on your clothes, everywhere. (source)\n老北市\nA popular night market in 沈阳 which runs every night. If you're there at the right time, you can catch the show with flying drone-powered phoenixes shooting fireworks from their wings. Sadly I don't have any good photos of that show — my senses were overwhelmed for most of the night (in a good way).\n\n\n\n\n\n\n\n\n\n\nNight markets have been ruined for me forever. How can anything measure up to that? Not to mention we passed two markets en route to 老北市 that also looked better than anything I'd ever seen.",
          "link": "https://tiramisu.bearblog.dev/2024-shenyang/",
          "publishedOn": "2024-05-23T14:19:59.869Z",
          "wordCount": 666,
          "title": "沈阳 photo dump（mostly 老北市）",
          "imageUrl": null
        },
        {
          "id": "https://kartikay.bearblog.dev/skill-issue/",
          "author": null,
          "description": "The term skill issue is thrown around Twitter a lot. It comes from gaming culture. If you can't beat a level. It is a skill issue. Just level up and win. If you think about it, it is a powerful term. It gives power to the player.\nApplied to life everything is a skill issue. Can't do the perfect juggle? Skill issue. Can't write awesome distributed performant code? Skill issue. Can't convince a penguin to try your awesome new ice cream? You guessed it. Skill issue. It is a powerful mindset. Gives you extreme ownership.\nBut there is a catch. Do you take ownership of other people's shitty behavior? No. You can take ownership of the triggers and environment you perhaps created to lead to that shitty behavior. Especially if you are in positions of power to have a big impact(ie: manager/CEO). Otherwise, constant shitty behavior is their burden to bear. Avoid such people. People rarely change and you don't need the negativity in your life.\nHere the skill issue is effectively able to isolate and weed out the negativity. This is purely in a professional context. In a more personal context, things are a lot more messy. I don't have an answer for that which works. A skill issue on my end. Need more life experience to resolve it.\nMake everything a skill issue and just level up!",
          "link": "https://kartikay.bearblog.dev/skill-issue/",
          "publishedOn": "2024-05-23T10:37:22.552Z",
          "wordCount": 671,
          "title": "Skill Issue",
          "imageUrl": null
        },
        {
          "id": "https://pesto.bearblog.dev/apartment-hunting-and-finding-meaning-in-living-alone/",
          "author": null,
          "description": "In the fall, I'll be moving to a new city to pursue graduate studies. I thought it'd be a good idea to move in a few months early to get a feel for the area - and also avoid fighting over good areas around campus, especially if I wait too long.\nNext week I'm flying out to visit some apartments. It dawned upon me that this would be the first time where I live truly alone - no housemates, roommates, parents, pets - it'll be just me, in a new city. I'm excited of course, but also quite scared. The thought of being free and landing into a new city is something amazing, but for the first time, I'm really on my own.\nI moved back with my parents to save on rent a year ago. And while I do appreciate them for their generosity, I think it's time for me to leave; I've been paying rent with my mental health, something a lot of Asian kids can relate to. I also feel restricted when I came back to the city where I attended high school. It was like I'm in purgatory: suffering for some time before entering heaven (a place of my own).\nIt's a big step, despite something I'm excited for. Yet very scary. But if I'm scared to do it, it's exactly because I'm scared that I should do it.\nI think I'm ready now. Ready to take that big leap, into a new home, nearly a thousand miles away from where I grew up.\nThe (paper) journal I've kept since 2020 is reaching the last few pages, appropriately. It's as if it knew that my journey here was coming to an end, and a new one will begin soon.\nI'll be buying a new notebook once in Seattle. Only appropriate when closing a chapter, no?",
          "link": "https://pesto.bearblog.dev/apartment-hunting-and-finding-meaning-in-living-alone/",
          "publishedOn": "2024-05-22T05:38:01.193Z",
          "wordCount": 548,
          "title": "apartment hunting, and finding meaning in living alone",
          "imageUrl": null
        },
        {
          "id": "https://kartikay.bearblog.dev/productivity/",
          "author": null,
          "description": "The fundamental selling point of all productivity advice is getting more done in less time. It's a good hook. I have over the years consumed a lot of content around productivity. It took me a long time to realise I was making a fundamental mistake.\nI assumed I would stumble upon some specific protocol that I can follow perfectly and my life is set. So I have tried it all. All kinds of wake-sleep times. Journaling. All kinds of productivity apps and timing techniques. Trying to get as much damn sunlight in my little eye holes within x minutes of waking up(yes, I had a Huberman era). Nothing worked.\nThe fundamental mistake in all of this is I thought of my mind as some unmotivated child that I could be strict with and discipline into getting stuff done. But if you have ever taught young children( I have) you will know that discipline and fear only get you so far. Getting them interested in the topic changes the game.\nThis realisation drastically changed my life. I can get my mind interested in doing things through self-programming. Everyone is different on how to do this. Many of these routines and techniques that we hear about are just outcomes of effective self-programming unique to that individual. Each of us needs to find our unique way.\nHow to program your mind? You can introspect and the documentation of your mind will reveal itself to you. Also, there are some ways you can make the mind more malleable to programming. I have given a framework I follow for this in my 'Hacking Hardwork' post.\nThere is no golden technique that will save you. Only you can save yourself.",
          "link": "https://kartikay.bearblog.dev/productivity/",
          "publishedOn": "2024-05-22T00:00:00.000Z",
          "wordCount": 714,
          "title": "Productivity",
          "imageUrl": null
        },
        {
          "id": "https://that-bloke.com/mouth-dildos/",
          "author": null,
          "description": "People that use mouth dildos annoy the shit out of me. Either commit and smoke a cigarette, or give it up.\nI hate smoking. I think it's fucking disgusting and I don't understand why anyone would want to do it. I especially hate it when there's a gaggle of smokers huddled around the front door of a pub, tooting away on their fags. It's vile and I don't want my pink fluffy lungs affected by that shit.\nBut do you know what I hate more than smoking?\nMouth dildos.\nWhat the fuck is a mouth dildo?\n-- Everyone\nThis is a mouth dildo:\n\nNot only do you look ridiculous putting that stupid fucking contraption in your mouth, but the plumes of flavoured vapour that bellow from these things make you look even more like an utter cunt.\nI don't want to be subjected to the cherry ice cream vapour pouring from your mouth dildos, seemingly by the bucket load. At least smokers are committing, knowing they're gonna kill themselves, have decided to enjoy it while they're here.\nBut you mouth dildo fuckers are the worst. We don't want to smell your stupid fucking vape. So put it away because you look (and smell) like a dick head.\nPeace ✌🏻\nReply by email",
          "link": "https://that-bloke.com/mouth-dildos/",
          "publishedOn": "2024-05-21T12:41:59.234Z",
          "wordCount": 885,
          "title": "Mouth Dildos",
          "imageUrl": "https://bear-images.sfo2.cdn.digitaloceanspaces.com/thatbloke-1713812790-0.webp"
        }
      ]
    },
    {
      "title": "China - indi.ca",
      "feedUrl": "https://indi.ca/tag/china/rss/",
      "siteUrl": "https://indi.ca/",
      "articles": []
    },
    {
      "title": "The Olognion",
      "feedUrl": "https://www.theolognion.com/feed",
      "siteUrl": "https://www.theolognion.com",
      "articles": []
    },
    {
      "title": "The Anarchist Library",
      "feedUrl": "https://theanarchistlibrary.org/feed",
      "siteUrl": "https://theanarchistlibrary.org",
      "articles": [
        {
          "id": "https://theanarchistlibrary.org/library/carl-boggs-marxism-prefigurative-communism-and-the-problem-of-workers-control?v=1716806355",
          "author": null,
          "description": "Author: Carl Boggs\nTitle: Marxism, Prefigurative Communism, and the Problem of Workers’ Control\nDate: 1977\nSource: Boggs, Carl. 1977. “Marxism, Prefigurative Communism, and the Problem of Workers’ Control”. Radical America 11 (November), 100; cf. Boggs Jr., Carl. Revolutionary Process, Political Strategy, and the Dilemma of Power. Theory & Society 4,No. 3 (Fall), 3. Republished in Class Against Class www.oocities.org. Republished again in libcom.org.\n\n A conspicuous deficiency of the Marxist tradition has been the failure to produce a theory of the state and political action that could furnish the basis of a democratic and non-authoritarian revolutionary process. The two most widely-tested strategies for advancing revolutionary goals — Leninism and structural reformism — provide no real al…",
          "link": "https://theanarchistlibrary.org/library/carl-boggs-marxism-prefigurative-communism-and-the-problem-of-workers-control?v=1716806355",
          "publishedOn": "2024-05-27T10:39:15.000Z",
          "wordCount": 11053,
          "title": "Carl Boggs - Marxism, Prefigurative Communism, and the Problem of Workers’ Control",
          "enclosure": {
            "type": "application/epub+zip",
            "length": "39636",
            "url": "https://theanarchistlibrary.org/library/carl-boggs-marxism-prefigurative-communism-and-the-problem-of-workers-control.epub"
          },
          "imageUrl": "https://theanarchistlibrary.org/sitefiles/en/opengraph.png"
        }
      ]
    },
    {
      "title": "Stories by Alibaba Cloud on Medium",
      "feedUrl": "https://alibaba-cloud.medium.com/feed",
      "siteUrl": "https://medium.com/@alibaba-cloud?source=rss-8cdb52f9cdca------2",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}